{"name": "Character Backgrounds","description": "One hundred background stories for your players and NPCs.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "ZoLzGomK6oYHkmUx","flags": {},"type": 0,"text": "You served as a squire to the younger son of a local lord, a minor political figure. Two years ago he moved to the city, to study magic and indulge in debauchery, and released you from your service (and your salary). You’ve heard that Bordertown has uses for someone with skill of arms, and so you’ve hopped onto the first coach available.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "hD9Kad4ghAiI0QnG","flags": {},"type": 0,"text": "You’ve always wanted to be an adventurer. You sat on your pappy’s lap as he told and retold the tales of your uncle Algar Spiderspear, and your great uncle Kenway Fireheart, and your great great aunt Thea Earthforger. You didn’t understand that those were meant to be cautionary tales, and that there’s a reason you don’t have any cousins.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "zsnyNNeBS0dDyojo","flags": {},"type": 0,"text": "You never really liked the family dye business. As the first born you were always expected to take over. After lamenting one night drunkenly at the tavern you met a gnome who promised to help. On returning home your family did not recognize you and your younger sibling was set to inherit. They drove you off their land to homelessness. You never saw the gnome again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "uusrhjRXUYfUfNMC","flags": {},"type": 0,"text": "You were a normal farmer, nothing special about you. Over the years, your farm started losing money and you had to let more and more of your staff go until it was just you left. One day when you are at the local inn drinking your problems away and adventurer walks through and buy the entire inn several rounds of drinks from his large sack of golden coins. Since that day you have sold your farm and used the money to buy some basic adventuring supplies and head out to build your fortune.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "8mfNeQUUQmYahW3i","flags": {},"type": 0,"text": "You were a squire for the local knight and Lord of your province. One day while cleaning his library you come across and gold handle behind some dusty books. As you turned the handle it felt as if your brain was opening like a door. When you turned the handle back a a dusty grimore fell into your hands and you heard a voice inside your head, you decided to name the voice Greg.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "7v2gERZ6XLSDG6DR","flags": {},"type": 0,"text": "You grew up as a milk maid, over the course of your child hood you realised that you had a special connection with all animals and nature. One day on your way back from town bandits jumped out from the side of the road and attacked you. Startled, you this your hands out towards them and magic shot out from your finger tips. The next day you packed your things and headed out to learn more about what you had just done and how to control it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "XsId2AYQLrKe997v","flags": {},"type": 0,"text": "Your father was a miner, your mother and innkeeper, you spent your childhood poking the ashes in the fireplace waiting for something to happen. One day a halfling fell down your chimney and talk you into hiding him in your room, his only name that he gave you was Miro, but he taught you many thing over a few nights, once he felt ‘it’ had blown over he packed his things and invited you to join him. He trained you to be a master thief and became almost a second father to you over the course of 2 years. Until one day he set you up, and ran away with the treasure leaving you to rot in the king’s jail.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "JWjd87t7kH3PCgao","flags": {},"type": 0,"text": "You always had anger problems, then again most sailors do, yours were a bit different though. One day you were fishing off the side of your ship when you caught something very heavy on your line. When you finally reeled it in you found a gold ring, but the gold was almost blood red, and in you hand it felt like it had almost no weight. Your crew members wanted to see the ring, but they only saw it as normal gold, you saw it for something much more incredible. When they tried to take it from you you flew into a rage beating them senseless until you jumped into a rowboat and made your way back to shore. You know that they will probably come after you, but none of that matters, you know that you must go to the mountains. You just don’t know where or what a mountain is.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "b45SWPSyG9waCVLH","flags": {},"type": 0,"text": "You grew up on a small farm. Your family was poor, but you managed. You idolized your older brother as a child, even though he wasn’t always nice to you in return. Then one day your brother was conscripted into the army, and you haven’t heard from him since – none of the money he promised to send home, not even a letter. You have finally come of age yourself and set out to find him, or at least find out what happened to him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "3lFw6dzDcstK9K0L","flags": {},"type": 0,"text": "When you were a teenager, you stopped by a fortune teller’s stall at a festival, just out of idle curiosity. The fortune teller performed her rites and examined you, and promptly burst out laughing. She refunded your money and refused to tell you what she had seen. All she told you was, “Good luck!”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "lEXrOdwZnW6VfnY3","flags": {},"type": 0,"text": "You were a middle-aged craftsman/woman with a successful business, several children, and a happy life. One day you came home to discover your spouse was cheating on you. Newly divorced, you had a bit of a mid-life crisis and spent all of your savings on a [book of magic/set of shiny armor/fencing lessons/musical instrument/etc]. Gosh darn it, you want to have an adventure!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "a3Qdh5HMNu62E57U","flags": {},"type": 0,"text": "Your parents are scholars, historians specifically, and you’ve been raised on countless trips to archaeological digs, libraries, and lectures with them. You may or may not have taken to the studies as much as they’d like, but when the restless need to spread your wings and get away from home took hold, they were excited to request that you document all the things you discover on your adventures and bring them home to share.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "FZILomxErqMgMUO5","flags": {},"type": 0,"text": "You were the oldest child of a prosperous peasant. You had a life of beer, bread and barn dances to look forward to. Then, you went into the big town on a religious pilgrimage, and were knocked out and press-ganged into the army. Turns out, you loved it and never looked back. Your dad had other kids. Too bad the Goblin Wars are over now and your lord disbanded his army.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "6YoOhAZudyvUe4vF","flags": {},"type": 0,"text": "You were a slave, on a big estate. One day, a charismatic leader got the slaves to rise in rebellion. You’re pretty sure there are others who didn’t end up crucified, but you’ve never met any of them. Here in the city, nobody has any idea the rebellion even happened.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "NUG5Jfspy9lM6nUU","flags": {},"type": 0,"text": "You were a village priest. Births, deaths, rites of passage. Holy cow, was it boring. You renounced your vows and moved on. You’ve never suffered from this: the gods have never wrought revenge upon you. You get the feeling they don’t care, or they’re not there. Some of the things you learned (healing, counseling) have proved pretty useful.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "Tz8xHDWVrxrOmkhk","flags": {},"type": 0,"text": "You were a wealthy playboy, the son of a rich merchant. He got murdered; you lost what was left gambling. Turns out you’re pretty good in a fight. You still have expensive tastes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "QAMphM46Yecx1hMF","flags": {},"type": 0,"text": "You were trained as a courtesan. You got blamed for breaking up a marriage among nobles. Some of them still like you; others want you dead. Sometimes, it’s hard to tell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "nk4Ltq5pUOCgURQl","flags": {},"type": 0,"text": "You were conscripted to join the army, but it was a sham. You and a couple others were lured into an ambush by bandits. Though outnumbered, your group managed to fend them off. Unfortunately, only you survived the ordeal and managed to escape before the bandits got any more reinforcements, though not without taking a valuable item the bandits were after. Now you’re on the run hoping to lure the bandits away from home.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "AxhSMz57eiNpdCUI","flags": {},"type": 0,"text": "You are transported to another plane of existence where everything and everyone from your past life has occurred just the same, except you. In this plane you died early in life/never been born/had rose as a crime lord that went missing as his reign fell/whatever else you can up with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "3vITLhXIkKOnzsaF","flags": {},"type": 0,"text": "Your family has been guarding an ancient artifact for generations that has been said to hold immense power. It is stolen under your watch but you track it down JUST as it is about to be used for evil. It’s a dud. Now you journey around to find the real artifact that your family should’ve been guarding/ find the reason why they’ve been given such a fool’s errand to follow for so long.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "yqlkud5Ld9ANK5yt","flags": {},"type": 0,"text": "A warlock finds out they’re not the only user of their patron’s magic. Others share the same pact they made with it and now the patron desires them all to find each other and fight to the death. The winner shall be granted the true power the patron split between them/wish/ immortality/ whatever else.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "drQXTDyyvTmyhNJ1","flags": {},"type": 0,"text": "Your mother carried your little body through the woods, with her dying breath she brought you to the wise man of the forest and collapsed as soon as she told him your name. He raised you in her stead until he died of …","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "yjQgY0xdzgg5NUuN","flags": {},"type": 0,"text": "Despite being cheerful and righteous, you can’t remember anything before you’re 25th birthday. Every time you kill something evil, you get a small memory back. Every quest returns to you a piece of your former self…and the more you see, the more you suspect you were not a good person.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "IYZMtvoQFEZ2h2wR","flags": {},"type": 0,"text": "On a mission to buy some new clothes you were mistaken for an adventurer who had already orders some. You were thus outfitted and always one to role with with what life throws at you decided to run with it. Somewhere there is an underdressed adventurer looking for her clothes and wondering who stole her identity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "2dwyhhjbc8cShDqI","flags": {},"type": 0,"text": "Your parents always said that reading would be the death of you. Despite this you taught yourself how to read behind their back. You then discovered the will and testament of your real parents and realize you are being raised by your uncle who controls all the family wealth. Fearful for your life and feeling betrayed you abandon the household to make your own name and find out what really happened to your parents. Your uncle may or may not know that you know about the deception.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "X8p5oaB657VSPsKC","flags": {},"type": 0,"text": "Once, you belonged into a wealthy and noble family, who unofficially ruled the city, due to your wealth and power. You were enjoying your time in the sun and were proud of your family name, until you discovered your father is a vampire, who works with evil necromancers and together turn civilians into monsters. Conflicted on your hatred, feelings of betrayal, sense of duty and love for your house, you grabbed your dearest friends and hit the road, forsaking your family name and keeping the secrets of your family hidden.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "YPeBYx7EEWp0orPp","flags": {},"type": 0,"text": "You were raised by travelling merchants, going with them wherever they went. As you got older, they started teaching you the ways of the trade, and you planned to travel and trade with them your whole life. One day, your caravan was attacked by bandits, who killed everyone, and would have killed you, if you didn’t get away. Since then, you abandoned your dream, and have been making a living out of adventures.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "TGfvllqi1Iv7VfZr","flags": {},"type": 0,"text": "You were trained by a master of your skill, like many others, in an appropriate organisation. One day, they set each of the students on a quest for retrieving a mythical item. The thing your character was supposed to find though, was simply a myth. When you told the master the story, they didn’t believe you, and expelled you from the order.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "F2iSEcXzFSJtROhw","flags": {},"type": 0,"text": "Your parents were retired adventurers, who told you their epic tales, and probably expected you to follow their steps. When you reached adulthood, you set out to do even more epic deeds than them, despite having no training at all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "5mHCVc2ul1eveC3u","flags": {},"type": 0,"text": "The first thing your remember is being rescued from rubble by a good-hearted noble, who then patched you up and offered his help in trying to find who you are. The only clue you have are your class abilities (which are like muscle memory to you), and the knowledge of whatever the collapsed building was.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "SqDxs717K0jdCEee","flags": {},"type": 0,"text": "You grew up as a normal city kid, and never really did anything interesting with your life. You had a decent job and was going to get married soon, until the day you got lost in the wilderness. That was years ago, and you have never been able to find your way back to your hometown, because nobody seems to know about it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "yv4tcTti4C5nA2pE","flags": {},"type": 0,"text": "You grew up with nothing, cheating and stealing where you could. All you’ve ever earned was a target on your back and bad reputation. Eventually you found yourself on the run from the wrong kind of people. In a tavern you met a wizard that promised a way out. With nowhere else to turn, you reluctantly agreed. The wizard took you to his study and performed a ritual to switch your face with the face of another person of similar build. Now you go off into the world with a new identity and a chance to start over. Or so you thought… (The face you wear has it’s history too).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "FtmgnGGfORvo2Lqe","flags": {},"type": 0,"text": "You are the child of a single woman taken in by a traveling caravan of performers while pregnant. She never described your father to you, and she changes the subject when you ask. Those in the caravan are your substitute family. You have several ‘grandparents,’ ‘aunts,’ ‘uncles,’ and ‘cousins.’ You took part in the caravan’s entertainment for coin, whether as a performer or someone behind the scenes. When you felt the need, you left the caravan of your own free will to pursue your journey. You were given a special crest with the performers’ symbol so you would be welcomed back if you returned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "0Hbf1oEkuEHSsSNk","flags": {},"type": 0,"text": "You are an experiment, either made or modified for a reason you cant even remember. with so many genetic changes and magical ‘enhancements’ that you cant even count the amount of places where they’re from. A lab rat from a man who seemed to want to do good, and claims to try to have done so but never told what he was doing specifically, never said what his end goal was and just kept going, and going and going. The doctor was put to death for his experiments. Whatever purpose you had been made for is now lost to you, as is just about everything you used to know. You don’t know who you were, assuming you were anything other than this.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "COa6qTiIcQWGY0p7","flags": {},"type": 0,"text": "You fell into life threatening trouble one day exploring some ruins close to town. There you found a strange altar with and old woman sitting behind it. She said she could help you escape, if you promise to serve her. You’re pretty sure she’s a god, but she won’t tell you her name, or what she’s the god of. She shows up sometimes and points, and whatever she points at you must somehow acquire and leave behind in certain ruins. Her tastes are getting kind of extravagant.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "BMJ85Jiltm12WVsB","flags": {},"type": 0,"text": "You were once the son of a wealthy merchant who traveled more than average compared to other merchants at the time. Your father would often take you and your younger sister on some of his shorter journeys, exposing you to a dangers of sailing across the seas. On one advantage your father’s ship was attacked by pirates killing everyone on board. Because of the tragic death of your father you desire revenge, and will do anything to kill them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "Bj5ELugp11eDRq9L","flags": {},"type": 0,"text": "Your an anti-social person who lives a quiet life in a rural part of the kingdom. In your quiet life you discovered a interest in ancient artifacts left over from the last civilization. Known most of your down time is sent studying these artifacts through reading ancient texts, and practicing your magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "lY5Bhe5DcDY8b3Ub","flags": {},"type": 0,"text": "You sold vegetables from a street cart you were still making payments on. A wild street chase broke out and one of the escapees upended your cart to delay some guards, shattering it badly. Reeling from the financial loss of your vegetables and blocked from setting up another shop by overzealous debt-collector harassment, you left town with all you had hoping to put your life back together.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "rTvtgqIx29m4Oj1R","flags": {},"type": 0,"text": "You were once a wicked individual who took pleasure in the misery of others. You were then struck by powerful cursed magic that turned your entire outlook on life around, so that you now are a force for good who brings happiness to others. Your dark past still haunts you, and sometimes your old friends try to call you back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "CryLwF4OADvdGncJ","flags": {},"type": 0,"text": "You were a simple bed-and-breakfast inn owner. One of your guests left for a night of carousing and never returned. Among their left-behind possessions was an ornate locked box with no key. Hoping to find the owner or their organization, you took the box to a local bush-wizard to get it identified. While you were away, your inn was ransacked and burned to the ground. Word got around you had the box and you were being hunted, so you fled in terror.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "O9vutqI81Zl5WUFo","flags": {},"type": 0,"text": "When you were young, you found a diary that would message back to you if you wrote in it. It taught you many mysterious skills and spells. One day, the diary told you that it couldn’t write to you anymore, and it went silent. You set off when you got older to explore some of the places the diary mentioned and uncover the identity of your mysterious penpal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "z0ZjzGVM6joUbzWB","flags": {},"type": 0,"text": "When you were young, you were polymorphed into a flying horse by a malfunctioning spell. Some explorers promised to help you, and you taken on many harrowing adventures. The help never came, as the explorers preferred a flying horse. Decades pass, you were lost and sold many times. Eventually a kindly witch made you whole again, picking up human life at the age you were changed. (Can substitute for flying carpet if you aren’t a horse person.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "yrioCL5fXjDlG9A9","flags": {},"type": 0,"text": "A lonely child found a ring of wishing. They wished for their imaginary friend, you, to become real. The child soon became sick and died, and their parents blamed you and ran you out of town. Using the powers that the child imagined you to have, you have begun to search for a purpose.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "tj6ovJQX96qDF7mP","flags": {},"type": 0,"text": "You were born dumb to a wealthy family with an estate. Ashamed and not knowing what else to do with you, your family used you as a slave, setting you to all the most awful and menial tasks. Not knowing any better, you became strong with a smile. One evening, you showed kindness to an old woman who turned out to be a fairy queen in disguise. She blessed you with intelligence. Disgusted with the way you were treated, you left home, hoping to learn to read, study, and start life anew.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "W2g6L7qfWQBFkSSE","flags": {},"type": 0,"text": "After your town was razed and everyone you knew died, you woke up in the middle of the ashes. Something, for some reason, kept you alive, and a life of adventure might give you the opportunity to find out what and why.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "bLC1SNqi0TiCePIr","flags": {},"type": 0,"text": "The bandits thought they left nothing of value in your village, and maybe they were right because that night you lost your arm and way of life.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "68eam7X325MQJVyP","flags": {},"type": 0,"text": "You grew up as the region’s stereotype, a poor farmer with a passion for whittling. After inheriting the farm prospectors found gold in the river and you sold the farm for more money than you thought was in circulation. Unsure of how to spend money and unwilling to save it, you purchased an abandoned adventurer’s guild with plans to turn it into a wooden toy shop before finding it not quite as abandoned as you thought.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "ne7tDyVDhV8L7TFz","flags": {},"type": 0,"text": "You are a farmer who found a talking rock which only you could hear, in the middle of your own farm. Everyone thinks you lost your mind, which eventually leads to an unwanted embargo, and you go bankrupt.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "5a8Z71tVMnBApgky","flags": {},"type": 0,"text": "You lead a relatively normal life as a tailor in a small town until your infant daughter started showing signs of sorcerous abilities and was stolen in the night.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "145O75lIFPVxMZRe","flags": {},"type": 0,"text": "You were the student of the greatest bard in the land, until you murdered him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "sHQ0EdUlhT1xmBSc","flags": {},"type": 0,"text": "You were trapped in a cloud giant’s castle for years living of of giant crumbs. Only recently were you able to escape.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "L1XJYpgyjqXdd0zd","flags": {},"type": 0,"text": "You were an orphan taken in by the local butcher. You were a loner bug dilligent and you loved your adoptive father. One day the village is attacked by bandits, who kill your adoptive father. You get your revenge on the bandits but the brutality of your vengeance alienates you even more to the rest of the village.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "tHd359a4IE2UbRtZ","flags": {},"type": 0,"text": "You grew up watching the pit fighters in the capital city, marveling at their strength and ability. You spent years training on your own in both armed and hand fighting, with the ultimate goal of entering the pit and becoming a legend in your own right. As you are about to enter for your first match, your opponent and the announcer come over to lay out the match, revealing all of the fights are pre-determined and set up so no one is really injured. You walked away and now are trying to find your place in the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "KrIA0jM8yKy93H2v","flags": {},"type": 0,"text": "For your entire life up to now you have watched others perform magic, they were few, but fantastical and filled your heart with wonder. Practice and study as you may, you were never able to recreate even simple cantrips that the local wizard has tried to teach you. Distraught, you ran to the woods to a secret clearing to cry for a bit. That day something incredible happens, magic shot from you fingertips, and shortly after a man in a suit and tie walk up from the edge of the clearing and sets his briefcase down on a large flat rock that you had never seen sitting there before. “It seems we have some paperwork to go over,” he said with a smile.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "Xzk7hP8pACTTqv7j","flags": {},"type": 0,"text": "You met and joined a errant knight and his small court that traveled searching for riches and a new home for this lord and his barren town after the war. After years of service and being brought to be loyal to this cause, the knight died in his sleep all the sudden and his attendants looted the caravan and ran off, leaving you to bury your teacher, pack what gear he had and was left behind and pick up the quest of Knighthood to this unknown lord as he was show.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "OANrrChddNfVQU5M","flags": {},"type": 0,"text": "Character [C] was a demon hunter on the desert planet Derach. C fought alongside their small battalion and this group was revered for their efficiency and kept to themselves. One day a strange rift opened and pulled the group apart banishing each of the soldiers to different corners of the universe. C’s only goal once reaching a strange green planet was to find a way to portal back to the demon’s world and find their companions. Unfortunately C was captured by the planets inhabitants and forced into slavery.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "FEAuP4E8g427aSpC","flags": {},"type": 0,"text": "You only remember the last 5-10 years of your live. Before that it is all blank. Your parents/caretakers/close ones tell you that you had a terrible accident and lost all memory after the accident. But then you find written agreements of your adoption, detailing that you were selected for an experimental form of adoption. This meant that your memory was wiped and your biological parents wiped out. You have been engineered by wizards/scientists to be the perfect human. You then find a note that the amnesia can be reversed if [plot hook] is done. A warning is written in big letters that reversing the amnesia spell might have unforeseen effects.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "F8H6AnqeeWbCJAug","flags": {},"type": 0,"text": "You spent most of your childhood and early adulthood as a farmer, the difficulty of your daily work offset by the amazing times you’ve had with friends and family. One day, you hit your head on a rock. When you next awoke, you were in leather armor, on a sailing ship as part of an adventuring party. An entire life of adventure, riches, and excitement unfolded, and as you lay down for the last time, surrounded by your allies and loved ones, you woke back up with a pain in your temple, 3 seconds after hitting your head. You can’t feel comfortable any more as a farmhand, you need a blade in your hand and a bag of loot at your side.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "2VMlXQg5cCriXKSE","flags": {},"type": 0,"text": "You’re a wandering conman, appearing trustworthy as you bend others around your finger, making yourself invaluable to them with the hard work and amazing success you provide. Every time you leave to fulfill your life’s dream of finding a perfect spouse, you leave behind a trail of heartbreak, impossible upkeep, and new businesses doomed to fail.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "dPGwmgGnMmC3Q2cl","flags": {},"type": 0,"text": "You’d probably say that you’re about 605-615 now. The years go by in an instant. When you were young you devoted your life to meditation. Recently, you were visited by a boy, who you began to talk with, and would do anything for. He lived, trained with you, and eventually succumbed to age. You, now unquestionably ancient, you have no clue how to interact socially or succeed in anything else, but you want to see what world the boy left behind for you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "iavXXdHwMBQauKcO","flags": {},"type": 0,"text": "You’ve spent your entire life underground, in the same building. Every day, a music box played you a lesson. You learned languages, numbers, history, how to act properly in society, how to assassinate the high king. Now, the doors finally open and you see the outside for the first time. It’s time to use all that you’ve learned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "w2JrvGmpkcH5CqzA","flags": {},"type": 0,"text": "You’ve always been able to talk to the trees. They tell you interesting things. How they are, what they feel, how those who pass through and around them respect or disrespect them. Recently, the trees have been quieter and quieter. You need to find out why, for their sake… and yours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "rNa4xkuoqDln1GGn","flags": {},"type": 0,"text": "You were drunk. Your low marks in Thermo meant you wouldn’t be on the dean’s roll this semester. Your parents were going to lynch you. You spend the night weeping, stumbling into a dark part of campus you didn’t recognize. You made a deal. You thought they were going to intimidate your professor for you. You woke up in a hay bale, with no phone poles in sight. You get a strange feeling that you won’t be graduating this year.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "3KAlJKAxlqwqSXNi","flags": {},"type": 0,"text": "You were an orphan. Your parents died in a plague that went through when you were small and, to care for you, the town council apprenticed you to the local gravedigger. For years you served, learning the ins and outs of the physical and spiritual side of dealing with death. You learned about your god, the patron of death, from the gravedigger, but his worship always seemed a bit hollow, a little too rote. One night you picked up the sacred text he kept on the small shrine in your shared chambers and read it. You became shocked and dismayed at the disparity between the soft platitudes your guardian parrots and the dire truths uncovered in your god’s scriptures. That night the gravedigger, his home, your entire life burned to the ground as you set off to become the god of death’s most faithful servant ever.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "GRjbFIIXfcKwx8Zm","flags": {},"type": 0,"text": "Born to caravan guards, as a child you traveled with merchants and learned to sort goods, haggle, fix wagons, spot danger, and cook meals on the road. You met all sorts of interesting people who paid to be guarded by a convoy. Now that you have come of age, you want to explore some of places you heard about.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "QGgySlvjW0Jele6f","flags": {},"type": 0,"text": "You are the 11th child of 14 siblings. Instead of hanging around your cramped home, you spent your waking hours in a nearby library, learning, sorting books, and doing sums for others for small fee you brought home to your parents. You have come of age and hope to write a book one day that will sell tens of thousands of copies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "BOIBtGQDShVj7m71","flags": {},"type": 0,"text": "You were raised in a dragon’s den. One of your parents was a dragon’s favorite and the dragon allowed your family to take up residence in his/her home. They, and you once you were old enough, provided services such as greeting guests, expelling uninvited intruders, maintaining inventory, cleaning, and cooking fine meals. You have fond memories of playing in a piles of gold, stirring a 2000 gallon stew pot, donning magic clothing and weapons, leafing through esoteric books of powerful magic to look at the pictures, and attempting to outwit your draconic landlord with whatever puzzles and games you could think of. You left on good terms at the same time the dragon’s youngling left to establish its own territory, and you hope to carve out a bit of the world for yourself as well.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "ZiKnrWplaAyDL8VV","flags": {},"type": 0,"text": "You were raised in an abandoned necromancer’s lab by intelligent skeletons and various other undead. You ran a lot of errands, being tolerant of sunlight and unlikely to send the whole town fleeing for the hills. Your main mentor was a flamboyant skeleton with a hat of disguise and a penchant for long-winded but thrilling tales of ages past. Armed with ancient weapons, some minor alchemy materials, the lost necromancer’s notes, and the skills your undead family taught you, you now walk the earth. You are quite open-minded about creatures of the dark and undeath, but having seen the goodness they are capable of, you are intolerant of undead who would exist at the expense of others and visit cruelty on the living.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "euN9XwYYcewixNcg","flags": {},"type": 0,"text": "You were born into a clan that viewed those born with magical power as evil. During your coming of age ceremony your powers awakened and you found yourself surrounded in arcane power. Fearful of you, the clan leader cast you out. Now you roam as an exile from your clan trying to understand your powers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "cYoajEkjVIUn6pzj","flags": {},"type": 0,"text": "Your birth was a summoning deep in the forest, and you recall the face of your first parental figure was sheer disappointment. Summoned as a readymade adult, your memory of childhood is non-existent, and less helpful, your summoner teleported away the moment you arrived nude on the mossy floor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "roug3Um1xDykNO4z","flags": {},"type": 0,"text": "You don’t remember your father at all, but your mother says that they were the most handsome and talented bard in all the land. Each day you wonder what adventures he must be on, as your village has nothing for you but chickens to pluck and hogs to hang. With nothing but pitchfork and hoe in hand you set out, determined to find your father, or at least bring back a story for the folks back home.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "mwtQgPiNswi2q243","flags": {},"type": 0,"text": "Your father was a blacksmith, but he’s not truly your father. Your mother cheated on him years ago and he knows it. Whether it’s true or not you’ll never know. He hates you for it nonetheless. He did the bare minimum a father needed to do until you were old enough then kicked you out despite your mother’s plea’s. You stole the greataxe(or preferred weapon) he was withholding until the customer paid and left your old life behind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "nFBeVEezdFZwkytU","flags": {},"type": 0,"text": "You were orphaned at the church of (insert God of Strength, War, Valor here) where you were raised from a young age to become a fierce warrior for your God.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "KSY3WFsMqHm0xyZo","flags": {},"type": 0,"text": "When you were young, you had a thing for fire. It was pretty, destructive, and alluring. One night as your family slept you were playing with it and accidentally set the family home ablaze. Your mother awoke to the inferno and using every once of power she had saved you from the blaze before succumbing and burning up right in front of your eyes. It was the most beautiful thing you ever saw, and if only the world understood, then maybe they wouldn’t be so afraid of fire.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "F3ANx5bD60lO7Ln0","flags": {},"type": 0,"text": "Mistress tells you that you used to be a great Paladin. A sworn warrior of good, bringing justice and light to a terrible land. Then you came to her and Mistress may be the strongest enchantress there is, maybe stronger. Now you are Mistress’s defender, a (insert Warforged, Golem here).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "hdGYL3Bmm2CvdVIQ","flags": {},"type": 0,"text": "You are … were a member of the city watch. Now, you suppose that you’ve likely lost that position. Just like your father, you were signed up and joined their ranks at quite a young age. You were far too low of a rank to call your job fulfilling or exciting, but you didn’t really mind it all that much. After work you’d spend about half a day’s pay drowning your boredom in booze. You’ve always had a love for a good brew, but you never thought it much of a problem. Until recently. It seems one night you decided to go on a week long binge. What few memories you have are too fuzzy and disorienting to make any sense of. How you’re alive, you don’t know. During your blackout, you seem to have somehow made it to somewhere you don’t even recognize. You’re wearing equipment you don’t remember acquiring. You accidentally set off a cantrip, despite the fact you’ve never even seen magic at work, let alone use it. Some guy just told you that you asked him to get you up so you could go meet with someone about a new job. You decide that you need to figure out what happened and that maybe you really do have a drinking problem.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "q3KTn0Fezu69DVY2","flags": {},"type": 0,"text": "You grew up alone in a rather large and well kept house, no parents that you can remember, or relatives you visited, but food would always appear out of nowhere in the pantry, as did gold in the sofa and water in the well. One day, you woke up on the ground, the house having completely disappeared from existence. In its place, a note remained, reading ‘Stay Strong!’ Of course, you began adventuring from there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "sV0qi9ieTk5N3tXw","flags": {},"type": 0,"text": "You narrowly escaped  your home city after a nasty plague was set upon it. The man who helped you escape was a high nobleman, and you later heard that he was culled along with much of the city. That city was your home, you loved it, and now it is all but gone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "pNMEprYbNgQW9ci9","flags": {},"type": 0,"text": "You were a member of minor nobility that got wiped out by a conspiracy, so you fled to a monastery. But then you got kicked out for tricky one of the priest(ess)es into breaking their vows of chastity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "CWo77CDNvvap1Kzf","flags": {},"type": 0,"text": "You were part of a desert caravan that ran out of water. But a vision appeared leading to an unknown oasis … and commanding you to go to the city of (Plot starts here).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "7Ng5WmWLGvAkXMz2","flags": {},"type": 0,"text": "You were raised by a lovely mother and a father that turned out to be a true polymorphic gorilla. As a result, some of your beliefs and habits are a bit ape-ish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "q4SyaRJqXc5TDweo","flags": {},"type": 0,"text": "You were born in a tribe of nomadic people. In your young age you and your parents got captured in a raid and sold as slaves. Your family got lucky because you have been sold to a noble. His castle was in a cold region with hard winters. He was a brutal leader but fair to everybody who did as he told. You learned the etiquette of the royal court and got along very well. As you became an adult he gave you to another lord to become a soldier. Their kingdom was at war. On the way to your new owner your caravan got raided by their enemy. You somehow escaped. A few days later you found out that your former lord has been attacked and everyone including your parents were murdered. You left the kingdom and never came back till today.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "C0FRqcJBDdpsORwM","flags": {},"type": 0,"text": "Born an orphan, you were adopted by a wealthy family at a young age to be raised as help. (How the family treated you growing up is up to the player.) Shortly after your 18th birthday the entire estate is burned to the ground and you are the only known survivor. You are suspect and wanted by the local, kingdom for questioning and crimes against the family. Can you clear your name before the kingdom picks you up, are you to blame for the fire, or are you innocent and wrongly accused? Will you be able to find the villain in time?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "wmO5o0erh4SKVW75","flags": {},"type": 0,"text": "A retired member of the army, you have been jaded by war, seen far more than any one person aught to see in a hundred life times. After settling down and manning an inn for some years, you’ve gotten the itch for adventure, and now ready to strike out on your own and see the good in the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "tdr2dNvMQFN3QIPV","flags": {},"type": 0,"text": "Given up as sacrifice at a young age by a small village to insure their harvest, you were picked up by a band of traveling performers. Growing up with them you traveled the country side. Upon reaching adulthood, your adopted parents told you the truth of where you came from. Do you venture off for revenge? Do you forgive and forget?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "kJXBCADap3b19HZJ","flags": {},"type": 0,"text": "Sold into slavery at young age, you where set free by traveling adventures early in your teen years. Since then you have always dreamed of becoming one yourself. Not wanting to waste away your life tending to home and hearth you’ve set out for the call of the wild.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "bSV2GkcdSZI3t6go","flags": {},"type": 0,"text": "Daughter of a diplomat, you traveled the world’s capitals with your father. You grew bored of the stuffy and bureaucratic business and roamed the foreign streets and markets. It is here you fell in with a dashing rogue who stole your heart and taught you the secrets of his world over one glorious summer. You resolved to embark on a career of your own choosing, not your father’s.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "94nmSlwJJ6jpW5ud","flags": {},"type": 0,"text": "A radiant portal spit you out. The last words you remember were ‘Penance’. Aasimar know who you are, but won’t disclose it even under torture.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "4hUHm8DINAjk3HAy","flags": {},"type": 0,"text": "Raised by pirates you raided the wrong temple and you were the sole surviver.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "pHbKEGRlG4EvskYN","flags": {},"type": 0,"text": "Raised by ogres they always threatened to eat you growing up. You payed them tribute and grew above the goblin ranks. Eventually you made your bid for freedom by poisoning all their dinner. You are a legend amongst the goblins and ogres.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "hChLxMKwP9T9KpJw","flags": {},"type": 0,"text": "You had a normal childhood in the city. Schooling, family, friends, playing on the large stone walls…but all that was taken away in an instant when 200 hollow-core Warforged self destructed… leveling the city you once called home. Their master and her apprentice long dead you hunt down the last of their demented toys to honor your loss and make the burn marks on your back hurt a little less.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "Z3J3qCHwoX5wfRRo","flags": {},"type": 0,"text": "Taken in by a pack of traveling werewolves you were given a silver necklace and acted as their cover. You outed them in a city and you were finally liberated. Their daughter still hunts you… waiting to find you alone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "LWGUTspui3Jdfqvc","flags": {},"type": 0,"text": "As an orphan you were taken in by a sweet, old, good-natured necromancer. You fetched goods from the nearby city, helped dig up parts, played with his creations… You left on good terms and you have no fear of the undead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "4QmLfM3dUWf0JACg","flags": {},"type": 0,"text": "Your heart opens a portal to the Nine Hells… according to the prophecy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "j2ansapTuRBwHtKV","flags": {},"type": 0,"text": "Your family is known amongst all Dragonborn…and loved for your ancestors deeds. Which was promised in blood oath to never be disclosed to you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "xdCYdSALJ324GyJB","flags": {},"type": 0,"text": "You grew up seeing visions of battle in your dreams. Horrible, cruel visions of a war far away. You share a soul with a Warforged on another continent…and you are seeking each other out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "d6JYdFh96KOM0qk0","flags": {},"type": 0,"text": "You were raised by giant eagles. You learned to flush out prey and perform menial tasks in service to your sky lords. Eventually you got too heavy to carry and they all abandoned you…all except your rookmate Kyla. She was the runt, left to die, and always keeps an eye out for you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "5Ae0mT716grpb5wU","flags": {},"type": 0,"text": "Raised by dwarves in a mountain hold it’s no wonder you have such a surly disposition. You know the runes for entry into most dwarf fortresses and can drink ale with the best of them. Switch this background to ‘Halfling’ and ‘farm’ if PC is a dwarf.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "9ta4GtG3PezHTyfS","flags": {},"type": 0,"text": "Raised in a lighthouse on a lone island you would danger the rocks to salvage whatever you could from the unfortunate ships scuttled on the rocks. This made you a strong swimmer. Be it pirate or merchant your family name is well known and appreciated for the work they do.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "oiUAvE1lwjvHCWJM","flags": {},"type": 0,"text": "You were forced to murder your family when they became vampires. The town didn’t believe you and now you are on the run. Rumor is one of your family survived your gruesome attack…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "EWeuhYyYmdBdvWAe"}
