{"name": "Signature Tavern Drinks","description": "One hundred special drinks for your tavern!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "m0MhV6GRv0a2slHn","flags": {},"type": 0,"text": "The Flaming Dragon – A spicy beer that causes the user to breathe fire when they burp.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "qkVTCyjwXxg4zuJd","flags": {},"type": 0,"text": "The Banshee’s Breath – white, swirling liquor made from a special translucent wild berry. Tastes sweet, has an effect similar to mint gum in that it always feels cold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "7JL6vZ7nn4jbou2R","flags": {},"type": 0,"text": "The Mountain’s Bounty – A fine liquor made using water from a glacial stream. Always refreshing, and always makes you feel cold no mater the weather.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "Qt2caDrJOoBMV7vM","flags": {},"type": 0,"text": "Mawxie – A drink all the locals cite as a local treasure. Tastes disgusting.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "XoTi2tqZPR7DAHTv","flags": {},"type": 0,"text": "Bog Grog – A mix of Rum, Orange Juice and fermented herbs that, when drunk, causes the user to gain advantage on saving throws against being poisoned for 30 minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "zCyE5I8LpH8iUYVE","flags": {},"type": 0,"text": "Frost Mead – Honey and the tear of an Ice Giant make this shot. The crackling blue sparkle and the jet of icy breath you have for rest of the day is worth the expense.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "QGVErOEaba2cGy0g","flags": {},"type": 0,"text": "Weatherbee’s Whirler – Invented by the perhaps too inventive Filbus Weatherbee, this drink is testimony as to why it is a bad idea to point a gnome’s sharp mind towards the creation of a new brew. After spending many years living among the dwarves, Weatherbee made his way home with a drink even the stout folk couldn’t handle. This monstrosity is laced with latent magic designed to lessen the chance of drinkers dying from its ungodly alcohol content, and reportedly tastes like “A kick in the face from a horse.” After one shot of this drink, the drinker is shunted into a chaotic haze of blurry awareness, bolstered confidence, and overpowering drunkenness. In addition, the latent magic in the brew causes minor, uncontrolled magical effects to occur around the drinker at random times during the haze. The nature of these effects is up to either the DM or the player, so long as the effects are sufficiently insignificant. After 1d4 hours, the haze drops away and the drinker immediately and almost violently falls into a deep sleep so that they may recover.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "uUhbpPulmudTLPVK","flags": {},"type": 0,"text": "Dragonborn Bloodwine – When you drink it, you are able to use a breath attack once within the next 10 minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "uNVN8pQv8faFV2TV","flags": {},"type": 0,"text": "The Quieker – nasty rum that gives a high pitched voice for 1d4 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "ZR1TPXo2LvH1zkrv","flags": {},"type": 0,"text": "Faerie Fireball – a delicious cinnamon whiskey made with a touch of Fey magic. Causes uncontrollable hiccups for 1d4 hours. With each hiccup a small cloud of shimmering breath is released.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "LfOItU3Qs6DXssd7","flags": {},"type": 0,"text": "Lily in a Well – a tall mug of ale, half full with an edible flower garnish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "dSPoc7tCU3z3q8ha","flags": {},"type": 0,"text": "Hammer Beer – One glass will make you feel like you just hit yourself with a hammer. Minus 5 HP.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "fE1WLDNDxdNDNsBC","flags": {},"type": 0,"text": "Dragon’s Piss – A beer that tastes exactly like one would suspect by its name. For sure not a drink you need a second one of.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "cHaAeFoImfBnFujZ","flags": {},"type": 0,"text": "Shamrock Shake – Instant dc15 con save. On fail the patron is incapacitated. No save required if patron has Irish (sounding) accent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "gqbRjtQkgOiV3AoR","flags": {},"type": 0,"text": "The Sun’s Glory – A citrusy cider that makes your eyes glow like an Aasimar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "S3ip2THuTtXS1ZMO","flags": {},"type": 0,"text": "Black Midnight – A drink created by necromancers to honor fallen necromancers, Bitter with a touch of rum. Those who drink it have nightmares of dying and spending an eternity rotting away inside a coffin. This helps enforce necromancers to contemplate their own moralities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "mRvcZBeadCLXJ5Dm","flags": {},"type": 0,"text": "The Phoenix – A peppery drink that burns on the way down, and then again on the way out. It is often used as a prank on drunk companions, who have a nasty surprise waiting for them the next time they go to relieve themselves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "XLh5AKP98tVQXtj2","flags": {},"type": 0,"text": "Hair of the Bloodhound – Once you have become intoxicated on this brew, you gain the usual drawbacks of drunkenness but gain advantage on survival checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "ojQcGKMJqqQE80aA","flags": {},"type": 0,"text": "Seer’s Solution – A mildly viscous green liquid. The first two shots have no effect. The third gives you truesight up to 60ft for 1d4 minutes. The fourth and subsequent shots give the drinker horrible audio/visual hallucinations for 1d4+2 hours. Counter resets at dawn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "7YfsIvPWZHdbnHhP","flags": {},"type": 0,"text": "Spider’s Bite – Take 1d8 poison damage on a failed CON saving throw. Packs a mean punch.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "tdU8DKViYYlTsxp7","flags": {},"type": 0,"text": "The Fortnight – Very strong alcohol. If you actually drink enough to get drunk, you stay hammered for days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "No1TUOxNYIWPsxRp","flags": {},"type": 0,"text": "Tinkerer’s Tincture – dark and smooth, and when you drink it all the clicking, whistling, and scraping noises are more apparent to your ear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "f8IEOtfbGF1p62Tt","flags": {},"type": 0,"text": "2 Couples in a Shared Household – (much easier if teabags exist) Two different types of hot tea, 2 of each, into one mug.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "xC63fYMltE64tXAH","flags": {},"type": 0,"text": "Sucker Punching a Rabbit – A single teabag steeped in the biggest mug you have.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "GQw3xRX7mGoaZNGA","flags": {},"type": 0,"text": "Buried Treasure – A single, very sweet, rather expensive hard candy is stuck to the bottom of a mug of very hard liqour. Once you’ve drunk it all, you get a spoon to pull it off with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "Clt4JZupMTkVLeie","flags": {},"type": 0,"text": "Ouch – Two full shots worth of lemon juice put into a glass of very high proof alcohol.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "VVL7Fuw7OA9M6m2B","flags": {},"type": 0,"text": "What was I Saying? – An unassuming shot of very strong alcohol, with a cherry in it, usually taken in the middle of a conversation, which is promptly ended.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "jJvDv3pUdtCjysTa","flags": {},"type": 0,"text": "Actual Torture – 2 Teaspoons of salt which are to be eaten all at once. Then washed down with a citrus based liquor. If anyone else offers any drinks, their hands are free game for attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "k1JWYuHVzIc83WL9","flags": {},"type": 0,"text": "The Green Kobold – The first drink to ever be served in a piece of ham, with the skin. 1 shot of herbal liquor wrapped in ham. To be eater all at once. Probably fixed in place with at least 1 pin, make sure you pick it out before you eat it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "sc9gUyOxmBSLjiuj","flags": {},"type": 0,"text": "End of the Line – Very high quality, rather expensive alcohol. A coin is flipped. If heads, your drink is free. If tails, you are forced to drink until you either die or pass out. If you regain consciousness, you must continue drinking.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "o4Doi441rqpVoiIR","flags": {},"type": 0,"text": "Traffic Stop – Invented by a Diviner. Whenever a fight seems to be brewing, everyone orders a traffic stop. It’s a mug of 3 separate liquors that stay separated in their mug, all very strong.The goal is to drink it all before the local police forces arrive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "ipeO8kBGO0bq2bje","flags": {},"type": 0,"text": "Dragon Milk – not really milk, or related to dragons. It’s an expensive white drink, resembling milk (duh) that removes any alcohol in your body. As a result you exale fire in the form of a single burp, resembling a dragon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "iKSK4zaFL4HbefXq","flags": {},"type": 0,"text": "The Necromancer – a drink for those who fall unconcious from alcohol. It’s a green glowing liquid. Also known as the ‘Corpse Reviver’; when poured into the unconcious persons mouth he/she gets up and walks in a way similair to a zombie.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "TNY7Szvk4I0Ndu1O","flags": {},"type": 0,"text": "Beholder – a delicious drink decorated with an eye or multiple smaller ones. Feels like normal alcohol but gives the person a (false of course) feeling he/she has multiple eyes after drinking enough of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "azo7FJOhf5fLJ81l","flags": {},"type": 0,"text": "Elysium – a nonalcoholic drink that smells and looks as bad as it tastes. Some compared it to trash, vomit or even excrement but only because they couldn’t find the adequate foul words. Most refuse to look at it, let alone allow it to come close to their nose. Only those with the strongest will manage to gulp it down. Once drunk, the person experiences true bliss, which seems to last for decades. In reality it’s a few seconds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "stTjo645S2fq4o3R","flags": {},"type": 0,"text": "Nine Steps – commonly known as ‘The Niner’ or by it’s full name ‘Nine Steps to Hell’. It is a liquid that when left to settle separates into 9 parts, the bottom one being pure black and the top a beautiful red with a gradient in between. After drinking it the person seems frozen for a few seconds, but to the person who gulpes it down it feels like days, weeks, maybe even months of 9 different experiences, all basically a form of torture. Often used as a torture method but sometimes drunk to prove ones mental strenght, as those that can’t endure it go insane. The niner is a rare drink because it’s extremely hard to make. An amateur making it, if the ingridients aren’t correct to the milligram, makes a drink that causes instant death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "CpUYAZ5pEj5VeOrJ","flags": {},"type": 0,"text": "Honey Pine Dew – An imported halfling mead, served in small cups. Very pleasant taste, cheap in halfling towns, but expensive elsewhere.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "PU949lj4Vxsvf4Lx","flags": {},"type": 0,"text": "Cubed Spirit – This drink is served as a hollow ice cube with liquid spirit within. As the ice melts in your mouth the drink will come out. How exactly this novelty drink is produced, is a well kept secret.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "Csy5za8ZNDpUkzBc","flags": {},"type": 0,"text": "Milky Way Whisky – A light blue drink that tastes like very watered down, sweetened milk with a lot of alcohol. Besides giving a quick buzz, it also gives bone, and thus teeth, a blue fluorescent glow for 1d4 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "S7hawxSeLDMLSmmr","flags": {},"type": 0,"text": "The house special – This drink doesn’t have a particular name, but it’s cheap. It doesn’t really have an effect. In fact, you’re pretty sure the bartender is simply casting prestidigitation on dishwater to make it raste like like it has alcohol in it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "qFF6TAZGcHxa4nhG","flags": {},"type": 0,"text": "True Dwarven Stout – A strong drink, not recommended if you cannot handle your alcohol. Traditionally served on the rocks, literally. There are pieces of stone lying on the bottom of your drink. Said to give the true mining flavor. This drink will make any dwarve feel very nostalgic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "4DiwNoDqh5bF0Ryu","flags": {},"type": 0,"text": "Petralias Wine – A very expensive wine that is served as a single droplet. It does nothing for thirst or getting drunk, bit the flavor is said to be very concentrated and the lack of drink quantity should make the experience richer. Typically ordered by very pretentious people.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "wp9eGo1clXoCMe9s","flags": {},"type": 0,"text": "Golden Goat – Fermented goat milk and honey.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "uvFd1aUDHXVlpqgB","flags": {},"type": 0,"text": "Star Liquid – A really black drink resembling the night sky. If you drink it you experience a wonderful journey trough the stars for 1 min.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "awa4YvTgDVMI0Rvq","flags": {},"type": 0,"text": "Polymorphic Brew – Commonly used in drinking games, this brew will turn the user into an animal when they burp. They turn back about a minute later.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "7BXDmnWnDbjm2Gwl","flags": {},"type": 0,"text": "Insom’s Ale – has same effects as a long rest, calming.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "toouxc8anUsBmtvO","flags": {},"type": 0,"text": "Lilphina’s Lusty Lover Liquid Liquor – The bottle comes in two parts, with each part having a different hue of color depending on the flavor. When two persons consume the drink within 5 minutes of one another, their minds are swapped for 1 hour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "sl1Ns2pUQEOnWj8I","flags": {},"type": 0,"text": "Piña Colossus – a rare colossal pineapple hollowed out and filled with rum, coconut cream, and pineapple juice. Usually a shared drink. The pineapple shrinks in size when the liquid is drank or spilled. It will also continue to expand and grow to colossal proportions the more liquid that is added.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "t7fLJCULv7ojTiNv","flags": {},"type": 0,"text": "The Coup de Grace – At the end of the night, the bartop is wiped down with a rag, the contents are rung into a shot glass.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "VldHy6jHF6T8aNIE","flags": {},"type": 0,"text": "Drippzt – The drops in the bottoms of emptied kegs mixed together and dyed black. Anyone who can drink a pint of it without vomiting doesn’t have to pay.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "KLcVLAdcwZeYUrjo","flags": {},"type": 0,"text": "Firebreath Ale – If someone drinks it and then breathes into a flame, a 3rd level Fireball is cast centered on the flame.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "X5sA6ZBi3AYRYWDf","flags": {},"type": 0,"text": "Belching rum – After trunking this make a con save. On a failed save the effect takes place immediately. On a success you choose when to have the effect take place (After ten minutes the effect takes place no matter what.) Effect: You belch thunderously. Everyone in a 100 foot radius is defened for one round.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "Mk3L0bxy2r8w5zk2","flags": {},"type": 0,"text": "The Titans brew – A regular tasting ale served in an enormous cup, and after drinking it the receiver grows a few inches.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "NqMPoAnSFqaUImTg","flags": {},"type": 0,"text": "Paladin’s Bane – sweet enough to tempt the righteous and you hardly taste the alcohol, but it’ll give you a decent hangover and diabetes to boot.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "AqfepJQzWw0jjiEF","flags": {},"type": 0,"text": "Goodberry Gin – if you drink enough of it, it works as a mild healing potion which may or may not compensate for the damage done to your liver or you falling down the stairs while drunk. 1d6 hp healing, 1d4 drunk damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "0JaSgh3W8p3VhCyj","flags": {},"type": 0,"text": "Hagraven Brandy – though it has a taste as ugly as its namegiver, the appearance of everyone around you will exponentially improve with every sip you take. -3 on Charisma saving throws for 1d6 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "0lbfT1t5cAwEBl3I","flags": {},"type": 0,"text": "Will-o-the-Whiskey – whisky with minor hallucinatory effects, starts with a tiny tingling light in the corner of your eyes, ends with a shining orb of light dancing a few yards away from you, moving away as you try to catch it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "P4RiWlTyRCRYeHp3","flags": {},"type": 0,"text": "Mandrake Mocha – a hot creamy beverage with a narcotic effect. Dulls the pain, leads you into a deep slumber.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "r54QQFA75XrjcKdD","flags": {},"type": 0,"text": "Madman’s Mead – downing a mug causes a fleeting bout of insanity, roll a d100 for effects of Short-Term Madness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "LxLPMcm0fzKiB2io","flags": {},"type": 0,"text": "Ochre Stout – a cheap drink so thick you can taste chunks in it. Best to swallow and not be curious.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "vWInGXFRfLKa17aX","flags": {},"type": 0,"text": "The Drunken Dwarf – a pint of dwarven stout with a teabag in it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "P36kL4aszYzlfAd9","flags": {},"type": 0,"text": "For (local deity)’s Sake – a local sake or rice wine, popular with priests.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "aegLBnRimaO3M55c","flags": {},"type": 0,"text": "Ciderella – a sweet apple cider, considered “a girls drink”. Even the toughest bloke will begin giggling like a little girl after a few drinks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "HJuoVqnBmc9iEcHN","flags": {},"type": 0,"text": "Jalapálinka – a fruit brandy spiced with hot peppers. Burns the throat, downing a pitcher leads to steam escaping ears and nostrils.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "gJ109kiUSMaGU1mh","flags": {},"type": 0,"text": "Ginger Ale – Wait, this doesn’t taste like ginger at all… An ale that turns your hair ginger, effect lasts for 1d6 days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "h1TlJKhF1pX3qvSa","flags": {},"type": 0,"text": "The Maiden’s Ass – a quadrupel beer, served in a bottle with a donkey and a pretty girl on the label. Sweet but strong.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "5PAOvMFT99tF3Gf9","flags": {},"type": 0,"text": "Bock Bear – a bock beer that gives you +1 Str and extra body hair for 1d6 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "yU4VvsKSGKmLR62y","flags": {},"type": 0,"text": "Polypilsener – turns you into a canary for 1d4 minutes. Drinking half a mug will turn you halfway into a canary.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "EK95olQo7gpOmcio","flags": {},"type": 0,"text": "Our Thoughts and Prayers – a brandy that works as a reverse Detect Thoughts spell; surrounding people learn your surface thoughts, although you’re unaware of it. Range increases with 2ft each glass, though your thoughts don’t exactly get more coherent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "MT3rpGUjuIMTXSU4","flags": {},"type": 0,"text": "Smirgnome – a vodka that fills your brain with the weirdest ideas, although the morning after you’ll likely have no memory of inventing a sunlight-storing clockwork pigeon to hunt vampires with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "BrlKGneCX0RhtPxd","flags": {},"type": 0,"text": "Abbathor’s Gold – a clear golden mead that does nothing to quench your thirst – instead, you crave more of it. Roll a Charisma saving throw (DC 10) after each glass; if you fail, you keep drinking. After 8 glasses you pass out for 1d10 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "eMsjNiBBKX4NfIHp","flags": {},"type": 0,"text": "Coala – a Dwarven invention, this black bubbly drink tastes like grinded coal with sugar, but also makes you feel reinvigorated and less tired.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "QKfj1iAX4pFDzSQt","flags": {},"type": 0,"text": "Cinder – a spiced cider served hot. You can control non-magical flame that fits within a 1ft cube for 1d10 minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "gVWGB5EkGNOogwb4","flags": {},"type": 0,"text": "The Umber Hulk – a pint of whisky, brandy and tequila in equal measures. Good luck.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "hfRcTPPM3R0W0A8l","flags": {},"type": 0,"text": "Bottomless pint – the bartender pours beer into a ceramic mug. When the patron pulls the glass up to their mouths, they realize that the mug really doesn’t have a bottom. The mug is empty, and the beer has been pour through the mug into a hole in the bar with a pitcher underneath.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "rEyodZdyLWjRycsJ","flags": {},"type": 0,"text": "Copperhead – the bartender pours a beer, mixes in a shot of whiskey, and then a couple drop of snake venom from a vial. Normally drinkers will feel numb in their extremities. If a drinker fails their saving throw, they will be paralyzed from the neck down for 1D20 minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "hb3ksPptiOfhgjqY","flags": {},"type": 0,"text": "Brazenbrew – Served in a special mug laced with bronze, the drinker is more apt to make outrageous claims of ability, but also gains the relevant luck to succeed while still under the influence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "ResLXtHLnHcRrNyB","flags": {},"type": 0,"text": "Yam’s Choice – A delightful mead, high class, has a fair chance of being extremely addictive. Withdrawal is applying two effects from the long-term madness chart, and one from the short-term chart.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "DU7UI68CV108ERx7","flags": {},"type": 0,"text": "Witchwood Absinthe – A potent spirit the color of a moss-covered tombstone. It has mild hallucinogenic properties, and local folklore holds you can hear the voices of those you’ve lost if you drink enough. Not too much, though. You might join them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "KEaSwC0n3VFyyKOB","flags": {},"type": 0,"text": "Salty Dog Ale – A dark, rich brew that reminds you of the sea. Plopping in the shell of a sea snail for good luck is customary, and adds a fitting salinity to the drink.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "gtchgmmx7H8rlZSO","flags": {},"type": 0,"text": "Hymvaren’s Luck – A bright, golden-colored beer named after a local drunk who woke up on the beach after a night of carousing with a chest full of pirate’s treasure. He claims to have no memory of that night.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "01fcQspVa4ghHrfX","flags": {},"type": 0,"text": "Bourbon of Dwarfkind – makes the user start to grow a beard. If they can normally, you see accelerated growth. If they can’t, a few hairs will sprout on their chin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "ReRmeDOKXfl6kmZc","flags": {},"type": 0,"text": "Old Mill Rye – tastes alright, has a strange aftertaste in the back of your throat of an old sock. It’s cheap and gets you drink","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "tsX4cX6DiRkAssDA","flags": {},"type": 0,"text": "[Insert local diety’s name] brew – Has characteristics that reminds you of said god. Gold for sun worship for example. Hint of cinnamon for a hot and fiery one. A hint of licorice root perhaps","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "AOgJjvu4BPqa5KpB","flags": {},"type": 0,"text": "Ochre Jelly Ale – Ale with safe-to-drink ochre jelly mixed in it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "ZRUR7lWJji9UCtvv","flags": {},"type": 0,"text": "A regular glass of water – That’s it. It’s just a normal glass with regular, boring water inside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "DDYxf3lVmyMlZkbr","flags": {},"type": 0,"text": "Mimic Drink – Usually sold by tricksters to play pranks on people. Looks like a regular glass of water, but a tiny water elemental/water weird is disguised as normal water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "AYwep5gbQeH9WprH","flags": {},"type": 0,"text": "Liquid Nitrogen – Drank by frost giants and other beings that can tolerate extreme cold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "R19LHXHTBg1g28u6","flags": {},"type": 0,"text": "Mead of invulnerability – Once drunk user makes a DC 15 Wisdom check. On a fail believes they are immune to all damage and if damage is dealt to them believe they did not take the damage. Effects for ten minutes. User still take all damage as normal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "ABK1nNO57kxKRg8c","flags": {},"type": 0,"text": "Inverted rum – when you drink it, every one around you in a 15 foot cube becomes drunk. This dose not include yourself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "li9XnzqJ7uv9fhmn","flags": {},"type": 0,"text": "Goblin Spit – whiskey and gin mixed with the barkeep’s home-made mints. It tastes surprisingly good despite its name. As is tavern tradition, a long-distance spitting competition occurs after every round.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "DfIhQl87aqtAC0Xk","flags": {},"type": 0,"text": "The Hook and Slider – a cooked goat (?) intestine tied and filled with a heavy beer. After finishing the beer chow on the intensive","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "MrKgsCGxRDVKUA6F","flags": {},"type": 0,"text": "Lucky Leprechaun – A sickly green drink that gives you advantage on Charisma checks for one hour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "ivpThUwhCoUUuBC8","flags": {},"type": 0,"text": "The Tiamat – 5 different shots, one for each color of the different heads. One is black and syrupy, one blue and gives tingly feeling, one is on fire, one is green and tastes a bit minty, the last is white and frosts the closest things. They are mixed together and separate in the cup making a very nice presentation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "OBbbNkk1POzXwMu9","flags": {},"type": 0,"text": "The Sweet Roll – flavors of cinnamon and sugar blend with the strong scent of rum. The drinker gains an additional 1d4 to any pickpocket attempts for the next hour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "qdsgsPPUU31rEJgb","flags": {},"type": 0,"text": "The Sailor’s Spirit – There once was a cap’ and a crew, Who made the most wonderful brew, From rations of lime, They would in their spare time, Make fine drinks no man could outdo.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "hTfhhstvMx7ffeo3","flags": {},"type": 0,"text": "Good Hearth’s Brew – A hot spiced rum which is popular during long winter nights for the immediate feeling of warmth and calm that follows.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "rpD4OD0GcDssTTtm","flags": {},"type": 0,"text": "Tarnation – A strong spiced cider served warm and traditionally drank as quickly as posible after a boisterous cheer or a lewd drinking song. Enchantmented with the effect of the consumer belching a small flame right after ingesting.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "KD28yCaCh8iSO2HO","flags": {},"type": 0,"text": "Gnome Rum – Makes your voice high, squeaky, and annoying.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "QSmEyVqZySapRAnT","flags": {},"type": 0,"text": "Ethereal Ale – The more intoxicated you get, the more you fade into the ethereal plane. First you become slightly transparent, than objects start to phase through you from tame to time and if you manage to keep drinking you entirely enter the ethereal plane.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "cV5Tge25BioR8bbd"}
