{"name": "Eldritch Horrors","description": "One hundred horrifying creatures and beings that lurk in the shadows.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "QLLaGSaCsRokD89W","flags": {},"type": 0,"text": "The Three Sisters – This strange being is formed from the souls of deceased princesses. The being has three heads, depicting joy, sadness, and rage. It’s body resembles a giant octopus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "wnYV3yckiFGTfZaq","flags": {},"type": 0,"text": "Yazothle – A formless blob that consumes everything in it’s path. It gains the knowledge of anything it eats. The souls of the eaten are sometimes seen trying to escape the creature’s ooze-like body, but to no avail. They are trapped for all eternity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "n1bMPyU14LB453L4","flags": {},"type": 0,"text": "Shuggdus – The monstrous-looking, water-based race. They have powerful hearing, especially underwater. The Shuggdus move along on tentacles instead of legs. They are completely blind and rely on touch and sound to get around.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "2IvDRg5Cjt29fsZF","flags": {},"type": 0,"text": "Lovely Fall – This being only appears in the underdark. when it approaches humanoids it does so in the form of a cavern or a well. When humanoids enter the cavern the entrance closes. The cavern is in complete darkness. No light portrudes the darkness. It then leaves behind little gems that radiate light. If all gems are picked up in the cave they form one being. So bright that looking at it blinds you forever. If you don’t look at it it slowly creeps closer to you. Until the bright light burns you alive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "VY8TmQVtI45qWBQr","flags": {},"type": 0,"text": "Jakęshuž – A bear like creature with the head of a large salmon, though it doesn’t seem scary or something dangerous. Dont be fooled this beast was born from the closing of a black hole, it thrives on the hate and anger between lesser beings and will interfere with mortal lives to cause these things. If peace is found, Jakęshuž will be the one to break bonds and force negative emotions. Living with in the deepest parts of the outer realms it waits feeding until it is strong enough to rival Cthulhu.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "ubR8jjuA95NxIm2r","flags": {},"type": 0,"text": "Vothunae – A being totally foreign to all known plains of existence. Exists in all areas that no other living being can see it, occasionally a poor soul will catch a glimpse of it in the shadows. It’s monstrous, scaly goat head drives most people to a catatonic state with the briefest look.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "EJEIOMDs8i2D4akp","flags": {},"type": 0,"text": "Concealed Councel – Your mate is acting mighty strange– no longer favors the pub. When you’ve brought him some drink he politely refused. Not letting up you callback to old times, and he, just a sip in, collapses. A slithering pulp oozes from his ear, tailed by a blue-haired sack. It ropes its knotted, grainy skin around your leg, and you quite blitzed yourself, no longer desire the dog.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "bam3ZjTCM9FLGyXx","flags": {},"type": 0,"text": "Blind Besetter – Writhing rows of teeth set on a bulbous tongue dangle limp before you, like the pendulum of an annual clock. Sinewy black mucuous drips to the floor, slick with algaeic bloom. Nestled in the banister above, a hundred needle beaks watch you from a flesh of huddled skin, peering through the folds at their eager trap.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "Q0DMtiquChG7ebMu","flags": {},"type": 0,"text": "Whisper Regret – It is just larger than a mammoth, pitch black and sloughing flesh and decay. Where it touches the floor of its vined and wooden cage, lay sharp forcipules the size of knights, curved up into four legs with inverse knees, now chained in painful compression. These squirming hinges jut from an iridescent carapace whose spine is scaled beneath oozing tar and pus. Only it’s face -what a face! – finds a window in the cage. howling in agony, without eyes at all, this Earthblind hellspawn gapes with a thousand layered lips in every direction, folding and gasping, and curling and drooling, all budding to reveal its scream from a single, central, digestive intestine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "88lCMftb4Ej9vESV","flags": {},"type": 0,"text": "Gar-Khoza – Strangely enough, this gargantuan beast is quite passive, usually not paying the living much attention and only ‘feeding’ on corpses and dead plant matter. It resembles a giant amalgam of body parts from various creatures formed into a vaguely humanoid shape. Its state of decay, or lack there of, makes it seem much younger than it actually is. It’s an entity of rot, exhaling and surrounded by a necrotic mist. The occasional animal will make their home inside it, usually a swarm of insects or a vulture perched on its back. It shambles around aimlessly, leaving a trail of harmless, albeit alien, fungi and bugs in its wake. It’s known to defend itself violently if the need arises.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "4T489BjBrZBGNOp9","flags": {},"type": 0,"text": "The One Who is All – a formless, shapeless creature, who, when summoned, assumes the form of each being it sees. This is not sequential. The One Who is All adds the form of each new being to its grotesque visage, eventually becoming unrecognizable other than a mass of twisted limbs and other stolen features. Once it has absorbed enough identities, the being begins consuming the souls of those copied, and the victims become deathly ill and suffer immense pain until they die.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "NFYoYTIi6w9aVmcD","flags": {},"type": 0,"text": "Pülüupuli – It is the thorax and abdomen of a Huge grasshopper, dark red in color. The anterior end of the thorax has been cut off, leaving a blank maw oozing violet ichor. It cannot speak nor reason. It will seize the smallest of the party, and once a successful grapple check is made, will launch itself into the air and fly away. After two turns in flight, it will open a gate to the Astral Plane and disappear. In the Astral Plane, it will place the seized character in suspended animation and use the resulting cocoon as another brick in its enormous lair.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "iLVhIg5dFOrOkHfM","flags": {},"type": 0,"text": "The Ancestor – On a mountain overlooking the sea lives the now decrepit and abandoned mansion of a family lineage that has fallen into ruin. Tales tell of the last member of the family, who became obsessed with forbidden knowledge and legends of the land the house was built upon. Far beneath house lies the result of this blasphemous research, the ancestor, in exchange for immortality, fused his own body with the ancient and towering heart of a massive and unknown eldritch horror discovered beneath the earth. In this form, he works tirelessly to make the comatose horror rise again and unleash an unstoppable reign of horror upon the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "1S6lf2nkGw8pVyKb","flags": {},"type": 0,"text": "Shadow Stalker – your character comes back from the dead. For the rest of his/her play, they see a person in a black robe. No one else sees him, but he’s there. Watching them in the crowd. Following them. They wake up and see him at the end of their bed. They go to sleep and hear him whisper their name just before they fall asleep. After battle, they hear him clapping. Every year, the man says ‘not this time’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "Otj9Z4miVBd0534Q","flags": {},"type": 0,"text": "Lover of Nothing – A girl was kidnapped by a creature that may or may not have raped her. She is quiet after this event, afraid to touch anyone or look them in the eyes. She’s much more nervous now. It turns out she wasn’t raped. She fell in love and willing gave herself to The Nothingness. It showed her what everyone really looks like under the skin: preemptive worm food. She can’t un-see how disgusting the world looks now. She can’t look someone in their eyes without seeing maggots crawl out. She yearns to be with her love again, if only to feel the warm embrace of the meaningless in it all is again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "qIAGepvziLnKze22","flags": {},"type": 0,"text": "Caged One – A tall, lanky humanoid covered in feathers with a beak. Covering the head is a locked bird cage, and the eyes, presumably on the sides of the head, are covered with metal patches. When it speaks, it brings crows to the location in an agitated state, attacking those who are not the Caged One. The crows bring flesh back to the Caged One so it may eat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "CV76qZrqfKnJkQ52","flags": {},"type": 0,"text": "Combusting Mimic – Like mimics seen in the past in terms of what it hides with and in. However, these mimics are coated in a secretion that, when the mimic is fully excited, causes the secretion to detonate. These mimics will try to latch onto its target before it explodes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "k0Y6FZOly88xMHAp","flags": {},"type": 0,"text": "Living Blood – Mass amounts of blood fused into an entity by otherworldly science. It seeks blood to expand its size, though not intelligently; it seems to be an animalistic instinct. Scientifically speaking, it has the same physical characteristics of blood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "jiqfh5W1gpY6Vyr8","flags": {},"type": 0,"text": "Vuntekúparavan – From behind, it looks like an adorable moppet: a six-year-old girl with a pretty dress and bows in her hair. Her face is entirely flat and blank, but for a circular portal about six inches in diameter, leading to another plane; this changes every minute or so in such a way as to be readily visible. She carries a box about six inches on a side: the material of the box is always valuable but shifts at random intervals, not synched with the mouth portal. If directly addressed, she will lift the lid of the box to reveal a marionette of a ballerina: this will stand up on its own, with the strings trailing all the way up to the heavens, and speak for her. She/it only speaks in riddles; none of the riddles has a correct answer. If attacked, she turns the mouth portal to face the most powerful attacker: a beam comes out and strikes that character for 40d6 damage of a random type. The character must also make a DC 20 CHA save or be imprisoned as per the spell. The Vuntekúparavan will vanish immediately after imprisoning a victim.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "Lg914tDyDH7kUTFO","flags": {},"type": 0,"text": "Shriek of the Caverns – This obnoxious creature hides in crags and small caves. Its shriek can be heard from miles away, and those who linger too long near it will begin to feel their bones crumble from the pressure created by it. Up close, it resembles an extremely round and fat beetle, however, where its face would be is an impossibly large maw.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "0TXPbTDSOeZcCzdQ","flags": {},"type": 0,"text": "Chitintu – Approaching with the tides on large beaches is a massive creature, appearing to simply be claw upon claw upon claw, clinging to a hard and slim shell. Seaweed-like tentacles trail twenty feet behind the mass. When hungry, the shell will split vertically to reveal teeth all along its interior.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "btEiZlRbjSeGD2Ut","flags": {},"type": 0,"text": "Moss of the Insane – A mass of yellowish moss is under your feet for many feet. It seems like the ground itself whispers through the yellow moss. Often, while walking across it, your foot will become unnaturally stuck. Upon closer inspection, each tendril of moss appears to resemble a tiny hand with long, decrepit fingernails, and where the palm should be, a tiny, drooling mouth. When bare skin is bitten by this monstrosity, the victim will be unable to think clearly or speak beyond tongues.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "WErQ6p9GIfc90f6o","flags": {},"type": 0,"text": "Sköllmunger – A seemingly drunk, frail old man stumbles out of hiding to puke ichor black tar which immediately attacks the party. The continuous pillar of black bile envelopes the man and spiked tentacles and spears pierce and grapple the party. Weakness to sunlight, loves graveyards.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "zAaSivUZx1KbnaOA","flags": {},"type": 0,"text": "Oculus of the Fire Court – A 5 meter tall D’jinn aspect of fire with three faces. Hooded and jewel encrusted it teems with ancient knowledge but at a price. Can transport the party to an arena in the Fire Elemental plane for trial by combat. Weakness to water and Fire Genasi have advantage on persuasion checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "B4yeJEcgyD1LOj5W","flags": {},"type": 0,"text": "The Scourge of the Air Naiads – Three zombified rocs that spit up zombies, cause hurricanes, and have advantage against dragons and dragonborn. The ancient avian corpses can never be truly destroyed due to the mysterious revenge magics of the long extinct air naiads. Violent and capricious as their old masters these birds violently attack anything with scales until ‘all the dragons join us in the void’. Weakness to non dragon sources fire, if both a Water and Air Genasi are in the same party they have advantage on persuasion checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "If0dwTQPnRnagbgX","flags": {},"type": 0,"text": "Xorus – The mother of all krakens.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "xEfDtYTC9euccwjk","flags": {},"type": 0,"text": "Aspect of Fenris – The shadow of a giant dire wolf of the Apocalypse. The howl blots out the sun and shakes the earth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "I7D2sDhxisVyYzoF","flags": {},"type": 0,"text": "Shadow of Queen Mab – The fey usually lock away their shadows in their own dark corner of their realm. Over time they develope their own personality and intelligence. Gods help any plane of existence she pokes her head into.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "I5ZS6tPsttm5BJtU","flags": {},"type": 0,"text": "The Inside Inn – Creatures lured to this inn feel compelled to stay the night, only to find the doors are locked and the Windows lead to frothy mist outside. Through the halls wander the deformed, monstrous husks of previous guests, and a single touch infects you with an illness that drives you violently insane, twisting your mind as well as your body. Only by hiding in your assigned room can you escape the other guests, as long as you can withstand the unending torment of their attempts to break inside. The inn tricks you, too — it will fill your head with visions of escape, only for you to one day wake back up inside its bed, your life since your escape revealed to be merely an elaborate dream.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "IGSuLG3pwICo96Fy","flags": {},"type": 0,"text": "The Clone Worm – A cosmically large worm hundreds of millions of kilometres across, consisting of the warped and deformed bodies of countless assimilated civilisations. The worm senses and is attracted to the formation of empty husk bodies, like those formed by the Clone spell, and when it draws close enough to be seen twisting and turning in the sky, any creatures created through cloning or through creating genetic copies come out wrong, deformed, warped, often beyond recognition at all, sometimes huge and bloated and other times spindly and wicked. Interestingly, this also affects creatures who have used teleportation magic, as well as any who have been reincarnated or resurrected.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "9oxILIDVv78B94U8","flags": {},"type": 0,"text": "Sheyeoxks – This extra dimensional being, the size of a solar system, creates wormholes to tunnel through the universe one dimension at a time. Its true form, being of hundreds of dimensions, is impossible to conceive. It’s so big it has its own gravitational pull.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "AZ9q7mPENdzGItOS","flags": {},"type": 0,"text": "Deep Ones – A virgin sacrifice must be made once per fortnight: drowned above the deepest and darkest parts of the ocean. These tentacled watchers will pull the coastline into the sea if left unappeased.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "wg8HIzSLzXGXrNgy","flags": {},"type": 0,"text": "R’hhk – A stone block is convulsing unnaturally. Looking upon the stone block has a chance of giving cackle fever and looking at it afterwards can cause a cackle fever fit. Players can avert their eyes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "73yJSJPNzVwqHtND","flags": {},"type": 0,"text": "Yab-Mthol, The Eternal Price – This small creature appears as an anatomically impossible amalgam of bat, seagull and scarab- with every flap of its six wings, steel carapace grates against bone and tendons rip to pieces, only to regenerate again. Yab-Mthol howls with two throats as it flies, and never tires- it has no way of resting on the ground. The creature follows around one specific creature, sometimes for a day, sometimes for centuries- it never harms them or antagonizes them, but most of it’s ‘prey’ are eventually driven mad by the creatures constant pursuit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "OylNOwpzt5mb73AO","flags": {},"type": 0,"text": "The Dustman – A man in a simple white tunic is occasionally seen walking along a road, by one person, occasionally two. He is shrouded in a light cover of kicked-up dust and smoke from the road, though his form is visible. Nobody else sees or remembers the Man. Those who see him cannot describe his face, or race, or any discerning features, despite the man sticking clearly in their memory- there was something off about him. Something Wrong. That night, those witnesses are found dead, their bodily cavities filled with choking, harsh dust.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "wBkGJsZy8PwMXegD","flags": {},"type": 0,"text": "The Vrenbliock – A gargantuan monster consisting of nothing but murderous eyes, hundreds of long spiny arms, and a large mouth. It disguises its grotesque body as a cloud. It uses its hiding place in the sky and its long arms to reach down and pick up unsuspecting prey. The only problem with its disguise is that it’s closer to the ground than most clouds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "Cb7UHpVnOIsJa0Hg","flags": {},"type": 0,"text": "Dark Horror – It is seen in the form of a strange gas approaching the person, or a dark shadow behind someone. Sometimes it has a corporeal form, but no one can hit it, instead it just passes through. It only lives in the dark, although light does not kill it. It attacks by stalking a person and entering them, taking control of them. When they take control of someone, their objective is to kill the most people around it and then kill himself. When in shadow/gas/corporeal form, it has a low health pool, and when you attack it in any form radiant damage will be effective, while necrotic will be ineffective. When in shadow form, radiant is the only one to hit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "2X5afHUhF4hKzdre","flags": {},"type": 0,"text": "Pale Strider – From the foggy mist extends a long, gigantic and lithe limb attached to a large clawed foot. The flesh is human like, but is a sickly white and translucent showing the network of veins below. The creature’s body is obscured by an ever present ethereal fog that is chilling. It moves silently for its size and is rarely hostile unless provoked. It’s fog does necrotic damage and wherever it travels, a plague seems to follow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "wfXX2hRG7H8UMqVt","flags": {},"type": 0,"text": "The Dread God – This being is the diety of the Seventh Circle of Hell, where even demons and devils dare not tread, where all is so far removed from what is known as life that even the merest touch of the least of its denizens will siphon off the vitality of mortals, fiends, and celestials alike in moments. The Dread God is the most powerful of this realm. It is not evil, as we understand it. Good and evil are not concepts that have meaning to it. It does not seek wanton destruction, or chaos, or peace, or war, or domination. It merely hungers for energy. The fact that taking this energy from Upper Circle beings also kills them is not a notion that even registers for it and those it rules, for they do not understand that Upper Circle beings are even alive. They are vessals of energy to them, no different to them than drinking water from a paper cup then throwing it away is to mortals. Mortals do not mourn for the paper cup, the Dread mourn not for those they consume. Those that discover this being, and worship and bind themselves to it, will eventually discover means to siphon life and send it to the Dread. These worshippers are, of course, considered evil by their peers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "svVcxVs3CoKX9bXY","flags": {},"type": 0,"text": "Warm Embrace – This being which reproduces in manners unknown is made out of a single material. It looks a lot like boiling blood. These creatures can range in size from a single drop to bigger than galaxies. They don’t seem to know where they are as they move throughout the universe with no for regards for gravity or matter. If it comes across an obstacle it will try to go straight through it. Soaking the object and boiling it. This object can be a rock or a city, the creature will soak it either way. The carnage left behind is burned organisms and destroyed buildings. Nobody knows why or how they move and to where.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "ulIIahBKR43lxNf5","flags": {},"type": 0,"text": "Hell’s Guardian – An angel that appears to those who are destined to fall in battle. The Angel matches the height of whomever she is visiting, and her wings are always closed behind her back where on the tips of the wings are covered in dark violet shade of blood. The blood originates from the quill of each feather along the tops of her wings, often the blood drips down her wings in very solid stream still warm from her veins. No mortal has seen her face which is covered by a mask crafted by Bhaal, God of Murder. As legend has it the mask was former Guardian’s skull know damaged beyond all recognition due to the flames that were used to forge it. The Guardians hair is bleached red for obvious reasons, and her dress once virgin white has turned black as the night.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "R5uTCvyrxAc3wMNA","flags": {},"type": 0,"text": "Bone Bastard – The ancient legends tell of a towering horror that has a root in all of mankind. This creation of the underworld is the primal root of death for all living things. The Bastard is known to carry incurable diseases that have wiped out whole civilizations. The Bone Bastard is a seventy foot tall giant that wears old torn webbing, dust, and the feeble smell of death with not a single piece of flesh beneath it. Those who have seen the giant know of its legion of skeletons that crawl all over its body praying for the opportunity for The Bone Bastard to stop long enough to murder any humanoid who crosses there path. The Bone Bastard himself has no set destination which causes it to wonder from place to place searching for its own destruction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "Diq5VvTjwLtY59Gn","flags": {},"type": 0,"text": "Immortal Suffering – Rumored to be from the Plane of Shadows this apparition has caused the most painful deaths conceivable to the human mind. This ghost is known to appear those of the pure hearted, for it prays on the aspiration of those trying to achieve a new level of spiritual awakening. The Ghost is a pair of light blue eyes that stair out from its black mist like form, and devours its prey by forcing a part of its mist down the victims throat causing them to chock to death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "KFGvUpCrP2Y1A1eN","flags": {},"type": 0,"text": "Seklitlosri, The Black Tear – A massive winged toad with tentacles on her head to bring prey into her razor teeth maw. She has followers who collect her tears in urns. Any living creature that drinks from water polluted with the substance mutates into a toadish creature like them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "FjbyLGxUyVhsIRS6","flags": {},"type": 0,"text": "Borovoi – a towering creature of long thin limbs, it hides among the trees, taking the appearance of the forest it inhabits. Preferring the flesh of the apex predator, the Borovoi attracts woodland creatures to serve as bait. The bait is kept docile and unaware, luring the hunter close enough to become the prey.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "EUeCkfDGNbak5rJa","flags": {},"type": 0,"text": "The Chittering Library – A vast collection of knowledge composed of mangled rats that exists between our reality and a higher one.Every century it sends out an emissary to lure children and rats into it’s recesses so that they may be twisted together, allowing the Library to expand itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "cL7hI7lZeCuS7LW7","flags": {},"type": 0,"text": "Thump – This being exists purely in the heartbeat of life itself. It is the undercurrent of all fear, the energy that spurs our deepest horrors on. It has no goals, no meaning, and no manifestation outside of the hideously loud beating of blood in the terrified masses’ ears.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "HKO0dSZAhJiAldOy","flags": {},"type": 0,"text": "The Flesh – This being is a huge mound of mismatched and misshapen limbs and organs, both human and bestial. Its malformed body is trapped beneath the earth, yet it does not seem to make any effort to break free. However, when a living being is within grasp, it flies into a frenzy and attempts to devour it. Every so often, gaping tears crusted with blood and pus open in the flesh and birth a new body. In most if not all cases this gives life to some fresh abomination that’s not quite human nor animal and oftentimes the Flesh will feast on it before the creature can escape. However, some travelers that have stumbled upon the Flesh’s cavern prison swear they have seen animals and even humans tear their way free from its unnatural womb, and the implications and grotesqueness of these events have driven the witnesses mad.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "d1yv9jqQDw7CcJT8","flags": {},"type": 0,"text": "Qho, the father of Monsters – In the guise of a constantly fleeing mortal dressed in rags, this monstrosity from beyond the veils does not even know what it is. Most of its mind slumbers, dreaming that it is a mortal and haunted by paranoia. Whenever the mortal part of this creature comes into skin-to-skin contact with anything it creates a degenerate, brutish clone with mutated body of that creature. Should Qho be slain in this form, there is a chance that the true creature might wake from its nightmare filled slumber.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "88TWQ0glangOLHCP","flags": {},"type": 0,"text": "The Unseen Queen – A placid and and comely woman who seems to have a supernatural predilection to not be noticed. She radiates a sense of reverence, obedience, and manic joy. Wherever she walks a throng of easily persuadable people follow. These groups tend toward violent destruction and profane sacrifices once the crowd grows large enough.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "C8g9evSWngAFQykB","flags": {},"type": 0,"text": "Crealeth – A hulking monstrosity that waits in the darkest depths. A fleshy transport for the vile creations of the aboleth, the Crealeth is a large whale like creature covered with pustule abrasions that constantly leak a black tar. The creature is host to an exposed maw of needle like teeth as large as the fiercest warrior and a row of blind eyes wrapping around its large dome-like head. The Crealeth is a means to an end, an unstopped leviathan carrying in its stomach the oozing and decaying armies of the aboleth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "2H360q23cMGCH0Dl","flags": {},"type": 0,"text": "Shul’thaa or The Wither – Deserts are born when the withering heat slays the very earth, beating the foundations of life deeper and deeper into its sweltering heart. There are people who say it is not the sun, nor the wrath of gods who bring this terrible blight to the world. Instead, it is death himself. The Sultans build their temples in remote deserts to appease him and stop his wandering for a time. The abandoned villages whose fountains ran dry are said to be his home in places where stone fails to hold him. But still, when the halls he haunts turn to dust with age, he wanders, and where he wanders life will begin to dry and swelter and eventually wither to dust and desert. Certain men are said to find his dwellings in their dreams, or sometimes in their wanderings deep into the dunes and ruins. These men return or wake as lepers, cursed by death himself to remind man of what will eventually come. But to see him will turn you to dust, age you beyond aging is possible. He is the eventual ruin of all things.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "tNzwwqcNupTOppF0","flags": {},"type": 0,"text": "Urumaggoath, the Mother Bull – A bulbous red mass of bare muscle and erectile tissue, this abomination seems to be in a constant state of giving birth to itself. Tufts of black hair protrude here and there only to vanish and then reappear again. It has no limbs; rather, its underbelly is full of human-like molar teeth with which it drags itself on the ground. What it touches, it crushes and grinds to atoms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "DWbx35f0NYwhyq4z","flags": {},"type": 0,"text": "Tagrabui, the Rotten Man of the Marsh – A gargantuan half-decomposed bear with sloth-like front legs, blind eyes and moss growing on its back. Drool drips from its ever open maw: it ultimately hungers for the Sun, which it’s destined to devour when the time is right. Being in its presence causes the sensation of drowning and objects around it act as if they were underwater. Certain swampland tribes, who do not know any better, worship it as a god of death and rebirth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "DDegPJGjpAN0qRBC","flags": {},"type": 0,"text": "The Tongue – A small tenticle roughly the size and shape of a tongue. Its slithers and tries to fight its way into its victim’s mouth, where it absorbs the original tongue. Whoever the Tongue possess now is controlled by the void, and it speaks through them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "Yv8hI3xEaEZZeEr1","flags": {},"type": 0,"text": "Little Red Hood – A creature that is never seen except from afar, in the woods, and from behind. It resembles a little girl in a red cloak, and is always singing softly in a childlike voice. Anyone trying to catch up will see it slip into to the trees, with a mischevious giggle. Wolf Bones are left as offerings to her on the trail; anyone who disturbs them will never find their way back out of the forest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "hZNbGgJm6BXwGzyu","flags": {},"type": 0,"text": "The Leaf Pile – At first, this creature appears as a simple Autumn leaf pile. However, this is just a clever cover up. The creature can sneak around when no one’s looking, and can come upon its victims from behind, engulfing them. It is through this engulfing process that they can petrify victims","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "sWtPl2cdMxpzoRl7","flags": {},"type": 0,"text": "The Summer Cattle – quadrupedal entities resembling emaciated camels or antelope caked in dried earth. In the vicinity of a herd, the sun is bright, the air is still, and the skies are forever clear. The day’s heat seeps into shade and shelter, and lingers long into the night. Where they graze, plants wither. Where they drink, springs go dry.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "UnmHAKE2AoGrHhLW","flags": {},"type": 0,"text": "Time’s Breath – Willowy deer-like creatures of impossible grace and striking beauty; the sight of which quickens the breath and the heart. Time ripples in their wake.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "GiW8CnXwizB5ahRx","flags": {},"type": 0,"text": "Cuterebra Cerebrum – When Cooper said their kid had something stuck up their nose that was wriggling, I expected it to just be a run of the mill botfly maggot that had nested up there. But when I started pulling and that thing kept coming out, inch after inch, foot after foot, I started to worry. And as the kid screamed louder and louder, I started to panic. And when the sight and the stench of that dreaded maggot had become too much to bare, I started to feel dizzy. And when I woke up again and the kid was dead, the maggot was gone, and I felt something burrowing through my skull… I didn’t really feel anything ever again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "k2uuzBHpvA6GPdXK","flags": {},"type": 0,"text": "Aakenraah – A massive, slimey orangish-pinkish worm-like creature that secretes an acidic substance, leaving it in trails wherever it moves. Aakenraah’s only desire is to drink the blood of living creatures. The creature has a manipulative mind, able to convince many weaker minded beings to bring it more food.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "WpWPYs5Siu5ijRZV","flags": {},"type": 0,"text": "A crawling orb with a gaping maw that leaves a slimy rut wherever it drags itself. It vomits a stream of teeth, blood, and gums, which assemble into undead-like mockeries of life.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "9bMoYoiOdMPenoeK","flags": {},"type": 0,"text": "This pulsating smearlike-mass looks like a cross between brain matter and colorectal polyps. It travels in teleporting blinking waves across the land. It is not much of a danger but has a nauseating appearance. It is speculated to be the interior of a twisted extradimensional creature intersecting the plane, perhaps explaining why attacking it causes aggressive aberrations to appear like an immune response.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "uD5ZIf54BN4LvCqN","flags": {},"type": 0,"text": "A head-sized, cucumber-green cross between a sea anemone, a clam, and a tunicate. It has fivefold symmetry, a flower-like razor-sharp shell, siphons to help it move and defend itself, rows of tiny glass-like eyes, and grasping filter-feeding tentacles that eat … nothing as far as you can tell. It doesn’t seem intelligent but has an alarming tendency to appear in large groups when no one is looking, sometimes in populated areas. Some contain clathrate orbs with yellow roe-like nuclei inside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "B4vHZjvpAoQAef5h","flags": {},"type": 0,"text": "Its true form is like a crab dashed upon rocks and the shattered pieces were then reassembled by a mad child without reference to the original being, complete with biological tubing holding it together. It disguises itself as an ordinary wall. It only advances when you are not looking at it. It favors mazes and tunnels with twisted passages leading to dead ends. It uses all manner of trickery to pin people in dead ends where it delights in waiting for sleep to overtake its victims.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "y28luTi8y4GqfHch","flags": {},"type": 0,"text": "Its four legs are burrowing paws with wicked talons. Its underside is down feathers, its back is quills as long as pikes. Colored like a hawk, its headless neck ends in a great sharp black beak that gleams ferociously. Prey is not devoured but is instead pierced and left to rot upon the quills that adorn it. It reserves its neck quills for its favored prey.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "vghN3W6utrryTR5z","flags": {},"type": 0,"text": "The Unspoken Mechanism – larger than an elephant, the mechanism resembles nothing so much as the fever dream of a mad watchmaker. it’s countless gears made of any and every material imaginable. it lurches forward inexorably on seven mismatched legs, the low rumble of it’s movement punctuated by incessant, irregular ticking noises. it views the world through more than a hundred eyes, not its own. glass spheres filled with an oily, slightly cloudy liquid each contain a dozen or more eyeballs from various species and beings. these spheres are affixed to the ends of short sections of girder, shaded by large metal plates which arch over the back of the mechanism. the mechanism feeds indiscriminately, replenishing and strengthening itself with every meal. it catches living prey with a set of metallic tentacles which lash out in front of it. these segmented arms draw living beings into the mechanism, where they are slowly ground apart by its gears, the metals and minerals their bodies contain are absorbed, and what cannot be used is pulped and drained away. from the underside of the mechanism drips a slow stream of this fluid, which corrupts the land it passes over and causes strange, twisted plants and fungi to develop.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "7vavzQ0KKcB2a13K","flags": {},"type": 0,"text": "Molungth the Aspect of Brutality – Molungth is a giant, made from countless sewn or bolted together human corpses. The bolts cover him in spikes. He wields a chainsaw which’s teeth are actually human torsos with longer than natural arms and long clawlike hands as-well-as ghoulish heads with fangs. The chainsaw rotates, making the halved zombies slap, smash, bite and tackle into whatever he swings it at. The wheels over which the many chains that produce the weapon roll resemble old cart wheels. As every undead creature in the giant’s body is always screaming and laughing, he can be heard from miles away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "hWaKQonYsGPF5bo5","flags": {},"type": 0,"text": "The Swimmers – Strange, swanlike humanoids who travel through air, stone, or metal like all reality is just a reflection in a pond, distorted by ripples and the Great Stones which inexorably alter our courses…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "aixoP7RO2Z29j9FP","flags": {},"type": 0,"text": "Lfjeghoull – An amalgamation of twisted lines, like a child’s scribble given flesh and form. In the center of the swirling, writhing lines are hints of a face…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "yz05GfwU1XzvguSo","flags": {},"type": 0,"text": "Stylhurst Lake – At the bottom of Stylhurst beats the rotten heart of a nameless old one. Locals report seeing mysterious floating lights over the lake, but recently, their attention has been on their own backyards. Pets of all kinds have been witnessed marching out the lake every night, while the native wildlife behave as if nothing is amiss.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "7DCNfHkJFHrFcbi6","flags": {},"type": 0,"text": "Dalgd’r’s Aria – In an unsuspecting cave in Virginia, sealed behind an elder sign, sleeps The First of the Born, Dalgd’r. She is a massive, salamander-like monstrosity who has spent the past millennia readying her nursery for new spawn. Her avatar, a scruffy looking Scottish Terrier, lures unsuspecting locals into the cave where they join her as an embryo before being reborn into her cosmic hive mind of abominations. Throughout history, for unknown reasons, a distinct melody seems to crop up in the area around her chambers. The song has been known to cause uncontrollable fits of laughter and dancing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "Zytp9j1KbMlAv6WX","flags": {},"type": 0,"text": "Husks – Near dead mortals with a desiccated appearance. These creatures bore witness to the horrible truths of the universe, and can often be found near eldritch treasures or knowledge. Their skin seems stretched tightly over their body, their eyes a milky white, and their ears torn and bloody. They congregate together and violently attack any who would trespass upon the secrets they discovered.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "1I52nkvEl5knj77v","flags": {},"type": 0,"text": "Tyhuuth,The Judge – This being has a vaguely humaniod head and upper body attached to a large spider-like lower body with tentacles instead of legs. It emits a sound that is similar to a gavel smashing hard wood. Those in the presense of Tyhuuth are judged by the elder god. Those he deems worthy transformed into his Disciples, highly powerful Ithilid-spider hybrids. Those who are unworthly become pulsing blobs know as the Condemned, who search the world for those to bring to bring to Tyhuuth, in hopes of becoming worthy for more judgement. Tyhuuth however, does not care for anyone except his Disciples, who push his plans to return an reshape the world into his twisted vision, where is judgement is gospel.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "7JMihmVQGOvcAYe2","flags": {},"type": 0,"text": "Gorgloth the Sweet – A lump of dark disgusting flesh with what looks like red glowing corals on its back. It gives out a sweet fruit-like scent which affects the mind of nearby creatures, giving them the urge to eat Gorgoloth. When the disgusting feast is over, the creatures will themselves will slowly turn into two Gorgoloths. Gorgoloth is actually one creatures but expands the amount of bodies under its control using this method.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "HjkQDyNRY8qZpvow","flags": {},"type": 0,"text": "Halpolan – For some reason, its influence makes people deeply hungry for the left feet of other humans. At first it is simply a strange urge, easily dismissed and forgotten; if the influence is not stopped it grows into a near inescapable obsession.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "6BhJwrfvvfQlrveN","flags": {},"type": 0,"text": "Oorashanee the Uncaring – It moves like a hopping bird on three great hands and smells like honeyed words on a warm summer night. In its presence emotions are hollow and eyes grow empty, but The Uncaring neither notices nor forgets.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "h1BMRnInOAkVd9Cu","flags": {},"type": 0,"text": "Gorgon of Nenth – An amalgamation of faces, breasts, and sex organs. Many of the faces share features such as eyes or mouths and wear expressions of great pain or pleasure. Its characterized by hearing its animalistic moans and howls long before it reveals itself. Despite its monstrous appearance, uncontrollable lust is induced upon those who see it in their dreams. The witnesses often whisper of joining the mass in its endless pleasure, and disappear several weeks afterward.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "4RVsZrabQ0ScwrHg","flags": {},"type": 0,"text": "Fractured-Reality-Leaking-Unease – An entity that does not truly exist, except in the lack of understanding to which lesser creatures attribute their ignorance. A conscious concept birthed from the collective uncertainty present in the minds of all those that think, from the lowliest of vermin to the highest of gods, It is comprised of and sustained by the creeping doubts that lurk beyond one’s field of awareness. It has no name or shape that can truly convey its essence, for at its heart it is the sum of all untouched knowledge, a sentient vessel of everything unknown. It desires more. It detests the intangible membrane withholding Its core from enveloping all of perceived reality, and It hungrily desires to drown everything that could be something in its abstract unknowability. It bides Its time, lingering just beyond the barrier of what is perceived, and crack by crack, It worms itself beyond Its unknowable prison and into the broken edges of reality and the shattered thoughts of those It invades.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "jzRWB84xU5YVgpKP","flags": {},"type": 0,"text": "Yadon-Izfarod – There are many different kinds of love that exist. Parental love, romantic love, obsessive love, companionable love, bittersweet love, one-sided love; there are so many kinds of love. Yadon-Izfarod wants them all. It does not just want them in the sense that it wants to experience every type of love. No, Yadon-Izfarod wants to have all those loves, to own and possess them. In order for an ancient, faceless monstrosity such as Itself to eventually have every facet of love within Its grasp, It patiently and carefully waits for opportunities in the form of connections being made. Yadon-Izfarod uses these connections and infests the minds and hearts of those who formed the bond, twisting their very perceptions until love takes shape in one form or another. It feeds off the newborn love shared between those who have the bond like a leech, which in turn strengthens the unnatural love it induces even more. Yadon-Izfarod is never seen, for a visage such as It’s should never be beheld and could never be loved, and so Yadon-Izfarod haunts distant stars and drinks from the only thing that it truly cherishes; a parasite that dreams of one day becoming not just a host, but the only host.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "p4jmjS7PJk5P1bER","flags": {},"type": 0,"text": "Boreal Algid, Rime Ghoul – This entity appears as an orb of cobalt-tinged light. Anyone who approaches will experience a creeping cold that increases slowly and steadily, accelerating as they advance closer to the Boreal Algid. If they do not leave the presence of the Boreal Algid they will die of hypothermia. The Boreal Algid is drawn to heat, and will draw close to torches or lanterns. Once these sources of warmth are exhausted, it will be attracted to body heat which it will absorb steadily, pulsing as it does so, until only a frozen corpse remains.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "yL3je19qEehCfraf","flags": {},"type": 0,"text": "Ygathu, Endless Rage – for miles away from the site of the valley harboring this horror, howling screams can be heard. Those who see the creature would be disgusted by a huge screaming maw uncannily filled with many powerful reaching arms and numerous long extended antennae. It seems to be very, very angry about the fact that the rest of its body has been stuck underneath a fallen pillar of rock for at least a century.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "lm5AW5vduLMhdXu6","flags": {},"type": 0,"text": "Boucbin, The Plague – ‘Michel’s death marked, one might say, the end of the first period, that of bewildering portents, and the beginning of another, relatively more trying, in which the perplexity of the early days gave place to panic… Our townsfolk realized that they had never dreamed it possible that our little town should be chosen out for such grotesque happenings as the wholesale death of rats in broad daylight or the decease of concierges through exotic maladies… Still, if things had gone thus far and no farther, force of habit would doubtless have gained the day, as usual.’ – The Plague by Albert Camus. Boucbin is an unstoppable, unseen horror that destroys by their very presence. If this monstrosity dressed in the skin of men, monsters, rat, pigs, or pigeons, steps foot within ones boarders a hideous plague follows in it’s wake. In times before the classical, the ancient, even before humanoids first picked up stones as tools, Boucbin walked this plane; seemingly searching. But for what? What could satisfy a creature of such power that to him civilizations are less than ants on it’s path? Perhaps, in it’s infinite age, it seeks peace, it seeks it’s own death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "4afpvdPHxGMn9DwU","flags": {},"type": 0,"text": "Net of Flesh – A net-like organism (looks a bit like a fan coral) made of bone and flesh that grows endlessly along a surface (and up around any vertical surfaces), rotting and bleaching all matter below it, turning stone ashlike. It contracts in response to pain, but reveals little else. Only purpose seems to be endless growth. Will grow over and trap anything that doesn’t move out of the way.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "QoWZ3CleiVzW3hZ8","flags": {},"type": 0,"text": "The Hidden – A chaotic mass of slender, jointed bones (roughly fingerlike in diameter and anywhere from a few inches long to a foot long for each segment) wrapped tightly in desiccated flesh, its form streaked with subtle vertical ridges down towards an indiscernible center of mass. Pulls itself violently and almost magnetically into shadowed corners. Roughly the size of a child when fully retracted into a corner, where it may hide for weeks, warping the consciousness of those in proximity over the course of weeks by giving them the sensation of impossible spans of time passing in near instants. Will grow the longer it is ‘attached’ to a single host until its form curls up along each of the shadowed edges of the room and overtakes the space, the host completely blind to its existence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "IS8oK8BYJYe5kg6N","flags": {},"type": 0,"text": "Ur’Athka, The Lord of Nothing, Voidchild, The Man Between Spaces, The Godhole, etc. – An Elder being that embodies, consists of, and resides in nothingness. Visually, He appears as a gash in reality, looking like a spot in space where nothing exists, like a humanoid black hole, without the gravity and absolutely colourless, including black. When looking upon him, viewers feel an immense sense of unease and wrongness, as well as excessive existentialism, and upon looking away, little to no memory of him can be remembered, and as such, has next to zero followers, not that he cares. All writing about him is made by unknown sources, and instead of being written, is obtained from words being slashed or burnt out of a parchment, with the left over gaps being slightly legible. Very apathetic, having no care about people. Sometimes strolls through random areas, with anything that touches him being sent into oblivion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "sITuR109ujCQ6fRC","flags": {},"type": 0,"text": "The Warden of Fengsai – A humanoid figure appears with a dark green cloak and a menacing metallic mask. The warden speaks with a mottled but feminine voice, describing souls that are promised to her and how she will grant powers in exchange for the hunting down and executing of those souls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "FdAXT24AxZbDEycX","flags": {},"type": 0,"text": "The Sign – An intricate and wicked-looking symbol that, when drawn on a person’s flesh with virgin’s blood, subsumes the victim’s will to its own until the sigil is removed. The Sign’s legitimate worshipers work publicly to care for orphans and promote pious celibacy. In more secluded settings, terrified children are slaughtered to provide blood for the Sign’s renewal upon its bodies. The Sign’s goals are manifold, primarily centered on ways to apply itself to new victims. Expect cultists to be midway through constructing a blood canal in the shape of the Sign over your city, moving shipments of kidnapped children to endangered cells, or attempting to imbue a branding iron with enough pure souls to apply the Sign permanently.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "bpMVxwFz4H1GkSAc","flags": {},"type": 0,"text": "Gzgeth, The Wandering Maw – This bulbous abomination closely resembles a starfish, but house sized (but technically never stops growing). Long arms that extend out radially, as well as thousands of tube feet that propel it forward (see starfish movement). On the top side of its body where all the arms originate is a massive radial maw that its arms are always dropping things into. Its maw contains layers upon layers of teeth all the way into the gullet. The maw emits such a stench of decomposing matter that the word ‘stench’ makes it sound pleasant. Once again like a starfish, any of its massive limbs that get cut off for some reason can simply grow back. In fact it will purposefully remove one of its own limbs for a variety of reasons (defence, offence, distraction), which can survive just fine because its arms contain a high proportion of its brain cells (see octopus brains). It is a red fleshy colour, with toothy spikes here and there. There arent just one of these things, there are many, and they love coming in to new worlds to feast on organic matter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "VEwBU9hM1gE9S6R1","flags": {},"type": 0,"text": "Mother at the Gate – An indescribably massive creature at the other end of Yog-Sothoth. From tears in reality formed from burst bubbles of The Gate, she can be seen pressed against the edge of reality. A vaguely humanoid figure with jaundiced skin, ill-defined fat, musculature, and bone structure- more like the abstract concept of the humanoid form. No hair, genitalia, nails, ears, or any facial features. Three glassy, two-dimensional planes project in front of her face, two displaying eyes and one a mouth, all oversized. The planes engage in repetitive actions such as saccadic eye movements, blinks, and lip movements. Produces no sound except for when crying and vomiting liquid starfire, from which skyscraper-sized ‘children’ fall. Most of her appearance is inferred from these ‘children’- at the edge of the gate little more than her plane-eyes or mouth can be seen. A vague sense of maternalism or Munchausen by proxy aside, her behavior is in no way comprehensible to mortals.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "zRM2ky1Ulgc88sV4","flags": {},"type": 0,"text": "Vanadrish, The Mauled Corpse – This creature resembles the a skinny man with multiple gaping wounds in his upper body and ripped out legs. He normally lies in wait, pretending to be a corpse untill someone is unfortunate enough to step too close. If this happens, a constant stream of rats and insects spews forth from the holes in his body, to attack everything around him. When everything is dead, the vermin retreat into his body and he begins to consume the corpses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "Z6bMDJ4WszsKxluj","flags": {},"type": 0,"text": "Yethverel, the Mirror – a shapeshifter of sorts that mirrors the actions and appearance of any who look into the pool of reflectionless water where it resides, waiting for a living creature to touch the surface.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "nxQjDOHODPDRN5lE","flags": {},"type": 0,"text": "Your-Friend – This being is said to be the father of all devils, the embodiment of bargains. Said to be without true form, this being will appear bitter and desperate and bargain for a soul. Not their own, but the souls of those close to them, be it by blood or some other bond. His ability to do this frightens those even other devils.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "Q866nMV1l8q3t1Lz","flags": {},"type": 0,"text": "Entropon, The First Dragon – Calling this entity a dragon is a stretch. If you squinted, and tilted you head sideways, perhaps its may resemble one. In any case, this entity features a long Eel-like snout with no eyes. A Pharyngeal jaw system (jaw within a jaw) encloses its razor teeth. Wispy spines extend backwards from the head and down all the way around the long neck to the shoulders. This entity does no have a ‘right side up’ for its limb structure is radial. It can manipulate its 12 of sets of limbs to orient itself in nearly any direction, which is useful for climbing through asteroid belts, and other celestial objects. It does not have wings, but merely wispy tendrils that extend from its back (any part past the neck), which can be retracted at will. Its tail is long and slender. Its skin is loose and iguana-like and smoke black, but has a slime that glistens in the surrounding starlight. The creature is more bony than it is muscular except for its jaws which can crush most things. The slime that it exudes is ‘antimatter slime’. It uses its tendril wings to slather the slime on objects too large for it to eat to break them down into more bite sized chunks. Not a mortal being, but not immortal either. Entropon is chaos. The result of the God of Destruction’s inability to reproduce resulted in this abomination, which now walks the cosmos lusting for matter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "HwSg61mWGwGTNbpS","flags": {},"type": 0,"text": "Gygangoros, The Nightmare Leviathan – This semi-aquatic monstrosity features a head akin to a demonic and pissed off hornet adorning a menacing crest of twisting spines that extend around the head. It has a pair of powerful looking mandibles that lead to a mouth with multiple rows of jagged teeth as well as a hornet proboscis that it can shoot out to siphon all manner of life force from any given victim. Its body shape is vaguely centaur like, exchanging the horse body for that of a dragon. It is armored in thick bony plates covered by a lizardlike leathery skin. It does not have arms, but instead merely two sockets where scythe appendages extend out from. On its back, a multitude of strong grasping tentacles writhe about. It has a barbed tail with fin webbing. This creature is slightly intelligent and shares a common ancestor with the Aboleth, which are the only race that it doesnt prey upon. This entity preys out of sheer malice. It just ‘enjoys watching the world burn’. It prefers to strike on stormy nights and during typhoons, and especially targets beings of peace. Coastal monk monasteries are a good example.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "ir9SWSuEfUTtIda3","flags": {},"type": 0,"text": "Al Ecks Om, The Roiling Flesh – This being exists just outside the material plane and occupies spatial dimensions beyond the fourth. When a mortal happens to come upon its visage, it sees an almost incomprehensible sphere with ever shifting angles and boundaries. Within the sphere are vast amalgamations of muscle and bone, tissue and various organs as if looking at parts of a body from 100 different perspectives simultaneously. As the creature moves, a bystander would realize that the image they see is but a fraction of the total. The hundreds of perspectives are fixed, but the viewpoints move through the undulating tissue as cross sections of the whole, like so many colorful animated CT scans. Al Ecks Om wants to understand the nature of the space it comes into contact with, but it only has the most basic understanding of four dimensional space. Its only tool for understanding is the sensation it experiences in sliding its gargantuan form through the layers of spacetime, like a dog dragging its butt across the carpet to relieve an itch. It leaves behind a trail of madness and ooze covered tears in reality.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "4vwYvYTbSQTVUuUx","flags": {},"type": 0,"text": "Unit Designation 817:252, “Smother The Piteous Wails Of Those Who Wallow In Sin” – A predecessor-angel of the world before, which now exists only as shattered shells in the outer darkness. An obsolete model from an extinct reality. It is programmed to enforce moral commandments. The commandments it enforces are unknown, unknowable, native to an alien context. It kills those who will never know they have transgressed, and carries their souls to a far hell whose fires have long since burned out for want of stoking. The gods do not move against it. Perhaps it is nostalgia, or binding covenants not even they fully remember. Perhaps it was designed before the idea of cessation was invented. And so it goes about its cruel business, wielding a blade of strange angles, soaring on wings made of the substance which both light and matter were before the gods saw fit to differentiate them. It is swift. It is unerring. It is deadly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "pT0DWnPMLk7zHOTZ","flags": {},"type": 0,"text": "The Gardener of the Tree of Time – It lives at an end of the universe, when all that is splinters into galaxy-long knives and plunges into the nothingness beyond the void. This is but one end, one potential course for history to take. That dissatisfies the Gardener. It wants to exist in actuality, not merely in ever-shifting threads of possibility. It will use, is using, has used its great philosophical machines to fling pieces of itself back in time. These pieces are programmed with knowledge of all that has come before them. They disguise themselves as demons, spirits, gods, gathering cults and engaging in the careful shifting of events which will lead to their own circular return to create themselves. Their plans are incomprehensible on a human timescale. The fruit they bear may not come into bloom for millions of years. Sometimes they may even seem benevolent, but their end is abhorrent to all humanity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "hC9bWaflX8m6Tufz","flags": {},"type": 0,"text": "Perfectionist Amar-Amat – Humanity is weak, and ignorant, and foolish, but it has potential. Above the celestial spheres waits a community of star-things who patiently wait for us to reach that potential. There are a few who are tired of waiting. Amar-Amat is one of them. They descend on beams of discordant frequencies, sometimes when called by scientists and savants, sometimes according to a schedule only they know. On arrival Amar-Amat will set up a lab, and begin gathering test subjects. Acceleration of human development is a tricky thing. There are many failures, though even the failures are eventually made grateful for the Perfectionist’s blessing. The successes return to the stars with Amar-Amat, or else become their disciples on Earth, spreading the gospel of imminent perfection with their former fellows.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "B2WJ62KfMc9fa66d","flags": {},"type": 0,"text": "The Dreaming Maw – A castle-sized crystal floats above the ground, every so often pulsing red. Its lower half goves way to a mess of tentacles, some hundreds of meters long, that twist and writhe ceaselessly. It moves slowly, inexorably, for reasons unknown, and as it does the lands near it warp; first gaining a slimy texture, then sprouting tentacles, eyes, mouths, arms, then becoming those things until there is no trace of nature in them, only squirming fields of flesh. From these places sometimes life emerges, but not as life known to Men. Floating orbs of flesh and eyes, nearly normal creatures with grotesquely large features, fragments of stone from which sprout tentacles, and many other forms which cannot escape and fall back into the warped earth before presumably being destroyed. Those that do leave to other lands, in search of something perhaps, but inevitably bringing fear and doom. Below the crystal, an abyss lies, a hole with no end, save perhaps in a stranger place, where those given life by the Maw might call home. It follows the gem, the tentacled land before it giving way and closing behind. Perhaps it rose from the plane beyond the hole, before the world had felt its presense.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "I0cPiGn6mBtWiyuz"}
