{"name": "Gnomish Inventions Where Safety Was Clearly An Afterthought","description": "One hundred fun Gnomish inventions that get the job done one way or another. Results may vary.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "O1ewdCA9AI3wWPut","flags": {},"type": 0,"text": "The Let-Go: A small, metallic box that is riveted with small bumps. The Let-Go was originally sold in toy and trinket shops as a children’s building toy. They were extremely popular with children and adults alike before being removed from shelves due to delinquents recognizing their pure destructive abilities and utilizing said abilities in pranks that more often than not ended with the trigger-er in horrible pain. When stepped on, these metallic boxes would cause searing pain to shoot up the creature’s leg, even being able to punch through the soles of most common boots.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "8N7Yb3NJBml4L5ZK","flags": {},"type": 0,"text": "Irvlin’s Icy Earmuffs: Upon speaking the command word, these fluffy, crystal clear earmuffs fire two cones of cold in opposite directions, one from each ear (save DC 15). This property can be used once per day. They also keep your ears warm. (Irvlin is not responsible for any damage caused to allies)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "JdwqrV4tWW096dmz","flags": {},"type": 0,"text": "Fidget’s Spinner: A mechanical apparatus that, once activated whirls at a disconcerting rate of speed. Can be thrown farther than a usual projectile as it will glide along the air and hit quite a bit harder. Can be bladed or coupled with combustibles for extra effects. Was made as a children’s toy, but it’s upsetting lethality showed it far better suited to combat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "YVNMqBgCAtv74Jow","flags": {},"type": 0,"text": "Gimble’s Fabulous Spring. A high-tension spring device contained in a compacted platform. Can be activated to provide lift, boost a jump, or even to separate heavy objects, however, should the housing be damaged, the energy released by the uncoiling spring can prove spectacularly lethal. Some less scrupulous gnomes have been known to intentionally compromise Gimble’s Springs to create traps.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "UGeeCZyHkqirbjtt","flags": {},"type": 0,"text": "Pimm’s Cup: A drinking vessel of average appearance. Through a series of mechanical switches can be used to mix in liquid and powdered additives contained in the outer shell in careful proportion. Originally intended as a layman-friendly potion mixing device, the cup has also seen use in cocktail crafting and poisoning enemies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "s2Mg4sEJfki3pLnb","flags": {},"type": 0,"text": "Rocky’s Favorite Gizmo: Apparently, a strange collection of pipes, wires and odds and ends, careful manipulation of its many valves and switches can lead to a number of effects, although most common is a gout of flame in a 30-foot radius.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "i97K6cuZvRYUy7Hb","flags": {},"type": 0,"text": "Silver Mechanical Door Opener: If attached to a door frame as a full round action and connected to a door handle on an unlocked door and activated as a free action, the mechanical device weighing 25 lbs. will turn a door handle and/or force a door open in 5 rounds as if it were opened with an ability check (Strength) of 14. The object takes 5 rounds to reset and properly store.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "uKO8iDusjWNAoJZX","flags": {},"type": 0,"text": "Det Cord: Gunpowder infused string. Nothing could possibly go wrong!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "pFscyBUbHRjFYlsD","flags": {},"type": 0,"text": "A small wooden toy lumberjack that violently swings a sharp metal axe downwards when pressed the button in its back. Anything under the axe loses 1 hit point.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "1xXR8y7WQLyjjyIF","flags": {},"type": 0,"text": "Essential Healing Potion: Heals 2d4+2 HP randomly within the next 24 hours. Made from essential oils.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "b8ElbnCB91VmdUq1","flags": {},"type": 0,"text": "Emergency Quiver: Opening the quiver launches all the arrows forth at once. Make sure you don’t get it confused with your real quiver.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "6dQLEIpdX4R18Vl9","flags": {},"type": 0,"text": "Theft-Deterrent Pouch: Reaching into the pouch requires a DC 10 CON save, or take 2d6 poison damage, half on a success. Wait… how do I get my gold back out?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "BgBI5QWbG6kTu8n7","flags": {},"type": 0,"text": "Ravenous Hunting Trap: This hunting trap primes and triggers itself every hour. Best make sure it not dangling from your belt…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "vU2Seb4kc8TmVfuj","flags": {},"type": 0,"text": "Slightly Larger Torch: This torch provides bright light in a 30ft radius, and dim light for an additional 30ft. However, this added brightness comes from the fact the entire torch is on fire, including the handle. Take 1 fire damage per turn while holding this object.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "Ml2IHrJY7AgKZUm6","flags": {},"type": 0,"text": "Weapon Effect – Spiked: These vicious spikes add 1 piercing damage to your weapon! You also take 1 piercing damage whenever you hit on an attack. We put spikes on the whole thing, including the handle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "ju9zN44rvnNuXjcR","flags": {},"type": 0,"text": "Explosive Bow and Arrow: These arrows detonate on medium-high velocity impact. Beware butterfingers who drop the quiver.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "pp2Nh1eVUuCMsA74","flags": {},"type": 0,"text": "Escape Balloon: In case of emergency, pull the string and a balloon will inflate to fly you away from the danger. Getting back down safely might be harder.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "wMSJeiAguddmjQDw","flags": {},"type": 0,"text": "Explosive Hammer: For when you really need to pound down the stone wall. The risks of a hammer chock full of explosives should be obvious.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "7nkvc1TXiRRMqNVp","flags": {},"type": 0,"text": "The Magical Alarm Clock: Casts a random spell that you, or someone close, knows to wake you up at the designated time. There’s nothing like waking up to a fireball in your travel jammies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "XvZ4WptNfM2LbGPQ","flags": {},"type": 0,"text": "A crossbow that launches potions. The chance of exploding on launch depends on the potion container.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "W0Nlp8s5vgJVDEb0","flags": {},"type": 0,"text": "Restraining Foam: Everything in a large radius suffers the effect of an entangle and web spell, each with a spell save DC of 16 as the area becomes heavily obscured by a froth that hardens almost instantly into magical foam. Must be manually triggered (no throwing).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "rBEvXqZlDsHjGhDe","flags": {},"type": 0,"text": "Impervious Sphere (single use): When attacked, you may use your reaction to become surrounded by a protective spherical barrier that lasts for 1d4+1 hours. While within you cannot interact with the outside world (cast spells or be heard, attack, etc. through it) but you can see and be seen vaguely through its curiously pink opacity. The sphere has immunity to all forms of damage and protects you from all forms of damage originating from outside the sphere. You are untargetable by sources outside the sphere. You may move at Speed -10 feet while within the sphere, rolling it along as part of your normal move. It is subject to gravity and will roll down slopes at increasing speeds (DM’s discretion whether falling is technically damage from outside or from your body colliding with the sphere). The sphere is linked to your person – if you teleport, ethereal jaunt, blink, etc. – it travels with you. The sphere contains 1d4-1 hours of breathable air within it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "P5QrCjTQhwQhhrYr","flags": {},"type": 0,"text": "A pocket watch with a multitude of faces and dials, each tracking the precise time in a different plane. Unfortunately, it is powered by an incredibly tiny rift between our plane and the abyss. If you hold it to your ear you can hear faint whispers of the chaos. If it is ever dropped or left unattended for more than 1 hour, it spawns 1d4 Imps who torment you and play keep away with the watch.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "tzK1XFQxl9inPFI6","flags": {},"type": 0,"text": "Tantalizing Top: A spinning top covered in different colored gemstones. When you spin it, ribbons of colored lights burst from it and seem to dance around on their own. It requires an action to activate. Every creature (including the spinner of the top) in a 10ft radius must make a DC 14 Wisdom saving throw or become stunned by the top’s beauty. Any creature that enters the Tantalizing Top’s radius while it is activated must immediately make the same Wisdom saving throw or become stunned. At the end of each successive turn, a creature can re-attempt the saving throw. The top can only be de-activated by a creature who is not currently affected by it. It requires one bonus action to stop the Tantalizing Top.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "mlPSjzf33G35C5Gz","flags": {},"type": 0,"text": "Winston Probt’s Goggles of the Vision Miraculous: A pair of goggles that allow the viewer to see at great distances. An affect they achieve by using minor transmutation magic to actually change the physical makeup of the wearer’s eyes. Once the goggles are removed, the effect takes 24 hours to wear off, leaving the viewer unable to render anything at a close distance during that time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "LVWo1NbQdWx2x2yS","flags": {},"type": 0,"text": "Gazlowe’s Grabby Hands: A backpack device with four mechanical arms ending in dexterous robot hands (think a Gnomish Doc Ock). Controlled by a helmet the user wears. Each 30 minutes of non-combat use, the user must make a Will Save (DC 10). On a failed save, user is paralyzed for 30 minutes. In combat, user gets one extra attack per Grabby Hand. Each time the Grabby Hands device is used to attack, user must make a Will Save. User declares at the start of their turn how many extra attacks they are making (up to a limit of 4). Each attack made raises the DC by 5. For a single extra attack, a Will Save (DC 5) must be made. For two extra attacks, the DC is 10, and so forth. On a failed save, user is paralyzed for one round. Each hand is capable of operating a weapon with which the user is proficient. Two handed weapons require two Grabby Hands to operate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "1AkTrgQPOT2URgPQ","flags": {},"type": 0,"text": "Gob’s Hood of Hiding: Makes you Look, and Smell, like a goblin – head to toe – dc20 perception check. When you take it off, you no longer Look like a goblin. Oh, the smell? It lingers…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "KZQiatl6P1BC6Ep9","flags": {},"type": 0,"text": "The Excessively Fluffy Hat of Excessive Warmth: It keeps the character warm in extreme cold, but if the temperature is any higher than extreme cold, the character starts suffering from extreme heat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "AY5eA8jyeLfJIrqX","flags": {},"type": 0,"text": "Anti-thief Backpack Of ‘splosion: Anyone taking anything out of the backpack must make a DC15 sleight of hand check. If failed the backpack and all its contents explode in a 20’ radius 10d6 fireball. The backpack confers no fire protection to the wearer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "QCP4LDtgUXuxvvTp","flags": {},"type": 0,"text": "Goblin/Kobold Powered Wheelchair: The main wheels are just overly large, caged hamster wheels. Throw a caffeinated goblin or kobold into each caged wheel, release the breaks and hold on tight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "6dK0ugM0p7LsxySK","flags": {},"type": 0,"text": "Steam Powered Pogo Stick: When you want to reach or jump to those pesky high ledges, rooftops, etc. and you need that extra oomph to get there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "BKztGE78cmpGit7s","flags": {},"type": 0,"text": "A spell work speak & say automation device for the busy mage. A pocket-sized horn speaker and gearwork box used to speak up to three verbal commands used in common cantrips on the back is a slot where you can insert slips of paper with the verbal spell commands. Users can press a button to speak the magic commands, channeling the power from the nearest caster. Machine, however, was never meant to conduct magical energy. Roll 1d10 whenever using it. On a roll of 7, roll for an effect on the wild magic table.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "wl8OKZgWgMYyGMAD","flags": {},"type": 0,"text": "Farbar’s Fantastically Fabulous Prosthetic Hand: Replaces your hand and part of your forearm. A prosthetic hand where each finger can be fired like a dart for 1d4 piercing damage (make an attack roll for each one). However, it’s activated by fully extending the arm, so don’t extend your arm till you want to shoot.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "mlDJvz4Jupa3Bl8p","flags": {},"type": 0,"text": "The Venomous-Spider-In-A-Glass-Orb Launcher! Just don’t drop the ammo!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "1RL85pZKE93fVBfZ","flags": {},"type": 0,"text": "Whirlypack: A large, heavy backpack with six differently colored ribbons attached. When you pull a particular ribbon, something happens. Red: A 3′ metal pole extends upward from the backpack or, if already extended, retracts. Blue: Three large metal blades pop out from the pole or, if already unfurled, retract. Yellow: The blades start spinning. If pulled a second time, they speed up; a third time, they speed up even more; a fourth time, they slow down and eventually stop. Green: A series of small lights running up the pole illuminates; pull it again and they go out. Purple: A flashing light on top of the pole lights up and spins until it is pulled again. Orange: A siren blares. Unlike the other functions, the siren wails as long as the ribbon is pulled; it stops when you let it go. The intention is that the backpack will function like a helicopter. However, it doesn’t provide enough lift, even if you’re gnome-sized. It’s more like a ceiling fan in a backpack, and to that end, it does provide a pleasant cooling breeze. The backpack is powered by lamp oil; one flask will allow it to run for a full minute. (The fuel tank is only large enough to accommodate one flask at a time.) When running, it’s quite loud and frequently belches foul-smelling black smoke. If properly employed while falling, the backpack will slow you down enough that you won’t take damage, at least until it runs out of fuel (in effect it functions as per a Feather Fall spell). The spinning blades may prove troublesome to foes (and friends) in close combat. Obviously the ribbons are intended to be pulled in the correct order, but given there are no instructions or labels, most likely players will pull the wrong ribbon, which could lead to damaging the mechanism or worse — for example, if you pull the Blue ribbon before the pole is extended, the blades will pop out, likely skewering whoever is wearing the backpack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "Yay1Joy3fPq8j5lS","flags": {},"type": 0,"text": "Fireball Flamejet: A reinforced crystalline ball with a hole in one side and a tube protrusion on the other. When a fireball is cast into it, it spurts a jet of flame up to 1,200 feet away that does half the fireball’s damage. However, it was only tested with low level casters so more powerful fireballs may cause it to shatter and have the fireball explode in place.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "bIUTumYAVDSFJJqk","flags": {},"type": 0,"text": "Yuan-ti Finger Trap: If used by one creature: Fail a DC 13 Dex save (or voluntarily fail) to activate the finger trap by holding it between your two index fingers. Then succeed on a DC (20- Int Score) strength check to be able to escape. If another creature is proficient with int saves, they can use the help action to make the DC to escape equal 1. If used by 2 creatures: the enemy must make a DC 13 Dex save against being trapped. To escape, the winner must succeed on a contested Int check against the other creature. Every time you attempt the check and fail, add one more d20 of disadvantage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "eNimOhDFdYwgxYSR","flags": {},"type": 0,"text": "Whistle of (1d8, 1: Dragons, 2: Giants, 3: Undead, 4: Fiends, 5: Aberrations, 6: Monstrosities, 7: Fey, 8: Elementals) Summoning: On it it’s written in Gnomish: ‘Blow to Summon type of creature ‘. When blown, every creature of that type in a radius of 1 mile will hear the whistle and be bothered by it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "EZPoj1UgkPoBhB3M","flags": {},"type": 0,"text": "A cup of infinite water. Or at least that was the idea. They just put a small portal to the elemental water plane on the bottom of a regular cup. Unfortunately, they did not think about water pressure, so anytime the (very securely attached lid) is removed, it immediately acts like a power fire hose. Make a strength check to open (the pressure keeps it very tight) and, if opened, make a strength or dexterity check to not go flying uncontrollably. You also have to make a strength check to close it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "iJf5eCNBHN2iGJ9F","flags": {},"type": 0,"text": "Wizzwalds Amazing Cube: This is a light cube made of brass approximately the size of 1/3rd foot by 1/3rd foot by 1/3rd foot. This cube effectively works as a spell magnet, if it is very close to the caster or target or between them, the spells will be redirected and absorbed by the amazing cube. The amazing cube technically has no limits on how many spells it can hold, but every time it absorbs a spell, there is a 10% chance (+ another 10% for every spell after the first it has absorbed) that it will expel ALL of the spells it absorbed in all 6 directions it’s faces are facing. This can lead to some incredibly chaotic results, such as shooting six fireballs out of all of its faces, and then flooding the area around it with water before shooting an eldritch blast at whatever targets are on the correct angles of the cube, or charming 4 separate creatures at once while also issuing a command creature spell making all of them drop their weapons. You can reduce the odds of the cube expelling its spells to 10% if you spend half an hour and expend a spell slot with it. However, any spells it absorbs after this will still add their bonus 10% chance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "JrUBteHvhtbEEeW4","flags": {},"type": 0,"text": "Henswallow’s Handy-dandy Healing Handcrank: This small metal box has a hand crank with a wooden knob and is designed to be laced onto a belt. Once per day you can use an action to turn the crank as fast as you can. Turning the crank emits the noise of ball bearings rolling in an empty can that can be clearly heard up to 60 feet away and soft, white light begins to escape from the seams of the device. Once the crank has been used, at the end of the user’s turn the wearer rolls 4d4. Odd numbers are subtracted from the wearer’s hit points and even numbers heal the wearer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "X9AdMdSdmfXqfEfU","flags": {},"type": 0,"text": "Dodecahedron of Listless Wandering: Once activated this 20-sided sphere 1/3 Khelgars across in size will levitate and move in a random direction at 60ft per round. A creature whose space the sphere enters must succeed on a DC 15 Dexterity saving throw or be struck by it, taking 6d6 crushing damage, and triggers a wild magic surge.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "aQYpZNqVy5IkmQ0r","flags": {},"type": 0,"text": "Bouncy dynamite: It’s more fun to tinker then mine, but buying metals is a bit expensive. Maybe if we can get the dynamite to where it needs to be faster it will bring prices down. Just light and throw. Or go for the shock detonation version. Detonates in the, hmm, says on the box, an unknown number of hits, each stick is different, have fun discovering how many each need to detonate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "C1zybcQVQw0jM9bY","flags": {},"type": 0,"text": "Automatic Fire Starter: Tired of struggling to light your pipe or campfire with your clumsy mechanical piece? This automatic fire started is enchanted to light in proximity to wood, just bring the lighter up to your pipe and Voila, it’s on fire. I might not have thought this through, I’ll put it away. Oh, shit did I have a book in there? Yep, definitely had a book in there, I’ll be right back, have to put out this robe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "GzXHbo4oo1BDvOwA","flags": {},"type": 0,"text": "The Jumping Spear: A two-handed spear specially made for smaller races with a spring-loaded spearpoint and footplants on the butt. At any point a small creature can jump on the footplants and slam down to cause the spear to explode violently forward with or without its wielder. Whenever a wielder uses this feature, they must make a check to remain holding the spear. However, on a success it does an extra die of damage on a hit, or alternatively propels the wielder up to 15ft into the air and 30ft horizontally. ——— It’s a pogo stick with a spear attached to it essentially.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "hUudVWsaagfmfyb5","flags": {},"type": 0,"text": "Landslide Module: 100lb drill attached to a clockwork mechanism with an explosive core. Once activated landslide module borrows into the earth in a random pattern (roll dice for direction?) dealing and taking damage until it explodes. Great for mining, demolition work or guerilla warfare.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "S0PYWMDGc3e0I4J3","flags": {},"type": 0,"text": "Punfky’s Flying Machine: A glider made from spider silk. Enchanted to cast gust (a 30-mph wind if my math’s correct) 30 feet behind and under the glider. It… works, in the way everything works. Let’s just say it’s not the most stable thing in the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "3MyBFhFHlykXeQIp","flags": {},"type": 0,"text": "Gordex’s Elevating Slippers, Lesser:  The wearer of these rainbow-colored slippers may activate the slippers as a free action once daily. Upon activating these slippers, the wearer is instantly elevated vertically d6 ×10 feet into the air. During the ascent, the wearer may attempt to grab onto a ledge or any object they can reach as a DC 16 dexterity check. If the wearer has not grabbed onto anything at the end of the elevation, they begin plummeting to the ground and take falling damage as normal. Note: There are rumors that Goredex created a greater version of these slippers, but by all accounts, they were destroyed when Goredex impacted a moon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "YzKF3H6a78uXVP8t","flags": {},"type": 0,"text": "Nigel’s Knackered Knife: A knife with the properties of the Ice Knife Spell, which will activate… eventually.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "hWyzAsUeZXX10sVM","flags": {},"type": 0,"text": "Havel’s Handy Hoppers: A bag of caltrops that bounce around like rubber balls once thrown.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "HWwYspOAemecai7K","flags": {},"type": 0,"text": "Viflicks Incredible Disk: The ultimate Frisbee to keep any sort of beast occupied for hours.  Unfortunately, it doesn’t actually stop once thrown.  Not until it hits something solid like a mountain…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "uvqjeUF3xYqLxA75","flags": {},"type": 0,"text": "Reginald’s Rock Cracker: A magical war pick commissioned by a dwarven mining guild. Has 4 charges that restore every day at dawn. Every time the pick successfully hits, it expends a charge and casts shatter at 2nd level focused on the tip. Earplugs recommend.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "7bMHdpQvsHWSRYvN","flags": {},"type": 0,"text": "Traveler’s Survival Compass: This small metal cylinder shoots out a number of sawblades to harvest firewood from small trees. Subsequently it fires a gout of flames roughly the same direction to create an instant campfire. This handy tool also provides a sleeping solution, by spraying a large volume of quickly expanding foam for bedding, and it ensures safety at night by periodically sounding an alarm and flashing lights for the user to wake up and survey their surroundings. Gnome-corp is not responsible for any accidents involving faulty compasses and/or flammable bedding. The deluxe version comes with extra sawblades, scented flames, flavored bedding and a variety of alarm sounds and lullabies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "hTp8y4wNFBk3MjgE","flags": {},"type": 0,"text": "Chilla’s Speed Sheath: If a blade is put in this sheath, a small tug will make an opening in the sheath and propel it forward making your initial attack much quicker. Good for surprise attack, unless you are not good enough to make the DC 15 Dex saving throw to prevent it from flying out of your hands or getting lodged into your body.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "1adjSC3gKGSWNgdj","flags": {},"type": 0,"text": "The Boomstick: A large club with an opening on the bottom which is filled with explosives  and a trigger on the top to make them go off. Just a shame that the club isn’t always sturdy enough to take the explosion, so its recommended the user wears some armor to protect them from surprise shrapnel. Oh, and make sure you can stand your ground, the recoil is terrible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "HMzCtUcEgldINZji","flags": {},"type": 0,"text": "The Excessively Thin Hat of Excessive Cool: It keeps the character cool in extreme heat, but if the temperature is any lower than extreme heat, the character starts suffering from extreme cold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "f5G43Ev65kBDv7jx","flags": {},"type": 0,"text": "Harry’s Heating Gloves: Wearer can wear the gloves to heat up whatever they are holding. If powered on for too long the gloves melt onto the wearer’s hands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "Hpc4k6upwyMxy8R2","flags": {},"type": 0,"text": "Gilgam’s Self-Replicating Rodent Remover: a tiny construct that pursues its designated target and ‘removes’ it. If multiple targets are detected within its range, it will seek out materials to construct copies of itself. If in the course of locating said materials it finds other targets, then it will add those targets to its list while increasing the number of copies needed to cope with the added number of targets. The off switch is conveniently located on the roof of its mouth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "vT3sxbtTl7TryNnc","flags": {},"type": 0,"text": "Hellfire Sphere: A black sphere with a button on it. When the button is pressed, the sphere turns glowing red hot and melts through anything it touches. If not deactivated, it will eventually melt its way through any container holding it, and any surface it is placed on (including the ground). The button, which has to be pressed again to deactivate it, also melts anything it touches.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "ZovQJB2aBQO0app0","flags": {},"type": 0,"text": "Wind up Mimic: wind it up and set it down in a room, watch it transform into something inconspicuous. Oh, but make sure not to take your eyes off it or leave the room.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "hSKC7YX3AKlD2Scj","flags": {},"type": 0,"text": "Gloves of Burning: Only function if in contact with the user’s bare skin: on a successful melee unarmed attack wearing the gloves, everything in contact with the gloves takes 2d4 burning damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "uPFcKOh1ogGO48mv","flags": {},"type": 0,"text": "Malputon’s Mechanical Mount: a bronze knee-high sphere with a small metal seat and a protruding yoke. Once mounted and started, the sphere wheels along the ground with a speed of 200 feet or quadruple the daily rate of a horse and rider. The seat is poorly stabilized, and the rider must make 10 Dex saving throws (DC 16) for each day of riding, or else fall from the mount and watch as it treadles into the horizon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "wsciFzPk4CkubUSE","flags": {},"type": 0,"text": "Mavis’s Instant Malleable Metal: This small metal cylinder has as a plunger on one end that sticks tight to any piece of metal it is placed on. A DC 14 strength check is required to pry the cylinder off. When the command word is spoken, the cylinder casts Heat Metal on the metal it is stuck to until the command word is spoken again, at which point it becomes unstuck and falls off. Invaluable for any blacksmith on the go.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "J56O7gqinUbflFQ4","flags": {},"type": 0,"text": "Fizz-Spork’s Sustenance Seeder: Wide nozzled rifle with a hose that connects to a large, seed holding backpack. A proprietary mix of seeds are stored in the backpack area, the portions only known to Fizz-spork himself.  The user sprays seeds in an open field, in the shape of a pyramid to ensure correct sustenance portions. When done correctly, this will grow a perfect selection of crops, sure to last any village through the winter. Sadly Fizz-spork has been bribed by the local vegetable guilds. So, in reality, it only grows the most bland and rotten of fruits, sure to ruin fruits good name and drive customers to the vegetable guild’s market.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "QbwHYIFMAYpC3Xen","flags": {},"type": 0,"text": "Spring-mallet’s Mice o’ Matic: A helm that is sombrero sized, made of brass and tin, etched to the glories of rodents past. Many wires protrude, sending off yellow sparks when in use. When a user dons this helm, they gain the ability to speak and read any mouse’s thoughts in a 100-yard radius. After a few hours of wearing the helm, a user can even start to control the minds of mice.  Was designed to be a spying device, as the inventor dreamed of sending mind-controlled mouse spies into her rival’s homes.  Due to a lack of testing subjects (as of course, mice are the best lab rats, and they already speak mouse), the device merges the mind of the user and mice over time. Prolonged use may lead to the user having a strange desire to make bathroom in wood chips and have strong cravings for cheese.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "Yt5EkB1KWRiXFxoy","flags": {},"type": 0,"text": "Radrey Zerz’s Pocket Transport: a four-inch by four-inch by one-inch box that unfolds into a small two wheeled vehicle with a T-shaped handle, propelled by the rider kicking off from one leg. Its base speed is 50ft, but any attempt to ride a distance other than exactly 25 feet requires a Dexterity check DC 18.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "qnX3CZZ10RyUFBV6","flags": {},"type": 0,"text": "The Thunder Muffs: Yellow earmuffs that let you hear what thunder sounds like up close.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "WWupfqZOSap4HRi8","flags": {},"type": 0,"text": "The Acid Club: A 5-foot stick with 3 jars of acid attached to the end.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "NsJstDEbvkyUg7QL","flags": {},"type": 0,"text": "The Fingerpurse: A purse with teeth that closes tightly if it detects that someone has their hands in it. (Coins are meant to be poured out)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "1pWqqcUtkPAUW6oi","flags": {},"type": 0,"text": "magical sparkle torch. Provides more light than a traditional torch as it slowly burns down, if put out the wick returns to its original length, but don’t let it burn down all the way or it will explode for 6d6 damage. (it’s dynamite)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "v05SadpuO6e70bZm","flags": {},"type": 0,"text": "Ball Lightning: If outside, every time the ball makes contact with a new surface, lightning strikes it. DO NOT DROP.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "WBZ1IL59Vq8Xpfws","flags": {},"type": 0,"text": "The Entertainer: A toy for children that pits to people against each other in a game of rock paper scissors and the loser gets hit with what they lost to such as being clobbered with rocks cut with scissors or pelted with paper.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "fglClK3gb90o4tm6","flags": {},"type": 0,"text": "Uma’s Amazing Unguent: Applying this grease to your hair or beard gives you a +2 boost to Charisma for an hour! It also makes you vulnerable (x 2) to fire damage until your next bath.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "BPpKTY6MPjuPdbq4","flags": {},"type": 0,"text": "Magical Boots of Blinding Speed: These boots greatly increase your movement speed. You are blinded while using them!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "OA1NgkRHX7gXyyy7","flags": {},"type": 0,"text": "Saddle of Safe Evacuation: This saddle is amazingly well constructed and confers either advantage or a bonus to ride checks of any animal with the approximate mass of a standard horse.  As an added feature, it can launch the rider 30′ into the air simply by applying pressure to both stirrups and shouting, clearly, ‘Go!’ in any of 32 languages.  There’s always a 50% chance that the language is one understood by the animal.  Upon activation the animal takes 30′ worth of falling damage.  Without external influence, the users will take 30′ of falling damage upon impact.  Originally employed as a safety device in Whirrleygigs Spinning Hover Conveyance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "e47URp5C3zsBmpEj","flags": {},"type": 0,"text": "The Quick Carver: A large very sharp knife. When the blade meets resistance, it begins to vibrate to aid in cutting. This may allow the knife to cut through harder objects or to cut through more material faster. The strength of this vibration is random though. When a character uses this knife roll a D20 -5 to determine the vibration’s DC. The character must roll a Slight of Hand (DEX) save against this DC. On a failed save the character or another nearby creature or object takes 1d6 slashing damage at the DM’s discretion. WARNING – It is not advised to sheath this knife.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "4mFkkmSdwVBv4fJm","flags": {},"type": 0,"text": "Dwarf Tosser Catapault: perfect for launching your axe wielding dwarf across caverns or straight into the heat of battle! Parachute and/or impact cushioning and/or healing potions not included.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "rKAQfb2gVxxzush3","flags": {},"type": 0,"text": "Flying Fire Boots: uses powerful fire explosions to propel you up. Doesn’t take provide easy to control direction or speed and has no fire protection.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "2JeHOrxZ4m6vDpW4","flags": {},"type": 0,"text": "Lightning Fists/Gloves: embedded with magic to shock those it hits but has no way to designate friend of foe. If you even touch the outside of them, you get zapped. It is unstable when wet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "jqDsP0lIijRORvQJ","flags": {},"type": 0,"text": "Dark Vision Goggles: it basically amplifies the existing light in front of you within the goggles. Dim light becomes normal, non-magic darkness becomes dim. Same issue (but worse) as normal night vision in normal or bright light, causing temporary blindness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "OkvcHkQRhxub0f4j","flags": {},"type": 0,"text": "Firecracker: throw it in fire, makes cracking noises and sparks, but then explodes into tiny pieces.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "RUHjv2TNiORb5RcA","flags": {},"type": 0,"text": "Multitool of Amazement contains various tools like wrench, screwdriver, lighter, pencil, torch fuel, taser, flute, mint dispenser, sleeping gas. It’s not terribly user friendly or obvious which is which. You can see the problems with mixing them up.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "J1sTUZvbVFxGDQ7S","flags": {},"type": 0,"text": "Speedy Ice Skates of Quickness: these ice skates triple your speed on ice and gives you control of direction on ice. You can’t slow down at all though, but why would you want to.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "BoWFsf0O2pmmqRHR","flags": {},"type": 0,"text": "The Steam Powered Spoon: A spoon that moves in a jack hammer fashion. It is meant to smash rocks into smaller pieces, making them more easily digestible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "NLxzpuxCPJ7eMyY4","flags": {},"type": 0,"text": "Belmont’s Web of Fire Cube in a Can: By using the pull ring at the top of this tall slender can, the user shoots out a sticky web measuring ten feet in diameter as a ranged spell attack. The web requires a dexterity save or strength save or all those in its area of effect are grappled. One turn after the web has been deployed, it bursts into flames that fill a ten foot by ten foot by ten-foot cube and last 1d4 rounds. The flames inflict 1d8 fire damage per round and characters are blinded while within the AOE.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "wT9wMhe1oMjaAdel","flags": {},"type": 0,"text": "The Exploding Can: By using the trigger, you activate the oil in the metal can.  It ignites a round later and explodes in another round dealing 2d4 in a 5′ radius circle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "PTcJgSOCQRuLcLvL","flags": {},"type": 0,"text": "The Fire Sword: With the press of a button, a small flame increases size to 4 feet long in a sword shape.  The Sword does 2d4 Fire Damage.  It has a 10% percent chance of Exploding dealing 2d4 in a 5′ radius circle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "qGIqaeIWuE4H2Yoc","flags": {},"type": 0,"text": "Phoenix Flares: A new kind of construct that bursts into flame and soars gracefully upwards and elegantly performs aerial acrobatics. Unfortunately its inability to extinguish itself and a few incidents where they burned entire fleets of ships by setting one ship on fire causing the phoenix flare on that ship to ignite and fly into even more ships has stopped any sensible shipping company from buying them , even when having to buy more flares after every sea monster attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "dOzkoTHjCVAHYBy1","flags": {},"type": 0,"text": "Filly Lightfinger’s Marble Dispensing Escape Buckle, whereas the wearer secretly triggers the dispensing mechanism that begins to drop hundreds of small spherical metal beads that confound pursuers (and perhaps sometimes the pursued, but I digress…)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "0YXsxE3YqiU9xuQR","flags": {},"type": 0,"text": "Hare’s Legs: boots with straps and springs attached to the bottom. You can jump 20ft. into the air, and a distance of up to 30ft. Every time you land however, you have to make a Dex or str save or twist an ankle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "VtTQT9kJAcveMPEH","flags": {},"type": 0,"text": "Astro Goggles: meant for magical stargazing, these goggles will amplify the light of the stars for you! They also let you see any other small amount of light and inform you if it’s regular or magical light. If too much light falls into it though, they will begin to burn your eye out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "d0iJkaUjElVJ6ZW8","flags": {},"type": 0,"text": "Tilling boots: A set of shoes that move you along via spinning blades meant for tilling up farmland. You move along at high speeds, with very sharp, fast-spinning blades attached to your feet. What could go wrong?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "B2VRU1H4317yor0X","flags": {},"type": 0,"text": "Klick’s Iron Horse: Originally from the world of Eberron, enterprising spelljammer captains have brought these amazing automata to many worlds. Built to be mounts for Warforged, they resemble nothing so much as a 6-legged Clydesdale. Unfortunately, their turning or braking power lags behind their charge power. They’ve wrecked entire buildings, thrown riders off cliffs, and generally can be a nuisance if mishandled.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "tQ6RSHzoUBxRKtxo","flags": {},"type": 0,"text": "Eksni’s Pointed Beam: a small, discreet metal cylinder that fits into the palm of a medium sized humanoid’s hand. The button attached to the side exclaims “Press Me!” In Gnomish scrawl. Upon pressing the button, a spark of energy ignited inside the tube and projects a beam of red light where it is pointed. If held while used it is uncomfortably warm to the touch, and some models have been reported to spontaneous combust upon ignition.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "IUmcqKSeIgB5kHnU","flags": {},"type": 0,"text": "Flammenwerfer: large gun held like a flamethrower because it basically is one. Torch holder at the front in front of the nozzle. Smallish oil barrel with a piston head at the top with a heavy rock or something to create pressure. When fired, nozzle opens at the front which allows oil to leave by being squeezed out by the heavy piston slowly moving down the oil barrel. When nozzle closes it stops naturally. The oil sprays out a thin nozzle so it’s not too much and can be set alight by the flaming torch in the torch holder but still enough so that it can travel a few meters while on fire. Prone to having fire go back into the pressurized oil container which ends about as well as you’d expect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "ZQzlC6V7uxTSkAxT","flags": {},"type": 0,"text": "Leibowitz’s Returning Key Fob:  A key ring and fob that returns to the user at tremendous speed to pelt them with their misplaced keys for 1d6 bludgeoning damage on a failed DEX save.  Leibowitz never did dial back the velocity of the returning enchantment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "adkRDPteO9Ug1CCm","flags": {},"type": 0,"text": "Lily’s Opening Reversal mechanism: While not entirely useful, it’s certainly innovative. A device that when physically operated into any type of door will make it reverse its orientation of opening, if previously you would need to pull the door to open it, you now need to push it and vice versa. It achieves this by twisting the physical structure of the door on its axis, fast and in a violent way so the hinges are on the opposite side of the door arch. When installed the operator must succeed a Reflex save to not get hit by the twisting door or get hit by 1d4/6 blunt damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "YLiNbCPdYX7waIV3","flags": {},"type": 0,"text": "Absinthe Candle: An inventive yet stupid gnome by the name of Dankel found himself in a dark bar.  In an attempt to impress his fellow bar patrons by creating a light just with what he could find around said bar, Dankel soaked a rag in absinthe, pushed it halfway into the bottle and lit the half of the rap hanging out.  It did create a fairly bright but unfortunately quite unruly flame… ultimately causing him to drop the bottle to the ground, starting an even brighter and more unruly flame! …that eventually took the whole bar down with it… An unfortunate accident really, but it led to the invention of a rather effective weapon!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "cu8gaE7K1JGEHbi5","flags": {},"type": 0,"text": "Gelfe’s Hearty Spike: A mechanical spike that is driven directly into the user’s heart. It delivers a proprietary blend of potions directly into the bloodstream through the heart giving the spiked user a heightened sense of awareness (+3 to perception checks) and it also gives the user increased anxiety and an unshakable sense that something bad is about to happen. The user is killed if the spike is removed, oh wait.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "KtvkTis2e1qRweyZ","flags": {},"type": 0,"text": "Tanker’s Underwater Propeller: A device that a swimmer activates underwater and the user holds on to it with their hands as it propels the use forward 60 feet per round for 10 rounds. There is no off switch. After 10 rounds the machine turns off and can be activated again after 10 rounds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "eU6PFAwCgj8MiCaJ"}
