{"name": "Options for the Coat of Many Sides","description": "Over one hundred different options for the Coat of Many Sides.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "JdUcm18uURd1zvlF","flags": {},"type": 0,"text": "Noble Jacket – Gain ADV on any CHR checks dealing with nobility or other people of social status.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "I7pV6kFOkogI7a5A","flags": {},"type": 0,"text": "Warm Thick Coat – Resist cold damage and gain ADV on any CON save pertaining to cold damage","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "GzB0j59rh28BB3Jv","flags": {},"type": 0,"text": "Fancy Red Coat – Any CHR check to barter add your proficiency bonus (expert if proficient)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "pmlaAcScQaNdA0q9","flags": {},"type": 0,"text": "Black Leather Duster – Gain proficiency bonus to investigation checks, on the next failed investigation check you can treat the roll as if you made a natural 20","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "InvOudXe25IrcUeN","flags": {},"type": 0,"text": "Worn Leather Vest – When you talk with common people or skilled craftsman gain ADV on CHR checks","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "kY0dyCbC898KCkSr","flags": {},"type": 0,"text": "Coat of Arms – When this side is chosen gain a random magic weapon (DM’s choice) you gain proficiency with it, and it is a +2. (If the weapon is dropped for longer than 1 minute or if dispel magic is cast on it the weapon fades","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "sPNr7wza4xEyWf5s","flags": {},"type": 0,"text": "Religious Robe – Gain a vestment of a random deity or religious group, you gain ADV on all checks related to that group or deity","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "6OOZLtXvmc4rOHQ6","flags": {},"type": 0,"text": "Cloak of Little Color – looks the same as the coat of many sides but all the colorful patches are replaced by some shade of gray. This gives the user ADV on Stealth checks in dark and dimly lit areas.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "rM9mYp6uTR7QkGPy","flags": {},"type": 0,"text": "Chief’s Cloak – Gain proficiency with Thieves’ Tools, understand Thieves’ Cant. When you make any CHR check with a criminal do so with ADV. All checks with lawmen is at DIS.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "wyXiSqmTenl5ZXEK","flags": {},"type": 0,"text": "Coat of Armor – The coat becomes a set of Full Plate Mail, you are proficient with it and you do not suffer DIS on stealth checks while wearing it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "73uN4F1h1FvoiB3r","flags": {},"type": 0,"text": "Cape of Flames – Visible trail of flames follows you where ever you go. Lights all flammable objects on fire, and deals 1d6 points of fire damage to any enemies who end their turn within 5 feet of you. Gain Fire Resistance","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "r2RUHdaqlFzJa7FU","flags": {},"type": 0,"text": "Invisible Coat – The coat is invisible, anything hidden inside the coat is also invisible (not under or covered, inside) Inside the side of the coat is a hidden pocket DC 15 INV check to discover that doubles as a bag of holding. This bag can hold up to 50 lbs of items. Items can be placed into the coat while in this form but can only be taken out when the coat is in its standard form.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "hku9Q8wzEQPNptX9","flags": {},"type": 0,"text": "Coatie – The coat gains consciousness and starts giving its wearer bad advice","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "RfppwHZjTsA8aLcq","flags": {},"type": 0,"text": "The Patchwork Coat – Allows the wearer to pass unquestioned through the underbelly of society. So long as the wearer does not speak or interact with somebody of higher station, they go ignored by said folks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "haipxQHsNqlwOnRd","flags": {},"type": 0,"text": "The Long Sleeved Coat – The sleeves are several feet long and strapped to the back of the coat. Wearers are restrained though feet are free to allow movement. Must use an escape or performance check to break free of the restraints.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "UeqeeI0DUoYCBoqQ","flags": {},"type": 0,"text": "The Muffler – A nice suede jacket with a high collar that covers the moth and nose of the wearer. This grants advantage on saves against poisonous clouds or smoke and enables wearer to cast purely verbal spells without detection. Wearer’s volume limited to a whisper.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "O8PiklgbzC0gP6UE","flags": {},"type": 0,"text": "The Coat of Many Eyes- You can see in all directions, but you look like a horrifying lovecraftian nightmare.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "rm3qCBNL4UFd7YDw","flags": {},"type": 0,"text": "The Coat of Many Mouths- You can amplify your voice to defining levels, but you look like a horrifying lovecraftian nightmare.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "ncg3hP56JMSF2Zkz","flags": {},"type": 0,"text": "The Coat of Many Ears- You have incredible hearing being able to filter sound and hear far away things, but you look like a horrifying lovecraftian nightmare","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "ACH6Cq1xoXjBgSfj","flags": {},"type": 0,"text": "Pablo Picascoat- At certain parts the coat looks smooth and flowing but at other parts cubes stick out for no reason. Very good for artistic events.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "t4X9CUI7roMfCP6H","flags": {},"type": 0,"text": "Concrete Coat- Characters have to make a STR save or fall to the ground immobilized. Mobility is heavily decreased even if you make it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "Xst9Cfp5l4NBcTWD","flags": {},"type": 0,"text": "Winter Coat: The coat becomes a thick pelt, magically warm, allowing the user to endure frigid environments with no penalties. However, it gives the user 1 level of exhaustion per day if used in not-cold environments.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "89B7R9XiwjtjDkkx","flags": {},"type": 0,"text": "Summer Coat: The coat becomes a light, thin silk, magically cool, allowing the user to endure scorching environments with no penalties. However, it gives the user 1 level of exhaustion per day if used in not-hot environments.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "GolKmjtrEaFgwgAC","flags": {},"type": 0,"text": "Camouflage Coat: The coat gains a coloured pattern, giving the user a +5 bonus to stealth in specific environments. However, it gives a -5 bonus if not on the correct environment. Roll 2d8 on this table to select the environments, rerolling if you get equal numbers: Arctic, Coast, Desert, Forest, Grassland, Mountain, Swamp, Urban","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "oPMq7u4W2zimQ31X","flags": {},"type": 0,"text": "Cloak of Calming. It has an elegant green color. Temporarily changes the alignment of an evil/unaligned enemy to true neutral or neutral good if a nat 20 is rolled.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "1FWfBtqywXUzxDmt","flags": {},"type": 0,"text": "A Red Spandex Suit. Offers full health regeneration once every 10 battles. It also boosts dexterity and constitution.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "IjJOsfwPiSfhNe17","flags": {},"type": 0,"text": "Orange Parka. Very unlucky. Lifts the amount needed for every type of check. If a player dies while wearing this, another player must proclaim “Oh my God! They killed (player’s name)!” and a second player must follow it with “You bastards!”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "hA5g0HpkjWHCXSjd","flags": {},"type": 0,"text": "Coat of Binding – turns into a straight jacket, that binds and gags the wearer. DC 20 to strength or Dex save their way out of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "sngt8lvGlZ80EXwC","flags": {},"type": 0,"text": "Coat Cape – coat flaps in the wind (even if there is none) and allows wearer to fly at half their base speed for 1d10 hours. They are not told how long it will last.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "FaEM9W1lvbN3nwPO","flags": {},"type": 0,"text": "Invisible Coat – coat turns invisible. Wearer does not. No other special abilities","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "JSK8xDuxxd5ny41Q","flags": {},"type": 0,"text": "Tuna Coat – The cloth turns into oily fish skin, and the wearer gains water breathing capacities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "xvRbvck9WLWDlDot","flags": {},"type": 0,"text": "Porcupine Coat – The coat grows spikes on the outer surface. Creatures attacking the wearer with their body must make a CR 15 Dex check. On a fail, they take 1d6 piercing damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "eqcMVw3gt31xICl6","flags": {},"type": 0,"text": "Cat Coat – The coat grows a furry tail, and the wearer gains +2 on stealth and acrobatics checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "c8x485S3iw5emvUo","flags": {},"type": 0,"text": "Rust Monster Coat – The outer surface of the coat becomes the skin of a rust monster. Any metal that touches it is immediately rusted, but the wearer can still take damage from it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "xXWQxG5YjTyc8KH8","flags": {},"type": 0,"text": "Dragon Coat – The cloth turns into colored dragon scales, and the wearer gets a 15 feet long conic breath attack that deals 5d8 damage. Roll a 1d6 to determine the color: 1 – Red Dragon: fire damage; 2 – Blue Dragon: electric damage; 3 – Green Dragon: poison damage; 4 – Black Dragon: acid damage; 5 – White Dragon: ice damage; 6 – Rainbow: the wearer controls which elemental damage to use.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "AsopHDKElzkovNKW","flags": {},"type": 0,"text": "Coat of Fur – the coat runs into an animal skin of your choosing","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "NDcOonFVR7tUXmla","flags": {},"type": 0,"text": "Coat of Paint – the outer layer of the coat becomes sticky and wet. Applying it to something covers the object in paint of the coats color.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "OXwdgKx7pUZHW2cH","flags": {},"type": 0,"text": "Cloak of Storms – whenever a creature melee attacks the wearer they take 1d6 lightning damage and must succeed on a DC 13 saving throw or drop anything they are holding. The wearer is also resistant to lightning damage","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "vvugSwWUNZpWZICX","flags": {},"type": 0,"text": "Nightgown – You cast the sleep spell as if using a 5th level spell slot once when you get this coat. You also only need spend half as much time resting to achieve a long rest whole wearing this gown","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "GYUPuJv3fk52Hjso","flags": {},"type": 0,"text": "Coat of Many Coats – Inside the pocket on this side is 1d4 more coats, that are normal nonmagical coats, that look akin to the Coat of Many Sides","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "p8RiTxFrju2n2Z1o","flags": {},"type": 0,"text": "Ancestral Coat – you take on the appearance of a relative of the person to whom you are speaking.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "DWWs5ssudwYXYMmM","flags": {},"type": 0,"text": "Cloak of Rage. It has a bright orange coloring. It raises strength, but lowers every other stat of an enemy. The CR of the enemy rises by 2.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "uAEqHO1zQ8ImfbTg","flags": {},"type": 0,"text": "Tuxedo and top hat. Earn respect across the land. Get offered more high value gear, but for a higher price.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "V9mMlys0kkKAZ84T","flags": {},"type": 0,"text": "Peasants’ robes. Earn a discount at shops, but for low quality gear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "xkgjBRy40MvpOOgF","flags": {},"type": 0,"text": "Cloak of Good Luck. It is made of four leaf clovers, with a lucky horseshoe on the chest. Three slot machine style 7s line on the back. Lowers the amount needed to any kind of check. Also gives the player a chance to get random gold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "u5BKpFE0J5D8JIGx","flags": {},"type": 0,"text": "Cloak of Bad Luck. A grey cloak that is covered with the number 13. A broken mirror sits upon the chest of the cloak. Three irritated black cats line the back. Increases the amount needed for any kind of check. Random traps and enemies appear as well.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "XPGrhohigkYTgaP0","flags": {},"type": 0,"text": "Raincoat of Wetness – Coat continually looks like you just came in from a rainstorm dripping on the floor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "YcrgoBjJvam67K63","flags": {},"type": 0,"text": "Coat of Worms – Looks like worms are crawling all over you where a coat would normally hang. They occasionally drop off onto the ground.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "C73dGHh27oOliYbu","flags": {},"type": 0,"text": "Coat of Distortion – Has optical illusions of black and white swirls all over. Anyone inspecting the coat closely causes confusion per the spell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "4tfE7or3gRlIparY","flags": {},"type": 0,"text": "The Pettycoat – This sharp looking coat is made up of red fabric lined with black trim on the sleeves, collar, and lapel, and is decorated with swirling purple designs across the chest and shoulder that are somehow unpleasant to look at. Wearing this cloak gives the wearer advantage on Charisma checks that are about something trivial or insignificant. When the coat is being actively used, the designs begin to writhe slowly and unnervingly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "LxaGq4mEUmavcl9g","flags": {},"type": 0,"text": "Farmers coat – an old battered, but sturdy brown coat that gives an air of ruggedness and attunement with the earth. Add proficiency bonus to nature and handle animal checks, but -1 to AC. Starts day with 1d4 handfuls of buckwheat in pockets. Refills each long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "jGkl9lQ8yipIVnEK","flags": {},"type": 0,"text": "Goldilocks Coat – Roll 1d4. On a 1 the coat is way too small; on a 2 the coat is a bit tight; on a 3 it’s a bit loose; and on a 4 it’s comically big.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "KDstRiXCfWwSM79q","flags": {},"type": 0,"text": "Coat of the Binary – This a lovely, warm, well-made, and fashionable coat, but it is cut in a style that is distinctive to the gender that the wearer is not. If the coat is given to someone of the opposite gender, it transforms to be for the opposite gender to them. If it is worn by a person with no gender or a gender other than “male” or “female,” the coat retains its most recent appearance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "INmEZZOzB0p2Ubq9","flags": {},"type": 0,"text": "Snakeskin Coat – The wearer’s resistance to cold is lowered, and speed is reduced to half when in a cold environment. However, at an unspoken command, the coat allows them to ‘slither’ free of any tied or locked bonds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "8NzXBwDAOW24uTpk","flags": {},"type": 0,"text": "Displacer Coat- made from the hide of a displacer beast, it casts an illusion of the wearer a few feet away from were they actually are. The wearer can attempt to change the distance and direct of the illusion with with an arcana check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "aggaPGmbVxPezSma","flags": {},"type": 0,"text": "Stoneskin Coat – At a spoken command, the surface of the coat changes into many fist- to head-sized stones. This provides a bonus to concealment in rocky environments, but failing a strength check will render the user immobile and trapped under their weight, as well as suffering 1d4 damage per round.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "oepKBR3L4gswGSjU","flags": {},"type": 0,"text": "Coat of Many Stones – The user will be able to reach into any pocket on the coat and produce a stone suitable for slinging or throwing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "V2McLFeHAMrwP4TR","flags": {},"type": 0,"text": "Stoned Coat – The user will be able to reach into any pocket on the coat and produce a small amount of a locally-available (possible illegal) drug. However, this item is not produced out of thin air. It is actually teleported away from the nearest mundane source, and will raise suspicion in the rightful owner. Using this power also makes the coat exude a strong smell of the substance so acquired.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "KSNXWVzlWSW7hSHa","flags": {},"type": 0,"text": "Cloak of Memories – This loose cloak is a nondescript grey in color, but upon close examination a subtle swirling pattern can be seen. The cloak has two magical effects, with a fifty percent random chance of either occurring: Remembering: Anybody interacting with the wearer beyond casual contact will, for good or ill, never forget them. Every action, every word, every detail will be recalled with perfect clarity, and may result in an unhealthy obsession; Forgetting: Anybody interacting with the wearer beyond casual contact will forget everything about that interaction upon leaving the wearer’s presence. Anybody so affected will gradually become aware that they have a gap in their memory, and may address the issue as situationally appropriate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "orUDQskaJmEB0bku","flags": {},"type": 0,"text": "Tribal Garb – a shamanistic set of vegetal robes that give you advantage for religion and performance checks for rituals and stealth rolls in overgrown or jungle-like environments, but disadvantage on stealth rolls in more urban environments and intimidation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "j9FWf3n57Co17dw2","flags": {},"type": 0,"text": "The Coat of Batkin – the coat turns black and grows to the size of a cape. It now grants the wearer double proficiency in melee attacks, increases their STR by 2 and gives their voice a gravely, deep tone (despite of race or gender). It also neglects fall damage, and once per short rest, the wearer can use a bonus action to gain a flying speed equal to its walking speed for 1 round.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "kKTcqvJOd757pvtR","flags": {},"type": 0,"text": "Coat of Arms: the coat appears to be made from dozens of arms harvested from a variety of races and species. If the arm would normally have a grasping hand (instead of say, a hoof), it does so here, and can be used to hold a small object. The coat has no pockets, and items held by the hands are visible to all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "jptifXARbVQsIQdo","flags": {},"type": 0,"text": "Coat of the Dream Druid: it gives the wearer ADV on interpreting dreams (knowledge arcana) and animal handling. It does, however, make the wearer insufferable.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "2DPpPZAslvzvLgYW","flags": {},"type": 0,"text": "Coat of No Return: When worn, the player cannot exit a room from the same threshold they entered in from. If the player dies wearing the coat, they cannot be resurrected.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "gNXdqgpskQPff6Lu","flags": {},"type": 0,"text": "Coat of Camelot’s Widow: a double-breasted, strawberry pink coat with a navy trim, stained with the blood of a murdered monarch (the last bit optional if you are squeamish—or gorier if you relish it). The wearer gains the benefits of the True Appraisal spell and gains a bonus to persuasion checks when negotiating with art dealers and home decorators.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "SMMl3m4vMwi3b0PO","flags": {},"type": 0,"text": "The Emperor’s New Cloak: The cloak almost disapparates but gleams majestically. When worn it grants the wearer a bearing of nobility and they gain a charisma bonus of +5. However, when a NPC or player succeeds on a perception check of a 25, the wearer appears naked to everyone in eye shot.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "0ouMsanMxqQmHTwh","flags": {},"type": 0,"text": "In Sheep’s Clothing Coat: The wearer is transformed into a helpless sheep. The user is unable to take the coat off for 1d6 hours. Allows the player to communicate with other sheep, goats.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "ENRJAmDRkoIsPASF","flags": {},"type": 0,"text": "Technicolor Dream Coat: this coat of many colors can be worn during a long rest to have dreams that predict the future.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "BXsePyLobVqh45X1","flags": {},"type": 0,"text": "Three-Armed Coat: A third sleeve on the back of the coat hides a ghostly, blue arm. The arm grants the wearer an additional reaction before their turn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "uMztv8sH7v0REk6w","flags": {},"type": 0,"text": "Shrunken Coat: With a command the wearer can change size. The size is randomly determined but must be smaller than the wearer is currently.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "YOKwVcajqz39L3Ci","flags": {},"type": 0,"text": "Coat of Gilly: This coat appears messy, and is covered in detritus. Advantage on stealth while still, disadvantage if moving.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "4eRXOVd21qTYptDN","flags": {},"type": 0,"text": "Kender Coat: Brightly colored with many pockets. If the wearer needs any non-magical item, roll a d4. If you roll a 4, you find the item in your pocket. May be used once per coat-shift, twice by halflings.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "SoDH2h4f4DycqG2W","flags": {},"type": 0,"text": "The Marquis de Carabas’ coat: It’s a formal black knee length coat filled with hidden pockets. The PC must make a perception check of 15 to find what he is looking for in the coat. On a perception of 25 or more the PC discovers all items hidden in the coat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "9NYiKU6uTNB3rtIy","flags": {},"type": 0,"text": "Coat with Nothing to Declare: Allows the wearer to enter any city or port if they are carrying no luggage and respond to any questions by authorities in fewer than 3 syllables. The wearer also waives any custom fees. Inside pocket magically contains documents and identity papers that corroborates the wearer’s claims.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "PFqVV09dzQ2kusQs","flags": {},"type": 0,"text": "Beaver Coat: this furry side of the coat instantly blends any wood it touches. Can protect the wearer from damage from wooden weapons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "S1XvDwcTYbtvj2IV","flags": {},"type": 0,"text": "Firefly Coat: looks normal, but glows in the dark when the wearer is horny.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "OA1qW3emWq5gn4yj","flags": {},"type": 0,"text": "Crow Coat: made of black crow feathers, grants the user a +3 Intelligence bonus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "EnIZKVBLBAEfxW3W","flags": {},"type": 0,"text": "Owl Coat: made of white owl feathers, grants the user a +3 Wisdom bonus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "OP75sOAMj8WzUuwu","flags": {},"type": 0,"text": "Spider Coat: this chitinous side of the coat makes the user’s hands and feet (or gloves and shoes, if worn) sticky, giving them climbing speed equal to half their normal speed. Roll a d20. On a 20, the coat becomes a Spider Dragon Coat, that also has the ability to spawn a swarm of spiderlings that will fight for the wearer, once each two rounds, without costing them an action.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "BT3GnjQJEXCmf1pr","flags": {},"type": 0,"text": "Human Coat: looks normal, but turns the wearer into an egocentric asshole.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "CJSWOrJhrH0ALuRD","flags": {},"type": 0,"text": "Kenku Coat: this red, silky coat side makes the wearer able to replicate any sound they ever heard. People listening to it must pass on a CR 14 Perception check to know it’s an imitation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "mNd1Xa3YL7LNSX7O","flags": {},"type": 0,"text": "Mimic Coat: looks like a dark, chaotic mass of tentacles and pseudopods, until the wearer wills it to make them look like something else. The perfect disguise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "r7WKg2SzpJtsymtA","flags": {},"type": 0,"text": "Queen Velour’s Gown: Resembles Velour’s form fitting red garb that she wore when she battled Shea Couleé for the crown. When the wearer successfully hits an opponent, rose petals erupt from the point of contact and the party gains +1 morale bonus for attack rolls and saves (cumalative for up to 4 points). At will, wearer can cast Lock Gaze, granting your allies concealment. Ain’t it shocking what love can do?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "wjOFPaO89zp7DrU2","flags": {},"type": 0,"text": "Coat of Narration: the coat takes in the appearance of a normal cost for the time period but an audible narration is heard by everyone in a 10 ft radius. Stealth rolls are at a disadvantage towards creatures within this radius.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "2asEjZeCDRq21uCd","flags": {},"type": 0,"text": "Coat of Annoyance: The coat resembles a normal looking coat but has a mind of its own and reacts to the wearer’s movements and thoughts. The coat does not hesitate to annoy the wearer by becoming stiff, itchy, and could even become a straight-jacket if the coat is feeling devious enough. The only way to please the coat for a while is to give it coins in its pockets.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "f6RVynt8w6YJOjE4","flags": {},"type": 0,"text": "Coat of Androgyny: removes any sign of gender.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "E2KJ3rJSaiSL2OCU","flags": {},"type": 0,"text": "Coat of Many Races: wearer looks like themselves except if they were a different race. No change to stats.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "YRjLhfXsjhYSVcQy","flags": {},"type": 0,"text": "Cardigan: gives the appearance of being a little old man/woman wearing a cardigan. A packet of mints or butterscotch appears in one of the pockets when transformed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "gahpaZMkz7UtzXf9","flags": {},"type": 0,"text": "Coat of Melodrama: everything the wearer says is said in the most melodramatic way, regardless of how mundane the topic might be","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "4sPuGAtju5FwWKDS","flags": {},"type": 0,"text": "Turncoat: switches the wearers alignment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "xh0XQ6KDvz9bU52b","flags": {},"type": 0,"text": "Reign Coat: makes the wearer look identical to the current reigning monarch. Can open many doors but best hope you don’t run into the real deal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "L76mUfWfEvBWaRXS","flags": {},"type": 0,"text": "Lab Coat: turns the wearer into a Labrador, though they maintain their own mental stats. Bonus on alchemy checks in this form, though disadvantage to trying to make stuff because paws.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "TePlpGPzCnz7Ft70","flags": {},"type": 0,"text": "Peacoat: looks like a well made peacoat, is nice and warm and give advantage on nature checks relating to vegetables.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "WZKLGo0P4rcgHcXH","flags": {},"type": 0,"text": "Coat Rack: gives the wearer the appearance of having a gorgeous set of boobs. Doesn’t change gender.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "4JqGaWLrzS2JuTkE","flags": {},"type": 0,"text": "Vested Interest: transforms into a vest and any NPC they talk to will be very interested in them and try to prolong the conversation, for better or worse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "oUbYaBiIE7BOOplo","flags": {},"type": 0,"text": "Full Metal Jacket: wearer becomes encased in metal as per the tin man from wizard of oz. Bonus +2 to AC, but speed reduced by 10 ft and must take a bonus action every 2 rounds to grease the joints.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "KFskcLek94xdzDBf","flags": {},"type": 0,"text": "Fuzzy Jumper: transforms into a fluffy woollen jumper. Can cast the jump spell at will.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "GSKutPiT1WP02QfX","flags": {},"type": 0,"text": "Christmas Jumper: transforms into an ugly Christmas sweater. Neutral NPCs will become friendly as they share a laugh at how silly the jumper is.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "9wBbbXu85Lxkd7yY","flags": {},"type": 0,"text": "Double Coat: Combines the effects of two other coats on this list! Roll two more times, ignoring this result.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "m8iF7LiwWqNjysGG","flags": {},"type": 0,"text": "Coat of Invitation – While wearing this shimmering silver coat, you can cast Disguise Self at will, and can produce a blank piece of paper that will serve as an invitation to any event needed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false},{"_id": "iASdY6CW5uNBGcDg","flags": {},"type": 0,"text": "Copy Coat- Coat that allows initial owner to take on the appearance of the last person that wore, and it reveals their actual form. If someone with their own appearance altering enchantment wears it, what they hide is revealed when worn by owner of the coat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [101, 101],"drawn": false},{"_id": "CmavOsa67S8E4NzK","flags": {},"type": 0,"text": "Coat of the Arachnid- A silky looking coat that is made from spiders web that you can unwind at will and allows you to utilize at your will. Let’s you make traps, security systems, and let’s you track movement.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [102, 102],"drawn": false}],"formula": "1d103","replacement": true,"displayRoll": true,"_id": "w150pQiqHl8MZoay"}
