{"name": "Types of Alcohol That Can Be Purchased In Taverns","description": "You must be at least 210 elf years old to purchase!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "7XmOPAUdst5vXRYN","flags": {},"type": 0,"text": "Mordenkainen’s Magnificent Malt: A beer with just a lower alcohol percentage, for the adventurer that expects he needs to be sober for the upcoming nights.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "FB98sQmiuyjWgR05","flags": {},"type": 0,"text": "Mordenkainen’s Malificent Malt: A beer with an alcohol percentage similar to that of whiskey that has its own plans for naive adventurers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "leTQBsbCts0OCE8I","flags": {},"type": 0,"text": "Elven Absinthe: With an herbal taste, one can easily see why it is a popular drink among the elves. Drinkers take care, though, as it is much more potent than it seems.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "uR8ambyIr8A8XUlJ","flags": {},"type": 0,"text": "Underdark Ale: It isn’t really from the Underdark, but the brewers figured the name would be eye-catching (they weren’t wrong). It is a dark, potent Burton ale found in pretty much every tavern.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "kBL051fzJ7dF69Ao","flags": {},"type": 0,"text": "Goodberry Sangria: Delicious, nutritious, and pricey, this sweet concoction is a fan favorite.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "dtDkHY1TMdCheJIv","flags": {},"type": 0,"text": "Devil’s Blood Whiskey : Nobody knows whether there truly is devils’ blood in this aged whiskey or not… but the feeling of fire in the chest definitely seems to support the claim.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "qzwRkoU6S8d4v4dM","flags": {},"type": 0,"text": "Gore: Fermented pigs blood and cane sugar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "2d6Q9Yygv5EiyieT","flags": {},"type": 0,"text": "Iced Lager: From enchanted casks. Tastes as cool as the northlands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "Zw2mcpEFGLxjXcG8","flags": {},"type": 0,"text": "Draconic Ale: A strong but rather basic ale; there are 10 additional varieties of it based on the chromatic and metallic dragons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "3qtLOzFTsYtAI6Q2","flags": {},"type": 0,"text": "Red Draconic Ale: Infused with cinnamon; feel the burn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "hf3gHL1RensB3mnE","flags": {},"type": 0,"text": "Blue Draconic Ale: Infused with prickly pear cactus; causes slight static charge when drank.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "gj3oOTQie71H5Pn4","flags": {},"type": 0,"text": "Green Draconic Ale: It feels like you’re drinking straight poison, this ale is so strong.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "2b3hevuNmmMUNAaz","flags": {},"type": 0,"text": "Black Draconic Ale: Infused with various citrus to give it a slight acidity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "LnKx9JCTkjPV8d2o","flags": {},"type": 0,"text": "White Draconic Ale: Magically enchanted to stay close to the freezing temperature of water. You can feel it go all the way down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "Qqgs5q1cJM4mbhsd","flags": {},"type": 0,"text": "Copper Draconic Ale: Infused with ginger; causes you to hiccup a few times.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "eKqCvfCm3E3KCY4V","flags": {},"type": 0,"text": "Bronze Draconic Ale: Infused with coconut and pineapple. Smells like the sea.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "9s93FgAcXXWC1zAj","flags": {},"type": 0,"text": "Brass Draconic Ale: Infused with agave; makes you slightly sleepy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "dgElVDu2OECUMyvH","flags": {},"type": 0,"text": "Silver Draconic Ale: More of a cider than an ale, it is magically enchanted to be the perfect temperature for the drinker. It is made using the finest apples.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "IQladTT0LlhNSFj1","flags": {},"type": 0,"text": "Gold Draconic Ale: Infused with cinnamon, little gold flakes can be seen floating within. Causes the drinker to belch small harmless flames for the next 5 minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "Hn2V02vrpEh7xS2p","flags": {},"type": 0,"text": "Patrons Pint: A drink that shifts its type to correspond to the drinkers chosen patron/deity/inspiration. Dark ale with foam in the pattern of tentacles for a Great Old One, pale ale with an evershifting cloud for Archfey, and spiced mead with a bubbling fire at the base for the Fiend patron.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "2MhinwpLwxYip9aM","flags": {},"type": 0,"text": "Cave Breath Hard Whiskey: Of gnomish make. Gnomes don’t do much alcohol, so when they do, you know they’ll apply the same wacky engineering to make a bottle of essentially 50% rubbing alcohol and 50% gasoline that will 100% get you effed up.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "O0lBRBwdihpSd6cB","flags": {},"type": 0,"text": "Bubblegut Ale: A dark, heavy brew with hints of clover. I bet you can’t drink a pint without burping.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "mZZkzBa3GFRiXE4T","flags": {},"type": 0,"text": "Frost Giant’s Kiss: A chilled shot that leaves your breath frosty for 12 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "CkOKRKm9U7Dxgjy6","flags": {},"type": 0,"text": "Red Fez: A heady palm wine brewed in the desert regions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "gNsO5I2jUOz7p7gf","flags": {},"type": 0,"text": "Tectlate: An ancient fermented corn drink. Based on a thousand year old recipe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "NDNBZTCBZxwFcg6r","flags": {},"type": 0,"text": "Miguelabu: It’s a drink that is based off of Malibu but with an aasimar’s twist.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "Qop6PQNppg5Qv2HA","flags": {},"type": 0,"text": "Awakened Wine: A vineyard owned by a druid who cast Awaken on his vines. Claims it creates better wine when working with the plants input.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "HmQzPf2JglXW7GBK","flags": {},"type": 0,"text": "Spore Wine: A svirfneblin wine made from crushed mushroom. Despite being considered top shelf due to its difficultly to obtain, most surface dwellers find it stomach turning. Definitely an acquired taste.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "J7bIfUuBfHnRb8KD","flags": {},"type": 0,"text": "Pixie Cider: Served by the teaspoon, this surprisingly potent drink leaves the drinker seeing stars and “pixie dust” trails behind all other creatures for 1d4 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "RLBP4wAI6tYkAJ0Q","flags": {},"type": 0,"text": "Vegan Blood Wine: Wine that has been magically flavoured to taste like blood, for the socially conscious vampire.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "ERAS39RNAkub0n9J","flags": {},"type": 0,"text": "Zombie Whiskey: An out-of-touch elf decided the undead were “in vogue” this season and created this whiskey from grains soaked in rotting carcasses. Tastes absolutely awful but somehow leaves the drinker without a hangover.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "FD2vr1yu5ysQrKz0","flags": {},"type": 0,"text": "Jungle Juice: A spirit from Chult, made from berries grown wild in the jungles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "dFHUOehOd4xdj4Um","flags": {},"type": 0,"text": "Ver-poo-th: A derogatory name for a vermouth from the moonshae isles that is made from cherries that have been eaten and defecated by a native tree cat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "eXlDocOj4GzYCSgZ","flags": {},"type": 0,"text": "Orcish Rotgut: A surprisingly pleasant tasting, blood red alcoholic beverage, with secret ingredients that hide the fact that it’s incredibly potent. Those particular ingredients do not sit well with non-orcish guts. Anyone drinking it that is not an orc or half-orc must make a DC 15 Constitution saving throw a half hour after drinking it (separate from any checks that might be made to resist intoxication). Failure means the drinker feels painful nausea for the following 12 hours, during which the drinker cannot benefit from short or long rests and suffers disadvantage on attack rolls, saving throws, and ability checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "7aWb34x16oGL3Q8j","flags": {},"type": 0,"text": "Korin’s Dragonmint Mead: A delightfully light and crisp drinking mead that has a hint of herbal flavors and a tiny finish of mint. Tastes awful to paladins for some unknown reason.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "Xy2RwEpSK5NI0ZSr","flags": {},"type": 0,"text": "Kobold Kombucha: Comes in all the chromatic flavours, perfect for your hippie-dippie druids and teetotaler paladins.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "PDJoJeMD1pkOFopP","flags": {},"type": 0,"text": "Rubyrump’s Red Ale: Made with all the care and love you’d expect from a dwarf with the name Rubyrump. A warm inviting red ale with a smooth finish. A winking dwarf caricature with a foamy flagon and “It’ll put that ruby twinkle in yer eye” written in bold yellow letter on the barrels, crates, bottles, limited edition flagons, etc.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "n29Ms8CVPkMU2g6S","flags": {},"type": 0,"text": "Jotenhiem’s Ringlefich Brandy: Suprise suprise. Who would have guessed some of the best brandy in the region comes from some very outlander-ish Dragonborn living in the mountains. A favorite and well kept secret amongst the locals of the area. Best served warmed and paired with aged goats cheese.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "rtfHnZkuVrfqpsIJ","flags": {},"type": 0,"text": "Denurs Golden Ale: A light beer with moderate hoppy finish and a crisp mouthfeel with the smallest notes of hickory and rasberry. Simple enough to be enjoyed casually, but with just enough hidden suprises for a beer lover to find interesting.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "h05TqQgewjrIsoDD","flags": {},"type": 0,"text": "Gerlach’s Winery: A merlot grown by gnomes. They say the process with which they make this particular merlot is actually a secret formula locked away in a vault guarded by two ogres too dumb to read but too smart to turn down the gold the Gerlach family puts up for their services.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "ZjuNC9JDGLycX9d5","flags": {},"type": 0,"text": "Gentleman Jim’s: The mass produced whiskey that comes from the city in large shipments. Straightfoward and simple, cheap but effective for livening up a party. The black bottle with flourishes on its print is easily recognized by whiskey savant and dullard alike.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "RUG3KR3x8tLzoUpP","flags": {},"type": 0,"text": "Shanty Shandy: Allows the drinker to “see” musical tunes hanging in the air. Taking a swig before dancing dramatically improves one’s skills. Powerfully addictive to bards, as it connects them with music on an intimate level. Bards who imbibe will soon be unable to play without it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "Qd39faOH41wTMEvx","flags": {},"type": 0,"text": "Goblin Gutrot: Brewed in a local cave by the smartest of goblins, this stuff is your one copper for two flaggons. It will destroy your liver, tastes like shit and may have negative impact on you from cave rot. But at 2 tankads minimum per copper, sometimes you just want to get drunk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "v7uoWZ3uswUqq52X","flags": {},"type": 0,"text": "Brandis’ Brandy: Named after a famous pirate captain, this brandy is cut with seawater, and the barrels it is aged in are submerged in the sea for a year before it is served to the patrons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "50yoN7SGVUNnyTnd","flags": {},"type": 0,"text": "Stahn Brown Ale: A rich dwarven-brewed ale, dark in colour and very strong in flavour. Regular consumption results in an inability to feel the cold, refusal to wear a coat even when snowing, and an immense craving for finely sliced spiced lamb with salad on a flatbread.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "CRqv7WuFEZdRfXWi","flags": {},"type": 0,"text": "Rats Piss: Served in goblin bars exclusively, in a stitched-up ratskin. Extremely powerful drink. It is customary at goblin parties to “drain the rat” by squeezing the skin dry in one go, similar to doing a yardie at a 21st.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "2hGYuXuFFHtNiFYa","flags": {},"type": 0,"text": "Moody Cider: Made from the apples of treants. However they were feeling when the fruit was harvested is the emotion that the drinker will experience for the next hour. Every drink is a gamble! Exuberance, depression, fits of laughter, shyness, love, or confusion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "NM8ABlNC8PWPbR62","flags": {},"type": 0,"text": "Ooze Bane: A brutally strong and rough spirit that doubles as a solvent for oozes and jellies!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "UIpyFI1cc0vOFzSA","flags": {},"type": 0,"text": "Choke Ale: A nearly undrinkable goblin beverage made from fermented garlic. It is traditionally served with chunks of garlic floating in the glass, hence the name.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "G0S08hHGTH2ZWJ6L","flags": {},"type": 0,"text": "Gru’sh: Made of the bladders of large sea-life, this coastal inn sells this oily black beverage in large serving sizes. It is extremely potent, and had it not been for its fluidity, it would be extremely hard to keep down. If spilled, you must make a Dexterity DC10 Saving Throw to not slip on the tile it was dropped on or fall prone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "GpHF3Wjxpuj76Y6z","flags": {},"type": 0,"text": "Dwarven Tomb: Also called a Pondahl Tafone by elitists who don’t want to sound like a ruffian when they order it, this drink is a dwarven-made black mead. Besides its blackcurrants, it has a very earthy flavor and a grit to it. While someone who calls it a Pondhal Tafone would likely explain to you in depth that the earthy flavor and grittiness comes from a complicated and sophisticated fermenting process involving fresh roots that only a trained pallette can detect, the validity of this claim could be brought into question as the beverage is traditionally served in an unhewn stone cup. Something which those who call it a Dwarven Tomb, spare no time in pointing out, much to the frustration of their well dressed counterparts who are often mid-explanation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "fv8pgl5TCEO4vkir","flags": {},"type": 0,"text": "Dark Smoke Bourbon: The best bourbon can only be appreciated with a fine cigar. That’s why every bottle has a box included.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "ErfhVjWepneZsbJI","flags": {},"type": 0,"text": "Party Poppers: A magic cider that has a prize appear after it is drunk. It’s bottle cap also has numbers that act like a lottery.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "KryKK5toDlvXKhpt","flags": {},"type": 0,"text": "Black: A thin translucent black liquid that tastes somewhere between salt water and acrid smoke. Burns going down, ignites at the faintest rumour of a flame, but it’s cheap as it comes (2cp for a bottle big enough to knock out an average human).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "rfMTshqAXC4czr31","flags": {},"type": 0,"text": "Brown: Looks like thick opaque brown ale with a lighter brown foam head. There is a noticeable delay when pouring and it will develop a skin if it sits out for too long. Tastes like strobg, creamy, slightly-acidic ale, but fill you up like a good lunch. Often described as a “Meal in a Mug”.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "Xptlg1SvG7TOVpaA","flags": {},"type": 0,"text": "Lathander’s Light Ale: A pale ale brewed by the clerics at a temple of Lathander. Rumoured to grant minor boons to followers of Lathander, which the temple will neither confirm nor deny.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "mM93Mxf8o5db8qe5","flags": {},"type": 0,"text": "Borovian Wine: A rich blood red in colour, the bartender doesn’t remember ordering it, but found it in the cellar so figured he might as well sell it. Not suspicious at all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "IQoJQ6zFf8qwFZhg","flags": {},"type": 0,"text": "Beholders Tears: A clear spirit that causes very vivid dreams the next time the drinker sleeps. Actually just made from a plant know for it’s hallucinatory effects but that doesn’t make for an exciting name.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "2t1gEU2cz6mR5Bgz","flags": {},"type": 0,"text": "The Princess: A reddish spirit with a fruity taste. Because of the sweetness, the colour and that is sometimes served with some flower inside the glass, some people may think of it as weak, but is extremely potent and usually a few glasses are enough to wake up the morning after with no recollection of what happened.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "knnJldrrewRvQZWN","flags": {},"type": 0,"text": "Dragonblood: A dark red wine with an addition of some spice. It’s called Dragonblood becouse of the colour, the fact that is served warm, and it’s very spicy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "afpx9jRr26dCnzeO","flags": {},"type": 0,"text": "Fairy Gift: A liquor with an herbal flavour and a distinct light-blue colour. The colour is given by some rare plant and can remain for some time on your tongue or your lips","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "7m09bNd81VZsnUdG","flags": {},"type": 0,"text": "Holy Springs Golden Ale: Claims to be made from water drawn from a sacred stream and then blessed by a prophet of the gods. Everyone knows it’s all bullshit but drink it anyway because it’s super tasty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "14ghoyVytuuxPDN0","flags": {},"type": 0,"text": "Nilbrew: A noxious brown liquid that is legendary for its terribleness and high alcohol content. People ritualistically drink this foul brew calling the process “taking the wanderers journey” due to the tendency of these impromptu acolytes to end up in the most unusual places.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "zTN3KSN5uR5dfDgU","flags": {},"type": 0,"text": "Druidic Sangria: Messes with your visual color spectrum","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "9potlN1P9Qyo4WoM","flags": {},"type": 0,"text": "The Walking Red: A unassuming dry red wine that the players are instructed to “let breathe,” for a while before consumption. The longer the player lets it sit, the more it seems to actually be breathing. If left long enough, it will crawl out of the mug and wander away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "yeJY3wP2QQeKtODA","flags": {},"type": 0,"text": "Elven Ale: Made with a recipe stolen from a dwarven brewery. It’s drinkable, but not great.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "OVGirhS5uddpbjFG","flags": {},"type": 0,"text": "Dwarven Wine: Made with a recipe stolen from and elven winery in retaliation to them stealing a beer recipe. Slightly more successful than the elvish attempt at beer, but not by much.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "jwJV7yxPkHNE4Ht1","flags": {},"type": 0,"text": "Belbuck: A transulent green, spearmint beer favored by halflings.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "hbxUV6EwKqVZx57b","flags": {},"type": 0,"text": "Blue Eyes Wine: A halfling wine made from blue grapes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "UCxqLwONc3JDJWbB","flags": {},"type": 0,"text": "Luiren’s Best: A black-as-ink, very sweet stout. Brewed by a coastal clan of Luiren, Smokardin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "ypucbyiLQctGjvvh","flags": {},"type": 0,"text": "Pulsch Brown Ale: Halflings make this. It has a pleasant, nutty flavor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "wIGrP47fLkelxgAP","flags": {},"type": 0,"text": "Moon Mountain Ale: Very popular drink from the Moon Mountain Brewery in the Forgotten Realms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "TGtySHXxzrJMYUte","flags": {},"type": 0,"text": "Stonesulder Wine: This yellow-hued, sharp-flavored liquid is made by the sap from demon plants from the Abyss, which is then fermented in wooden barrels.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "vXkffsi7rdqbidNe","flags": {},"type": 0,"text": "Aelfengrape Wine: This elven drink is extraordinarily potent but doesn’t have a refined taste. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "h76BrIVA7EZIwdCl","flags": {},"type": 0,"text": "Elven Aleeian Wine: Grapes plucked from wild vines deep in the forest. Takes several months to create one batch.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "u94meeNFZnvuWpxr","flags": {},"type": 0,"text": "Dwarven Garnet Wine: Made from grapes high in the mountains.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "Pq3i2TDceDT2Yw5J","flags": {},"type": 0,"text": "Dragonbite Bitter: Exceptionally dark beer. Recipe is centuries old, only the Dragonbite Brewery makes it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "Un6HFvno23GxepKE","flags": {},"type": 0,"text": "Dwarfhead Stout: A powerful, “day to day” brew favored by warriors. Mostly found in dwarven communities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "1TfxVLJIONTSJykP","flags": {},"type": 0,"text": "Frenzywater: Extremely potent. Bottle may sometimes spontaneously burst into flame if left in sunlight. Might cause a berserker rage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "GVTZ0W26Raggh2ji","flags": {},"type": 0,"text": "Gnome Golden Light: A lightweight beer with flowery accents.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "sLysqH2AMSI8MPTB","flags": {},"type": 0,"text": "Elven Mead: Elves use exotic honey in the forest to make this. Even dwarves like this drink.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "bYTqMZx8nWuJCr3L","flags": {},"type": 0,"text": "Elven Moondrop: Exquisite drink made by experts using fresh dew and moonlight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "oLTeTT5qNAzfBeq2","flags": {},"type": 0,"text": "Moonslake: Minty halfling drink. Alcoholic apple cider that’s been mixed with water in which crushed mint has been boiled, then strained out again. Cool taste, humans don’t like the after-taste.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "flBDnobrMqLB7jLK","flags": {},"type": 0,"text": "Darklake Stout: This drink is a signature ale brewed by the Muzgardt clan of Duergar that live in the Underdark settlement of Gracklstugh in the Forgotten Realms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "2jcDSsxSH2LXbgT6","flags": {},"type": 0,"text": "Tea: It’s just a nice warm cup of tea. Perfect after a day on the town, or a day killing monsters. Have it black, or with sugar and milk if you prefer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "bh5TZwY5pHjDvzjQ","flags": {},"type": 0,"text": "Coffee: For those nights where you need to stay awake on guard duty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "taoDXQXNiWsQIHwI","flags": {},"type": 0,"text": "Three-Ashes Tea: This beverage is a cold, bitter tea, said to aid in meditation. Popular with the Dustmen in Sigil.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "dctdE12DEUf5WxvL","flags": {},"type": 0,"text": "Firewine: Brewed from the Arborean fireseed, firewine is a strong, smoky-flavored wine. It is often consumed alongside fireseeds, as each enhances the flavors of the other when consumed together.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "t0hFb1kXCjoo49Vx","flags": {},"type": 0,"text": "Oathbeer: Dwarves drink this as part of a ceremony to seal a pact, or as a sign of friendship and devotion. All involved swear an oath before a priest, shed blood into the beer, and the cup passed around. Oathbeer binds the drinkers to the oath, as long as they partake of their own free will. Violating the pact brings a curse upon the oathbreaker.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "wsmK7QAH9MOyUd6A","flags": {},"type": 0,"text": "Dwarven Grave Ale: When a great dwarven hero dies, skilled brewmasters are commissioned to create a signature ale to commemorate his passing. It is stored in barrels that have carvings of scenes of the dwarf’s great deeds. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "MRa7bOp4H2bztCIL","flags": {},"type": 0,"text": "Golden Maggot: A terrible name for a surprisingly fruity pale ale. The recipe is a close-guarded secret.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "dHD779dqg1B5lNXK","flags": {},"type": 0,"text": "Island Kava: A dull beige beverage made from a plant root from distant lands. A pungent earthy taste. Will make your lips numb and your brain number.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "XNqWJ5oeaDVhQkth","flags": {},"type": 0,"text": "Jacka’s Salted Mead: Tastes like honey-cured bacon. Looks like foul pond scum.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "dqga1PNcWKKCqTqp","flags": {},"type": 0,"text": "C’Suk’s Fortified Fruit Wine: The label literally says “Will get you pished”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "sX4I21mYVcoqg26W","flags": {},"type": 0,"text": "Owlbear Brew: Cheap and disappointingly watery lager. Inexplicably, the label depicts an Owlbear with massive breasts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "qPPC7VmyZ5IIGKic","flags": {},"type": 0,"text": "Owlbear Premium Brew: A palatable lager that won’t break the bank. The label depicts an Owlbear with unfathomably large breasts and a paper party hat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "lMyaJBcdYLSwoaan","flags": {},"type": 0,"text": "Human Cider: Made with apples, not humans. Touts itself as a ‘genuine human recipe’ and has a picture of a happy farm girl on the label. Pairs well with belly pork.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "icItg3TliyFbdexw","flags": {},"type": 0,"text": "Wyvern 981: A viscous liquor with an indescribable taste. Some have likened it to being punched in the nose with an onion whilst a fond memory kissed you gently inside your throat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "E5dPfKdMjLm17YrQ","flags": {},"type": 0,"text": "Gelatinous Gin: One curious and profitably end point in the wizardly experimentation of Curzan is this breed of gelatinous cube, bottled, intoxicating and relatively safe for consumption. This lively cousin of the Gelatinous Cube dances wildly in its bottle when it is given a little shake, as if it is sloshed itself. Sometimes brewers add flecks of precious metals like gold simply for visual effect and conspicuous extravagance. Typically served in a shot glass, the gelatinous drink goes down with a slightly paralyzing effect giving the drinker a signature raspy lisp. It is sweet from the molasses half-metabolized into alcohol (yes, it’s technically a rum) and flavored by other organic material added in the brewing process—berries are popular, but some adventurous combinations include ghost peppers, whole octopi and cilantro. Left too long on its own, it has been known to sneak out of the glass and crawl off a bar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "q6r01fJHpY4tGRlV","flags": {},"type": 0,"text": "Infernal Absinthe: Dangerous stuff. Functionally a deal with a devil in a bottle, infernal absinthe can produce visions in some, nightmares for others. Most people just pass out. If you drink enough of it, you might be in for a terrifying result.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false},{"_id": "FPAZwXzRkVgONskL","flags": {},"type": 0,"text": "Dwarven Fire Water: Different from dwarvish whisky in that this is distilled in barrels that have to sit next to one of the main weapons forges to absorb the heat of the flames and the bite of the blades. Not a beginner’s alcohol, as it’s quite strong. Dwarves like to see humans try to drink it, only to leave coughing and sputtering like it was their first drink.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [101, 101],"drawn": false},{"_id": "KG10caKopCLkFPNF","flags": {},"type": 0,"text": "Merfolk Vodka: The merfolk have a perfected a strange brewing process that creates a clear alcohol, which will get the drinker epically drunk for an exceptionally short amount of time. If the drinker isn’t used to the sea, they may have a wicked hangover.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [102, 102],"drawn": false}],"formula": "1d103","replacement": true,"displayRoll": true,"_id": "6IKrRPQWw58lR1a4"}
