{"name": "Aquatic Items","description": "One hundred special aquatic items!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "5mRL2y26ylKQ5rte","flags": {},"type": 0,"text": "Ring of Calamari: A silver ring with an octopus on it with emerald eyes. Gives you the ability to use the darkness spell 1d4 times per day rolled at dawn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "J4rYSTfyBjlKwH8j","flags": {},"type": 0,"text": "Dolphin’s Tooth Crown: An ornate crown made of dolphin bones and teeth. Gives you advantage on Perception, Investigation, and Nature checks while underwater.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "3OkpIG8mEet3lxs0","flags": {},"type": 0,"text": "Cup of Yises: when you fill it with water, it transforms it into wine	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "rgoIlALdNCngTKxE","flags": {},"type": 0,"text": "Blue Bag of Tricks: Like the standard item but filled with shells that when thrown turn into (d8): 1) sea horse, 2) dolphin, 3) quipper, 4) constrictor snake, 5) giant sea horse, 6) reef shark, 7) giant octopus, 8) hunter shark	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "Sw2VqF2k9S3hwaBU","flags": {},"type": 0,"text": "Staff of Flowing Water: Requires attunement. An ornate blue staff. The head is a large blue sapphire with a blue and gold setting in the shape of a cresting wave. While attuned to the staff, you can cast Create or Destroy Water, Water Breathing, Water Walk, Control Water without needing the required spell components. Additionally, up to three times per day, you can use the staff as if it were a Decanter of Endless Water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "fJJDdsXySJ64URzE","flags": {},"type": 0,"text": "Message In A Bottle: A glass bottle with a piece of paper inside that details the truth behind a mysterious murder.	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "z0UzPw5WjSclpKlE","flags": {},"type": 0,"text": "A Talking Crab: This little guy can speak common and says he was cursed by a warlock. He wants the party to break the curse, but has no idea how that could be done in the first place.	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "9HRGZM0sbvnpxcqm","flags": {},"type": 0,"text": "Neptune’s “First” Trident: A metal trident with a poorly carved “Neptune’s” on the shaft. Allows the holder to summon an incorporeal giant seahorse to ride while in water.	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "AknCIJHyWcmeofuO","flags": {},"type": 0,"text": "Spear of Lilia: A green-copper spear with a tip of obsidian. When this spear deals enough damage to reduce a creature to 0 HP, the wielder may choose to instead bring the creature to 1 HP. This may be used once per short rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "3pmUELohv7lOwlyL","flags": {},"type": 0,"text": "The Ocean’s Testament: A book bound in leaves of seaweed. The book grants 1d8 bonus radiant damage to any melee attacks, 1d10 bonus radiant damage to any ranged attacks, and 2d6 bonus healing to any healing spells cast through it. Each bonus removes 1 charge, the Testament contains 7 charges, 1d4 regained at dawn. If all charges are expelled, use the usual artifact charge rules.	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "co0BductjQnN1DeQ","flags": {},"type": 0,"text": "Second Elder’s Wrath: A mundane-looking bow embedded with clusters of gems at either end and strung with kelp. This bow may be fired underwater at no penalty, and deals a bonus 1d6 piercing damage to any creatures hit while underwater.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "XChQsbH3tQGMRIUI","flags": {},"type": 0,"text": "Brinelord’s Bane: A silvery steel blade, with the hilt embellished with gold. The blade must be submerged in seawater once a week or else it crumbles to dust. The blade gives advantage to all attack rolls against elementals, undead, fiends, constructs, and fey. Damage against these creatures gains 1d4 damage for every year that the blade has been held by the same wielder.	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "lwaJx0wG69A4KY1i","flags": {},"type": 0,"text": "Repentance: A small, purple gem. Roll a D20; if the roll is a 20, roll a D100; if the roll is a 1 or a 100, the wielder now has 1d4-1, minimum of 1, wishes. May only be used once every 30 days. Once the wishes are dispensed, the gem becomes inert for 3 years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "0r9usT73hSiZyTDF","flags": {},"type": 0,"text": "Mask of Water Breathing: Not what you think. This mask was made to allow aquatic sentient beings to breath water on land. Unweary travelers have drown because of that slight misunderstanding.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "OScLh8AVRHOdm1Hq","flags": {},"type": 0,"text": "Snorkeling kit: Made of rubber, glass and a pipe. Can breath indefinitely while within two feet of surface, advantage on perception underwater.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "uaL68ngCTMfqcYHu","flags": {},"type": 0,"text": "Castanets: A percussion based instrument made up of a pair concave seashells attached on the edge by a string. When pinched together they make a clicking noise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "FKjKran9BJlGAyHD","flags": {},"type": 0,"text": "Kelp Armor: When dry the kelp provides no more protection than light robes. But when underwater or wet it provides heavy armor protection at no movement penalty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "FfJQjtJwfRo16Y3e","flags": {},"type": 0,"text": "Trilobiter: A naturally formed sword, older than man. Within it is a plethora of deep see fossils, sharpened by volcanoes and waves. This sword is unbreakable by any non-magic means.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "s7tiaMkkn2k709pC","flags": {},"type": 0,"text": "Salt Bomb: A crystallized dynamite stick with a waterproof fuse. When ignited, it crystallizes everything within a 10 ft circle radius. Everything within a 20 ft radius is heavily dusted in salt. A fuse can be cut short enough for the dynamite to detonate in the same round or long enough to take several minutes to detonate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "LSXKAXxWFaGx3nnZ","flags": {},"type": 0,"text": "Ship in a Bottle: A dusty old bottle with a tiny pirate ship inside. When the cork is removed a full sized pirate ship explodes out and shatters the bottle. Ship is fully manned by hostile pirates.	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "hRWboiYOaJu6eZSi","flags": {},"type": 0,"text": "Captain Curly’s Crude Crusty Cup: The small metal cup turns any fresh water into salt water when filled.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "anhhw8wm9DPlpScV","flags": {},"type": 0,"text": "Shell Armour: Shells fashioned in scale style, covers one arm. Light armour; +1 ac against slashing & bludgeoning attacks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "FOZm4miJMt4f4TQn","flags": {},"type": 0,"text": "Conch Helm: +1 ac against slashing & bludgeoning attacks. Wearer can hear the ocean by listening.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "BtdWw08zNTuTPZVu","flags": {},"type": 0,"text": "Puffer fish poison: 1d12 poison damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "mM7MfR2XTbSUc5o1","flags": {},"type": 0,"text": "Electric Eel Squeezings: Used as a poison. 1d12 electric damage.	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "Q7azsjw5EqRLgPq9","flags": {},"type": 0,"text": "Sea Glass weapon: As durable as any steel equivalent, but lighter and much prettier. May come in enchanted form.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "29rW42MV51ZY4tml","flags": {},"type": 0,"text": "Seal Skin Parka: Buoyant and streamlined, gives bonus to swimming (athletics) checks (e.g. +1, advantage.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "GpFMFzNGhcxmsy01","flags": {},"type": 0,"text": "Merflippers: Movement speed of wearer is doubled in water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "0KP70xB4j6otomDA","flags": {},"type": 0,"text": "Shell Shield: Shield made from the shell of a giant clam or turtle. Standard stats at half weight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "M3oNfIgcxQWRHkrM","flags": {},"type": 0,"text": "Conch Ocarina: Instrument, flute proficiency may apply.	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "fZNG8PwrZwVx0uTG","flags": {},"type": 0,"text": "Sword of Triton: A pirate sword with a pommel made from a large, blue gem. The wielder may control a sea-faring vessel they stand on from any point as if they were at it’s helm (i.e. steer the wheel of a ship from the crow’s nest.)	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "wO0U2NsuKz0NBhZ3","flags": {},"type": 0,"text": "Coral Blade: Sharpened blade made with magically hardened coral. Longsword stats + 1d6 lightning, finesse. Requires attunement.	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "Ld93ucxDBRzw2lYl","flags": {},"type": 0,"text": "Scroll of Kelp: An arcane scroll that, when activated, entangles one enemy of the user’s choosing in 50 feet of soaking wet sea weed. Required a STR check of 13 or higher to break.	u","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "pNFQVmdTeL20PzKT","flags": {},"type": 0,"text": "The Megalodon: A sword made from two planks of wood and a set of razor sharp sharks teeth. Deals 2d4 slashing damage. May appear as a great sword of same design, dealing 3d4 slashing.	","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "SzyEDvOAy5JwJA34","flags": {},"type": 0,"text": "Shark Tooth Spear: When a creature is struck by this weapon the shark-tooth at the end breaks off and the creature bleeds each turn, if capable. A shark is summoned and attacks the bleeding creature if in water deep enough to allow. The tooth regrows every long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "4PvifT6726bT77fn","flags": {},"type": 0,"text": "Staff of the Deep: Magical quarterstaff +2; on a critical hit oily black tentacles burst from the chest dealing an additional 2d12 necrotic damage, if a foe is killed with a critical hit, the body explodes in a 10 foot radius dealing 2d6 piercing damage to all foes or half on a dc 15 dexterity save, the area then fills with darkness for two turns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "MazK9KhyAbfwaGtW","flags": {},"type": 0,"text": "The Pearl Trident: A great golden trident embellished with white pearls. On land, the trident deals 3d4 piercing damage. However, when the trident is within 5 meters of a water source, the damage jumps to 6d4 piercing damage, +1d6 radiant damage, which manifests in the form of glowing golden lights around the tips of the weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "NDYicKgMvOHIo1rq","flags": {},"type": 0,"text": "The Sea-folk Scissors: A copper dome with a handle inside, meant to be worn over the hand. The top of the dome boasts a foot-long copper pole, terminating in a flat semicircular axe head, sharpened to a razor edge. The weapon deals 2d6 slashing damage, and provides +1 to the users AC.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "wM0WJV0Ek0Dd3h53","flags": {},"type": 0,"text": "Pistol Shrimp Power Bracelet: A bracelet of crustacean shell, color changes with the time, is always vibrant. Free action, if the bracelet hand is free, the bracelet can become a large shrimp claw that overtakes the entire hand. As an action, the claw can shoot out 1d4 balls of scalding water that deal 1d4 bludgeoning damage on impact and then 1d4 of fire damage. Has 10 charges, recovers 1d4 charges while submerged in water over 8 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "a24eCfPJ69z5LElN","flags": {},"type": 0,"text": "Kelp Bracer of Rebreathing: While in water, gain +1 to AC and can hold breath underwater for twice as long.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "8nTRov2ot3ozROKc","flags": {},"type": 0,"text": "Driftwood Shield: When soaked in ocean water, gain +1 AC.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "KToZpxlhZEq3LB50","flags": {},"type": 0,"text": "Fishscale flippers: Gain +20 ft movement in water. Can take the dodge action as a bonus action when fully submerged in water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "ffDhw6rEBDlArAPu","flags": {},"type": 0,"text": "Singing Conch: Once per day, can be used to take advantage on soothing an aquatic beast w/ animal handling check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "sJOViRLQNreJbzRe","flags": {},"type": 0,"text": "Sticky Seeds: These seeds, when fertilized by the oceans waters grow into small throwable sticky grenades; DC 15 Dex save on dodge, DC 17 Strength save to escape. Cover a 1 sqft area.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "Z7bRW8tsSkRs0yjX","flags": {},"type": 0,"text": "Porthole: A 1ft wide metal hoop, bound to a porthole in the hull of a sunken ship. It has a pool-like surface in place of glass, and acts as a portal to that same sunken wreck. If held with both hands, a torrent of salt water is pushed through from both sides, doing bludgeoning damage and pushing back anything in it’s path. STR check each turn or dropped.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "1lZVVcxAe2afbpyE","flags": {},"type": 0,"text": "The Merfolk King’s Merman Fins: Silvery blue and made of some sort of magically infused fabric. These shoes are awkward and cumbersome to wear, -5 ft maximum movement on land +30 ft underwater movement speed, when underwater the wearer appears to have one single fin in the place of legs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "laAo07UtAxFnC34i","flags": {},"type": 0,"text": "Diving Helm: Ancient and rusted. Gain water breathing for as long as this helmet is worn, as a bonus action underwater you may choose to sink 60 ft; whenever a foe critically hits you, take an additional 1d6 damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "PlviCfN7DEvOERK9","flags": {},"type": 0,"text": "Sharktooth Necklace: A simple twine necklace with teeth from at least 5 different types of shark. Whenever you take a melee attack action you may also take a bite attack as part of that action as your head temporarily takes on the form of a great white shark’s. Bite","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false}],"formula": "1d49","replacement": true,"displayRoll": true,"_id": "u3oGnyv0NgEoyfxF"}
