{"name": "Magic Items for a Rogue","description": "One hundred magical weapons and items that would be useful to a rogue/thief!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "lm2QnmVkBz8APVad","flags": {},"type": 0,"text": "The Skeleton Key – Whenever the rogue is attempting to pick the lock with The Skeleton Key, the DC of the lock is reduced significantly. The key is shaped like a finger bone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "kQlJ7zgpsjj7UPWp","flags": {},"type": 0,"text": "Boots of Stone – Once per long rest, as an action, turn into stone for up to 24 hours. You can hear and see, but you can’t turn your head or move your eyes. You may dismiss the effect at any time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "IjHdWsYlo28qF2r6","flags": {},"type": 0,"text": "Psychic Document – Displays whatever credentials the target expects to see if they fail a DC15 wisdom check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "KaU3SBgYgD3r3nSD","flags": {},"type": 0,"text": "Flutterscope – You have a monocle that is magically linked to a winged lens that can fly up to 60 feet away from you at your command. Looking through the monocle shows you what appears on the other side of the lens.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "7Fl32r1zsdb8vgOy","flags": {},"type": 0,"text": "Bag of Unlimited Flour – exactly as it sounds. The flour vanishes after an hour outside of the bag.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "wwf8MvgPJx6RVlQj","flags": {},"type": 0,"text": "Aluminum Crown – you can’t be detected by magical means.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "Sjne54gqKGzkkdyZ","flags": {},"type": 0,"text": "An ear trumpet made from a worn out piece of driftwood. Allows the user to hear the immediate surroundings of any tree in a 5-mile radius. Useful for scouts. As a reward for creative play, casting speak with dead on the trumpet allows you to listen using any piece of wooden construction (This property is not revealed by an identify spell)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "V7tW5nvCe5doPk7b","flags": {},"type": 0,"text": "A dagger with a glass blade as strong as steel. Looking through the glass highlights any hidden items (Weapons, money, vials of poison) somebody is hiding on them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "6DAfkTfJb4lEZWvO","flags": {},"type": 0,"text": "A longbow made out of bone white wood that feels unnaturally light. The first arrow fired from it casts silence (one minute duration) centered on where it landed, regardless of whether it hit the intended target or not. Breaking the arrow ends the silence early. This ability recharges after every short or long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "B6KT1eH6SWKlbl0w","flags": {},"type": 0,"text": "A whip that appears to be made from feathers with a bird’s claw at the tip. The whip is completely silent, and the claw can be used to make any slight of hand check from up to 10ft away at the cost of +5 to the DC of the check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "iYiMJPu366pCBRT6","flags": {},"type": 0,"text": "Paradox Goggles – Once per day, using a bonus action activates these goggles. For the next minute, any attacks against you have disadvantage. They don’t make your vision better, but the enemy vision worse!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "10Ip0JjoQ5PyMQOf","flags": {},"type": 0,"text": "Fast-Acting Crossbow – A thick leather bracer with a crossbow hiding within (1d6 Hidden, Ranged 30/60). As a reaction to an ally taking an opportunity attack, you may activate the crossbow to fire a bolt at the enemy. If your attack hits, the enemies opportunity attack has disadvantage. Reloads after a short or long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "t3j57JhBqqoovyhI","flags": {},"type": 0,"text": "Sneak-ers – This black and purple shoes are perfect for any rogue. Your footsteps cannot be heard as you gain expertise in stealth. (If you have expertise in stealth, you instead gain advantage on all stealth checks.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "W9Kamy5B27RtzPzZ","flags": {},"type": 0,"text": "Doppelganger’s Cloak – Once per day, as a bonus action, you can turn invisible and move 5 feet, all while leaving a clone of yourself which replicates anything you do for the next minute. Any attacks against your clone cause it to disappear and you are revealed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "hDKggGLfrSjHCpTq","flags": {},"type": 0,"text": "An item that allows them to grant the Finesse tag to a wider variety of weapons. Possibly similar to a Ruby of the War Mage where it eats an attunement slot and takes at least ten minutes to attach to a weapon? Maybe use the restrictions for Monks for what weapons are eligible?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "pEUfaHaMMfMRMzBS","flags": {},"type": 0,"text": "A minor magic weapon, a classic Rapier in base form, can use a Bonus Action to change damage types while keeping other stats. Maybe between the physical types for no cost other than action economy, and a number of daily charges to do a subset of elemental ones for one strike?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "1SwFZ8Ldf5Mu6yiN","flags": {},"type": 0,"text": "A gold coin that seems to reflect light in an unnatural and mesmerizing way. When interacting with someone outside of combat, you can begin playing with the coin (Juggling between fingers, flicking it between hands etc.) in an attempt to mesmerize them. The target must make a Wisdom saving throw contested by a Dexterity (Sleight of hand) check or a Dexterity (Performance) check of your choice. On a failed save, the target is stunned by the performance and is completely focused on the coin, ignoring anybody or anything around them. This effect ends after one minute, when you end the coin tricks, or if the target is touched/attacked. On a successful save, the target has no hint you tried to mesmerize them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "evqUfq0AeQ8G6jzI","flags": {},"type": 0,"text": "The Peephole Ring – looks like an ordinary ring with the symbol of an eye engraved in it. When the ring is placed against any solid surface it acts as a peephole. Peephole can be used to see through up to 3ft of solid matter. Note there is no actual hole in the surface the ring only allows you to see through it as if there was a peephole at the location of the ring. Also note the ring doesn’t provide any light, so if it is dark on the other side, all you will see is darkness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "K5FgfMWMmPG0nimG","flags": {},"type": 0,"text": "A cloth sheet with small weights in the corners. Folds out to 6 ft. by 6 ft. Embroidery on one side is a bird taking flight. Embroidery on the opposite side is feathers. When placed upon any relatively flat surface its magic is activated. Bird face up – Acts as a trampoline. Anyone jumping on it can add up to 15 ft. to their vertical jump height. Anyone skilled at jumping such as an acrobat can add 25 ft. to their vertical jump. Also prevent damage from falling on it from up to 30 ft. but will bounce the person at least 1/2 the fall distance. Feathers face up – Acts as a giant pile of feathers. Jump or fall from any height, as long as you land on the cloth, you take no damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "wHIgpYAVdMavxkdv","flags": {},"type": 0,"text": "Gloves of Fast Draw – can teleport any item on your person to your hand. Attunement may be necessary. Grip the items you want to fast draw. Hold them the way you want them to appear in your hand, and say the command word ‘remember’. Any time after an item has been attuned, it can be reflexively teleported to your hand. Note: The item must be on your person for this to work.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "AQwKBgeP2teUg3WT","flags": {},"type": 0,"text": "A bag of rocks that, when thrown, deal 1D4 damage and count as simple ranged weapons with the finesse property. These rocks return to the bag when thrown. The item has 4 charges and regains 1D4 charges when a creature is killed by one of the rocks, 1 charge can be expended after landing a hit with the stone to force the target to make a DC 10 intelligence check or forget taking any damage from the stones.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "R0cDAaurxFG4mZP4","flags": {},"type": 0,"text": "Ledarra – A sentient weapon possessed by the greatest sand rider in the land, Addla Brekwynn. The weapon is a +1 magical scimitar that when held seems to lighten the weight in the wielders knees. They gain advantage on initiative checks, and if they beat the highest enemy initiative roll, it gains an additional +1 for that combat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "38hHSEEA6p0Am39N","flags": {},"type": 0,"text": "Lucky Deck – A magical deck of cards enabling the user to pick which cards are drawn. (Requires Attunement)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "70FNXmjVqtq8uBD4","flags": {},"type": 0,"text": "Bennett’s Grips – A pair of rough, fingerless gloves enchanted to provide double proficiency bonus to slight of hand and climb checks. If wearer is not proficient, they simply gain their proficiency bonus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "C3yVi0RN93FbCw5p","flags": {},"type": 0,"text": "Clockwork Distract-o-matic – A windable device about the size of a pocket watch that emits dancing lights and loud noises. Can be used as a stationary object, or set to roll forward in a straight line 30 ft. before activating.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "GWm9RE0g9SMi4hU7","flags": {},"type": 0,"text": "Clockwork Obfuscator – This belt-clip device provides 30 seconds per day of dimness to the wearer. Not invisible, but forcing disadvantage on attacks against them and any attempt to spot them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "6QXl7ULP7CyDPbFV","flags": {},"type": 0,"text": "Bartleby’s Fabulous Cap – A rather ostentatious hat that draws the eye. Gives the wearer advantage on Slight of Hand checks against anyone that is currently paying attention to them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "sTLCXC3RYJjcd7FR","flags": {},"type": 0,"text": "Dagger of distraction – A crystal blue glass dagger that rests in a matching sheath. When the dagger thrown at a target or object it shatters and makes a noise of glass shattering audible up to 20ft. After it shatters it leaves no trace of its presence and the dagger magically reforms in the sheath.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "W8WseNdldIKICp2A","flags": {},"type": 0,"text": "Amulet of Filtering – Requires attunement. 3 charges. As an action, activate. For 10 minutes, any creature unaware of your presence must make a DC10+CHA wisdom check or fail to notice you, regardless of line of sight. Gains 1d4-1 charges at dawn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "y44TFKYnVT2H4J0C","flags": {},"type": 0,"text": "Spider-Climbing Set – a pair of soft gloves and boots, made out of spider leather. Once a day they can grant the wearer the effects of the Spider Climb spell, but only for ten minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "NEs2Bkuv9TfUN2If","flags": {},"type": 0,"text": "X-Ray Specs – a fine jeweler’s loupe which can be used once a day to peer beyond an opaque material, granting the user advantage on picking the lock and detecting or disarming the trap.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "QFB43yzhSeqmlNd1","flags": {},"type": 0,"text": "Mother’s Coin – A coin that, once attuned, you can always track. Typically placed inside a shipment of treasure, or given to an individual as a homing beacon. Sometimes it’s used to follow targets back to a secret headquarters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "Qq7rYOtgUOtNilRd","flags": {},"type": 0,"text": "Ghost Cloak – A slimy, translucent, pale cloak that allows the wearer to leap through solid objects thrice per day and provides bonuses to all stealth rolls while worn. When worn, treat the wearer as undead when dealing with all spells, magic, and effects.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "T0z4i6jsmSZbs7eU","flags": {},"type": 0,"text": "Ring of the Doppelganger – 3/day you can cast Disguise Self as an action by turning the ring on your finger.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "OltmW59Vqm5FFFDG","flags": {},"type": 0,"text": "The Loose Stone – a small whiskey stone. Anyone who drinks from a glass containing it must answer the next two questions asked truthfully. A charisma check is needed to remember answering the questions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "SrT91alnT4H6DwRX","flags": {},"type": 0,"text": "Flashgang – A small metal canister that glows faintly and is surprisingly heavy due to its thoroughly condensed magic. As an action, a creature can press the button capping the Flashgang to open it and toss it up to 30 feet away. Dust immediately begins to spill out of the canister when it is opened, and upon contact with the ground it billows into a cloud that quickly takes the form of 3d4 armed goons. These goons are fragile, simple constructs made of dust and are unable to attack, physically interact with the environment, or make sounds other than sinister grunting and chuckling. The constructs possess limited intelligence, and are capable of little more than obeying and reacting to the user’s words in a shady-looking manner. If a goon takes damage or 10 minutes have passed since it’s creation, the construct bursts into a puff of dust and is scattered across the wind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "cSw4jrU4HwJDUE9t","flags": {},"type": 0,"text": "The White Key – Once per day, the attuned user can momentarily will the metal of this key to become white-hot. By being attuned to it, it does not burn the user, but would severely burn anyone else who touched it. Inserting the key into a lock and then causing it to become white hot will melt the interior of the locking mechanism, which will cause it to flow and reform around the key. This makes it such that the key now fits the lock and opens it. It can’t melt certain arcane metals, however.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "eX7WYwxYgTBiQKoK","flags": {},"type": 0,"text": "Assassin’s Blade of Hasty Escapes – (requires attunement) – A fine dagger made of some strange metal. It’s covered with intricate runes. The blade can be used as a normal dagger. Twice per day, the user can activate the blade, to cast Invisibility on the user as a 2nd level spell and to immediately be teleported 1d6+3 times 50 feet away in a random direction (1d4, on a 1, north, 2, east, 3, south, 4, west). Note: Only to be used in the direst of emergencies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "ix2k8Gy7Nb96HMsq","flags": {},"type": 0,"text": "Rapier of Resizing – A magic rapier with three sizes. You can make the rapier one size larger or one size smaller as an action. In large size the rapier acts as an unnaturally sturdy ten-foot pole. In medium size it acts as a regular magic rapier. In small size the rapier can pass off as an earring or other piece of jewelry.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "Vr6j6Eo12xBgVKfh","flags": {},"type": 0,"text": "Batfang – An exquisitely crafted dagger made out of a material somewhere between metal and bone. When a rogue attuned to this dagger uses their sneak attack feature against a creature, the creature takes 2d6 extra necrotic damage and the rogue regains an amount of hit points equal to the necrotic damage dealt.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "GTM9Qayn1XzKNRVj","flags": {},"type": 0,"text": "Gloves of the Talent Thief – Whenever a creature attuned to these gloves successfully pickpockets another creature (or steals anything of that creatures person, like a strand of hair) the creature attuned to these gloves can choose to become proficient in on skill that the other creature was proficient in for 8 hours. During this time, the creature that was pickpocketed is no longer proficient in the stolen skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "XAXBh3SfotlvOPHo","flags": {},"type": 0,"text": "Unending Coil – A coil of rope that is one foot in diameter, weighs 2 pounds when coiled, and is stronger than steel. When uncoiled fully, the rope is 200 feet long.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "1d31yI2yGHw87eBf","flags": {},"type": 0,"text": "The Hog’s Sniffer – A garish porcelain replica of a hog’s snout with a leather cord. When attached to the thief’s face, it replaces the user’s nose with a genuine hog’s snout. They can now smell treasure within 200 feet, able to pinpoint gold, precious gems, and enchanted items with great accuracy. It cannot be removed for two days after attaching, constantly oozes snot, snorts loudly, and sends the user’s appetite skyrocketing. The DM may require self-control saves to keep the user from stuffing his or her face with whatever is nearby (hogs will eat nearly anything, so feel free to get creative and gross with this).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "HXXCGmcTb2AjVZbh","flags": {},"type": 0,"text": "Nether Bag – Looks like perfectly ordinary linen bag. However, peculiar enchantments had been imbued into it’s very fabric, so it works like Bag of holding with the exception that it requires attunement to put things inside, or out, and nobody but the attuned can pull out things that the attuned put in. Any number of people can be attuned to the bag, each of them having their own carry limit of the bag. If one dies, while having their belongings in the nether bag, the possessions are teleported to their nearest living relative, unless the last will doesn’t specify otherwise. If one overfills their inventory space in the bag, their contents, and only theirs are spilled around the nine hells.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "7JWeI6Vw6lv413Jv","flags": {},"type": 0,"text": "Lockpickers Gauntlets – Grant use of silence and knock once per every long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "5APP3ao3DqYWPy8X","flags": {},"type": 0,"text": "Monocle of Appraising – while wearing this monocle you can see the worth of different objects. The more expensive the object will seem to sparkle. Additional, even the shiniest objects will seem dull if they are cheap.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "m58Yz0UTDJZSCZHS","flags": {},"type": 0,"text": "Dagger’s Brand – a red green in the hilt of this dagger is the only sign of anything magical about it. When this dagger is pressed flat against skin and given the command word, the entire dagger turns red hot and sinks into your skin dealing 2d6 fire damage. Once it has sunk in, the area is left with a scar that appears to be years old. At any time after this, you may say the command word again and summon the dagger back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "el1RhsWeRTvtA5uf","flags": {},"type": 0,"text": "The Proud Purse – A coin purse. Copper or silver coins placed inside will appear to be more valuable after being retrieved from the purse (copper appears to be silver and silver appears to be gold.) After 1d4 minutes, or if returned to the purse, they disappear altogether. Any other coins or jewels placed inside the coin purse also disappear; so don’t get it mixed up with your other ones.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "S3tYlUJG6H7c96oA","flags": {},"type": 0,"text": "Weaponized Throwing Cards – (mage, attuned) – Each card comes from a common playing card deck: Spades: Weapons. Damage or status dealers. Kine has an 8 of Spades that creates 8 knives dealing 1d10 damage to up to 8 targets in a cone. Hearts: healing/status removal Diamonds: Damage resistance or counter/reaction magic. Mine has an Ace of Diamonds that can protect against 1 otherwise successful attack. Clubs: utility. 10 of clubs might reveal a trap or weakness, confuse or blind a foe. These can be scattered around your world and found one at a time. The drive to collect and obtain them can even be a narrative hook at times.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "ik0pAuWYr6Bfe7G3","flags": {},"type": 0,"text": "Wrist Pocket – (rare item, requires attunement) – A simple leather cuff, with arcane sigils burned into the inside. While attuned, the wearer of this cuff has access to a tiny pocket dimension, capable of holding one small item (no larger than 1 cubic foot). As a bonus action, the wearer can stow a small item from their cuffed hand into the pocket dimension, using a slight gesture. Also, as a bonus action, the wearer can make a gesture to summon the item from the pocket dimension into their cuffed hand, as long as their hand is empty. Sleight of Hand checks made to conceal the triggering gesture have advantage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "W42cZKa7EC9bAU9U","flags": {},"type": 0,"text": "Skulker’s Shawl – (very rare item, requires attunement) – This hooded black garment is sewn from shadowsilk spun from the Shadowfell. When attuned, the wearer gains the Skulker feat. Because of the residual despair of the Shadowfell clinging to this garment, the wearer has disadvantage on death saving throws while attuned, as do any creatures within a 10-foot radius of the wearer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "FzrH7haY4UHxkL7s","flags": {},"type": 0,"text": "Smoking Bead – (uncommon item) – Smoking beads are typically found in quantities of 2d4 + 2 beads. This milky-black glass bead contains smoke drawn from the paraelemental plane of smoke. When broken, the bead releases the smoke, which fills an area of 5 cubic feet. Natural and magical wind have no effect on the smoke. Anyone starting their turn in the smoke must succeed on a DC15 constitution saving throw, or is blinded for 1 minute.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "gUPRbsqMobMAxENO","flags": {},"type": 0,"text": "Scry Fly – (tiny construct and earring, requires attunement) – This clockwork construct is a masterwork, life-size replica of a horse fly, crafted by tinker gnomes. It is paired to a simple silver earring, which requires attunement. While attuned, the wearer of the earring can control the Scry Fly as an action, and can hear anything within a 30 ft. radius of the Scry Fly. The Scry Fly has a Dexterity of 15 (+2), is proficient in stealth (+4), an AC of 14, a flying speed of 40 ft. and walking speed of 10 ft., and 1 hit point. It adheres to all surfaces, and the Detect Magic spell reveals it to be magical.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "emhEBNJsMWfsNthD","flags": {},"type": 0,"text": "Blink Dart – (very rare item, requires attunement) – This dart is a sharpened rod crafted of dragonwood, a hardwood found in the Feywild. Once thrown, the attuned wielder can use a bonus action to teleport to the dart’s location as per the Blink spell. You vanish from your current plane at the end of your turn, and appear at a random location in the Feywild. At the start of your next turn, you reappear in your original plane, in the location of the Blink Dart, holding it in your hand. (Upon reappearing, you must succeed on a DC10 Wisdom saving throw, or forget everything you experienced while in the Feywild.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "aUBENNgiNpgRPeSE","flags": {},"type": 0,"text": "Coat of disguise – At first appearing as a ragged and torn jacket, when examined it clearly has a bit of magic. Flip the coat inside out to produce an effective costume for your current grift. The same coat will never be seen twice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "xkNmed30wr7wZEg5","flags": {},"type": 0,"text": "Acrobat’s Baton of Four – (very rare, requires attunement) -This unassuming black cane has 1d8+1 charges, which are regained each evening at dusk. While attuned, the wielder can use a bonus action to expend one charge to speak one of four command words: Viper: The baton transforms into a +1 weighted whip. Monkey: The baton transforms into a +1 nunchaku. Tiger: The baton transforms into a +1 quarterstaff. Crane: The baton transforms into a grappling hook attached to 100 feet of silk rope. The baton’s transformation lasts for 1 hour, or the wielder can end the transformation by using a bonus action to speak another command word.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "3OlpR7H0nKDKvec9","flags": {},"type": 0,"text": "Acrobat’s Cape – (uncommon, requires attunement) – This silk-lined cape has a dramatic collar and silver embroidery. While attuned, the wearer automatically reduces falling damage by half, and can use a reaction to make an Acrobatics check (DC15) to negate falling damage entirely, and move up to 10 feet upon landing. Also, while attuned, the wearer ignores difficult terrain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "RfOr6Vz3rS2od6pV","flags": {},"type": 0,"text": "Map of the Maverick – How can you be so sure what’s in that cave? A small weathered piece of rolled parchment contained within a case made from a human femur bone. When removed and consulted with a DC15 Dungeoneering check, acts as a live-updating map of the bearer’s surroundings. For every five points by which the player beats the check, the map can reveal more detail. A new check can be made every minute. DC20: Traps and hazards. DC25: Secret rooms and hidden passages. DC30: Enemy locations and species. DC35: Enemy classes and names. DC40: Enemy strengths and weaknesses. Requires attunement. Note: The magic of this map can be defeated by antidivination spells like Nondetection and Mind Blank—DM’s discretion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "jDUH0b0BIC0J1OCD","flags": {},"type": 0,"text": "Arcane Dampeners – How do we sneak up on a Wizard? This small pair of identical silver rods is intricately carved with ornate runes. The end of each rod has a button. When a rod is held in each hand and the buttons are held down, all magic items and effects active on the bearer become undetectable by Detect Magic and other similar effects for as long as the rods are held. True Sight reveals an illusion surrounding the bearer. Releasing either rod ends the effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "WqNoEeebYPSeTYIP","flags": {},"type": 0,"text": "Last Pipe – Do you have any last requests before you are hanged, Thief? – To all inspection, this appears to be an ordinary smoker’s pipe, packed with a fresh and fragrant tobacco. When lit and smoked, the user comes under the effect of Gaseous Form for 10 minutes. One charge renewed daily at dawn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "KTbNUdLAEaX5zlnN","flags": {},"type": 0,"text": "Coin of Illusion – A coin which can be used as an action to create a major illusion, but is used up in the process.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "kiGsmpuC1vZuvrYb","flags": {},"type": 0,"text": "Amulet of the Anonymous – An Amulet that, when our on, causes the wearer to possess a unique skill of visual slipperiness. All creatures within the vicinity, including allies, must make a DC 15 Wisdom saving throw at the beginning of their turns or forget about the wearer’s presence. On a success, they are aware of the wearer for that turn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "95SHZnVlE3oSRjoe","flags": {},"type": 0,"text": "Shadow Stalker’s Mask – This mask can cast Darkness centered on the wearer once per day. The wearer can see through this darkness while wearing this mask.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "CDj90tJEFAulFXkS","flags": {},"type": 0,"text": "A hand crossbow fires bolts that deal force damage instead of physical bolts. Can hold a maximum of 2d4+2 charges and gains 1d4 charges every dawn. Firing the bow takes a charge, and you can use an additional charge to give yourself advantage on the attack. These force bolts leave no marking of physical damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "sm9wgmOTyJgfdRcb","flags": {},"type": 0,"text": "The Security Card – An enchanted playing card that makes someone immune to setting off the alarm spell while the card is on their person.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "NT12MXDbdq0yEhuF","flags": {},"type": 0,"text": "Instant Mimic – If you touch this non descriptive cube to any tiny object and speak it’s command word it will instantly form in to a replica of that object that looks and feels identical. A DC 15 investigation check will reveal that the duplicate is a fake. After 1d4 days the object will revert back to it’s original form.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "M80uTE2t2VTTtBzt","flags": {},"type": 0,"text": "A whiskey tumbler that shows an X-ray view of a humanoids circulatory system when you look through the bottom of the glass. Seeing a creature’s heart rate through this manner gives advantage on insight checks to see if they are lying.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "1lXV1AgWGvVmMfqg","flags": {},"type": 0,"text": "Moonshadow Blade – a dagger or rapier that has the phases of the moon inlaid into the hilt. It allows the user to cast blink at the end of their turn and reappear at the beginning. (Think just 1 teleport per charge) 6 charges. It has to lay unsheathed under the night’s sky to recharge, gaining 1d4 charges if the moon is waxing and 1d6 if it’s waning and gains a full charge under the new moon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "HmMiSzh4szWHuCmi","flags": {},"type": 0,"text": "Blur Knife – requires attunement. When this throwing knife is used to make an attack, the attuned wielder can choose to either make the attack with advantage or make two different kinds of attacks (say, stabbing someone and throwing it simultaneously). This special use of the knife causes it to disappear for 1d6+3 hours, and then it reappears in the attuned wielder’s possession. After it disappears, regardless of whatever actions the attuned wielder takes, a replacement weapon can be drawn for free. It might also have some other magic in it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "m7XfOi8dS0lne9mR","flags": {},"type": 0,"text": "Flask of Induced Paralysis – requires attunement. Most liquids (DM’s discretion) placed in this flask for 10 minutes turn into a clear liquid with no odor discernible to most sentient races. The effective dosage is ten drops for an adult human of average weight. The person attuned to the flask can will someone (or everyone) who has taken at least a full dose within the last 48 hours to be paralyzed for 10 minutes per dose, or release someone who has been paralyzed by this effect from paralysis. A person can be repeatedly paralyzed for as many doses as they’ve taken within the last 48 hours. Certain creatures with a keen sense of smell, as well as magical means of detecting poison, can discern the presence of the flask’s liquid.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "JwPcw7r48pZ1EryU","flags": {},"type": 0,"text": "Flask of Induced Sleep – as above, except it makes the afflicted go to sleep for 1 hour per dose, and the effective dosage is twenty-four drops for an adult human of average weight. Someone sleeping can still be roused by ordinary means, though they’ll be drowsy- and nothing is stopping the attuned user from putting them back to sleep if they took more than one dose!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "fZEciRZaDl0sRAZf","flags": {},"type": 0,"text": "Gyroscopic Timepiece – a necklace pendant with a small glass ball as the hang-down piece. Within the ball, a miniature round clock revolves continually. The clock tells time to the second accurately. Whosoever wears it can use a single charge as a free action at the beginning of their turn to describe two turns’ worth of actions. The first, ‘phantom turn’ is a full set of actions for that turn that everyone who isn’t a deity or otherwise sufficiently removed from the mundane world perceives- however, this action does not actually occur. The second, ‘real turn’ actually occurs, but is not perceived by and cannot be reacted to by anyone who isn’t a deity or otherwise sufficiently removed from the mundane world. The real turn is described after everyone else in the round has made their turn. The pendant stores two charges; when they are expired, the clock inside liquefies, and a new miniature round clock has to be inserted in to regain the charges.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "HY9KpQaljsaxIXS0","flags": {},"type": 0,"text": "Fingerless Glove – A glove made from Displacer Beast hide with the fingers cut off at the second knuckle. Putting the glove on, it seems to make the wearer’s fingers disappear. However they are actually projected to a point of the user’s choosing within 30ft. The teleported fingers can feel and take damage as they would normally","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "KKjo3EluGBJDQLWs","flags": {},"type": 0,"text": "Cloak of the Barlgura – (requires attunement, very rare) – This cloak is made of the fur of a demonic Barlgura. While you wear this cloak with its hood up, Wisdom (Perception) checks made to see you have disadvantage. And you have advantage on Dexterity (Stealth) checks made to hide, as the cloak’s fur shifts to camouflage you. Pulling the hood up or down requires an action. Additionally, the attuned can cast Invisibility once per long rest on themselves by using a power word. To anyone that casts Detect Evil and Good or uses a similar ability, you will register as an evil fiend because of the demon hide the cloak is made out of and you have bound yourself to. To demons you are viewed as a fellow demon until such time as the user takes hostile action. Devils are immediately hostile to a user.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "grG6NK7HCtkBAuzY","flags": {},"type": 0,"text": "Mute Crowbar – uncommon magic item just like a classic crowbar, but never ever causes any sound. For when those thieves’ tools don’t work but you still wish to be pretty stealthy. Also, good for silent splatter kills (would allow sneak attack with that).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "9vAl0RLqo05sIcPi","flags": {},"type": 0,"text": "Cape of the Coward – rare magic item (requires attunement) this cape is covered by some pretty powerful magic to grant the wearer safe escape when followed or chased. By bumping into someone, you can activate the cape’s magic to exchange the appearances of yours and his/hers clothes. The magic lasts for a minute. You also get advantage on Stealth and Acrobatics checks whilst fleeing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "VovoaXay5aFFVcUB","flags": {},"type": 0,"text": "Roof Runner’s Glove – Once per short rest you can automatically succeed on a saving throw or skill check to grab onto a ledge, rope, or other object to prevent yourself from falling.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "I7enuBQSKZJ7o6Jc","flags": {},"type": 0,"text": "Releasing Hook – This three-pronged grappling hook responds to a command word which causes its prongs to retract, allowing it to detach from whatever it’s hooked onto. The command word can be whispered from a distance, so long as it is audible to any part of the rope attached to the hook.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "ZUvDd8q3XBSxV3PW","flags": {},"type": 0,"text": "Breathweed – Chewing on this herb produces breathable air, allowing one to remain for an extended time underwater or inside a compartment or extra dimensional space, which would otherwise cause suffocation. One dose is sufficient to last two hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "UVSTV9jklGCwHlCU","flags": {},"type": 0,"text": "Decisive Coin – This enchanted coin is able to reorient itself in midair in response to the words ‘Heads’ and ‘Tails.’ If flipped from a person’s left hand it will land with the called side up. If flipped from a person’s right hand it will land with the called side down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "5GIKgPbUDJCDaZPP","flags": {},"type": 0,"text": "Palming Glove – A small slit in the palm of this glove opens into an extra dimensional space, a cube six inches to a side.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "WuF1Ktxnump9pANv","flags": {},"type": 0,"text": "Commoner’s Touch – A set of gloves that will turn all gold pieces they have touched into copper pieces for one hour. They turn back after the time has passed. A remove curse can dispel the effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "lGg6wMoNq5TyVSUq","flags": {},"type": 0,"text": "A string with a rock stuck to the end. The string is as strong as rope. When the string touches the rock they magically fuse and the connection is near impossible to break.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "eqKdG0TXIPyQ0irS","flags": {},"type": 0,"text": "Timed Immovable Rod – This immovable rod has a dial on each end. On one setting you twists the dial to have the immovable rod activate from between 1 to 10 seconds after you twist the dial. On the other you set the how long the immovable rod remains active with three settings 1 minute, 1 hour, and 1 day respectively. The Rod has a loop in the center to tie or hook an object or person to it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "A275zsgIA5iC4pPw","flags": {},"type": 0,"text": "The Counting Eye – This small white marble colored like a human eye can be placed on any pile to measure a specific aspect of the pile, which will show up as floating red numbers projected from the pupil of the marble. You can ask how many of a specific thing is in the pile like number of gold coins in a pile of various coins, the overall weight of the entire pile, and the approximate worth of everything in the pile in gold pieces. Often used by smugglers to verify payment and that the goods delivered are not counterfeit. The marble has a 17 investigation score for determining if an object is counterfeit or not.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "t1hqbmLQp9qfpkzt","flags": {},"type": 0,"text": "Contraband Concealment Container – When this item is created the creator selects a material, spice, coin, or any other mundane material and a command word. The container has a seemingly endless source of whatever mundane object is selected, though it deteriorates from existence within a day of being removed from the container. When the command word is spoken and the container is opened, it reveals completely different contents. Stored in an extraplanar space, the container may store any amount that would make sense for the size of the container, and then by shutting the container, the bag will store the contents away until the command word is spoken again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "DpibSzYZOu8rQj9E","flags": {},"type": 0,"text": "The Discrete Dagger – When attuned to, this dagger shifts to the ethereal plane and becomes insubstantial for all other creatures other than the owner or ethereal creatures. As an action, it may be returned to the material plane and used normally. This dagger is a favorite among high profile assassins, as it cannot be found during a pat down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "5HbtYUg3SkAPzkdx","flags": {},"type": 0,"text": "Dream Catcher – Very rare (requires attunement) – When a creature who speaks at least one language falls asleep with their head at least 10 feet from the Dream Catcher, if the user is on the same plane of existence and also asleep, they may enter that creature’s dreams by making a successful Intelligence (Slight of Hand) check. Once inside the Dream, the user must pass an Intelligence (Stealth) check to stay undetected. They can make an Intelligence (Investigation) check to search and shape the dream to find the answer to one question. The DC of these checks is the creature’s Intelligence score. The user may then leave the Dream or make a second Intelligence (Slight of Hand) check to repeat this process but this and all subsequent checks are made with disadvantage. If the user fails a check, they lose 1d4 Intelligence until dawn and must attempt the check again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "G7cLXNTM1Qnogurk","flags": {},"type": 0,"text": "The Ear Cuff of Attention – When worn, the ear cuff heats up whenever the wearer is being observed by a creature they are unaware of. The intensity of the warmth scales with the intensity of observation. (The stipulations keep party members from activating it constantly and keep it from going off at full strength every time someone’s eyes pass over them in a crowd.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "D0HGhvlpPpqX0crb","flags": {},"type": 0,"text": "A Get Out of Jail Free Card – An empyreal blessed card that only appears to be a simple rectangle card made of stock paper. For one use only, presenting this card to a guard will release the bearer from imprisonment. This card may be kept until needed or sold. (DC 25 Charisma check or according to DM’s discretion)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "LUIPqrbJ0pt06rLS","flags": {},"type": 0,"text": "The Titan in the Shadow – A crown made of Ebony tipped with shards of obsidian. When attuned, the user can whisper it’s command word to grow one size (as they would under the effects of the enlarge spell) and become cloaked in shadows. While they are in this state, they can use the hide action to blend into the shadows cast by any object larger than they are (such as a building or a tree).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "njWerIrFoAqrnID3","flags": {},"type": 0,"text": "Spry Skates – A pair of roller skates. Adds a +10 to speed when worn and allows the user to leave a creature’s range as part of their movement without invoking an attack of opportunity as long as they did not start their movement inside the creatures range. Useful if you want to strike fast but stay out of harms way.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "v5v8EHUV3aCMMRgs","flags": {},"type": 0,"text": "The Fireman’s Friend – A small metal handheld canister that can silently cast the Control Flame Cantrip at will, but only the extinguish flames effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "Wzz3ZCVmtMpGNta8","flags": {},"type": 0,"text": "Ariyi-Ino – An extremely lightweight +2 spear of elven design. When you twist the handle, it expands to a full sized pike and vice versa. It’s lightweight design allows it to be used as a finesse weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "8Rg4HnAXNJuy1Nl2","flags": {},"type": 0,"text": "A round, flat disk that, when thrown, will create a minor illusion to distract from looking at the thrower’s direction. The harder the rogue is able to throw the disk, the greater the distraction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "daGYWQdemmh3TNaa","flags": {},"type": 0,"text": "A container of dark sludge that camouflages the wearer against the night sky.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "xAbMiENGiYYNBabs","flags": {},"type": 0,"text": "A living lock pick set that you have to pass a charisma check of 14 to convince it to pick a lock. If the roll is failed it becomes rude and angsty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "dHPgrD2CHb52n5SA","flags": {},"type": 0,"text": "Unassuming Box – This brown box made of an unknown and lightweight material has the odd property of being hard to pay any mind to, even in environments where it would stand out. Hiding inside of the box makes you nearly invisible when still. Moving while under the box makes no noise, but someone seeing the box move will make you automatically fails all Stealth checks. The box can be folded in order to fit inside a bag. Both folding and unfolding the box takes 5 minutes, each. For some reason, a large red ! is inscribed on the sides.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "mKWrDkgwSxeTtqrO","flags": {},"type": 0,"text": "A piece of paper that, when someone dead’s name is written on a line at the top, makes anyone who reads it thinks that it is the will/journal/letter/etc. of the name written. This effect wears off after 2 hours or when someone affected makes a successful Wisdom saving throw. The paper’s affects only work once, and stop having any effect on people after 10 hours past writing it or when the paper is destroyed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "I5F9BWeWWItEXybK","flags": {},"type": 0,"text": "Glove of Rope Summoning – A thick leather glove with a hempen rope pattern etched into the back. Pointing at an object and speaking the command word causes a 50ft rope to launch from the glove and tie itself to the object. Once tied to an object the user can pull the object to them or use the rope to climb up steep climbs. Any damage to the rope causes it to disappear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "3SW9O0ZqhHvo0ORt"}
