{"name": "Gods and Goddesses","description": "One hundred Gods and Goddesses to watch over or destroy your players!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "qQfMMIC65xB4kTpH","flags": {},"type": 0,"text": "The Allfather – Ruler of the gods and creator of humans and other races.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "bDtlzPPcb33hRcxP","flags": {},"type": 0,"text": "Război – One of two gods of war. Although often seen as bloodthirsty, he actually hates war. He encourages brutality so that people will fear war and try to avoid it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "ub8weQCXsqNehKUN","flags": {},"type": 0,"text": "Erou – One of two gods of war. Generally the more worshipped of the two, being seen as the goddess of honorable war. Loves the thrill of battle and she appreciates it most when her worshippers fight battles in her name.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "2KUvHiwozSG4jNs4","flags": {},"type": 0,"text": "Nälij – Goddess of knowledge. Legend says she lives in an eternal archive with the knowledge of all that does, has, or will exist.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "UD3MhabMWlPdaAua","flags": {},"type": 0,"text": "Rymat Samiar – Demigod of bridges, ferryboats, and fjords. Samiar was born a mortal who later achieved great renown for his swordplay, trickery, and legendary ability to escape from the most secure prisons in the multiverse. His most famous exploit was escaping from the afterlife by transforming into a frog and swimming back across the Stream of Life. He tricked the Servitor of Death sent to retrieve him to make a bargain that he would protect others from mishaps when fording the Stream if he could remain free. Now he is invoked by those wishing a safe crossing across rivers and streams. He usually appears as a rapier-wielding bipedal frog.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "XLXhCNzqG8QAAsvf","flags": {},"type": 0,"text": "Ismaros – God of stalking. The hooded figure looks a bit like the grim reaper, but without being a skeleton. He is not very popular, but he is always there, always watching everyone and everything. If you wish to make a deal with him for information, it will come at a great price.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "IRYgZkd3OHMixL7v","flags": {},"type": 0,"text": "Edrun-Of-Far-Places – God of the unknown and the wanderer, dressed in a traveler’s cloak patterned with stars. He has no realm in the Astral Plane and instead is believed to wander the mortal realm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "QTAE6FbLJihPn2OR","flags": {},"type": 0,"text": "Talichtoli – God of Murder, justified or unjustified. Talichtoli’s symbol is a simple bone knife, and they gives their aid to any who truly wants someone dead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "onS9XCMVp8HhGCkr","flags": {},"type": 0,"text": "Pocaba, Lady of Islands – Goddess of sailors, fishermen and any who lives away from the mainland.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "IJtGlwOvOkRttoz1","flags": {},"type": 0,"text": "Hornfels – Dwarven god of home and hearth. It is common for members of any faith to keep a statue of Hornfels on the mantle. This god demands no worship, no tradition. Warming yourself by his protected hearth or eating food cooked at his hearth offers a kind of boon over the years. A request for home and safety can be made. Locate an outcrop of rock and, using soot from a campfire, draw a door-frame on the stone or boulder. The door-handle is drawn with a special rune. If done correctly and by the right person the door will materialize and a hearth and bed will be waiting inside the stone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "g2diVyKkCSK8f3ro","flags": {},"type": 0,"text": "Fýsi – Goddess of the reclaiming wilds. When disaster strikes a town and buildings or lives are lost, that is the work of Fýsi, she takes back the man-made. Followers of Fýsi are nomadic and travel between villages on the outskirts of the wilds. Followers of Fýsi are not so much protected by her, or sent by her for specific bidding, but rather understand that Fýsi will act and it is a question of disaster, or a safe offering. They understand that Fýsi acts to protect nature and her disasters are akin to the lashing out of a scared animal, when her home is encroached by mankind. Followers are often offered respite in abandoned buildings in the village. Often, disaster can be warded off when followers arrive at the village and suggest safe homes and objects to offer to nature, so that disaster can be averted. Rangers and hunters will seek out these followers for blessing to avoid animal attacks and other dangers of the wild. A common ward is a packet of seeds kept in a cloth pouch with dry earth from their village. As long as the traveler keeps the soil dry, they will be safe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "JxTsIDbA902pVlYD","flags": {},"type": 0,"text": "Calais – God of vigilance and domesticity. Domain: Life/Light Calais is not the most powerful or well-known god, but among the pantheons he is the most well-loved. Keeper of homesteads and of vigils he comforts the wives whose husbands have gone off to war and keeps hope alive in the hearts of men who are in far off and possibly dark places. Although his representation among clergy has diminished over time, he keeps the hearth alive and warm for all mankind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "QM8kb4h04ArQt8gl","flags": {},"type": 0,"text": "Noklaji – The Construction god, representing the expansion of cities and towns. This gnomish god is a deep gray all over and always carries a wooden plank with a nail in it as his weapon. Protects buildings and the people inside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "xTZfTJyeSvsweqFZ","flags": {},"type": 0,"text": "Vigo – Faceless Prince, Master of Lies, Patron God of Actors and Charlatans. Shapeshifter, Facechanger, the Great Mimic. Has no temples but a yearly festival where a parade of masked worshippers marches through cities. His holy symbol is a plain gold coin with two eyeholes, but any mask can be used to depict him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "pQWOy91EZFsFJqVM","flags": {},"type": 0,"text": "The Crone – Goddess of Mists, Magic and Prophecy. Worshipped primarily by the river halfling nomads, she is a little known deity and very mysterious. It is said these Halflings read the cards each morning to determine her will for them, and that her chosen on this earth (often an elderly female seer), is imparted with some of her divine manifestation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "JwboD4jjKPcJX7CU","flags": {},"type": 0,"text": "Samuqan – God of the Desert, Sun and Stars. He is known as a god of little mercy because of what he did to the land, but also as a guide for people, using the stars to help travellers find their way and tell their history.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "J2FGdGakHtE87Vtf","flags": {},"type": 0,"text": "Sangasu – God of Storms, known as a destructive force of nature, but necessary for renewal. It is believed he kidnapped [Goddess] and forced her to help him make monsters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "7WYhJv1V2AQ6gHw7","flags": {},"type": 0,"text": "Naphistim – God of the Sea and Sand, people worship him when they need to travel through harsh and unforgiving places. They often give thanks to him by way of sacrifice as a reminder of their mortality, but also their strength.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "fJqOUd6fvc53NzHM","flags": {},"type": 0,"text": "Mezizi – God of Time and Death. All things turn to dust and sand, many are burnt in funeral pyres to honour him as it is he who allows life even in the harsh climes of the deserts and wastes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "oLdVhOgYQtfpgskS","flags": {},"type": 0,"text": "Lugalme – Goddess of War and Fire. This goddess is the heat of passion and bloodlust, embodied literally as fire, she is prayed to in times of tragedy but also renewal, consummation and of course, before war.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "dPnNh4lQvynOQswv","flags": {},"type": 0,"text": "Amarazen – God of Protection and Life, she is said to be the one that guided [city’s founder] to the oasis that made [Desert city] possible. Those who anger her are given visions of water that isn’t real. Most claim her essence rests in the oasis and so the largest temple belongs to to her as she allowed them to live at the oasis’ side. Thus all who wish to take from the waters must pay tithes to the temple. She is secretly the goddess of secrets and sacred knowledge.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "DcwpnWn52sRbHcHR","flags": {},"type": 0,"text": "Elutil – Goddess of Monsters, Madness and Evil. Often depicted as an elderly woman, Elutil is cursed and hated by the people as the mother of Hags. Thought to have created most of the monsters in the world, it is hate and fear that strengthens her.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "LE3cbPeFQSqWwwhb","flags": {},"type": 0,"text": "Delondra – Goddess of Woe and False hope, but at the centre of her machinations is the promise of something greater. She is a fickle Goddess, known to test mortals, sometimes out of sadistic humor and sometimes from a desire to help. She is also a Goddess of Hope and Risk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "IcYQArdZeNzhPQUt","flags": {},"type": 0,"text": "Toitel – God of Travel, Wandering and Beasts. It is said he walks the world and has no domain other than where he stops to rest each night. He carries a shell on his back that looks like a rock to hide from people. Those who find him, he blesses with luck.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "GhUKpklL8ofp9dt1","flags": {},"type": 0,"text": "Caileon Le Corre – God of Protection, Music and Joy. He was sad to be a human who saved thousands from disaster and so was worshipped by them. He is depicted with a ring of swords and a lute. In times of revelry, some say they can hear his voice, keeping the party alive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "PiG2KH6KJeVM93eH","flags": {},"type": 0,"text": "Prophet of Harvest – All who wish for a plenty to befall them pray. A god of Hunting, Harvest, Wellness, Livestock and Famine A skeleton god, with a complete digestive system, the ribcage being filled by a beehive. Offerings are made with fresh meat, honey and pommegranites.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "sEkdpGIyky9bBMmt","flags": {},"type": 0,"text": "Michizane – patron god of learning. Often students will pray or provide offering ahead of a major exam. He is known to be fond of poetry, plums and oxen. Legend tells of the time a nobleman closed down a library, to expand his palace. Misfortune had befallen the nobleman and his family, until they reopened the library and built a shrine in his honor. His holy symbol resembles a plum tree.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "3IupMobh9itXvIHv","flags": {},"type": 0,"text": "Molac – God of Flame, Red Dawn, Flame Tyrant. The god of the primal wild nature of fire. He represents chaos, and that is passionate (love, art, war. etc…). He appears as a being made from flame bearing a mask made of blackened wood. He represents things that are all consuming and destructive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "BoCFUVfhhc1sdjCK","flags": {},"type": 0,"text": "Tempsdule: God of time – Born out of the fragmentation of Relatitus, former Deity of The Singularity, Temspdule lives in a temple on the Moon, guarding and manipulating the Universal Hourglass, that controls all time in the Multiverse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "aabxK8my6OFPkJyP","flags": {},"type": 0,"text": "Metria – Goddess of space – Also born from Relatitus, Metria dwells on a mile-high tower on the Sun, which she moves and protects, using it to coordinate the movement of the planes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "n7WvQRlyrHFbMVry","flags": {},"type": 0,"text": "Decepscher – God of illusion – Worshipped by illusion mages, Decepscher is often depicted as an artist, using a canvas and paint to shape the perception of reality. It’s said he lives in a personal semi-plane, where all normal concepts of space and time are irrelevant.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "BvBaRqXhZV3mplJG","flags": {},"type": 0,"text": "Aveli – Deity of birds – Once a majestic winged creature that soared through the skies of the old world, it created all the bird species, and sacrificed it’s own flying abilities in favor of it’s creation. Penguins and emus are a question Aveli refuses to answer it’s followers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "Zt7itur1JMR6wy5g","flags": {},"type": 0,"text": "Falkorta – Goddess of luck – Ironically, she’s worshipped by strategists and leaders, who believe chance plays a huge role in any important event. She decides who to give her blessings, and does so to anyone, just to make it look like she’s neutral, even though she prefers to bring luck to those who never give up. Usually takes the form of a small pink dragon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "K2ktuCxcojjk8p2e","flags": {},"type": 0,"text": "Icholese – The Lady of the Lake, the Teal Stream. Godess of lakes, rivers, and all inland waters. She protects the health of her people by granting them pure water and healings. She can take the form of a great predatory fish or a willow. Her fidels often throw offerings in ponds and ritualistically drown sacrifices","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "tlmxRFWPHLtV6DZU","flags": {},"type": 0,"text": "Doran – The God of the Forge. He is a Dwarf with a mighty hammer in hand and towers even Orcs in size. It is said that the unique weapons that Dwarves use come from Doran telling them how to make it when they sleep. These same legends say the weapons are to have a greater purpose in the future against an unknown enemy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "YamLjbVM7xKSCciY","flags": {},"type": 0,"text": "Bob – God of the mundane.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "h8tIHnhgpsIWKoew","flags": {},"type": 0,"text": "Peolai – Goddess of luck. Big on irony, she tends to make life chaotic for those people most staunchly committed to our ability to control our own destiny. On the other hand, for those who rely upon luck and appease her, their good fortune becomes almost predictable.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "J2bVind5EgzCT63h","flags": {},"type": 0,"text": "Lelia – One of the twin druid gods, Lelia is the opposite of Vadaszat. Called the Mother of Nature, the owl-headed goddess represents life and balance in nature. She and Vadaszat select a shared mortal champion from among their druids, called the Skinwalker.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "dr8PdEGdHJ1k4LGp","flags": {},"type": 0,"text": "Vadaszat – The second of the twin druid gods, Vadaszat the Huntmaster is the brutality and ruthlessness of nature made manifest. Appearing as a man with a deer head, he stalks the world’s forests at night hunting prey for sport.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "ixKTRzoniSrJdkcB","flags": {},"type": 0,"text": "Aussiria – Goddess to Kobolds, Dragonborn, and other races with draconic heritage. It is said she was born a pure white color, and emanated a powerful good aura unlike her brothers and sisters. Unlike other chromatic dragons, she values kindness and well being over power and hatred. Draconic societies that worship her are therefore very welcoming with their hospitality to outsiders, though they are not against using claw and breath to maintain the sanctity of their homes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "0eAXfeCEyS5JhJTY","flags": {},"type": 0,"text": "God of the Forgotten – you know how sometimes you wash your laundry and sometimes you end up missing a few socks? They’re his now. Orphanages hold a special place in his heart, and any legends, stories, or prophecies lost to time are his to know.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "Folxo4gR4OZrYdWW","flags": {},"type": 0,"text": "God of Belief – If an “AllFather” or “God of Creation”, or “King of Gods” had an origin story, it would be because of this god. Following through on superstitions (like knocking on wood, or throwing salt over your left shoulder) is worship to him, and as this God is of Belief, he is able to create new Gods–which may or may not be properly thankful for their creation (e.g. “Oh hero, it is because of your belief that I am alive! Here is a boon.”). His true form cannot be seen by anyone, as anyone who sees him sees what they believe he looks like.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "KbNmRiS64N3vvwOZ","flags": {},"type": 0,"text": "Goddess of Choices – Much like her sister the Goddess of Luck, this goddess is more on the “cosmic” scale of things. Able to see other outcomes for different choices–and depending on the outcome of the choice and whether or not you are in her favor, she may let you choose the more fortunate path. Alternatively, if you piss her off, she may send you down the more destructive path–even if it seemingly looks like the best path, at the moment. She is fond of games that require logic or math.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "jPEhNzMAnOAs94j7","flags": {},"type": 0,"text": "Goddess of Elements – not just of water, nor solely of fire, air, or earth–and certainly not “mother nature”. “Element” golems worship her, as it is she who grants them life. She has a particular fondness of fire and lava–or, really, any of the “heated” elements. Being a high priest in her temple means remaining virginal–she rewards loyalty with immunities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "PyUcFZVZ2l6xQzQS","flags": {},"type": 0,"text": "The Gray God – A solitary genderless god, half pure evil and half pure good, both sides are eternally in pain from the others’ existence. Worship at their feet means relief of pain from it’s existence, and with relief brings information that Good can use against Evil–as well as information Evil can use against good (both pieces of information are given at the same time to the one worshiping). Also could be considered a god of wealth, the Gray God also finds pain relief in donations of silver coins (melted in sacrifice). The larger the donation, the more your alignment slides towards True Neutral.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "lCPA28AHEsZXe3IX","flags": {},"type": 0,"text": "Goddess of the Gift – any time something is given selflessly, or out of good will to another is worship to her. Fun fact: any version of “Santa Claus” on any version of reality is her champion. Usually “appears” to those who have great potential but are in dire straits–she isn’t ever actually seen, mind you, but something draws her target to whatever gift she’s left behind. Typically, her gift is contextual in nature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "2ekQnudmc3V2O4XK","flags": {},"type": 0,"text": "The Write/ReWrite God – authors/bards pray to him, their worship is books/songs, his temples are libraries/music halls. This god looks like… well, like a shut-in middle-aged male with a pencil on his ear, glasses down his nose, and rumpled up dark-brown hair with silver streaks on either side. If your adventure, your quest, whatever mission you’re on, is not going well… you pray to this god, and hope he doesn’t find your story exciting. If your downturn of events makes for a good book, he will ignore you, and may even possibly send more challenges your way; but if you seem unjustly getting the wrong end of the stick (so to speak), he will erase what’s happened, and re-write it so you come out better.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "pauECB8OnRzHVGBQ","flags": {},"type": 0,"text": "Spencer – God of storytelling and beards.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "j9zRD5TkAZYe3vqS","flags": {},"type": 0,"text": "Vance – the god of deceit, mischief, and insanity. Represented by a smiling gray mask. He blesses those who worship him with insanity and power. On the occasion that he comes to the material world, or a follower gains his spirit, he tends to go to casinos and bet everything he has on him. When losing, he burns the place to the ground. He is known to take any bet, whatever the chances.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "iM5QITe6kHPCJ4nC","flags": {},"type": 0,"text": "Judrod – Goddess of lost causes. Taking the form of a brief spark of light, this goddess is known to appear when all seems lost. A flash in the eyes of a sickly child just before a miraculous recovery, a glint off a rock that momentarily blinds an executioner, a meteor in the sky that leads a starving man out of the forest: all these are manifestations of her brief favor. Impossible to prove from mere coincidence, her boons are nonetheless real.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "XTLkeGIZ7CZAXmEN","flags": {},"type": 0,"text": "Paxe – the god of peaceful passings. Taking the form of a kindly stranger, this god will appear at the side of those dying in pain or in fear and will comfort them until they claimed by Death. Paxe will grant blessings on those that nurse the sick or comfort the troubled. Necromancers and torturers earn the god’s wrath, as Paxe will reveal in harsh detail to them how they will die.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "ThPLUikEEb9UmwIf","flags": {},"type": 0,"text": "Fortuna – goddess of luck and gambling that celebrates fair play. She will never alter the outcome of a game of chance, but will often grant boons to those that willingly risk everything. Appearing as a smiling beauty with fire red hair, she might gift a gracious loser at a casino with a priceless ruby or a winner at a card game with a passionate kiss. Those that cheat at games of chance, though, earn her wrath and instead see her moments before meeting a grusome end in a random accident.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "uVNkY4Jwn1fCqt6E","flags": {},"type": 0,"text": "Azuiar – Secret god of preservation. On the surface, Azuiar is a god of evil, the proverbial devil on your shoulder convincing you to do bad things. In reality he chose to adopt the mantle of the evil god out of fear that the world was changing too drastically toward good. Azuiar is the god of all who wish to corrupt and do evil for its own sake.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "gkbVjBNXPfxangq2","flags": {},"type": 0,"text": "Entaros – God of the Soil- A massive giant ridden with dirt, grass, and plant life. Many say he is made of stone himself, with a heart of diamond. Legend has it, the most rich soil is that which clings to his back, and that those who worship him will be granted with the ability to grow all plants in any location. He rests in the earth, appearing to be a huge overgrown mountain. Many druids and those who respect nature are his followers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "3zFIftazDGbypx8z","flags": {},"type": 0,"text": "Knaben – God of archeologists and ruins, he guides those who seek lost knowledge. Mostly invoked to protect graves and monuments from grave robbers, buildings blessed by him are immune to the wear of the elements, at least until someone recovers their secrets.Ub’took – God of Aliens: A disliked loner of a god that has taken an interest in mindflayers, beholders, and other aberrant creatures. Most aberrations stick don’t worship him or even acknowledge his existence but Ub’took does have a small following. He is also a patron of all mortals who study alien lore and magic.Nurggle – God of the unclean. Nurggle thrives on the rot and decay of all things as he and his followers see it being the common denominator of everything. Nurggles avatar is the form of a Giant/Orc hybrid with the broken antlers of an elk. He wishes for the decay of not just physical entities but also society, love/purity in relationships, and advancement. His followers often douse townsfolk with their chamberpots and exhume corpses in the name of Nurggle. Nurggle only appears to mortals when they have destroyed or desecrated something of great sentimental worth, when he reveals himself he will complete one task for a mortal so long as it is vile and distasteful. No Lawful or good alignments would worship this deity.Mamcho – Humanoid woman, solid gold eyes, long curly hair, light brown skin, radiates a warm light. Dressed in white robes. Goddess of hospitals, harvests, the home, and family. Patron goddess of parents, doctors, and patrolmen. Described as being very warm and friendly. Symbol: The shield, can be found carved into the cornerstones of fortresses and above the entrances of homes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "1ktMbFpph1ugFPaf","flags": {},"type": 0,"text": "Ub’took – God of Aliens: A disliked loner of a god that has taken an interest in mindflayers, beholders, and other aberrant creatures. Most aberrations stick don’t worship him or even acknowledge his existence but Ub’took does have a small following. He is also a patron of all mortals who study alien lore and magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "aFISKh4NgpqV6vjh","flags": {},"type": 0,"text": "Nurggle – God of the unclean. Nurggle thrives on the rot and decay of all things as he and his followers see it being the common denominator of everything. Nurggles avatar is the form of a Giant/Orc hybrid with the broken antlers of an elk. He wishes for the decay of not just physical entities but also society, love/purity in relationships, and advancement. His followers often douse townsfolk with their chamberpots and exhume corpses in the name of Nurggle. Nurggle only appears to mortals when they have destroyed or desecrated something of great sentimental worth, when he reveals himself he will complete one task for a mortal so long as it is vile and distasteful. No Lawful or good alignments would worship this deity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "y4MdeMPiuEIMbw7O","flags": {},"type": 0,"text": "Mamcho – Humanoid woman, solid gold eyes, long curly hair, light brown skin, radiates a warm light. Dressed in white robes. Goddess of hospitals, harvests, the home, and family. Patron goddess of parents, doctors, and patrolmen. Described as being very warm and friendly. Symbol: The shield, can be found carved into the cornerstones of fortresses and above the entrances of homes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false}],"formula": "1d59","replacement": true,"displayRoll": true,"_id": "hfKAeq540mXaqToQ"}
