{"name": "Interesting Dungeon Encounters","description": "One hundred different encounters that can occur when traveling through a dangerous dungeon.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "wev16wgGwfM5Ro8L","flags": {},"type": 0,"text": "Under a loose bit of cobblestone on the ground, you see what appears to be a small tunnel. If you reach inside or stick around too long, a living crawling hand jumps out of the hole and attacks. This living hand has been hoarding rings and jewelry in this tunnel.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "oOAx00gOepUZDTbO","flags": {},"type": 0,"text": "The group finds a long forgotten coin hoard. All is not as it seems, some of the coins are tiny-sized mimics (maybe individuals, maybe swarms), that adhere to and attack those that try to gather the treasure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "9PMFglEWuf164EBD","flags": {},"type": 0,"text": "A crumbling wall with a small tunnel bore through its base hides the resting room for a peaceful Goblin who knows the dungeon well and will give directions or hints in trade for an interesting item.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "3YYoZv05Vhsdt69g","flags": {},"type": 0,"text": "A series of really, staggeringly obvious traps. There’s a tripwire that’s made of thick hemp rope, a wooden pressure plate set in the middle of a cobblestone path, a dark path with a torch set right at the beginning (the torch is crudely attached to a lever on the wall).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "Ed9PXA75pnJW2WEU","flags": {},"type": 0,"text": "The ceiling is completely covered with horrid insects – dark, silent and unseen except for the occasional masonry dust they knock loose.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "rxS1IYb1HUYwoAbe","flags": {},"type": 0,"text": "Around a corner, you hear clucking. There’s a chicken in the dungeon? You’re three levels down. Shrug: maybe it’s just random. But every three rooms or so, there’s another one, just a chicken walking around and pecking at the dirt. Then you get to a region where there aren’t any chickens. That’s when shit gets real. Because the chickens are a food source.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "C8xowBl3gfUcNYmN","flags": {},"type": 0,"text": "A dead end – The tunnel the party is walking down has them run headlong into a Giant!! Well, the upper torso of the giant. He’s not hostile and is pinned in place by the surrounding walls as he was chasing dinner down a hole and has wiggled himself into this tunnel, blocking any forward movement. If the party attacks him, he will yell and cry, ‘Stop it, please!’ and be overly pathetic, but with his arms pinned at his sides, they will likely kill him in time (suggest higher hit points than normal so the party has to take their time). If they chat with him, he knows a bit about the surrounding rooms as he’s seen creatures moving through the halls and possibly former adventurers. His name is Gordum, and he’s really hungry as he hasn’t eaten in a very long time. Normally, adventurers take pity on him and feed him while they make their way through the dungeon, but the real reason he stays stuck here is a ring of sustenance that he found years ago and pull on ’cause it was shiny.’ If he’s friendly, he offers to watch over the party while they sleep and promises to warn them if anyone else comes down the hallway.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "c5ue4X0lmvTagVwa","flags": {},"type": 0,"text": "A rune trap curses you so that you can’t refuse a request. (Requires the word please to count as a request).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "uOPiuKS05dnNNP5n","flags": {},"type": 0,"text": "A dragon’s cave? – This room is 60 feet (18 Meters) across, and nearly as high, with small pools of water that collect in natural erosions to the west side where an underground stream has formed a small waterfall. The water is chilled and safe, even if it tastes earthy and heavy with minerals. As the group moves into the cave, they likely notice coins littering the edges of the room in small piles and an outcropping halfway up on the east wall… with a snoring, smoking dragon’s head. If the party is quiet, they can sneak through, but any attacks or loud noise wake and do not harm the dragon. It lets out a massive burst of fire over the heads of the group and yells curses as it waves around. Once it finishes, it demands tribute from the group or it will eat them!! In reality, the head and neck are a permanent illusion that was placed in the area to scare off adventurers by a mage who was practicing some new defenses for his study, and a fairy dragon has worked out how to control the illusion and get it to move when he wants. He uses magic to project his voice and sound like a great dragon, and can use a rune placed as part of the illusion to fire a cone of fire 3 times a day that does damage as an ancient dragon. The Fairy Dragon living in a small opening that’s only accessible at the top of the dome ceiling with a meter (2.5 foot) opening that one would need to fly to or us other means. Any tribute that’s left is floated to his home when the adventurers move on and kept there, or discarded around the ground to add to his greatness. (If characters can get to his cave, he should have 2-3 magical items of some note). The little guy has really done well duping people over the years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "PvDgBKNefAjgeZff","flags": {},"type": 0,"text": "A dire warning – Moving through this hall, the characters torchlight will cast light through a red ruby the size of an eye that’s been carved to catch and cast the light around the room. If there’s no light, the ruby isn’t found. The light through the ruby displaces words in 5-6 directions saying ‘The Stone of Anolox.’ A group also notices a warning on the wall, one painted with blood and another carved with what must be someone’s finger nails saying – ‘Do not, by any means, touch that gem!’ Anyone who picks up the gem, well, except Anolox, is immediately disintegrated and their ash fills the tunnel.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "Ne8sZQxv5raSMaRn","flags": {},"type": 0,"text": "A door painted onto a wall with two door knobs sticking out, one labeled ‘fame’ the other ‘fortune’. Touching fame will turn you as blue as a smurf, only reversible by a wish. Fortune will cause 10,000 cp to fall from the ceiling at great speed causing heavy damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "0MiweqDPCFQhrQA8","flags": {},"type": 0,"text": "Bad Directions – A series of alcoves with a skeleton set to perch in each of them. Each is placed alternating up the hallway at 20 ft (6.5 Meter) segments. The first points down the hallway, the next at the floor, and the next straight up, and so on. Every time the party moves past the skeletons, they point a different direction, and it changes every time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "q4AaM5KSDSwgRkUf","flags": {},"type": 0,"text": "Morbid Statuary – A massive room filled with people frozen in time, and in stone. Like creepy stalagmites, hundreds of humanoid statues point up from the ground. One looks like a prince leaning in to kiss a sleeping princess, another is a goblin throwing its hands in the air in panic, and another a cautious knight stalking in his armor. The place looks like a repository for the victims of a gorgon, hopefully long gone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "WBxPA21f6z6DwjKY","flags": {},"type": 0,"text": "Help us Heroes! – The group comes across an small village that spreads out in a crevace in the wall and stretches for hundreds of feet, but where the ceiling is never more than 4 feet high. This is a village of Myconids that have lived here peacefully ‘since the time of our first spores’ and numbers in the thousands. They beg the party to help them as there is a murdered in the midst. Every day, more and more of their people go missing, and they can’t find the culprit. If they are helped, they will give the party pearls that they collect from nearby shellfish and have saved for years. (The murderer is a kobold with a ring of invisibility and a strange mask to keep from falling to the creatures spores. He REALLY loves cooked mushrooms and has been harvesting the myconids for dinner since finding the village).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "p5w2rM4OUp71I0F3","flags": {},"type": 0,"text": "Welcome Matt – The group comes to a door rigged with a number of traps. A line at the top that pulls something above the door if it’s opened, a pressure plate that’s released from the bottom if the door is opened, poison darts that fire from the wall behind it, the works! All the traps are fairly easy to spot and disarm, and there are 6 total. An exceeding high perception check is needed to hear that there’s a small click after each trap is set off or disarmed. Once all six have been triggered, the real trap occurs. The walls 30 feet to either side of the door slam into the ceiling (these are 10ft cubes). At the same time, the floor drops out under the door at a steep angle to a smooth shoot, and the walls start moving in. While it looked like there was something behind the door, it leads no where but a series of mirrors that look like a nearly endless hallway, and with the walls closing in, the only way is down. Those characters that do slide down are eventually deposited into a large cage where a robed figure covered in bandages whips around and screams, ‘Happy Birthday Matt!’ He’s then disappointed that you and yours are not Matt. After muttering to himself for a while, he eventually apologizes for the ‘trap’ and releases the group, showing them to a set of stairs that head back to the tunnel. They don’t run into this encounter again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "K7ioqJ5u6ZQStLiY","flags": {},"type": 0,"text": "Poor soul- you find a skeleton chained to the wall. When you approach, you realize it is an undead. He is scared when you approach and explains that he was trapped here and was brought back from death to continue his torment. Who put him there is up to the dm. Also whether or not he is lying is up to you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "7s0ZXfxwJYLE9vCc","flags": {},"type": 0,"text": "The room nullifies any sounds made, players must communicate entirely through gestures OOC.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "m2ncNXbqX1o7Erxa","flags": {},"type": 0,"text": "The door opens up into a mirror dimension flipped horizontally, any and all actions taken are performed by the doubles on the other side, including stepping through the doorway. If a PC attempts to talk they are interrupted by themselves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "fCjqFGDKhQpQb633","flags": {},"type": 0,"text": "The party walks down a hallway which and comes across an opening on one side leading into a large open room. Stepping on a trap in the middle of the open room causes the door to shut and the ceiling to begin to collapse – but only as long as one member of the party is still in the first hallway. That party member can disarm the trap, opening the door and raising the ceiling by finding a recess on the wall in the hallway with a switch in it. If they fail a roll on the first attempt they only manage to stick their hand through a hole into the room and have to search for a second recess.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "KxwtVPtcePcXAHwB","flags": {},"type": 0,"text": "A large pit, filled at the bottom with spikes and scorpions. A sign is just visible on one side of the pit. A successful perception check, or a party member being dangled by their feet, can detect that the sign is upside down and says ‘LEARN THE WORDS’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "Hp2ZwizQHG03QQ0a","flags": {},"type": 0,"text": "The skeletal remains of a man can also bee seen at the bottom of the pit, still wearing black pants, suspenders, a shirt with horizontal black and white stripes, white gloves, and with a black beret perched atop its bleached skull.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "HAta38HytSHUcmHY","flags": {},"type": 0,"text": "A gnome sorcerer with short term memory has been trying to find this dungeons hoard for the last 10 years, but keeps forgetting which way he came from.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "IhU1zCwdQbkiM3ds","flags": {},"type": 0,"text": "A large banquet hall, with pewter utensils, earthenware plates, and fine food. The walls are draped in common but warm furs, and the table is lit with some nice candelabras (2gp each). There are 2x(Party Size) seats at the table, and at the head is a stout, ruddy faced bearded earl who warmly beckons to the party. ‘Welcome,’ he he says, voice booming, ‘our other guests are almost here. Please, sit down.’ Seat the most interesting mix of NPCs, Villains, and historical figures at the table. The banquet quests are compelled to not make any hostile action in the room. The non-party guests are returned to whatever place and time they were in before the meal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "NMU3pMAogR1dvnBH","flags": {},"type": 0,"text": "A merchant adventurer (CR party level+1, true neutral alignment) has set up a table, chairs, and all manner of interesting equipment to sell to whomever happens to wander by.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "GhlOYBYJlYyyWdvO","flags": {},"type": 0,"text": "A wandering mycologist is looking for the weirdest mushrooms that you can find for their latest thesis/monograph. Not only will he pay (not much) for any mushrooms you can help him find, but you’ll get a mention in his paper! Think of the exposure! All the biggest mycologists in the region will be talking about this.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "Coge5RQkky0m5l58","flags": {},"type": 0,"text": "In a this room, there is a dividing wall with a doorway. On this dividing wall are a series of colorful masks. Around the dividing wall appears to be a large wooden table with 10 chairs, 8 of them already filled with large creatures (a mix of monsters and/or adventurers in any combination) playing Texas hold’em poker for coin and valuables. No one is talking. Any players at the table who notice you will stop, stare, and point silently to the masks. Any two party members who wear the masks can join the game.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "S4TRb1u63Q4j0KiW","flags": {},"type": 0,"text": "The party walks in on a group of hostile hobgoblins in the middle of them practicing their synchronized dance routine. After one round of surprised embarrassment, they will attack unless the players either start playing music or challenge them to a dance off.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "KBY1dVDIjc6pgUEK","flags": {},"type": 0,"text": "This room contains a hole with a wooden bucket on a string suspended over a large, clear pool of water. The bucket hangs down through a circular hole in the ceiling, leading up to a well. As the player’s approach, a coin falls down the hole, and a distant voice calls: ‘Magical well, I seek thy wisdom!’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "vIwTpeneS5wfMK3s","flags": {},"type": 0,"text": "This room is round, with a concave floor. Three large, metal spinning tops whirl magically around and around, bashing into each other seemingly at random. On a balcony wrapping around the room are three goblin shamans, engaging in their favorite pastime, BattleTop. Each controls the tops with a small, delicate handheld contraption. The tops will cease spinning if the contraption is broken, or if they leave the room for more than 1d4 days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "m9qaeN4546SCVQWC","flags": {},"type": 0,"text": "This area of the dungeon appears to be under construction. Goblin work crews and ogre haulers are lead by hobgoblin foremen, building out new rooms and defenses according to blueprints lying unprotected on a table off to the side momentarily forgotten.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "KQY1OyPx8M6b4MXK","flags": {},"type": 0,"text": "Three nothics sit, pouring over old tomes and scrolls, lit by blue crystals scattered on a pedestal. On the wall, a giant, engraved flaming eye is engraved. Staring at the carving of the eye for any significant length of time (DM’s discretion, but at least a few minutes) grants advantage on wisdom checks until the player’s next long rest. The player feels compelled to be unable to rest for the next two days, and is exhausted on the third day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "LahNL4EAAWzh8wRV","flags": {},"type": 0,"text": "Carved on the wall in code are the letters…H-A-S-T-U-R. If deciphered and spoken aloud, then whosoever speaks the name of this horrid Elder God, HIM WHO IS NOT TO BE NAMED must make a saving throw against magic or a Byhakhee will be gated in and attack (or the PC may go insane?).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "Mo6vXPjPrsODwpVC","flags": {},"type": 0,"text": "You walk into the next chamber and find a stone statue of a man reaching for a gold ring on a pedestal. The ring, when worn for at least 1 day, gives you +1 to all saving throws for each day it has been worn for up to a week, but if you take it off you suffer the inverse of that bonus for as long as you had it on. You can’t sell the ring. Putting the ring on the man’s finger will restore him from stone, at which point he reveals this ring was the result of a transmutation spell going horribly wrong. He gives you a level appropriate large sum of gold for releasing him and goes off on his merry way.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "3QfWtEdjFZFSUTdr","flags": {},"type": 0,"text": "The ceiling of the dungeon tunnel has partially collapsed down, making it very difficult to get past. Characters would have to strip off any medium or heavier armor and backpacks to crawl past it. Investigating it more reveals some furniture at the top of the rubble near the ceiling, indicating a room above, but investigating it will probably complete the collapse and prevent further exploration down the tunnel.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "p1UDbxbL6mPto887","flags": {},"type": 0,"text": "A several story deep library attended to by a seemingly human librarian that doesn’t know his library is deep in an underground dungeon. The stacks are littered with skeletons of all shapes and sizes but it doesn’t seem to bother the attendant. Now that you mention it, it has been a few years since he’s had anyone visit. That is, of course, anyone besides the necromancer that comes by every so often. – defeating the necromancer and his skeletons allows you access to the library. It contains a bunch of spell books for the wizards in your party, some defensive magical items, a moderate stash of gold, and a heap of baubles and nearly insignificant magical items.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "wsjxXaOwDb9NuCSu","flags": {},"type": 0,"text": "An undead, but coherrent, merchant runs a small item shop in the depths of the dungeon. The shopkeep is a little mad, but seems content to run a shop with average or slightly below average prices on basic goods (maybe a few rarities at DM’s discretion.) The Merchant seems disinterested in the world beyond the room their shop is located in, and if pressed seems to think they’re getting new supplies in once a week. Will react accordingly if the PCs attempt to cheat or steal from them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "RHvXB9zmR8ccYTM7","flags": {},"type": 0,"text": "An archway has been heavily barricaded and the area around it has sign postings in the language of the dungeon’s inhabitants with stern warning to stay away. Skittering can be heard from within. Inside is a wing of the dungeon containing a burrow having broken through the wall and an infestation of subterranean creatures of the DM’s choice. (Possibly of a high CR to make this optional wing and its loot a real challenge to the PCs)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "bCzBIIAuqfT7zUPG","flags": {},"type": 0,"text": "A patch of wall indiscernible from the rest of the dungeon except for the incredibly soft quality of the stone. A small alcove containing a slightly inhuman skeleton is on the other side.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "idIvH7LmyERpap2s","flags": {},"type": 0,"text": "A room that has no gravity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "HpAf2BJTPtuShloQ","flags": {},"type": 0,"text": "A crack in the floor that constantly streams out a thin wisp of smoke. It smells of honey.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "h0RhQyjejiAy3ZGp","flags": {},"type": 0,"text": "A docile monster that is permanently invisible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "igtEi5ewfFBFdqUw","flags": {},"type": 0,"text": "A room with a large central pool in which an elemental lives, protecting a powerful artifact.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "wjXsJRU5updPQN4V","flags": {},"type": 0,"text": "The ghost of an adventurer that became lost in the dungeon years ago.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "8eccMVJSC38VkoGE","flags": {},"type": 0,"text": "Foolish forebears- Ghosts of an adventuring party that died there long ago. They re-enact the the moments leading up to their deaths with no notice of the players. They can help lead them through the dungeon, and even offer information the players don’t know. Eventually though they will lead the party into a trap or deadly encounter","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "lZDZ1AwqzRNbcZcZ","flags": {},"type": 0,"text": "Nuka skeletons- A room with the charred skeletons of dead adventurers. The walls are burnt black with the only thing juxtaposing it being the perfect white silhouettes of their final moments. When the player’s backs are turned the silhouettes move, and begin attacking the players. The skeletons get up, and their burnt black bones come alive with fiery cracks not dissimilar to embers left in the bottom of a bonfire.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "U6pipgGHCfaRKfGz","flags": {},"type": 0,"text": "Murder mystery spectacular-A doorway that leads into a well set dining room has an instant kill trap thst extracts people’s souls from their bodies. They now have to act as ghosts in a murder mystery dinner party, and can get back in their bodies once they have helped solve the mystery. They are unable to communicate with anyone directly, but they can ‘haunt’ things to send messages.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "ibiLr44m6BJ4st7I","flags": {},"type": 0,"text": "Arachnid ally-A spider living in an old shoe offers information to adventurers for a modest fee. She can offer shortcuts, intel, and hidden passages","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "x5A5gW0cCgtO8FHM","flags": {},"type": 0,"text": "Pilfering party-Another adventuring party has been stealthily following the party, and plan to jump them in the treasure room.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "QoSuHIm5Nw33piEm","flags": {},"type": 0,"text": "No blinking!- As soon as the players step into this room the door locks behind them. The room is mostly normal with the exception that one wall has the words ‘no blinking!’ Written out in huge letters. If the players blink they see where the key is hidden, but only for a split second.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "BH5vOV9pclBWVSwe","flags": {},"type": 0,"text": "A room filled with artifacts such as gems, ancient pots, weapons. Some are on pedestals but most are scattered on the floor as if someone has ransacked it but left everything inside. A small, golden statue of a dragon lies smashed by an empty pedestal, and at the end is a locked door with no keyhole. A large mirror leans against the wall on the left of the path. Reflected in it is the room, but with everything carefully arranged and the dragon statue unbroken on the pedestal. If the players attempt to steal anything, the pathway they came through liquidates and melts, across, trapping anyone inside the room and crushing anyone in the hall, until it is placed back where it was found. If the room is arranged like in the mirror, including mending the dragon statue, the door at the end slides open.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "DkM19CEdDRKHUu3q","flags": {},"type": 0,"text": "A hole in the wall, about the height of human shoulders. There is something shiny on the deep end of the hole, however to reach that, you would have to reach inside, and it’s deep enough to swallow your arm up he shoulder. If you reach inside, something bites you, causing 1d4 piercing damage. If you reach inside again, nothing bites you and you are free to take the shiny thing. It’s a single goldpiece.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "A6CRQ1T4ZgNjeVFM","flags": {},"type": 0,"text": "An old gnome is sat on a barrel smoking a pipe in a corridor of the dungeon, where the path splits into two. He gives the players a pleasant smile, and starts chatting about the draught. If they ask about how he came to be there at gives a vague answer about knocking the area well and directs them down left corridor, promising it’s worth their while. If they do they find a backpack filled with old treasure worth 30gp and the skeleton of a gnome lying beside it. If they go back, the old gnome is gone without a trace.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "K7Fx47O93CO9XNHb","flags": {},"type": 0,"text": "A large disk floats rotating, a few inches from the circular walls of the room. Through the cracks you can see a deep chasm. At even spaces around the walls there are open and empty tombs, each with a seal floating above it. If the players all venture into the disk it will activate and spin violently, using its centrifugal force to push the players into the tombs or the entrance or exit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "ApQ8WDKIw8QJ7QJA","flags": {},"type": 0,"text": "The ghost of the now crumbling manor is not pleased that some adventures are taking his stuff, but instead of attacking, he tries to find some middle ground with the group so he can be left in peace.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "lv8gwk6L7GlqVBCG","flags": {},"type": 0,"text": "In front of the party is a large stone door, possibly of gnomish construction that is covered in thin grooves that seem to make out a labyrinthine maze. In the middle is large ruby red gem that, when touched, shrinks the party and puts them somewhere random inside of it. In order to re-enlarge themselves and exit the labyrinth (thus opening the door) they must find their way back to the gem that now looms menacingly overhead while dodging mechanical spiders and tiny traps.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "WuvDhmH0EqtenQQt","flags": {},"type": 0,"text": "A tiny telepathic spider offers to show them to a secret shortcut to the end of the dungeon. When followed a phase spider ambushes the party and thanks its child for bringing home dinner","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "DwdDmTy3w1GHjnUD","flags": {},"type": 0,"text": "A room with magical darkness cast upon it hides important clues, but the only thing that can dispel the darkness is a living chandelier over the player’s heads. The only problem is that the chandelier can feel pain and doesn’t want to be lit on fire. The party can try to convince the chandelier to let them light it or light it forcefully. If the latter then it screams bloody murder attracting any nearby enemies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "HgRgesgsJs84bMTH","flags": {},"type": 0,"text": "In a completely filled treasure room a single sentient gold coin waits to liberate it’s brothers and sisters. As soon as the player’s backs are turned the gold coin begins animating 2d20 gold pieces a turn and they all make a break for it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "mOb73D4Q3802IXSU","flags": {},"type": 0,"text": "In a large empty circular room in the middle of a tower is a flower surrounded by a ring of fur. If the flower is pulled the room shifts downward a few feet if the fur is ripped out it goes up a few feet. As soon as one is taken. It regrows as fast as it was pulled until it reaches the top or bottom level.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "y6GuFRFSO73TUkGx","flags": {},"type": 0,"text": "At a junction of hallways, the players notice one hallway has a slight breeze accompanied by a slow, rhythmic wheezing. The air is slightly warm and has an acrid smell. If they seek out the source, it leads to an abandoned forge with an enormous billows. An enchantment keeps the forge warm, like a magical pilot light. The late forgemaster’s bones sit hunched at a workbench with various mechanical drawings. There are various trinkets around the room, some magical, some mundane. If the players take any of the items, they are attacked by a previously dormant construct that was sitting under a cloth in the corner of the room.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "OOPrO1oqjPpKvk1E","flags": {},"type": 0,"text": "The players begin to smell a faint scent of baking bread. Is it delirium, or does someone live down here? Bonus! The smell of baking bread is soon joined by the smell of roasting meat. If the players seek out the source of the smell, they find a crack in the wall that leads to an ancient banquet hall, inexplicably laid out with a feast.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "mXo1BmyPqcbrjX1r","flags": {},"type": 0,"text": "The party finds a door, barred and barricaded. If cleared, the door appears to have been hastily welded shut by pouring molten metal around the edges, and requires a strength check to open. (or some industrious chiseling) When opened, the doorway opens into a void, scattered with stars. The party may step through, and they walk on an invisible surface even with the floor of the dungeon. Who knows what could be found in this strange realm?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "mNMs2y3m0Hyndhji","flags": {},"type": 0,"text": "A room lined with standing alcoves. The alcoves are inhabited by a body encased in (magical) crystal. A knowledge history check can date the bodies to various eras of history. Near a collection of empty alcoves is a body bearing an item of only recent styling, invention, or popularity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "3wvMnXlH7hqjqwnC","flags": {},"type": 0,"text": "A barren room with a standing mirror at one end. The mirror is cracked, it appears someone took an axe or sword to it some time ago, but the magical runes around it’s edge still flicker faintly with power.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "zImaxAhkzyT1TWMI","flags": {},"type": 0,"text": "A room that appears to be a shrine of some kind. It contains a 10 ft wide, 3 ft deep circular pool in it’s center. In the pool, there is a duck. The duck resists all attempts to discern it’s nature, for all intents and purposes, it appears as an ordinary duck. The duck is docile and is content to do regular duck things. If, at any point, a member of the party says ‘I wish…’ within 5 feet of the duck, it quacks, grants the wish, and disappears in a suitably appropriate and silly display.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "qXX7o2frmE5OTSOq","flags": {},"type": 0,"text": "The dungeon is very cramped, smaller than usual hallways, doors just tall enough to fit through, etc. At the bottom of the dungeon is a large, cavernous chamber containing an enormous monster. Upon inspection, the chamber appears to be a sort of colosseum. The monster may be dead, undead, or alive, and may be immediately aggressive, or just want a friend. It has no understanding of how it got there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "mKVSvy6wSa85h4hY","flags": {},"type": 0,"text": "You come across an adventurer/adventurer party that has been magically bounded to a room so they can’t leave the area.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "iAQgxrwh0NZQAhCz","flags": {},"type": 0,"text": "There seems to be a weird hole in the wall that is pitch black. It doesn’t seem to have good magic or evil magic, in matter of fact, there is no magic coming from it. If an object is thrown into it, it shoots straight back dealing 1 damage. If a PC tries to get close, it automatically seals and reopens when no one is within 5 feet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "2nHDfSnLLXmCkPjX","flags": {},"type": 0,"text": "When you enter the dungeon, after clearing the first few rooms of traps, you realize that the homeless had already cleared out the area and is now using it as a place to live and sleep in, they say it’s better than sleeping in the streets.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "OpIyo78vpQeBn79R","flags": {},"type": 0,"text": "The room is raining?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "Ez7FXigKXVsaBBve","flags": {},"type": 0,"text": "You come across a nice looking devil statue in the middle of a room, after a DC 20 (Investigation) check, it turns out there is a button in its mouth, when pressed, the mouth closes shut dealing 2d4 piercing damage and you can see blood dissolving as it leaves your skin. After 10 seconds it reopens and the statue turns into an imp, this imp now serves under the PC that put their hand in the mouth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "bpzVi3StP8dTPnBB","flags": {},"type": 0,"text": "A reverse pit trap; a reverse gravity rune with the pit above instead of below.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "yylCwalUBgtQbeqW","flags": {},"type": 0,"text": "The hallway the party is currently in starts to fill with water at about a knee deep height. Waves begin to form on the opposite end of the hall and rush towards the party. Each character in the water must make a DC 13 Dex saving throw or be knocked prone and pushed back 10 feet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "oKkW5Rnd6rRAW4tt","flags": {},"type": 0,"text": "A dwarven fighter, The last survivor of her party, is trying desperately to dig her way out of the dungeon with her war pick. Unfortunately, just as you reach her she breaches the dungeon’s sewers and unleashes a giant crocodile and a swarm of rats.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "9AJxUYdkBHvFl1Om","flags": {},"type": 0,"text": "An enemy Hobgoblin wizard the party is fighting casts shatter and collapses one of the nearby crumbling dungeon walls, revealing the basement of a very confused and panicked Halfling couple.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "HPYHI6GkhC76d4Jl","flags": {},"type": 0,"text": "Pipes high up on the walls in this chamber are dripping some kind of emerald-green liquid into a wall-mounted fountain. The fountain is nearly full. A successful miscellaneous intelligence check tells you that it’s just liquid paint. Highly toxic paint, but just paint. The fountain drains into an adjacent room, which is completely knee-deep in the liquid.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "8RsiDNHXZwmsZwQR","flags": {},"type": 0,"text": "The room contains a number of flensed livestock hanging on hooks, as if you’ve entered a butchery. Alongside creatures appropriate for the area, there are some animals from far away, such as penguins if in a dungeon surrounded by desert. If the party waits long enough, something invisible takes one animal corpse off the hooks and drags it into an adjacent room, where it begins butchering it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "bI9DGMGWSzpPAjaz","flags": {},"type": 0,"text": "You come across a group of kobold engineers repairing some traps that jammed or are otherwise damaged.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "LP2w7KOlLX1H0xBt","flags": {},"type": 0,"text": "This room contains an 8ftx12ft pool of opaque white liquid, framed by four columns with taut chains leading up to a recess directly above the pool. If any creature is fully submerged into the pool (which is 10ft deep), a large metal mold begins descending from the ceiling recess. It will stop shortly before contacting the liquid if whatever creature entered the pool didn’t get out in time, but will plunge fully into the pool when everything leaves. When the mold returns out of the pool in four(?) minutes, a solid white mannequin in the shape of the submerged creature is atop it. The mannequin animates when there are no witnesses directly observing it, and will stalk the creature it’s modeled after. Perhaps the dungeon denizens are aware of the room’s properties, and have managed to take control of the mannequins to make reinforcements.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "d26ipSspXdm9rk5j","flags": {},"type": 0,"text": "A bright lamp hanging on the wall in an otherwise dim hallway, next to a wooden door with thick hinges. The door is locked, but it has a small counter at about elbow height, and a panel above that will open up if anyone tries to open the door or knocks on it. A flickering, jittering undead asks ‘I’m afraid the library is currently closed to visitors, but may I help you find a book?’ It will bring one book of choice for each person within the next few minutes who asks for one, but will not give multiple books to the same person. Books can be requested by very specific parameters (author, edition, hardcover or softcover, title), or by saying something as vague as ‘I’d like a book on cows’, though vagueness is probably less rewarding. The books are deposited on the door counter. Once every person it sees has received a book, or after a few minutes, the undead, door, and lamp vanish, leaving behind an ordinary patch of wall.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "yjF3FnkPrZFcaY3f","flags": {},"type": 0,"text": "A broken down wall of the dungeon leads to a decently sized cave where five cow like animals with purple spots and luminescent horns are grinding their teeth against the stone walls to get the lichen growing inside this crumbling tunnel. If approached slowly they will ignore the PCs, but if the PCs get too close the biggest one will turn towards you and snort while the others run back into the tunnels. If the PCs continue to approach it will attempt to gore one of the PCs with its poisonous horns and will then gallop after its compatriots.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "iBSGdW56Q5rgv5xB","flags": {},"type": 0,"text": "A ghost and a corpse. The ghost is desperately trying to get back into its body so it can rescue its beloved, only it doesn’t realize that hundreds of years have passed and its beloved has likely died, if only from old age.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "Uv79NLi33iS5v922","flags": {},"type": 0,"text": "A sentient chest, not a mimic and not enchanted. Somehow, in some way, the chest has become self aware. It cannot speak or see or hear or taste or feel, but it can ‘sense’ its surroundings somehow. With great effort it can open and close its lid, and with even greater effort it can move slightly across the floor. How the party learns to communicate with it is up to them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "092mF0r4kE3DS00l","flags": {},"type": 0,"text": "There is a helmet in the corner of this room/chamber. In the next room, there is an identical helmet. This continues for every single room afterwards. Any rooms visited before the first time the party noticed these helmets also have an identical helmet. If someone dons the helmet, they see all of the rooms of the dungeon at once, taking 2d12 psychic damage with a WIS save to halve the damage. This psychic damage occurs every time someone dons the helmet, but if they stick through with it rather than removing it, it can be used to get a brief glimpse of whatever an identical helmet would see in another room once every ten turns by passing a perception check. While someone wears a helmet, the other helmets seemingly vanish. Any damage or modifications inflicted to one helmet is performed on all the others.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "uLATDmvuayyM1Uz7","flags": {},"type": 0,"text": "The party comes across a glittering egg about the size of an adult halfling in kaleidoscopic colors. If they break it open, there are… more eggs inside, about the size of a normal chicken egg but made of the same material and in the same colors. Each of these can be cooked like an egg, or the party could wait for one to hatch by keeping it heated; a nature check tells you these are basilisk eggs, but luckily newly hatched basilisks don’t have their petrification abilities. A nature check, even if successful, fails to explain why the eggs were inside a larger egg.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "MxtNPhQWnS2reabb","flags": {},"type": 0,"text": "There is a pile of gold coins, about 4500gp total. Whenever the DM so chooses (but within a day), they sublimate into thin air- it was all Prankster’s gold. If players return to the same spot, they’ll see empty vials that probably contained the liquid where the pile originally was, complete with labels detailing what the liquid does.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "4CtGTpetBAePUMfI","flags": {},"type": 0,"text": "As the party rounds a corner or passes through a chokepoint, a small glinting ball bounces on the ground towards them before exploding into a massive cloud of whitish smoke. The party’s been ambushed by some kind of clever, intelligent pack of hunters, hopefully appropriate to their level. The exits to the room are so small that attempts to blow the smoke away can only siphon away so much at a time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "wppH4bZ66jyT7fZE","flags": {},"type": 0,"text": "The party walks into a room to be met only by a button and next to it are scribbles seeming to make out “DO NOT TOUCH.” As the final party member enters the room, the door slams shut and the 4 walls of the room flip, revealing walls lined with spikes that slowly encroach on the party. The walls are indestructible and unstoppable, and every time the button in the center of the room is pressed, the walls recede back to their starting position only to crawl towards the party once more. The only way out if the situation is to heed the advice of the sign. Right as the walls are pressing the party members together, about to impale them all, the walls will reset, for good, and the door will reappear, letting the party escape. The trap can only be reset by having every member of the party leave and then reenter. A funny, harmless trap that will either starve a mistrusting group to death or make them panic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "8P6ao0tK41eTcITy","flags": {},"type": 0,"text": "The walls of this room are lined with intricate carvings that appear to be dwarven in nature. They depict grand battles between dwarves and orcs that lead to a large set of stone double doors at the opposite end of the room. The doors depict a dwarf holding up a hammer that sparks with lightning. In the center of the room are 3 small pedestals and one larger pedestal in the middle. Each small pedestal has a stone tablet on it. Each tablet has a different word written on it: Others, Yourself, and Justice. To get the stone doors on the opposite side of the room to open, the party must put the tablets on the large center pedestal, placing Yourself on the bottom, Others atop it, and Justice at the very top. Once this is completed, the letters JOY will light up and the stone double doors swing open.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "PGcYB9RMMwy0x2lo","flags": {},"type": 0,"text": "Dave – An 78-year old human commoner who has no idea who was captured for slavery by the owner(s) of the dungeon – has a curse on him that activates after 1d4 days, and casts Fireball on him. The curse was applied by his ex, a vengeful witch who he had abandoned after learning of her true nature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "XtTeMDcT1HIeUyai","flags": {},"type": 0,"text": "A ghost bard of no fame who never got the chance to perform at the big show. He has come back from the great beyond to find that he can no long play his trumpet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "8yr5SR1O6dQFosae","flags": {},"type": 0,"text": "A room which disguises itself as the childhood room of the first to enter. When enough people enter, the room locks. There is a significant difference that the one who first entered can spot with a DC 14 Intelligence saving throw to escape. Each time they fail, a nightmarish creature based on one of their childhood fears appears and the party must fight it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "yxaB8zx73Lo7LiMk","flags": {},"type": 0,"text": "An eternal campfire burns in this room. The adventurers shadows appear on the dungeon wall, which turn into Shadows from the Monster Manual. The taller the adventurer, the more powerful the Shadow will be. The fire can only be put out by dousing it with holy water or some other curse removal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "LOLpI3A6pKYK48lQ","flags": {},"type": 0,"text": "Party enters a smallish, circular room, with a simple wooden door. There is a wooden door on the far side of the room, locked. The room has nothing but a simple wooden table, upon which is a single vase, containing a large, dark purple flower. If the party investigates, the flower is nightshade, and the vase is of unknown origin. Everything here is ordinary, other than the table, which is a mimic. Let it lie still until after the party investigates the flower/vase (if at all), just for the extra surprise factor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "7zaFlS0qU604A2Lb","flags": {},"type": 0,"text": "The party finds a scared Gazer whimpering in a corner of a room. It will cry and whimper if the party approaches. If the party can earn its trust, it will hang around and give playful licks. What will happen when the party finds the Beholder searching for his pet?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "4rLi5ZoGs5QlRvKH","flags": {},"type": 0,"text": "You come across a large furnace in a dead end of the cave. It’s a fancy, built-in brick oven. If you open its cast iron door you hear faint moans and echoes. Inside it is pitch black, even with darkvision you cannot see the bottom. If you drop a lit torch you see hundreds upon hundreds of zombies and other shambling undead monsters converging on the light until it is extinguished.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "Y9dy7xHPd0KQock1","flags": {},"type": 0,"text": "A goblin named Sam smorkle who is just looking for rusty things. If given a rusty thing he’ll help you until the next rusty things is found, where he’ll quickly work himself up into a frenzy and accuse you of wanting the rusty item. Roll initiative.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "YvAjdMmReyAZAPIe","flags": {},"type": 0,"text": "A labyrinth eventually leads to a center room. The room appears to be a study with a table in the middle featuring an exact scale model of the labyrinth, including miniatures of the PCs themselves. Another miniature can be seen, of some hideous monstrosity, and its heading for the center room…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "FTRf5dpn96kEJZbG","flags": {},"type": 0,"text": "The party finds a tiny portal to the Far Realm. An impossibly huge eye is looking at them… then after a few seconds the portal snaps shut leaving behind an strange small polyhedral made of a hard unknown material that somehow inspires awe and fear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "RcFWOjgSWs7fCxUz","flags": {},"type": 0,"text": "The party finds an gold vein that has been roughly ‘mined out’. If they follow it, they find a hive of rust monsters eating the ore. If disturbed the RMs with spill out into the dungeon and eventually the surface (maybe destroying a nearby village).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "pNt2CwklcQgYZN4Y"}
