{"name": "Demon Lords","description": "One hundred demon lords to destroy your players!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "TkLrXfNFEUd8nr3s","flags": {},"type": 0,"text": "BRONOCALOS – Demon Lord of Warped Bones and Emaciation: Bronocalos causes crippled and sickly babies to be born, people to grow hunchbacked, and limbs to atrophy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "GlWp0anUQE12JlN1","flags": {},"type": 0,"text": "SAHARNA: Saharna’s touch makes men strong and powerful, but it also makes them slowly lose their sense of self control, eating away their ability to restrain themselves from physical violence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "HikdyGSg2lW6ISrD","flags": {},"type": 0,"text": "CANTUS – Demon Lord of the Maddening Melody: Cantus resides in its lair, built beneath a bard’s college, where it whispered its melody to all that studied there. The melody obsesses those who hear it, dedicating the victims to spreading the melody as far as they can. This melody leads those who hear it to become thralls to Cantus, or to madness for those who tried to resist.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "IhjGAu3iEqUNbaTz","flags": {},"type": 0,"text": "ESURIO – Demon Lord of Gluttonous Greed: Esurio’s hunger is as voracious as his greed. He eats anything that holds value – be it gold, gems, statues, or art. This greed fuels him and is the source of his strength, and he grows more powerful, the more he consumes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "gAU5DcSyYthbpwyF","flags": {},"type": 0,"text": "THE REMAINS OF VETITI: The Remains of Vetiti are twisted remains of a demon lord who sought forbidden knowledge. His lower body is still intact, but everything above the armpit is gone. From the remains of his chest come the tentacled mass of an eldritch horror.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "6ybl67lAk8JBZznc","flags": {},"type": 0,"text": "GIZOGOTH – The Whisper King: Gizogoth resembles a short, bloated humanoid with the grotesque head of an insect. Gizogoth’s servants, small corrupted flies and gnats, buzz throughout the world, whispering lies and rumors in the ears of mistrustful masses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "y7doPwGJoSzQvBVe","flags": {},"type": 0,"text": "QUISIPHISTIS – Demon Lord of Festering Peace: Quisiphistis wants nothing more than to cover up problems so that they are never solved. He loves to build towers and empires that look solid and immovable on the outside but are actually flimsy and fragile within. Nothing brings more joy to Quisiphistis than the moment when it all comes crashing down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "Dy62Ul1L8pC1T9B6","flags": {},"type": 0,"text": "TALAZAR – Demon Lord of the Flesh: Talazar is a master craftsman who works entirely with flesh, muscle, and sinew. He considers himself a sculptor and spends his time constructing horrifying, fleshy constructs that defy all expectations. Victims of Talazar have their still-living bodies twisted into impossible shapes and put on display somewhere public. Followers of Talazar must sacrifice a piece of their own flesh to win his favor, preferably an eye, extremity, or spare organ. The void left by the sacrifice is smoothed over by the worshipper’s own flesh, like soft clay.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "OmNhibDfxh9OiKnr","flags": {},"type": 0,"text": "MUNDI – Demon Lord of the Darkness: With a flick of his wrist, all light disappears. Some folk in the land say he is older than the gods, and he may even be older than the material plane. His magic makes anyone cry out in terror. He can make an entire army of demons in seconds, which could wipe out a whole city in minutes. Mundi seems to phase in and out of existence instantly. In fact, even when near, no one knows that he’s there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "Oohp3sgNYEDFdEin","flags": {},"type": 0,"text": "NIMIR – Demon Lord of the Ruinous Oblivion: A massive, invisible figure draped in cloth. Nimir oversees the creation of wraiths. When it is time to create a wraith, Nimir descends to the ethereal plane and infuses a soul with a massive rush of negative energy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "L39zm8gn8lIXntAa","flags": {},"type": 0,"text": "KILORVAS – The Defeated; Demon Lord of Defeat:  Those who lose in battles seek Kilorvas for revenge. Be it out of spite or a just cause, if someone goes to him, their next battle will have an extra helping hand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "MsmbRyZYO2qhuGG9","flags": {},"type": 0,"text": "PSYNOTROP – The Forgetful; Demon Lord of Missing Thoughts: Psynotrop is the lord of missing thoughts. He is at work when one puts down their tool. turns around, and forgets where they placed them. He is the reason one leaves their house but has to return because they don’t remember if they locked the door. Psynotrop erases and steals memories, and he can even make his victims forget their family and wander aimlessly, feeling empty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "vmj11dhunchMhNAD","flags": {},"type": 0,"text": "RYOSANOP – The False: Brother to Psynotrop, Ryosanop places false memories the heads of his victims. Because of him, one might remember picking up groceries, only to discover they imagined it. A victim might believe they submitted their thesis on aquatic dragons to find out it wasn’t even started. Ryosanop’s power is the reason some people spend the rest of their life looking for a love that never existed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "Oh60JaY2ElIwTLrk","flags": {},"type": 0,"text": "RETHOR / ROHATOR / RAHOR: He exists, maybe. He casts doubt onto the mind of the weak, probably. He might have abilities beyond that, but no two people seem to agree on what his abilities are. Or if he even exists. Thinking about his existence causes confusion and doubt most of the time. But sometimes not, so no one is sure what it is.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "hDvEA0rs9ccrP2Wp","flags": {},"type": 0,"text": "ZILMINEY – The Nonexistent: Zilminey is, actually, the existent. She was born when numerous lost souls formed into one, ever-changing entity. And although his existence is confirmed, everything about them changes when one thinks about her. In fact, some say Feroghit has existed before the world was even created, but no one really knows anything about them. Or if he even exists… but she definitely exists.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "OfFTTh3fT07RmaPs","flags": {},"type": 0,"text": "EMMET ARIAN – Demon Lord of Clockwork: A 9-foot tall demon obsessed with metallic and magical perfection, he has very few normal minions. Mostly, he builds his own twisted clockwork versions of demons and devils. Emmet’s general and his masterpiece is Belos, the Clockwork Balor. Emmet resides in a mobile workshop where he constantly builds constructs to do his bidding,  while Belos patrols the grounds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "i6V8ouMx6zwwyg96","flags": {},"type": 0,"text": "RHAINIR – Demon Lord of Jealousy: Constantly rejected by demons who could not love, Rhainir grew jealous of the mortal races. Trying to win affections from mortals, he began to kill or kidnap those who would reject him. He showers his “lovers” with gifts – many of which are addictive, causing his victims to mistake their reliance on him for love. Rhainir also encourages spurned lovers to bring ruin upon their own rejectors. Finally, Rhainir is vain, constantly altering himself to look perfect – a vision that changes with every perceived insult he encounters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "p4nLYrqdQfegWvvy","flags": {},"type": 0,"text": "ANOR – The Bored One: Appearing as an adventurer, Anor offers high-octane adventure. Those who take his offer are subsequently trapped individually, in a room with one bed, one chair, a mirror, and some sort of magical lighting system. Victims are provided one meal a day, and each room has a door that cannot be opened from the inside by any way. Victim are kept imprisoned until figuratively bored to death, unless they go insane or continue trying to escape. The rooms are never in the same place, and multiple rooms are never near to each other, in order to avoid freed victims from freeing each other.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "uZjtAvUMNVAWfZCv","flags": {},"type": 0,"text": "TARSIOX – The Smith: Tarsiox seeks warriors and appears to them as a mastersmith. He offers to forge his victims the best armor they’ll wear in their life, and when the victim accepts, scraps of metal suddenly appear and cover the victim’s body from head to toe – save for their eyes and mouth. The poor soul is trapped within the armor, which cannot be easily removed. The armor requires weekly maintenance. The victim can see, speak, and eat; but expelling anything from the armor is not an easy task. Therefore, personal hygiene is something to be forgotten, especially since water makes the metal rust.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "rmI0c230FmJnsStG","flags": {},"type": 0,"text": "THURKOS – The Silent Watcher: Thurkos appears like a shadow man with glasses. When bored, he searches for a victim to watch and appears behind them, staring endlessly. His victims constantly have the sensation of being watched, but he quickly disappears if the victims starts looking for him. His victims become paranoid and mad.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "Y74nJ3L3toO6QUcH","flags": {},"type": 0,"text": "OLMON – Demon Lord of the Void: Olmon sits atop a granite throne in a barren throne room, somewhere in the pits of the Abyss. He is thin and grey skinned, and where a face should be, there is an infinite chasm instead. He wishes to make all of existence one with the Void, but lacks the strength to do so on his own.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "tL5P88atlQVG0uKJ","flags": {},"type": 0,"text": "GERRIMOR – Demon Lord of Bad Luck: Gerrimor subtly influences the fates of every mortal in the planes. Everything from minor inconveniences to horrific tragedies can be traced back to the influence and presence of Gerrimor. He appears as a deformed, skeletal cow head, and his presence is marked by the stench of rotting meat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "ZlcmNZNUQVMkhDQ1","flags": {},"type": 0,"text": "KIITH – Holder of True Names: Responsible for naming newborn demon lords in the Abyssal tongue, Kiith is able to seek the true name of any living being. While it could use this power to rule the entire Abyss, Kiith instead chooses to spend eternity tormenting other demon lords with names that are either unpronounceable (“Yyaldobravoth”), incredibly long (its current record takes 5 years, 243 days, 5 hours, 6 minutes and 21 seconds to pronounce), dangerously short (“E”), or simply silly-sounding (“Gollywabble”).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "IDDlCyUUj7sZn3zg","flags": {},"type": 0,"text": "GOLLYWABBLE – The Broken Automaton: As various geniuses invented automated machinery to aid their lives, a critical malfunction by them birthed a new demon lord. Now, Gollywabble seeks its own death through erasing all functional technology, starting with the inventions that keep mortals alive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "LGYxTVg3kB7Wcy34","flags": {},"type": 0,"text": "FIDRIA – The Unknowable: Fidria knows that which nobody else knows. Everything mortals have learned but forgotten, lost, or destroyed enters Fidria’s boundless knowledge. As a result, it is affiliated with amnesiacs and makes bargains with them – their memories returned for their eternal servitude. It has been said Fidria takes the forms of the deceased who have been forgotten by both history and their lineage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "YZaREMMDkuhXrpSv","flags": {},"type": 0,"text": "YYALDOBRAVOTH: A being made of dark tendrils and viscera, Yyaldobravoth was sealed deep underground by an ancient race. From its subterranean prison, he sends random people visions of his chamber’s location to lure them there. Once they arrive, Yyaldobravoth transforms them into twisted aberrations made of the same black tendrils and dripping gore his is made of. He exerts his influence on the world through these beings, using them as pawns to do his bidding. He hopes to eventually find a way to free himself, so he can make the whole world his personal army of aberrations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "T1OT6rPYZMnl2WUJ","flags": {},"type": 0,"text": "VIXIL – The Tickler; Demon Lord of Tickles: A demonic vortex composed entirely of feathers floating in air, Vixil never harm his victims, but he will cause tremendous stress due to excessive laughter. Souls who die from laughter join his army, and each soul is put into a jester costume and sent out to cause laughter in the demon lord’s name.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "CcdWaSjofFfB0g6O","flags": {},"type": 0,"text": "SERGORIUS – The Demonic Orc Lord: Sergorious lives only to destroy everything in his path. The more destruction, the better.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "WgwTbWm4kpv4eXoj","flags": {},"type": 0,"text": "ASHURATH – Demon Lord of Forbidden Knowledge: Ashurath carves out the eyes of the warlocks and liches who seek a pact with her in order to extend life or to have control over the living and dead. They can use her magic, but their sockets continuously burn as if the knife that carved out their eyes is still in them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "TyNEcswLXoMM4Vs8","flags": {},"type": 0,"text": "DAGOTH – The Living Nightmare: Dagoth causes men to be driven insane by what they fear most.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "IaY9uzO9cDKPhTsw","flags": {},"type": 0,"text": "ATURIAS – The Void: Aturias drains victims of emotion to feed its own lifeforce.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "WsRY8DqXlvilNtqu","flags": {},"type": 0,"text": "MYRONIR – Demon Lord of Reflections: Myronir brings waves of doppelgängers to attack enemies with. He uses magic to see through mirrors and causes people to see their reflections as horrible, twisted versions of themselves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "lWJXJ0zA0pTYE0fb","flags": {},"type": 0,"text": "CARRION – Demon Lord of Music and Guile: Carrion is a trickster demon lord whose musical magic brings about random effects to those who listen. The effects can be either good or bad – it can range anywhere from transforming people into animals to adding years to their lifespan. He is a common deity for tiefling bards.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "6ms1Hv4Tdp5iR03V","flags": {},"type": 0,"text": "R’REECTH – The Thirstful; Demon Lord of Thirst: R’reecth appears as a desiccated man with cracked, parched lips and a swollen, black tongue protruding from his mouth. His eyes are hollow, sunken pits; and his skin is sun-scorched and stretched taut across his skeletal frame. His touch drains living tissue of its fluid.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "PAQl1tHSIMHv92pC","flags": {},"type": 0,"text": "SHAANAATH – Show Who Coils in the Dark; Demon Princess of Cold-Blooded Predatory Death in the Night: ShaaNaath appears as a pair of reptilian eyes that peer from a permanent patch of darkness. The eyes flow with an eerily fluid grace, constantly seeking to move behind a person.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "tcAdg5xVmDZYhq8J","flags": {},"type": 0,"text": "ERGAALESH – Demon Queen of Sandstorms and Locusts: Though Ergaalesh is not physically powerful, her coming is the coming of cataclysm, as entire cities are buried and farmland laid to waste by swarms of insects.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "tdkU4VgkKhFpNhLI","flags": {},"type": 0,"text": "MUZCABEEL – Demon Queen of Flies: Gluttonous and ill-tempered, Muzcabeel’s mere presence causes food to spoil and maggots to rise from the ground in loathsome masses. Muzcabeel resembles a gruesomely corpulent humanoid with a gaping maw in her torso. Out of the torso pours an endless, black cloud of flies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "BUcIfWowgiWxZXED","flags": {},"type": 0,"text": "KANEBAL LUR MUL – Demon Lord of Cannibals: Kanebal Lur Mul earns his titles because he has a tendency to devour any who oppose him – literally. Whether they are rival demons or celestials, he views their devouring as the ultimate form of dominance one can have. He gains power from those he feasts upon, and to join a pact with him, he expects victims to eat whatever is dear to them. He wades into combat without weapons or armor, and when assuming a physical form, he looks like a cross between and dragon, a wolf, and an oni. His colors are red and white.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "HE8O5JphOTluqjkQ","flags": {},"type": 0,"text": "IZZURAD and MAZOR: Twin demon lords whose avarice is second only to their jealousy of one another, a mortal’s dealings with one brother usually involves stealing something of value from the other. This invariably results in wrathful retaliation against this foolish mortal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "EgeXJxD90vmRAuOT","flags": {},"type": 0,"text": "RALGAD – The Repentant: One thousand years ago, Ralgad was the Lord of Lies but was defeated and imprisoned within a stone. He was held for centuries by a holy order of paladins who were eventually able to convince him to repent of his sins. Ralgad now works diligently to subvert other demon lords’ evil machinations. Of course, there are those who believe that Ralgad is as evil as he ever was, and this is simply another lie. Others say his selfless actions prove his good intentions. But only time will tell","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "Qukqk8FBHTNYJ8EN","flags": {},"type": 0,"text": "BRUGGATH – The Dreadmother: With her terrible wail, Bruggath claims the souls of the stillborn. Under her nurture, they learn to feed on the suffering of the living.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "lpQFeG6ijE7ySzNh","flags": {},"type": 0,"text": "SITHORITH – Demon Lord of the False Face: A female demon lord, Sithorith appears to be an angel clad in red. However, the red gown is made of sewn-together organs, and her feathers are made of thousands of tiny, razor-sharp bones.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "Tk5v3plUlwDrSdsU","flags": {},"type": 0,"text": "NEATHA: Neatha is a demon duchess who meticulously records the stories and lives of any soul she comes to possess. Her library of stories overflows. Within the library, her unruly minions are always inaccurately copying pages, not checking if the pages even needed to be copied. When a living soul finds themselves in Neatha’s domain, she allows them to leave but only if they forfeit a memory to her.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "nxfz9g0qWbiUUt7K","flags": {},"type": 0,"text": "ELDRAGOTH – The Space Between Stars: Eldragoth appears to be a small humanoid with a body composed of moving nebulas. He seeks to shake the very foundations of order and law but not before corrupting mortals with elder knowledge. Eldragoth is known to possess people when an opportunity arises, as he cannot walk the material plane on his own.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "gNNbYJyHrsVqgg8P","flags": {},"type": 0,"text": "AITHZIEK – Demon Lord of Bastards: Aithziek appears as a 9-foot tall, horned woman in a torn and bloody wedding dress. She sends her minions to seduce young, unmarried men and women; and she also sends them out to corrupt those born out of wedlock.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "GfvurnBNec1CGrl0","flags": {},"type": 0,"text": "GREZALPITH – The Imp King: A 3-foot tall, winged imp wearing an oversized crown, Grezalpith commands an army of 10,000 lesser imps. Other demon lords keep him around to wage “war” on other demon lords purely for entertainment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "ejpcSCalxu6TGbh2","flags": {},"type": 0,"text": "ZARGAZU – The Bound; Demon Lord of Slaves and the Sacrificed: Zargazu appears as a 6-foot tall human with thousands of chains hooked into his skin. His only job is to figure out which tortured soul belongs to which demon lord. Additionally, Zargazu is constantly beaten by other demon lords.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "3OBG91sgtaJLj33r","flags": {},"type": 0,"text": "SHEMMIR – The Worm; Demon Lord of Rot and Decay: Shemmir’s physical body is weak, sickly, and malformed. He worms himself into hidden places and rots things from within, waiting patiently. He seeds sickness and disease until nothing’s left alive and he can emerge to feed his unending appetite.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "32vEgSmbVh0bhzPp","flags": {},"type": 0,"text": "GHAZZKULL – Prince of Pestilence: Ghazzkull is a demon in symbiosis with a gelatinous cube who serves Juiblex, the Faceless Lord, from the 329th layer of the Abyss. His body, once familiar to a humanoid shape, is now a melting, rotting corpse inside his cube’s host body; and the two share a mind. Ghazzkull’s corpulent frame emits a viscous sludge, which covers his lair and gives off a noxious fume that poisons even other demons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "sKmr1jcp1hKnKO3s","flags": {},"type": 0,"text": "SVYLREN – Demon Lord of the Lost and Desperate: Svylren often appears to sailors lost at sea or travelers lost in the wilds, whispering false directions and driving them mad with desperation. Once the madness has caused them to isolate themselves further from rescue or murder their companions, Svylren moves in to feed on the remaining survivors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "jHQ2PPbDDDGglLVI","flags": {},"type": 0,"text": "ABIS – Demon Lord of the Deep: Abis lies dormant in the impossibly deep trenches of the ocean, waiting for his worshippers to bring him the body of a kraken. Only after he finishes feasting on the kraken will his hunger return, and then, the waters of the world will run red with blood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "PV3GqZ7QJ8NPfjGu","flags": {},"type": 0,"text": "XOROTH – Demon Lord of Pacts: Although often depicted as a hunched over figure with oversized glasses and a bony, spine protrusion, Xoroth is nothing to be underestimated. A master of loopholes and invisible ink, this lord can enforce any contract signed, and he will often trick or persuade both mortals and immortals out of their souls or power.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "mTRoaIr5Syf5L73e","flags": {},"type": 0,"text": "ZVONIMIR – the Faceless Hunter; Demon Lord of the Self: Zvonimir slowly appears to victims in crowds and out of the corner of their eye with a face that seems familiar but is utterly unplaceable. After a while of being followed, victims begin detaching from themselves, forgetting things, and falling away from the world. At death’s door, victims see that Zvonimir wore their face all along.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "6b1J1CQ19Xleg9dU","flags": {},"type": 0,"text": "KREDOS – The Sallow King; Demon Lord of Rot: Wherever he walks, there is decay in Kredos’ shadow. Rust, plague, dead soil, and the slow dilapidation of things is his handiwork. It is said that lepers are possessed with his will.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "em956FTvvuKXZsQb","flags": {},"type": 0,"text": "MEERNA – The Creeping Smile; Demon Lord of Sadism: Meerna reaches into the hearts of the weak-willed and makes them feel pleasure in cruelty. This starts as gallows humor or rumor mongering, but it will slowly grow in her victims until they cannot help but torture things for a giggle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "u4IGBXE12Db3KF69","flags": {},"type": 0,"text": "MALGAMAR – The Hidden King: A fiend of great guile, Malgamar has charmed, deceived, and corrupted his way into positions of mortal power since the dawn of civilization. He clouds the minds of mayors, dukes, and kings alike; and he sends kingdoms into ruin and the world into chaos.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "ofphbf33h60y8KAD","flags": {},"type": 0,"text": "SERCATER – The Iron Plaguebringer: Sercater is a vaguely humanoid mass of jagged, twisting metal. All living things in its vicinity become violently ill, and their bodies slowly turn to iron. There is no cure; the infected are doomed to become nothing more than sick, twisted statues.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "NKly7M9zVU4Tp9Lr","flags": {},"type": 0,"text": "XULLCATH: A mighty demon lord who loves to watch powerful beings destroy each other, Xullcath will go to great lengths to instigate these battles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "wgZkdidrPDAxsNut","flags": {},"type": 0,"text": "YALBENOTH – Demon Lord of Apathy: Nothing can die in Yalbenoth’s presence because the souls of the dying cannot muster the desire to pass on.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "VVL4wfj3WbkLgz49","flags": {},"type": 0,"text": "MADEMOISELLE FORTUNE – Demon Lord of Gambling: The left side of Mademoiselle Fortune’s body appears to be a beautiful and freckled, elven maiden; her right side is a hideous caricature of the left, with an inky, black complexion; a long, pointed chin; and a dagger-toothed grin that stretches to her distorted ear. The demon is made of the mind of the original demon lord of gambling and the body of a maiden that it won in a game of cards. Mademoiselle Fortune runs a cursed river boat through the layers of the Abyss, where gamblers and demons play for souls and hordes of gold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "dYez1WKuiJUx1fvP","flags": {},"type": 0,"text": "BISTET – The Destroyer: Bistet is a lesser demon lord who only seeks the minor destruction of nonliving things, such as furniture, decor, and structures. Most places look like a tavern at the end of a long and rowdy night when he is done.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "pHpMw9T6vSSL95cS","flags": {},"type": 0,"text": "SASAHMEL – The Leper King: A golden mask covers Sasahmel’s rotting visage, and removing it unleashes a plague-cloud that infects those it touches with the demon’s disease. The infected are doomed to join their king and his shambling host.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "zq1Eep6408RBiR4o","flags": {},"type": 0,"text": "LUCIANO – Demon Lord of Luck: While a relatively weaker demon lord, Luciano’s knowledge of the fabric of fortune gives him immense defensive power. He uses his ability to bind his fate to a random innocent. Whenever he receives damage, all damage that is done to him is also done to the innocent victim. Many that face Luciano cannot deal with the blood of innocents on their hands, and therefore, they cannot bear to fight him. (Radiant damage does not have this effect; it does not transfer to the victim).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "JZIiKSHHCvh9V5b5","flags": {},"type": 0,"text": "ANREK – Demon Lord of Paralytic Joy: Anrek’s presence fills weak souls with love and happiness until they lose the will to participate in basic functions, such as eating or breathing. Souls with enormous, jagged smiles form her army. She grows stronger with the thankfulness of those she takes with her curse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "QLir95TOO6Ueqnzf","flags": {},"type": 0,"text": "THE DEVIL OF GAMBLING; THE KING OF DICE: This demon lord travels with a pair of mimics disguised as dice, and he disguises himself as a common traveler. He challenges others to a game of chance, promising amazing rewards. When the other party inevitably loses the rigged game, the devil claims their soul. (For some reason, this demon has an irrational fear of any kind of ceramic, drinking container).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "OTPZ8WTrrVpMa4P3","flags": {},"type": 0,"text": "CLASTONIR – Demon Lord of Broken Dreams and False Promises: Clastonir appears to the miserable and downtrodden, offering them promises of wealth and glory in exchange for their service. He usually appears to mortals as a slender, well-dressed man with a pale complexion and dark hair. Entering an agreement with him can be lucrative, but it always ends badly for mortals.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "HZ8qc4dSxP7jEYAs","flags": {},"type": 0,"text": "MORTRANIAS – Demon Lord of Sickness: Mortranias is a sickly, mold=covered, skeletal entity wreathed in a shifting cloak of smoke and shadow. His very presence sickens those around him into coughing uncontrollably. Stories tell of him appearing when massive blights are brought upon the land.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "TuyZAlKSPl1L2kYh","flags": {},"type": 0,"text": "KAI-KHAN – The Mandarin: Kai-khan is the head bureaucrat of the underworld. He is happy to organise anyone’s eternal torment in the most efficient way possible, and he considers poor organisation the worst form of torture.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "SxQ5J34fYCtTEGbS","flags": {},"type": 0,"text": "KHAVSARSAN – The Black Blizzard: Disguised as a lone adventurer, one would only notice Khavsarsan by the icy gaze of his seemingly blind eyes. Where he steps, a deadly frost follows soon after. His goal is to spread his tundra-like domain and starve out all forms of life in his path.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "3BpHx7A6IIJQrBPE","flags": {},"type": 0,"text": "MĒ’TENS: Ruling over one of the most deeply-dreamed planes is the dread lord Mē’tens. Though he appears as a common, black housecat, Mē’tens is a powerful, necrotic sorcerer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "aLAy96GafLnatM00","flags": {},"type": 0,"text": "DROGUGOUGACH – Corruptor of Giants: One of the tallest demon lords, Drogugougach loves to tempt powerful creatures of law into serving him and committing chaotic acts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "iGwutfvoe4lQIcCZ","flags": {},"type": 0,"text": "IBISURSIA – Demon Lord of Owlbears: Ibisursia claims to have invented the owlbear, and whether or not that claim is true, Ibisursia uses them in her abyssal army – both the default variety and fiendish variants, such as an owl with the head of a bear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "5yRQJbUaSe9bxKTV","flags": {},"type": 0,"text": "ABIUON – The Pale: Abiuon is a pale-white demon lord who has black eyes with a thousand little stars wandering inside. Although he is not a strong demon, anyone who stares in his eyes is possessed by his dreams. The victims believe these dreams with all their of hearts, and they live within these realistic dreams for the rest of their lives.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "f6DULP8nfVxFaHnU","flags": {},"type": 0,"text": "OUKIN – The Charred One: Legends tell that Oukin was once one of the most beautiful demons, but the jealousy of others burned her skin completely. Now, her skin is like charcoal. and her eyes are no more than smoldering, empty circles. It is said that gazing into her eyes channels her wrath to the beholder, burning their bodies inside-out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "eF63hipEvKz6mbxp","flags": {},"type": 0,"text": "GRONAEHA – Of a Thousand Heads: Gronaeha appears as a woman with one-hundred heads on long, tentacle necks. Gronaeha is patron demon of all multi-headed creatures, and she occasionally gifts her humanoid followers with additional heads.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "71TIOf43yQaSNTMg","flags": {},"type": 0,"text": "UMBRIUS – Demon Lord of Crushing Darkness: Umbrius is a creature that despises all light, and it’s layer of the Abyss is among the darkest and most dangerous. Umbrius’ sole purpose and desire is to drain all light from the multiverse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "NEiC7ljWdgzWXqVi","flags": {},"type": 0,"text": "ALVAREZ – The Purging Duke; Demon Lord of Torture and Inquisition: Alvarez is a master of torture who incessantly searches the ranks of the tanar’ri demons for signs of the taint of Law. Alvarez is famous for the brutalities he inflicts upon his own troops. Even other demons fear his inventive torments.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "0TvlB0CjgQyssjs2","flags": {},"type": 0,"text": "ARZIAL – The Bloodied Baron; Master of the Barony of Vulderpayne; Minor Demon Lord of Subterfuge: Arzial is a cambion, born of the demon prince Graz’zt and, presumably, a human woman. His Barony of Vulderpayne resides in the Abyss, and he is the least accomplished of Graz’zt’s many children. Though, Arzial still has a vital role in Graz’zt’s schemes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "KNCRj1o5PII9PsGt","flags": {},"type": 0,"text": "ASEROTH – The Winter Warlock: Aseroth rules over the 566th Layer of the Abyss, “Soulfreeze,” which is a frigid place of ice so cold that, as the name implies, it can kill mortals by literally freezing out their souls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "bTZZlAx4sHzkV6Ku","flags": {},"type": 0,"text": "AZUVIDEXUS  – The Ravenous Maw: Azuvidexus is concerned with primeval beasts and scaled nightmares, and Azuvidexus controls the domain of N’gharl.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "IIXZjSltxgx6e2wQ","flags": {},"type": 0,"text": "KARDUM – Demon Lord of Balors: Concerned with Balors and fire, Kardum lives on the 21st layer of the Abyss: The Sixth Pyre.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "h7W3iOcmuNtMxYSj","flags": {},"type": 0,"text": "LYNKHAB – Lady of Desire and Depression; Lady of Regrets: Lynkhab is patroness of the self-destructive and suicidal, and she was a contender for the title of “Queen of Succubi”.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "qS08gKvGV9kI78Lx","flags": {},"type": 0,"text": "URO – The Eternally Engulfed: A colossus engulfed in flame, Uro roams the planes, leaving behind dead ash in his wake. His travelling is not for the intent of destruction, but rather, he wanders to escape the torment of his flames.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "Uz1Bd1Uqb0fHmE1x","flags": {},"type": 0,"text": "MAGAHAN – Demon Lord of Dread: Magahan is the lord who has enslaved 1,000 angels. His whips cleaves both bone and wing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "EAEwclxki5jJxTfa","flags": {},"type": 0,"text": "ASGAROTH – The Sleeping Wail: Asgaroth’s astral projection induces complete madness in victims seven days after they encounter it. Only a certain mushroom tea can cure the affliction before it takes its toll.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "TBYDfxCfbHhaHboc","flags": {},"type": 0,"text": "CARCER – Demon Lord of Brittle Bones: Those caught in Carcer’s gaze are either pertirifed or crippled as their bones turn to dust.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "ndLdJHetIjfjnHON","flags": {},"type": 0,"text": "VAMJIR – The King of the Stars: Once every century, Vamjir awakens. Everytime, he attempts to extinguish the stars and use their power to become a god.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "m6dEPMRMhIq9j3L4","flags": {},"type": 0,"text": "CHRYSERTUS – The Demonic Beast of Silence: Chrysertus is an intimidating demon that takes the form of a wretched beast. Anything within a 10-foot radius of it can no longer emit sound, until they leave the area.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "KjfQ4tUEZFjxW1Cn","flags": {},"type": 0,"text": "DEKATRES – Demon Lord of Desmotis: Dekatres is the keeper of the artifact Desmotis, a powerful sword that can sever the boundaries between worlds and open rifts straight into the material plane.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "rta00kOCVV6QdFSR","flags": {},"type": 0,"text": "IROHANA – The Benevolent Queen: Irohana appears as a travelling healer, but while she heals people, she also curses them to slowly turn into demons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "sREAvOPLXPJGn0lK","flags": {},"type": 0,"text": "RAR’GAMAN – The Chained Demon: A demon covered in writhing chains that keep him pinned to the underworld, Rar’gaman seeks to retrieve 100 artifacts that were taken from him when he was imprisoned . To do this, he uses his disciples, the Chain Hunters, to find the artifacts on the Overworld. The Chain Hunters are easily identified by the chain tattoo that is wrapped around their dominant arm; and they are also identified by their eyes, which burn with an ember glow. If one of the Chain Hunters finds the owner of one of the 100 artifacts, the chain tattoo leaps from their arm and latches onto the victim, allowing Rar’gaman to pull them into his underworld lair, where he tortures them for eternity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "1Emk15SKNQIOHuq0","flags": {},"type": 0,"text": "VALPULA – The Gear Demon: Valpula is obsessed with gears and clockwork. His ultimate goal is to find a way to become Primus, the God of the Outer Plane Mechanus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "yQQbtfal74uTBgl3","flags": {},"type": 0,"text": "K’YODAR – Demon Lord of Song:  Ethereally beautiful at first glance, many hauntingly beautiful songs emanate from K’yodar’s presence. However, closer examination reveals the source of the songs: a multitude of singing mouths all over her body. The tunes and words of the songs are incomprehensible and impossible to discern. They can only be identified as a jumble of rhythms and syllables with seemingly no meaning. Similar to a siren, when the unaware draw too close, either to look more closely at K’yodar or to listen to her songs, she devours their souls. For every soul she devours, she grows a little larger,  and an additional mouth appears somewhere on her body.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "67RK4lThvoreeDh4","flags": {},"type": 0,"text": "PITLORD KOPHIST – The Usurper: A former gladiator in one of the infernal plane’s many fighting rings, Kophist’s thirst for blood and natural aptitude for combat helped him rise through the ranks and quickly gain favour from the denizens of the Abyss. Kophist’s lord saw him as a threat and attempted to banish Kophist; however, the lord found himself betrayed by his underlings. Kophist keeps the now-nameless demon on display, as his prize.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "vHvr1BQBiW3WP2Gt","flags": {},"type": 0,"text": "HAYWOOD: Haywood dooms his victims to eternally fighting his demon cow, Edgar, in his realm, The Hole. Haywood wields a scimitar made of pure, dark steel; and he has a belt of infinite daggers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "o1AoOeae0Qhk76op","flags": {},"type": 0,"text": "ARHKSHORT – Demon Lord of Paper: Arhkshort is obsessed with paper, and he makes his every drawing come to life. He is very small and can usually be found sitting somewhere, drawing on his notebook. If badly drawn, his drawing can still come up – but as a failure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "PrMijn4csUvO6DlA","flags": {},"type": 0,"text": "CALIGO – The Dreaded Mist: Caligo is enigmatic and constantly pursuing chaos and destruction. Whether Caligo is a demon that uses its infernal, red fog – which is large enough to cover a town – as camouflage or whether Caligo is the cloud itself, nobody knows because no one who has seen the inside of the cloud has lived to tell the tale.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "2T5TIJf2ySvvuAsn","flags": {},"type": 0,"text": "THE NAMELESS ONE – Demon Lord of the Mute: Punished for some great blasphemy lost to time, the Nameless One is blue-skinned, emaciated, hunched, and bears stumps where hands and feet should be. The Nameless One’s long, coarse hair veils most of his face, except for the dreadful scar that takes up the place a mouth used to be. Those who venture near to The Nameless One hear muffled and incomprehensible screams echoing all around, and many victims are driven to tear out their own mouths and offer it up to the demon lord in a futile attempt to restore his lost voice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "l9XxHsN9SRZTPoOt","flags": {},"type": 0,"text": "SOHMBRAW – Keeper of the Lightless Halls; Demon Lord of Dying Lights: Sohmbraw is a monster-shaped darkness that’s seems blacker than shadow. She dwells in the Lightless Halls, which are unknown ruins of a labyrinthine-like castle, where she wanders the endless maze with a predator’s grace – hungry. Those that cross paths with her are quickly swallowed by her umbral maw and drained of whatever life energy sustains them. Many believe Sohmbraw greedily collects this energy as light, somewhere within the expanse of her domain, but the reason why is yet unknown. The most popular belief is that when bathed in the light of the living, wherever this may be, her umbral form is shed to reveal the person she used to be – the former queen of what is now the Lightless Halls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "SGmvEew20h2bTnV5","flags": {},"type": 0,"text": "MALBRIS – He Who Corrupts and Wears White; Demon Lord of Voluntary Moral Failure: Perpetually masquerading as white-clad figures of goodness, purity, or innocence, Malbris is a sinful chameleon that craves watching the righteous fall from grace. Whether appearing as a gentle child, a beautiful maiden, or a heroic knight, Malbris slyly draws good people into evil through clever plots. And once he has pulled them in, he relishes in the life-shattering moment of revelation when a good person sees who they have become. Notably, he never forces or manipulates the victim in any way beyond his natural guile, for he wants the victim to be the cause of their own failure, to have no one else to blame. As such, his machinations are often slow and patient and committed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "ZCqbCHoEAUHYy4Zj"}
