{"name": "Meals Made From Monster Parts","description": "One hundred delicious meals made from monster parts. Make sure you clean them first!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "SfDhQm3ZaInjNq0P","flags": {},"type": 0,"text": "Shifting Calamari: The tentacles of a displacer beast sliced and fried in a light batter. Aim your fork carefully.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "M3CN7zs1gXQbuRS3","flags": {},"type": 0,"text": "Fajita Nocturna: Bat meat pan-seared with onions and eaten out of a dried and floured cloaker wing. Remember to remove the claws.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "0eGYipQhngcCzkza","flags": {},"type": 0,"text": "Up-and-Down Stew: Traditionally made with blink dog and hellhound meat in broth, any mixture of Fey and Fiendish meat will achieve the dish’s signature roiling swirls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "Mh8sysH5xnKQEFBb","flags": {},"type": 0,"text": "Steamed Umber Hulk: The arms and legs of an umber hulk steamed and served with veggies. May cause acute memory loss if undercooked.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "EzLM4Q8Kaa9Nxxm2","flags": {},"type": 0,"text": "Underdark Paella: Cooked giant spider, umber hulk, and roper come together with fresh vegetables and sautéed shrieker to make a one-of-a-kind dish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "GV1tuPMzjdFRI3lS","flags": {},"type": 0,"text": "King of the Sea’s Sashimi: A complex mix of herbs, spices, and sauce neutralizes the mind control toxin in the thinly sliced aboleth meat that makes up this dish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "PhfDqHuiHpNh6joK","flags": {},"type": 0,"text": "Gorgon Roast: The naturally hollow body of a freshly slain gorgon can be placed over a flame and used as a cooking vessel, creating a unique cooking style that brings a unique taste to the food.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "7lPyiF8R5Hw1rRF8","flags": {},"type": 0,"text": "Hydra Eggs: With a similar property to their adult counterparts, the yolk of a hydra egg will appear to split 5 times when beaten. If fried, the yolk turns a deep amber color.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "LIEzQJTVds7gpJHk","flags": {},"type": 0,"text": "Tadpole Cocktail: Mindflayer tadpoles beheaded, cooked with veggies, and served with cocktail sauce. Said to bring back old memories when eaten.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "Fydm1TJV0329eSNh","flags": {},"type": 0,"text": "Griffin Gyro Wrap: Griffin steak wrapped in the wings and spit-roasted vertically. Takes 2 days to cook, but serves 20.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "ektfRP28D4V75EPb","flags": {},"type": 0,"text": "Dryad Tea: Adding leaves from a dryad can transform the flavor of any tea and impart a bit of the dryad’s mood at the time of picking onto the drinker.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "1Wj3m5pbVMkn5vgI","flags": {},"type": 0,"text": "Bonfire Dire Boar: The only true way to cook the massive swine. Roast vertically inside a bowl-shaped bonfire until the outside is charred black. Make deep cuts as the juices tend to move inwards during cooking.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "rY7vIUR6lWfkePQm","flags": {},"type": 0,"text": "Marauder’s Pie: Meat from at least 4 different sources ground up, cooked, mixed with veggies, and covered with a crust. A “true” one contains meat from something sentient.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "mX1U7oAfeag0d15L","flags": {},"type": 0,"text": "Mushroom Casserole: Diced myconid, shrieker, and trillimac cooked with bluestalk pasta and a lichen sheet. High in protein, a favorite of low-ranking Drow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "J4EkoIhW4N3fSvZZ","flags": {},"type": 0,"text": "Skewered Manticore: Diced manticore roasted over fire on its own spines. Requires great care and patience, as the spines tend to shatter and ruin the meat. Success will yield a rich, spicy meal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "AZzlj8pk5ceDdz2i","flags": {},"type": 0,"text": "Escarfléau: A flail snail cooked in the shell with a lot of butter and garlic, highlighting the meat’s natural spiciness. Served still in the shell, feeds four. Bon appetite!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "rUGFtHQNtgVoKRZs","flags": {},"type": 0,"text": "Draconic Jerky: The tongue of a dragon salted and dried, it’ll keep for 1000 years without losing flavor. Rarely made from a true dragon, usually the tongue of a wyvern or drake.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "MR4znwiXpLKw9ctp","flags": {},"type": 0,"text": "Bullywug sur la flamme: The leg of a bullywug marinated for a week and grilled over an open fire. Tastes like chicken, smells like death. A favorite of Wood Elves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "8CBktgbCWfbw1Hcj","flags": {},"type": 0,"text": "Hippocampus Surf’n’Turf: The legs and tail of a hippocampus cooked, lightly salted, and served together. Often prepared for aquatic dignitaries.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "UYca5euNpHcogrXB","flags": {},"type": 0,"text": "Gelatinous Marmalade: Gelatinous cube jelly mixed with sugar water. Doesn’t taste like much, but can make just about anything safe to eat if enough is slathered on it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "xFf50onjHtZHhZex","flags": {},"type": 0,"text": "Woodland Bite: Viper venom watered down with apricot wine and spiced with pepper juice. Often used for drinking contests in more remote forest taverns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "Ya8vaBUuwUk3xp2x","flags": {},"type": 0,"text": "Lightning Gumbo: Diced behir meat, peppers, and onions in broth in a large heavy pot. After cooking for 30 minutes, dump the behir’s lightning gland in and close the lid. After the thud, the meal is ready.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "nSVNhRF5Tq7G0psF","flags": {},"type": 0,"text": "Feast of Gruumsh: Prepared by orcs after a particularly successful hunt. The prize kill is buried with hot coals for 4 days, coated in sauce, and served whole. The hunter who slayed the beast begins the feast by stabbing out one of its eyes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "zJs5VLEY0QWovkW4","flags": {},"type": 0,"text": "Lost Honor: When a rust monster eats a dwarf’s weapon, it’s only fair the dwarf return the favor. The claws of a rust monster are tough, tasteless, and unfulfilling, but the dwarves don’t care.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "C6BVUQtW7kpLjwen","flags": {},"type": 0,"text": "In the Eye of the Beholder: The severed eyestalks of a beholder can impart their effects onto food placed inside for weeks after death. Effects range from refrigeration to disintegration, all useful in their own ways.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "hRgolQUldYS99JWB","flags": {},"type": 0,"text": "Troll Taters: Sliced potatoes oven-roasted in troll fat. After 30 minutes, the potatoes will come out fully cooked but looking raw due to the lingering regeneration effects of the troll fat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "5otwg3yuqNbUYWjV","flags": {},"type": 0,"text": "Gnoll Rolls: Pan-fried gnoll meat packed into small biscuits. Good trail food, athough it may scare of wildlife.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "8BOyQHNlvKajkrML","flags": {},"type": 0,"text": "Phoenix Roast: While difficult, it is possible to delay the burning and rebirth of a Phoenix. The result is a naturally sweet meat that cooks itself, going from raw to fully cooked in 15 minutes. After 1 hour, the rest of the bird will resurrect as normal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "GCw9nZpuoVwEdmHD","flags": {},"type": 0,"text": "Sliced Troll Liver: The liver of a troll will continuing regenerating for several days after death. By placing a chunk of liver in an open topped container, roughly 50 slices of fresh liver can be freely acquired before the quality suddenly drops.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "AWsBKh7HnGIKY2IO","flags": {},"type": 0,"text": "Desert Sun Jerky: The tail of a giant scorpion hung on a rack to dry for 3 days. Every 12 hours, it must be flipped over. After 3 days, all of the venom has broken down, salting the meat in the process.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "GwvxdIswLiFg13vv","flags": {},"type": 0,"text": "Troll Stirfry: Greased with pig fat and vegetables from fresh gardens. Spices from far off lands burn your tongue. Next time you land a flamming arrow upon a Trolls brow, take a slice of flesh along with its gold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "nlxuYCBp8rHgIQWX","flags": {},"type": 0,"text": "Beholder Sushi: Beauty may be in the eye of the Beholder, but it’s taste is in the eye stalks! Really speaking, this can be made with most Beholder-kin (such as Spectators) and even enjoyed as sashimi. If you’re too squeamish about eating the ‘tentacles’ of your floating eyeball nightmares raw, simply coat in batter and crispy breadcrumbs for an excellent (if dangerous) kalimari.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "U3MuhHzvmGR2yx9m","flags": {},"type": 0,"text": "Gorgon Roast: While not technically edible itself, the rocky/metallic remains of a Gorgon Bull Male am excellent oven for the smart, open minded adventurer. Lighting a fire beneath an I damaged portion of the bill allows you to turn it into a giant cooling vessel. Always aim to remove the head cleanly for the best results. Once slain, it will become perfectly hollow, but always allow to air for one hour to allow any remnants of its vapours to escape. Then stuff the metal carcass with any other meat you can hunt and enjoy the satisfaction on multiple levels.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "FHGMZPFjcCC16ZrT","flags": {},"type": 0,"text": "Sahaguin Roe: Questionable, as the creature is seen as humanoid by most adventurers, the eggs of these fishlike creatures are much like salmon roe, popping with small explosions of flavour on the tongue.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "SB0bifs1Q8Yksqd5","flags": {},"type": 0,"text": "Dryad Tea: Should one find a friendly Dryad, always ask for some leaves or petals to add an excellent infusion of flavour. These flavours change depending on the Dryads mood when gifting the leaves. For the best results, flirt gently with the nature spirit. NEVER take the leaves or remains of a dead or corrupted Dryad unless planning on brewing laxatives or poisons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "Kyc6jWcX9jgTiWB4","flags": {},"type": 0,"text": "Seared Scorpion: Either boil or sear the meat in the shell, then consume similar to lobster or other shellfish. Heating the shell not only makes it easier to break, but also allows the meat to steam inside the shell, making for a much more tender meal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "6M1jOHE7b7ls2N9O","flags": {},"type": 0,"text": "Slaughterfish Stew: One of the few fish that tastes better stewed. For the best results, skin the fish pieces and poach in milk instead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "W3ypaw85ug1F7191","flags": {},"type": 0,"text": "Pan-fried Cockatrice: Tastes so much better than chicken! A favourite of adventurers and food connoisseurs the world over, this versatile meat can be fried, breaded and barbecued for an excellent and filling meal with very little effort… except for killing the creature in the first place. It’s also rumoured to help the joints, especially after petrification.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "pWClGZkiR0PP1igJ","flags": {},"type": 0,"text": "Phoenix Soup: Not made with actual Phoenix. This is made with a meat of your choice and a Phoenix feather. No fire necessary. Simple break the feather around the middle and drip 3 drops of the golden liquid into the soup you’ve prepared. For added flavour, shave the feather stem into your soup or save them for another night. You should now have a filling, spicy dish that will revitalise you and leave you feeling refreshed and ready to carry on, night or day!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "idK1jrAXYngZ8A4p","flags": {},"type": 0,"text": "Manticore Skewers: Slightly dangerous. Never break the spines, and only ever use unbroken spines to begin with. Cut the manticore meat into bite sized pieces before skewering. Roast on an open fire. If the spine explodes, do not eat the meat. If prepared correctly, the spicy, fiery toxin will denature and become something akin to a sauce or marinade as it leaches out of the skewer and into the meat as it cooks. Not for the faint of heart.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "Sy8oZGaApGefs7ak","flags": {},"type": 0,"text": "Dragon: A notoriously difficult meat. Dragons are normally sentient creatures, but the lesser dragons (including wyverns and wyrms) are considered fair game. Excluding the alchemical ingredients, such as the eyes or heart (which must always be consumed raw if used in magical recipes or rituals), most of a dragon is meat, just like any animal. After the arduous task of scaling (best done with the beasts own claws or teeth), the meat must be cooked on an incredibly hot flame, regardless of species. It is believed to be physically impossible to overlook dragon. Also, the dragons tongue is entirely edible. Often considered an alchemical ingredient, it can be cooked or dried into jerky. It often holds a little innate magic, transferring the knowledge of languages the creature knew in life, if any. An interesting (and tasty) way to learn some new words.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "D4zzhb5wmp8M6Sjx","flags": {},"type": 0,"text": "Gryphon sirloin: Often utterly ruined by the casual adventurer, the Gryphon should be butchered by a professional whenever possible. A well prepared, fresh Gryphon sirloin will often fetch as much money as the party will receive from felling the beast in the first place! Surprisingly tender and flavourful, the meat is a strange combination of white and red, fusing the best of both into some of the best meat known to men or elves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "dR3TfTTzchInkzEG","flags": {},"type": 0,"text": "Fried Goblin Ears: Works with a variety of ears, so long as the adventurer isn’t picky or is desperate. Favourite snacks of the bandit tribes of the south, the fried ears of their foes are enjoyed by all ages after the rest of the corpse has been robbed, stripped and butchered… maybe skip this recipe…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "MCrkGCNmZeIRrgyl","flags": {},"type": 0,"text": "Whole Roast Dire Boar: Wild pigs have nothing on the elusive Dire Boar. Even Dire Wolf packs think twice before attempting to bring down one of these colossal swine! Often as big as a small elephant, the only way to enjoy this is to roast it whole. Make it a celebration. The whole hunting party should help gathering wood and building a large enough spit to cook the kill. Carve away meat once cooked like kebab meat and enjoy with the whole village!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "LdWLtCkFuDcTza8M","flags": {},"type": 0,"text": "Roast potatoes in Troll Fat: No duck fat for these crispy adventurers favourites! Simply roast in a clay oven after cutting into quarters and covering liberally with Troll fat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "86GfAyu6bLZaS4NH","flags": {},"type": 0,"text": "Kraken caviar: Incredibly rare and extremely expensive, only the richest of kings and emperors will ever be able to dine on the freshly laid eggs of a Kraken. These things are released en masse and grow rapidly to try and combat the multitude of oceanic predators that feed on their young. These must be caught and consumed less than 5 days after being laid. After that, if exposed to water, these regular looking roe will rapidly expand to the size of a cannonball and continue to absorb nearby water until it holds a pocket of water roughly 5ft in diameter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "dqzD6WFQCyyB40sm","flags": {},"type": 0,"text": "Hydra Eggs: With a similar property to their adult counterparts, the yolk of a hydra egg will appear to split up to 5 times while being beaten. If fried, the yolk turns a deep amber colour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "HV39oLok4vE2Ubv3","flags": {},"type": 0,"text": "Owlbear Steak: Very ‘gamey’, but perfect for jerky. Plenty of meat on an Owlbear too.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "W4qGHBY104TmYQ1m","flags": {},"type": 0,"text": "Roast Behir: The only way to enjoy the multi-legged dragon lookalike. After removing the electric glands and other organs, the meat of a Behir should be either smoked or roasted. Most adventurers miss out on the best flavour of this mountain dwelling creature. Properly cooked, Behir meat should have a taste reminiscent of the air after a lightning storm. Pairs well with cheese, oddly enough.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "fLOfvrFhimJvAec6","flags": {},"type": 0,"text": "Ants on a Log: Raisins and peanut butter slathered on beholder eyestalks (replaces celery stalks).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "cRbr7Fd0ibyC3Y9l","flags": {},"type": 0,"text": "Shell Shark Fin Soup: The fin decorating the bowl is just for show, the soup itself is a standard vegetable broth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "GPMwO8kIQ7ZJwX8c","flags": {},"type": 0,"text": "Bullywug Leg: said to taste like chicken, if that chicken had been drowned in a swamp.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "LFCtYmmmFfN5Kvv8","flags": {},"type": 0,"text": "Flail Escargot: A whole Flail Snail is roasted in the shell, and served with garlic and herbs. Its so large, that it is often ordered as a main course for 4 people.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "9WAcPLf2kc8noUY5","flags": {},"type": 0,"text": "Mindflayer Calamari: The mindflayers tentacle gives just a bit more out of the ordinary taste to it, which has been discribed as ‘out of this world’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "thofOH8VEabPqFUs","flags": {},"type": 0,"text": "Illithid Probes: Mind flayer spawn harvested by the town’s local heroes. Their heads are cut off and the bodies lined up like shrimp. It is a good source of vitamins for the brain. 6: Owlbear Meat: A large slab of owlbear meat slathered in gravy made from the meat itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "G6wYAce3MRIe5o9N","flags": {},"type": 0,"text": "Shambling Lettuce: Leafy greens harvested from a shambling mound. Just dont let it get away!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "BXFxkAwHk93S5cHQ","flags": {},"type": 0,"text": "Strahd Wine: Some stupid adventurer took that wine glass strahd always had after killing him. Turns out it’s bottomless. Yay?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "Uo7I3VRHYo3me89G","flags": {},"type": 0,"text": "Terrasque Ice Cream: Powdered terrasque horn, once shaved off, it can be used for a variety of purposes due to its resistance to temperature change. One of them is ice cream!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "vU7gCGigDCJKFAAb","flags": {},"type": 0,"text": "Bullete-Fin Soup: An exotic dish made from these dangerous creatures. Served in a buttery soup.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "iXuDFVjHEnmRalfZ","flags": {},"type": 0,"text": "Ilithari: mind layer tentacles sautéed in a sauce made from spiced ilithid cerebrospinal fluid. Warning, may cause hallucinations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "bMB9YvFmaYBdui9B","flags": {},"type": 0,"text": "Gelatinous Cube Marmalade: The snack that bites back! Be sure to remove any debris of slain adventurers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "hnYgrh0b4eZOFRUK","flags": {},"type": 0,"text": "Poached Basilisk Eye: Eat it but don’t look it at. Mostly because gross.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "XzPK4vX0IYz8d1Tl","flags": {},"type": 0,"text": "Gnoll Roll: A hearty biscuit stuffed with pan-fried gnoll meat. Eating too many may give you feral thoughts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "IYeNQCLeOrsBes2I","flags": {},"type": 0,"text": "Animated hors d’oeuvres: All of these finger foods are held together with tiny, toothpick-sized animated swords. They’re delicious, but can be deadly in a swarm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "qQz8VCcIYgCOaVga","flags": {},"type": 0,"text": "Lime Gelatinous Cube Salad – A dish made from the genetically modified and farmed Lime Gelatinous Cube. Consists of a whole Lime Gelatinous Cube stuffed with fruits and topped with whipped cream.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "BfRzg9HVdIpYLpEi","flags": {},"type": 0,"text": "Roc Foie Gras – Made from the fatty liver of an inhumanely force-fed Roc. One serving of Roc Foie Gras could feed an entire village, but it is quite expensive and typically only enjoyed by the upper class.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "fDefL58fliHvGghL","flags": {},"type": 0,"text": "Quasit Boil – Typically served at large get-togethers, hundreds of Quasits are boiled alive with corn on the cob, potatoes, sausage, and spices. This dished is traditionally served in a family style fashion by dumping in a large pile on a table and dumping additional spices directly on top.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "Tot5HoPwgTwk4g2S","flags": {},"type": 0,"text": "Fondgoo: An insane eccentric aspiring gourmet turned adventurer developed this after a horrific adventure in a ooze laboratory. Combining the jelly of a gelatinous cube with copious amounts of cheese and wine over high heat, you are able to neutralize most of the acidic elements to create an amazing dish. A mild anesthetizing effect tickles and numbs the mouth, preventing speech for a minute after consumption. Some consider this a boon and it is a frequent dish at many upper-class family reunions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "ZuS9qEc1Dcfyt480","flags": {},"type": 0,"text": "Flesh Fondgoo: Captured by a human from beyond the stars with an unnatural hunger, the chef only had servitude as a survival option. Becoming comforter and preparer of meals, the new take on the fondgoo proved to be delectable with the right ingredients. Thin slices of half-orc proved to be the most popular with the star cannibal and his crew, wildly rich with only mild game flavor from the mixed heritage. The gourmet would never admit it to anyone, but his refined palate preferred the gnoll. The terror only ended after discovering what they thought was a holy grail, a Hungering Flesh that went from cornucopia to consumer in no short order.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "d7URIXdoMc2WvYmt","flags": {},"type": 0,"text": "Roasted Phoenix: When you’re done, you toss the bones in the fire and *pop* the phoenix is back. Also, you can always cook it just right; if you keep going, then it loops rare through well done.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "tpVh2UXR9Dn0HBHh","flags": {},"type": 0,"text": "Forever Stew: made with a bit of troll meat which is still regenerating. If managed carefully, one only needs to add vegetables and can continue making a meaty stew night after night, indefinitely. But if you don’t eat it fast enough or fail to tend it properly, you could end up with recognizable troll bits (hands, eyes, …) starting to show up, or worse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "NpwAKFpnzVXx5spQ","flags": {},"type": 0,"text": "Basilisk Bisque: With a broth made from basilisk scales and filled with root vegetables and basilisk meat, this bisque is normally served in a warmed stone bowl.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "MiyPfBekngVCMWMw","flags": {},"type": 0,"text": "Almiraj & Rabbit Buchada: A dish marvellously made with part Almiraj and part Rabbit, both are force-fed until their stomach rips. The organs are then removed and the meat, carrots, cuscus and herbs are stuffed inside the Almiraj’s stomach.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "h0ACRyQncPpIthGW","flags": {},"type": 0,"text": "Flumph with Undersalmon: The tendrils of a dead flumph are removed, boiled on water along with the sanguine coloured fish commonly known as Undersalmon. It is served with Rice and Potatoes. This Dwarven dish has been since outlawed, with the discovery of the complexity of Flumph society. Although some still prepare it, as not only is it a delicious food, the psionic energy left on the meat brings joy to those who eat it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "RS8DJK0jmJx0LuiA","flags": {},"type": 0,"text": "Neogi Neck: one of the few parts of the Neogi that are not poisonous, the Neogi’s neck has tender meat and takes months to spoil. As such, it’s often sought out by adventurers tired of eating the same old dried meat when on the road.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "laEaM6Fxyl6MkHtb","flags": {},"type": 0,"text": "Dry Stirge: this is a common folk food. In places with Stirge infestations, meat is often spoiled as these tiny creatures suck all of its blood and nutrients. Because of that, locals recur to it to replace their meat. The Stirge is prepared on a campfire, but because of the many types of blood that it sucks, it often leads to the eater contracting some sort of disease.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "v8tEFYxYbKNsMqvz","flags": {},"type": 0,"text": "Party meat: Nobody knows who had the terrifying idea of powdering sugar on Kruthik tissue, but certainly it was a madman. Or a genius, once you taste it and realise this abysmal combination is actually delicious. it’s almost impossible to attend to a dwarven party without seeing this dish, commonly known as party meat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "fj5b7nNprHYsnmKA","flags": {},"type": 0,"text": "Axe Beak beak: This is usually served with the bird’s head cut off and the lower part of its beak being decorated with its meat, as well as a plentitude of vegetables.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "hqVeag0sVYsW8NZz","flags": {},"type": 0,"text": "Mind Flayer Calamari: Mind Flayer tentacles chopped and deep fried. Great with soy sauce and rice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "3VfrHpH0Max232cc","flags": {},"type": 0,"text": "Ankheg Claw Stir-Fry: Ankheg claws are very tough due to constant use in burrowing and therefore require long cook times, but soften beautifully over time. Use ginger, spring greens and your favourite stir fry sauce, goes very well with roughly chopped myconid.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "c00mvS8YIlKvQz6D","flags": {},"type": 0,"text": "Hydra Eye Jelly: A delicacy among the braver class of adventurers, Hydra eyes became so highly acclaimed in part due to the might of their owners, but also due to the fact that you will generally get a minimum of ten for every Hydra killed. Cook in simmering water until they begin to cloud, then chill in an ice bath and mash before mixing with pork gelatin and allowing to solidify while chilled.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "Yx15W5y4HR8O3sud","flags": {},"type": 0,"text": "Froghemoth Calamari: Delicious and filling, Froghemoth Calamari is a dish enjoyed by all, cut into rings, removing the cartilaginous and muscular centre before washing well. To cook, broil until firm and serve with olive oil and vinegar or to simply fry until golden and serve with as many dipping sauces as you wish, don’t be afraid to experiment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "BUg9emrxgfn0jbh5","flags": {},"type": 0,"text": "Pate of Elder Brain: A very difficult meat to acquire and tricky to prepare properly, Pate of Elder Brain is worth the work if you live to taste it. carefully remove all external tentacles and connective tissue before butchering, being careful of the internal connective tissue as you go. Cut into small pieces and place in a pot of water, slowly raise the temperature to medium until firm and blanch once cooked before blending. Ensure brain is really dead before preparing to butcher.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "BkasxCUi03UTT7NG","flags": {},"type": 0,"text": "Fried Roc Wings: Once you have your Roc wings, butcher them into pieces around the size of a chicken’s wing and lay aside, mix together flour, spices, salt and pepper before carefully coating the Roc meat and frying, be sure that the Roc is cooked through, Roc wings are tough and must be cooked well.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "CJ0uhrKZpb2mLfhl","flags": {},"type": 0,"text": "Otyugh Ribs: Who would have thought that a garbage eating Monster could be to tasty right?! Butcher the ribs down small enough to fit into your ceramic oven and cook overnight in your favourite pork sauce, before revelling in the delicious taste of possibly the most amazing ribs you will ever taste.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "UUhD7oscMjQry12B","flags": {},"type": 0,"text": "Remorhaz Stew: Remorhaz is a wonderful meat for stews in that it retains heat forever! The Heat immune properties of the Remorhaz become fallible after their death, but they still require extremely high temperatures to be able to cook. Think smelting furnace, not oven. With such high temperatures required, Remorhaz needs to be cooked by eye due to the limited availability of such heat sources. Dice into evenly sized chunks and cook until very slightly crisp on the outside, tossing as you go before adding to a stew. Sufficiently heated Remorhaz meat will stay hot for hours, even up to a day or two, keeping any stew it is added to hot as long as you wish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "9Jj6WZpS8maNlyUT","flags": {},"type": 0,"text": "Roasted Bulette Flank: Bulette flesh is damnably tough and needs to be slow cooked with extreme patience. Combine red wine vinegar, balsamic vinegar, soy sauce, brown sugar, mustard, rosemary, olive oil, and salt and pepper to taste to make a marinade. Cut the flank steaks off of the body and marinade them for at least a full day before roasting while continuously basting with the drippings. Once finished you will have a beautifully flavoursome and moist flank that while slightly gritty, is worth the effort of cooking it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "Mhjpc1AJSGGMHt2Z","flags": {},"type": 0,"text": "Cave Fisher Sushi: As some of you may know, Cave Fisher blood ignites if exposed to flame or excess heat, therefore the best way to prepare it is to cut the meat into sushi sized pieces and drain as much blood as possible from the flesh before igniting and letting the excess blood burn off, lightly flaming the sushi for perfect preparation. Serve on Sushi rice with soy sauce.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "1d9YBT3DxxR1vtwX","flags": {},"type": 0,"text": "Forest Garbage Sauce: Anything you can use. Violet fungus, myconids, moss, mushrooms. Provides a hearty, earthy base. A secret: the sap of a treant, woad warrior, or blight is bitter. But together, simmer them. Put over any dark meat and find a bottle of dark, cheap red wine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "EobWSOpvavCH2HXe","flags": {},"type": 0,"text": "The blood of a vampire spawn is intoxicating. Mix with a bloody-mary (that tomato based morning juice drink). Add in some raw vegetables. Celery, olives, carrots, and the like. Bottoms up.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "nXLy99BYVTdVnFhK","flags": {},"type": 0,"text": "Demon Wing Soup: It’s very spicy, and the wings are chewy, but there isn’t a whole lot for a humanoid to eat in hell, so it works.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "lB4BsgrjnHJHgroe","flags": {},"type": 0,"text": "Candied Quipper: One of the cheapest quick snacks around. Quippers taste uncompromisingly bitter and have an awful crunch to them. They still aren’t very good once dipped in boiling tree sap, but at least they are covered in candy…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "5uwxY6SBM95E3Fbe","flags": {},"type": 0,"text": "Honeyed Siren’s Tongue: The tongue of a siren produces the most wonderful sound when chewed, bards will often accompany instrumental performances with the chewing of a Siren’s tongue in order to woo crowds even further. Mixing it with honey makes it slightly easier to chew, but cooking it causes it to lose these magical effects.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "EZuwYrZpyT58SrtU","flags": {},"type": 0,"text": "Water Elemental Juice: The fluid harvested from a living water elemental has been known to retain effervescent properties after being harvested due to residual magic power left over in the collected sample. Water elemental juice can be mixed with anything from potions to fruit juice to make a refreshing bubbly beverage. It is suggested to not drink the substance without dilution.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "60kz8ySeUBQz9Z3s","flags": {},"type": 0,"text": "Pixie Salad: A tossed salad of finely chopped pixies will always produce the flavors of the colors of the rainbow. Each bite may taste like a different color, the first might be purple, the second may taste like red and so on and so forth. The older the salad is since the death of the pixies the closer the taste is to brown.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "pqC8BEQWVF0tmNyX","flags": {},"type": 0,"text": "Trollbalaya: A jambalaya made from troll sausage, typically with a drizzle of boiled troll blood, topped with two Troll’s eyes. (Trolls are surprisingly delicious)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "jpVFzuPl6F5WgLQm","flags": {},"type": 0,"text": "Pulled Orc Sandwiches: Typically made from Orc shoulder or pectoral, the younger the orc the better. Requires 10 hours of cooking over old coals, best seasoned with an elven blend, two chopped onions, and copious salt and pepper.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "uKJXUkkAPbqnfX8Q","flags": {},"type": 0,"text": "Burritoes: Giant’s toes are surprisingly rich in protein and healthy fats. Chop them, Sear them, cook two behir eggs in the left over grease, and create an excellent set of breakfast burritos. For a bit of added fun, they are best served on the toe nail.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "oqt9Zl2pEmnGxshq","flags": {},"type": 0,"text": "Rib-hirs: Behir’s are nasty buggers, but they’re good for one thing: ribs. The longest rib cage you will find, gather up your town, or the local goliath tribe, and you’ll make a killing off of these. Flay the scales and smoke at a low heat over hickory logs for 2 days, slowly rotating the ribs through. A nice baste of dwarven ale mixed with citrus, or a rub of an orcish spice blend will make this a meal to remember. Just keep in mind the smell will travel for miles, so you might attract a nearby Roc.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "kw4ZkJKzBsRZYki2","flags": {},"type": 0,"text": "Roc Stock & Balor: While not actually made with Balor flesh, this demonic delicacy is as the name implies a stew made from Roc stock and any sort of demonic flesh. Due to the hellish nature of the flesh, the stew does not need any outside heat to work itself to a hearty temperature. Good for those in survivalist situations, assuming you can ignore the faint brimstone smell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "XZuyOjrpWKOuIZU8"}
