{"name": "Paladin Magic Items","description": "Over one hundred items that a paladin shouldn't leave the temple without.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "mMfRBS45z19ODmYh","flags": {},"type": 0,"text": "The Judge – A massive two-handed sword that receives a +2 to damage to any evil creature. The Judge can also emit a powerful light once a day that can light the Paladin’s path in times of darkness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "w6Qm24F5t3Dirgz5","flags": {},"type": 0,"text": "Demonslayer Shield: A small shield that gives +2 AC, as well as 1d6+Religion Modifier damage reduction from demons, fiends, and devils, as a reaction. (Like deflect missiles for a monk)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "f2PSXoP6EGTt1Ynv","flags": {},"type": 0,"text": "The Headsman: A two-handed executioner’s sword (double-edged blade with a blunt, squared-off tip) that deals slashing damage. An inscription on the blade reads: I lift this blade so this poor sinner may find redemption, even if it be in death. +1 to attack and damage rolls when wielded by a Paladin. This bonus increases at the DM’s discretion as the player performs greater and greater acts showing devotion to their chosen God.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "6PSvUJF2CO2W4xst","flags": {},"type": 0,"text": "Bulwark of the Ancients: Seemingly made of stone, perhaps a slab from an ancient temple or tomb. Adorned on the front is a scowling, bearded face with leaves and roots for hair, challenging any would-be opponents to stand the test of time. Tower Shield with +3 AC. Once per day, can be slammed into the ground casting entangle in front of the shield. A medium or smaller creature can use their action to take cover behind the shield, gaining 3/4 cover from ranged attacks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "scLyAwLrOwMAYSTs","flags": {},"type": 0,"text": "Aegis of the Pure of Heart: A ragged and stained tabard of great age that automatically removes a single harmful disease, poison, curse, affliction or other condition from the paladin who wears it 3x per day. If the paladin breaks any of their vows or oaths while wearing the Aegis, or does so and then subsequently dons this garment, they are immediately subject to every condition the Aegis has removed while worn by that particular paladin for double the full duration.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "YqfBs9xiQaKGv4Ve","flags": {},"type": 0,"text": "Dawnbreaker: A large warhammer covered in vaguely luminescent engravings. On a critical hit, it deals an additional 2d8 radiant damage. The speaker is compelled to say ‘Dawn has broken’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "xL9F0VqC8KNiBapu","flags": {},"type": 0,"text": "Circlet of Command: 3 times per day, you may expend your reaction to force an individual targeted by the spell Command to roll their saving throw with disadvantage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "JwZ5B0KwJiNQOyMD","flags": {},"type": 0,"text": "Warhorse’s Bridle: Appears to be a mundane leather bracelet. Expending a bonus action causes it to grow into an appropriate bridle for the Mount summoned by Find Steed, and it can be applied to that mount in the same bonus action. The bridle increases the damage die of a single one of your mount’s natural attacks by 1d6, and its damage type becomes magical. If your mount does not ordinarily have an attack, it gains one.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "ZQYmiLvD9b1BjvWG","flags": {},"type": 0,"text": "Saving Grace: A five-petaled flower made in the image of a long-extinct variety of summer flower. When worn by a paladin, they may spend 2 hours of a long rest in prayer to dedicate the symbol to their god, promising increased adherence to their Oaths. It takes on an aspect of their deity or purpose – a war god would turn the petals into blades, a sun god would turn it to a sunburst, a god of life would revitalize the petals, while a vengeance or conquest paladin may cause the petals to take on an aspect of grimness, manacles, or drops of blood, etc. Once dedicated thusly, the Paladin may expend a use of their Channel Divinity feature to automatically succeed at a saving throw. This must be done before choosing to roll. This ability can only be used once per Day. A petal drops from the item each time this occurs. Two hours of each long rest must be used in this fashion until the item is used up, else it loses all petals and incurs the displeasure of the deity in question – at the DM’s discretion, you roll your saving throws at disadvantage for (# unused petals) days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "W2Z1B4q0JqSyXj2m","flags": {},"type": 0,"text": "The Golden Rose: This tower shield is engraved with a twisting vine culminating in a single rose. For each devil- or demon-kind killed while wielding the shield, a bit of the vine begins to glow with golden light, starting from the bottom and working its way up. Upon the 10th killing of a devil- or demon-kind the rose itself flares in a pure, brilliant golden light, dealing 4d6 radiant damage to all within a 20 foot radius. After that the shield goes dark and the tally begins again. A paladin’s work is never done…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "vRU5OjiruM6oEkLm","flags": {},"type": 0,"text": "Midas: A mighty greataxe, gleaming with gold accents, who smites it’s enemies with style. On a Critical Hit, the target must make a DC 15 Con Saving Throw or be petrified, as their body begins to harden into gold. On the targets next three turns, it can retry the saving throw. If none succeed, or if one of the saving throws is a Critical Failure, the target is permanently turned to gold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "YqdI90qhKjWq6qsf","flags": {},"type": 0,"text": "Gloves of Radiance: These gloves are highly conspicuous. They made of a silvery metal and constantly glow with a bright radiant light. This light grants a advantage on charisma checks not involving deception but imposes disadvantage on all stealth checks. It provides illumination as a torch. Every point of healing applied via lay on hands while wearing these gloves heals 1 additional point.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "EFWsNd0remRyok9c","flags": {},"type": 0,"text": "Leap of Faith (Boots or Greaves) – Attuned Allows the wearer to make up to 3 steps/foot placements onto nothing/dead space as if it were solid ground in any direction. Each step has a duration of 3 seconds and once the foot is lifted off of the step it is no longer usable.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "fo0bZ6IejD5luJQj","flags": {},"type": 0,"text": "God’s Grasp (Gauntlets or Bracers) – Attuned +1 STR (Not exceeding 20), Advantage on Grappling and on saving throws vs losing/dropping Weapon, +1d6 DMG using hand to hand combat, +1d4 DMG on all other STR melee attacks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "94lUvscyhdvjO18y","flags": {},"type": 0,"text": "Virtuous Visage (Armet Style Helm) – Attuned +1 HP(Not to exceed max hp) to wearer whenever wearer deals Radiant DMG on an evil creature. Wearer has advantage on persuasion checks when the Truthfulness of the situation has meaning (DM discretion) Wearer has disadvantage on deception checks and any rolls regarding “Amorous” actions or conversations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "M342Ny9bPDr9SZ4b","flags": {},"type": 0,"text": "Gavel of God – Wondrous, Legendary 2H GreatMaul – Attuned – 4d6 Radiant Damage 30ft aura that gives every ally in range advantage on saving throws vs spells. +3 attack/dmg rolls. Fiends and Undead take +50% more dmg when struck with this holy weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "xsnWFLJu2jB9RfEr","flags": {},"type": 0,"text": "Cloak of Curing (or cape) – White w/ Silver inlay While wearing creature is impervious to disease (exceptions: Vampirism and Lycanthropy) and receives +1 Hit Die Laying this garment upon a dying creature stabilizes it. Food washed/dried with this garment are purified. Wearer has Advantage on stealth checks in Snowy environments and Disadvantage in all other biomes. Upon removal CON saving throw DC7 – Success: Minor Ailment, Failure: Major Ailment, Nat20: No ailments.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "QsQEEnSHmXCJDBZC","flags": {},"type": 0,"text": "Shield of Wondrous Power – Magic Item +1 AC – Attunement for following Power: Bearer May summon a Snow Leopard from the astral plane by calling it’s name. When summoned a snow leopard is formed out a snowy mist within 5ft of summoner. The cat understands common and follows the orders of the summoner. If the creature is slain while summoned it will return to the astral plane and live on, but if the shield is destroyed the item becomes worthless and loses all enchantment. The feline may be summoned for up to 24 hours, but must rest for 2x that amount of time in the astral plane before being summoned again. If the creature is forced back to the astral plane by being slain an additional 24 hours of rest is needed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "sRNbeKzvnDxh5PAx","flags": {},"type": 0,"text": "Miraculous Mug of Mirth – This flagon is constantly full of mead, but only pours/spills out when applied to pursed lips. When drunk from, the creature receives a warm happiness in its heart and 1 HP. This benefit can only be applied once per individual creature between long rests.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "s5Llp6CnOrUeMN0j","flags": {},"type": 0,"text": "Bow of Redemption – A longbow that allows the user to deliver their Divine Smite as a ranged attack. Once per day, when attacking a fiend or undead creature with the Bow of Redemption, the paladin may use their Divine Smite without expending a spell slot.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "7cPSYZu8zER9o4R1","flags": {},"type": 0,"text": "Swiftstream’s diminutive courtroom (legendary): Camelia Swiftstream enjoyed a fulfilling and lucrative career as a pixie lawyer, until she was one day cursed by a vengeful opposed claimant to sit in judgement of any and all cases, forever, as a travelling justice. She took the opportunity though, and built a tiny but complete court in a travelling home (the size of a normal suitcase), and now lends her services to adventurer paladins who find themselves needing expert opinions on matters of right and wrong: after all, a paladin is expected to uphold the law, not understand it. (As a full action, anyone allied to the holder of Swiftstream’s Diminutive Courtroom may ask her for a legal opinion, the outcome of which they can then take as being aligned with Law. She takes 1d4 turns to prepare the opinion (pixies work fast), and on a 3+ flip a coin to determine if she needs to take opposed evidence. If she does, lawful opposed characters must call a truce to have their dispute settled with words rather than fists, or pass a DC15 WIS save to find a lawful reason the court is not in jurisdiction. The DM can make up Camelia’s judgement as they see fit. Out of combat, she can be invoked for similar debate and opinion and be treated as any other NPC in a position of moral and legal authority, except she lives in a house carried by the paladin and may be slightly biased)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "l6uchN2KYzXrtVGT","flags": {},"type": 0,"text": "Contact Lenses of Divine Fury (requires attunement): These lenses glow with a golden radiant light, even when not worn. While attuned and wearing the lenses, a creature gains darkvision (60 feet). In addition, the bearer may use its action to activate the lenses’ full power. The bearer picks one creature that it can see within 60 feet. The lenses’ golden glow narrows and blasts in a pinpoint line towards the target’s face. A creature can avert its eyes, similarly to avoiding a basilisk’s gaze attack. If the target has not averted its eyes and can see the bearer, it must immediately make a Wisdom save. On a failure, it takes 1d8 radiant damage and becomes frightened of you for 1 minute. On a success, it takes half as much damage and isn’t frightened. If the target is a fiend or undead, the damage increases by 1d8.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "dKtSacTaT0qqHyIN","flags": {},"type": 0,"text": "The Thrown Gauntlet – This white-and-silver glove has 6 charges. The wielder can expend a charge and cast compelled duel (DC 15). Alternatively, the wielder can make a melee attack with the glove. On a hit, the attack does 1+Str damage, and the wielder can expend five charges. The targeted creature must make a DC 18 Cha save or be at disadvantage on all saves, ability checks, and attacks besides melee attacks against the wielder of the glove. The effect lasts until either the wielder or the target are incapacitated or knocked unconscious, or until the wielder makes an attack against another creature. The Gauntlet recovers 1d6+1 charges every dawn; the Gauntlet also recovers all charges if the wielder singlehandedly defeats the creature targeted by the 5-charge ability.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "HCZWr9Q0kgCjGUnc","flags": {},"type": 0,"text": "A Dispensation for the Greater Good: A black scroll with an intact black wax seal containing a special dispensation signed by the Supreme Pontiff (and Co-Signed by a servitor of the God that you worship who will shield your action from your deity’s scrutiny) that permits you one extraordinary evil act for the greater good of the Church.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "aKAZRx7ZRXjTrPax","flags": {},"type": 0,"text": "Holy Censer of Concealment: Upon activation with a command word, the censer ignites, clouding the wielder with smoke in a 5 ft radius for 2 rounds. During that duration, the wielder gains concealment and +2 profane or holy bonus on spells and attack rolls. The censer can also be used a melee weapon and shares the stats of a +2 Flail. Adjust stats according to your game.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "09TbzLsDQERweHoy","flags": {},"type": 0,"text": "The Eye of St. Ballard: A disembodied eye that is magically preserved. The eye will magically replace another creature’s eye when held to an eye of a willing creature. The eye grants the ability to see the alignment of any creature that is visible. Additionally, when looking through the eye a creature gains +2 on Perception checks and has Darkvision (120 ft). Removing the eye can be done at will.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "hfcr45sUZMzbIlLL","flags": {},"type": 0,"text": "The White Stone of Calimdor: A polished stone of white granite covered in Elvish runes, it is a small, 1′ thick disc that emits a faint opalescent glow. The stone can instantly sharpen any sharpenable simple or martial weapon, and upon doing so grants that weapon a +2 to hit and damage rolls plus the following effect. (3/day)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "t3fWkURibVU2p2FB","flags": {},"type": 0,"text": "Calimdor’s Honing Spark: At will, the wielder of this weapon can choose to discharge its magical effects, allowing it to perform a melee attack from up to 50 feet. The attack is treated as a melee basic and gains 1d6 Radiant damage. Upon using this attack, the weapon loses the magical properties given to it by the White Stone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "8cuFtnM7Te1TA9fK","flags": {},"type": 0,"text": "Mithril Mirror: A 1 foot diameter disc of mithril with small silvery runes inlaid around it’s border. A creature can use the mirror to capture up to 12 hours of daylight (1/2 as effective for moonlight, 1/12 as effective for firelight). The light can be released by speaking its power word. When the light is released, the user can choose how many hours worth of light they wish to release. Releasing the light blinds all creatures that can see the Mithril Mirror, reveals any invisible creatures or objects caught in the effect, and deals (1d12 x [# of light hours released] + 10) radiant damage. (Blind lasts for a number of turns equal to hours of light released, WIS save 15)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "bRKqKTmdWYq2Cozi","flags": {},"type": 0,"text": "Recourse – A willow quarterstaff with silver ends. This +1 staff grants double proficiency in Insight and Persuasion when attuned. When the command phrase (‘Nothing More To Say’) is spoken, the Staff reveals its other nature- the command phrase opens the brandistock’s grooves and lets out its three long blades. The brandistock is a +2 weapon, doing 1d8 piercing damage and an extra 1d10 radiant on a critical hit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "tuItDonCX94gOZsY","flags": {},"type": 0,"text": "Lord’s Light- a silver lantern with four lion heads whose mouths let out the light. The lantern emits a bright light for 30 ft and dim light for an additional 20 ft. The light can even pierce magical darkness and can only be extinguished by the wish spell. 3 times a day, as an action, you can use the lantern to cast magic missile with 4 darts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "0obUaapSZ9ZJrNdl","flags": {},"type": 0,"text": "Redhead’s Favor – This beautiful white handkerchief has been interwoven with a golden chain to create a makeshift necklace. It was originally created by Lady Bridgette Nallshaw for her betrothed husband, the paladin Gathross Valle. It is said that the love and promise with which she endowed the favor saved Gathross from certain death. Once per long rest, the wearer of the necklace can have a critical hit deal no damage, and instead heal the wearer for the amount of damage that it would otherwise deal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "id6lhuptae0TQ3Hm","flags": {},"type": 0,"text": "Weeping Flower of Mercy: An artificial flower typically worn on the lapel of an outer garment that is secretly attached to a pouch of holy water. As a swift action, the wearer of the flower can squirt the fluid at a distance of 5 ft as long as one hand is free.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "wkOnt08VwahQNLXa","flags": {},"type": 0,"text": "Ring of Discernment: Judgment requires Wisdom. Twice per day, the wearer can ‘take 20’ on a sense motive check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "PwJ3VihMRVYkPbEI","flags": {},"type": 0,"text": "Torc of Faithful Radiance: The Torc of Faithful Radiance emits a visible aura to worshippers of the paladin’s deity, even if other spells or conditions suppress the paladin’s aura. In addition, once per day, the Torc permits the wearer to cast detect the faithful and compassionate ally.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "ceNgl1lyo15YlMuI","flags": {},"type": 0,"text": "The Smock of Sweet Judith: Can be worn under plate armor. Long ago, a small girl was kidnapped by Kobolds and forced into slavery in their cave kitchen. Little Judith worked tirelessly for years until one day she found just the right type of mushroom and added it to their stew. With her captors dead Judith returned to her town only to face ostratization and condemnation by her community because she had changed and people feared her. They thought she should be dead and did not understand why she was still alive after being taken by monsters. Judith lived in the nearby mountains as a hermit and herbalist for the rest of her life, dedicating her energy to helping those who sought her out with her herbal knowledge and uncanny ability to find lost children. When she died a Lammasu who had taken note of her dedication to those who suffered and were lost channeled her soul into the leather smock she wore for 50 years, worn thin and supple from use. This smock grants the user cure serious wounds just by speaking ‘Sweet Judith’, cure critical wounds once per four hours by speaking ‘Kind Judith’, and holy word once per day by saying ‘I am lost, please find me.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "beH6ixoM5k2XbtEH","flags": {},"type": 0,"text": "Mallet of Judgement and Law – All individuals within 60 feet of the mallet are under a permanent Zone of Truth spell with a save DC of 22. Also usable as a +2 warhammer and a spell focus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "F6SaA5WQA1zsO7YE","flags": {},"type": 0,"text": "Blessed Silver Powder of Blasting – One toss of this powder (as an action, range 60 feet, affects a 15 by 15 cube centered on a point within range) deals 4d6 radiant damage to fiends and undead within range. May also sanctify water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "V2ZESfAG9iGgsN7n","flags": {},"type": 0,"text": "The Myarsia Monks Staff – The Myarsian Monks are pious warrior priests that wield ornate steel staffs. Their remote monestary is located in the middle of a cliff. Each staff is unique and carved with the monks personal symbol. A stolen staff is pursued with much vengeance and to have one in your armory is sign of great wealth or power. If a command word is spoken, a blast of blueish energy comes out of the tip dealing 3d8 force damage in a 20 ft. cone. Those caught in the blast must make a DC 14 Strength save or be pushed back 10 ft. Recharge on a short or long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "Eoi0vNVoIG8FAgcW","flags": {},"type": 0,"text": "The Hammer of Retribution- This large, ornate maul is topped by a golden top. As a reaction, the wielder can choose to take the damage dealt to another target within 30 ft. Each point of damage thus taken is added to a pool. Upon a successful hit, the Hammer can expend the pool, dealing normal damage as well as radiant damage equal to 2d10+ the amount of the pool. This resets the pool to 0.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "TOdrHsInYXlP9AUA","flags": {},"type": 0,"text": "Blindside Flank- A black-and-red set of greaves. On the left leg is etched the symbol of a dragon; on the right, the mask of a tribal warrior. When attuned to these, the wearer has advantage on dexterity saving throws and can ignore difficult terrain for (Str Modifier x 5, minimum 5) feet each movement. When attuned to both the Blindside and Openside Flanks, the wearer gains the following benefits- The wearer is immune to sneak attack damage. Any attacks with finesse weapons are at disadvantage. Once per short rest, the wearer can make an overrun attack as a bonus action on a target no more than one size larger within 10 ft. On a successful attack, the target is knocked prone and takes 1d6+Str damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "wUjaDTQuYAyfE90u","flags": {},"type": 0,"text": "Openside Flank- This set of bracers appear to be black-and-red forearm wraps; closer inspection reveals that the wraps are made of a mix of cloth and superfine chainmail. When attuned to these, the wearer is resistant to sneak attack damage. In addition, once per long rest, the wearer can impose disadvantage on an attack roll within 30 feet. When attuned to both the Blindside and Openside Flanks, the wearer gains the following benefits- The wearer is immune to sneak attack damage. Any attacks with finesse weapons are at disadvantage. Once per short rest, the wearer can make an overrun attack as a bonus action on a target no more than one size larger within 10 ft. On a successful attack, the target is knocked prone and takes 1d6+Str damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "147RHHCVddcFmO5L","flags": {},"type": 0,"text": "Truth – A +1 longsword that glows a bright blue when someone tells a lie within 30 feet of it. The liar isn’t forced to tell the truth, but wielder of the sword now knows they were just lied to.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "Lwkx8tJBm5qskeQZ","flags": {},"type": 0,"text": "Conviction- A rugged, battered metal shield with a faded picture of a dwarven maiden on it. On the inside, near the hasps, tarnished golden lettering reads ‘My Faith is My Shield’ in Celestial. The shield is magical, giving a +1 bonus to AC when wielded. Conviction also has three charges. As a reaction, the wielder can expend one of the charges and add a bonus equal to their Charisma Modifier to their AC and all saving throws for one round. All charges are restored at dawn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "XxbsAYqBOhLNJPKG","flags": {},"type": 0,"text": "The Sight of Reason: A beautiful white scroll, carefully tied and sealed with a golden seal. As an action, a paladin can cast calm emotions while holding the scroll. Alternatively, the paladin can break the seal and unroll the scroll. If this is done, every creature within 500 feet must make a Charisma saving throw at disadvantage. If they fail the save, any creature’s attitude toward the paladin changes to at least indifferent (if hostile or unfriendly). Using the scroll in this manner drains the magic from the scroll for the next 3d6+1 weeks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "2eTJUQueb3SY0rGI","flags": {},"type": 0,"text": "Builder’s Judgement: This +2 Warhammer was created for the good followers of Erakto, God of the Forge and Innovation. It appears old and well-used, with a fire-blackened grip and a slightly dented head. The hammer has 3 charges. As an action, the wielder can point the hammer at a magic item and call upon the magic of The Builder to suppress the magic within the item. If the item is being wielded by a creature, the creature may make a charisma save. Upon a failure (or if the item is unattended), the magical properties of the item are suppressed for 1d6+1 rounds. This ability can also be used to remove cursed items.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "zIlsbHyi2sXpXTt1","flags": {},"type": 0,"text": "Sam’s Jackal: A silver necklace with a jackal’s head pendant. When the wearer knocks down a creature of medium or smaller size, a silvery silhouette of a jackal appears on top of the downed creature. In order to stand up, the creature must make a DC 13 strength save. The jackal disappears when the creature successfully makes the save or after 2 rounds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "3ki3h5mnYW590gfV","flags": {},"type": 0,"text": "Prayer beads of the Righteous: After using these for prayer beads for daily prayers/during a long rest, the paladin may declare that a target that has been successfully smited (smitten?) is stunned for one round. The effect is wasted if the creature is immune to being stunned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "T5ooujurGolf6e5j","flags": {},"type": 0,"text": "Mantle of the Brave: Extends the range of all of your auras by ten feet. One per day/long rest, you may grant one ally within fifteen feet a re-roll on a fear save they have failed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "d4RDgjP9B8epWAKR","flags": {},"type": 0,"text": "Snuggwie Bwankie: This 5-foot square cloth is warm and soft, and never appears to get dirty. It can be attuned by a good-aligned creature. If a humanoid is wrapped in the blanket by someone attuned to it, the humanoid is subjected to the sleep spell (focused entirely on the subject in the blanket). If the creature wrapped in the blanket is put to sleep, it is impervious to damage while asleep, cannot be targeted by any spell, and can only be awakened by the blanket being unwrapped or by the end of a 6-hour long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "ETmDIcvZ1LraczXz","flags": {},"type": 0,"text": "Medallion of Heresy: A symbol worn by Oathbreaker paladins that represents the fact that they betrayed their oath. No matter what it originally stood for this medalion is now a symbol for their new path and makes a oathbreaker instantly recognizable as a oathbreaker. If a oathbreaker paladin wears it, their dreadful aspect channel divinty now makes a creature fall prone alongside frightening them and gives it advantage against celestials. If a paladin with a different oath has it. They can, one time only, destroy the medalion to instantly nullify any malicious illusion’s and echantments affecting them of level 6 and lower by reafirming their dedication to the values they have sworn to serve.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "VHGn9l8taF0WVCTw","flags": {},"type": 0,"text": "Malleus Maleficarum: The first page of this small book claims to teach the reader how to deal with witches and demonic cults. The second simply says ‘Kill Them’ in Celestial. Upon uttering those words as a bonus action the book transforms into a burning +2 returning light hammer. The flames emit dim light out to 20 feet but are harmless. The hammer may be transformed back into book form with another bonus action.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "6gAOkjJuS0PawXdh","flags": {},"type": 0,"text": "Candle of Vigilance: After lighting this candle using an action, its flame will not go out for any reason other than the approach of a shapeshifter, fiend, or undead within 60 ft of it. When it goes out, whoever lit the flame immediately and telepathically becomes aware of it, regardless of distance. After going out, the magic of the candle is consumed and it can no longer be used in this manner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "J15mSuMPMjc3bTEp","flags": {},"type": 0,"text": "The Bleeding Lance: The wielder of this +1 lance may choose to automatically deliver a dosage of holy water to an enemy when they hit that enemy with an attack using the lance. The holy water is stored in a reservoir inside, which can hold up to 5 flasks of liquid. Theoretically this reservoir could hold other liquids, but you’re a paladin so you wouldn’t do that, right?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "R3O2AISYE9VtqcDE","flags": {},"type": 0,"text": "Boots of Blinding Speed: These brightly polished steel boots reflect light like a mirror. At will, the attuned user may choose to activate the boots’ magic ability, causing them to leave blindingly bright footsteps wherever the user moves during the duration of their turn. These prints flare up into a magical wall of radiant force that lasts for the next minute. The wall is 20 ft high and 1 ft thick. The first time a creature enters the space occupied by the wall or ends its turn there, it must make a Con save or take 5d8 radiant damage and be blinded for one minute, taking half damage and not being blinded on a success. Undead, fiends, and creatures with sunlight sensitivity have disadvantage on this saving throw. This ability can not be used again until the attuned owner finishes a long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "Lk0nqQPksq340h7e","flags": {},"type": 0,"text": "The Monocle of Magnanimous Judgement: A monocle that allows its user to cast Detect Evil and Good once per day as well as providing cryptic advice on if they could atone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "JJVcbzDLPbFwGMOs","flags": {},"type": 0,"text": "Ledger of Loyalty: A small leather bound book. If anyone makes a promise to the Paladin the Paladin can write the characters name in the book. If the character breaks the promise they name is magically crossed out and the Paladin is aware.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "OqCaJ0Zqi8tZbiEf","flags": {},"type": 0,"text": "Glove of the Godsworn: The glove has 4 charges and regains all charges at dawn. Using a charge, the paladin can cast any cleric cantrip by snapping their finger using the glove.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "ep4o3NfLdFsZaivF","flags": {},"type": 0,"text": "The Justiciar’s Noose: this beautifully wrought torc grants the wearer the ability to cast ‘Zone of Truth’ as a free action at will. If the wearer knowingly lies, the torc starts to constrict, strangling the wearer for 1d6 cumulative per round unless removed with a DC 15 strength check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "RCXeg52pNPYQySeW","flags": {},"type": 0,"text": "Breath of Conviction: A small glass vial that appears empty. As a bonus action, a paladin can open the vial and inhale the contents. The paladin is filled with a renewed conviction of his or her oath, and has advantage on all rolls directly fulfilling that oath for the next minute.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "9NbK5qmLQmMeyY2k","flags": {},"type": 0,"text": "St Arno’s Flame – Uncommon – A ring of red and orange beads to be worn around the wrist as a bracelet. A paladin attuned to this item can not use Lay on Hands to restore hit points but can instead take half as many hit points away from a creature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "gibop2TAQm9gwcdA","flags": {},"type": 0,"text": "Sword of All Fear Uncommon – Greatsword – A creature attuned to this weapon has advantage on concentration checks for all spells that contain the word ‘Smite’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "XPTqZ0gmurKiqTy5","flags": {},"type": 0,"text": "Harlan’s Bridle – Very Rare – allows the attuned paladin to cast Find Greater Steed without expending a spell slot once per day. Summons a Celestial Lion wreathed in flame.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "5AbKhTU5MraWeHQC","flags": {},"type": 0,"text": "Horn of Heavenly Reinforcements Legendary – allows the attuned paladin to cast Find Greater Steed once for each creature within 30 feet summoning a fleet of creatures. After being used, the horn is inert and unusable for a hundred years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "9NtnBgGvY7G0Bpz4","flags": {},"type": 0,"text": "Mantle of the Mountain – Very Rare – when a creature in the attuned paladin’s aura takes damage, that damage is reduced by an amount equal to half the paladins level.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "bVu0AC5ldRQf1ItX","flags": {},"type": 0,"text": "Hero’s Helm – Uncommon – a paladin wearing this circlet knows the direction and distance to the most imperiled person within 500 ft.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "M99hJHKwdl8czU6o","flags": {},"type": 0,"text": "Halo of Pure Emotion – Wondrous item, very rare (requires attunement by a paladin of good alignment) – When placed on the head, this silver halo hovers just above the wearer’s head. The halo provides a +2 bonus on Wisdom and Charisma saving throws, as well as advantage on saving throws against being charmed or frightened. Once per day, the wearer may cast calm emotions from the halo.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "x9sxcRw6aBmvGO3h","flags": {},"type": 0,"text": "Feather of Respite – Dropping the feather, even in utterly still air, will cause it to float in the direction of the nearest spot where the party can get a full night’s rest. The spot will be the best available protection from the elements and free from malign supernatural influences in the vicinity, but might still be interrupted by natural creatures operating on their volition. The feather can be used multiple times but requires time to restore: if used on subsequent days, the range of the feather halves. Some paladins use it to confirm whether they are surrounded by evil or to discern the direction where they might be most needed by willingly choosing to ignore the feather’s suggestion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "y5KXMBh0SUHeSTe0","flags": {},"type": 0,"text": "Soulplate Armor (Chainmail, Splint, or Plate Armor) – Rather than a strength requirement, this lightweight set of armor has charisma based requirements of equal level.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "lzk5ukYmW7CUNgNf","flags": {},"type": 0,"text": "Hammer of the Hoardbreaker – Whenever you land a divine smite using this warhammer, all large or smaller creatures in a 10 foot cone originating you and in the direction of the attack must make a strength saving throw equal to your spell save DC or be pushed backwards 5ft and knocked prone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "sxv7KQzGTrjxo4zq","flags": {},"type": 0,"text": "Chaotic Chatelaine: This decorative belt hook is all about making sure things never stay the same curtesy of the Traveler. By wearing this belt hook, the wearer (and being a follower of the Traveler) let’s the wear switch one piece of clothing with a target of their choice. This is not limited by if the target is even wearing clothes or the size of the garment the only piece of clothing you may not change is the actual Chatelaine itself. You may use the ability of the Chaotic Chatelaine 2 per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "zHWf2jrHiv68bIbU","flags": {},"type": 0,"text": "Belt of Chastity: a chastity belt that grants the wearer clear mind in midst of trying times. Pick-up lines and sexual engagement don’t work on those wearing a Belt of Chastity. Additionally, when one wears the belt, they have the ability to a cantrip, Aura of Chastity, that causes a person of their choosing to not engage in romance or sexual activity. Especially useful for keeping the party on track after grabbing a drink at the tavern. The ultimate platonic kink.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "T7ZtHLsclbGtTEpo","flags": {},"type": 0,"text": "Wolfsong: Wolfsong is an enchanted silver and mahogany flute that inspires ferocity and courage in battle in those who hear it’s chilling song. Those who hear it get +1 to AC and one point of inspiration. If the user does a bad job in playing it, the wolf carving on Wolfsong’s front will bite them and the user will lose one hit point.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "Bhtf6hLVaiJZZBrV","flags": {},"type": 0,"text": "Gauntlet of the Bane Giver: A silver gauntlet with a red gem in the center. It allows the paladin to use Lay on Hands, cure ally or self of poison, paralysis, stunned or blindness effects and can store them in the item. The user can use an action to touch a creature and give the stored negative effect to it, which the creature must succeed a Constitution saving throw against the spell save DC of the user.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "bXSYNJvjk0bXcstH","flags": {},"type": 0,"text": "Truthbrush: A potent dental instrument made from the whittled bone of a legendary Prophet and the hair of his Pegasus. While unparalleled in the upkeep of good oral hygiene, the truthbrush’s true power is in the supernatural ability of the wielder to detect lies. The wielder has +5 to checks against attempts of deception. Additionally, their gleaming smile gives them +1 to Charisma rolls targeting friendly characters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "HrVtVqWzSov1Rt8D","flags": {},"type": 0,"text": "Banner of Swiftness: A banner depicting a horse, grants allies within 40 feet an extra 5 feet of movement speed and +1 Initiative.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "4pXdGnK12lSRuBLq","flags": {},"type": 0,"text": "Shoulder Pauldrons of Responsibility: Steel shoulder replacements that depict lion heads. Gives Advantage on persuasion checks to convince NPC’s to allow the party to help them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "VkJg4sZpSzeOUBCf","flags": {},"type": 0,"text": "Necklace of Purity: This necklace glows faintly at all times unless the user is non-good alignment, is diseased, is cursed, or has stolen items on them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "iCoM0ePnocBP8mgL","flags": {},"type": 0,"text": "Boots of Grovel and Gravel: Blessed by the God of Justice, when these boots are not directly observed they clean themselves. These boots provide total immunity to nonmagical bites and claw attacks made at the wearers feet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "bcWqIEQJXap5sj4B","flags": {},"type": 0,"text": "Spear of Jannus Smile, The Knight: Can only be attuned by a lawful character This +2 spear has two long strands of ribbon a the tip. Once per turn, when making an attack with this weapon, on a miss, the user can decide to re-roll the attack and must choose another target within 5 feet of the initial target.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "3u1PEUMrnbDGATLY","flags": {},"type": 0,"text": "The Coinpurse of Western Ideals: Must be equipped by a Lawful Character. This small bag of holding is actually a mimic, can only hold coins, and the mimic speaks with the gruff voice of a staunch city guard. The Coinpurse cannot be pickpocketed, and has a chance to hurt any character attempting to steal from it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "fpUvtyk7AbFXSnPz","flags": {},"type": 0,"text": "Moustache of Lightheartedness: Can only be equipped by Lawful female characters. An adhesive moustache made by the god of trickery after losing a contest of courting to the god of justice. This item is blessed and provides advantage on diplomacy checks to the wearer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "GmuvyZ6TSdjDdgOH","flags": {},"type": 0,"text": "Shield of Sight: Can only be equipped by Lawful Good Characters. The wielder can close their eyes and see telepathically through the shield as long as they hold it. They are immune to sight based petrification, fear, and charms as long as they are seeing their target through the shield’s telepathy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "UJDPaF8NupS26pxJ","flags": {},"type": 0,"text": "Hammer of Community: This Hammer is blessed by the god of civilization to never bend nails when used as a tool.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "yiQHIZD87RuNCu2S","flags": {},"type": 0,"text": "Cape of the Overgrowth: This cape depicts tree roots growing over a city wall. This cape is blessed by the god of nature. Once per day, the wearer can cast the spell plant growth as a ritual. The Cape has text written in Druidic which reads ‘Life beyond borders’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "3ByqmuMTbPpnfRUH","flags": {},"type": 0,"text": "Lantern of True Intentions: This lantern, when lit, radiates light like a normal lantern. However, its light responds to malicious intent. If there is a creature within the 30 foot radius that intends harm toward the bearer of the lantern, its light will change to a blue hue. If the creature is also a fiend, then its light will instead change to a red hue.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "uUaQZ41vtqVRIjtQ","flags": {},"type": 0,"text": "Casting Censor (requires attunement): This constantly burning silver censor smells of your god’s most prolific plant, filling the air with empowering spirit as it does so. While attuned as a Paladin, you gain 2 cantrips from the Cleric spell list; additionally, you have the option of using your Charisma or Wisdom as spell-casting modifiers. This item (and any spell cast using it) has no effect on Oathbreaker Paladins.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "yw8J9lewYpzdVBeF","flags": {},"type": 0,"text": "Smoldering Censor (requires attunement): This charred, cast-iron censor billows soot, filling the air with a choking smoke. While attuned as an Oathbreaker Paladin, you gain 2 cantrips from the Warlock spell list; additionally, you gain the option of using your Charisma or Wisdom as spell-casting modifiers. This item (and any spell cast using it) has no effect on standard Paladins.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "kwCK0RM1QV9HLR21","flags": {},"type": 0,"text": "Belt of Noble Visage: This blessed belt gives the wearer the ability to cast disguise self as long as the disguise is of nobles clothing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "rRCwyEp7WmDcd04B","flags": {},"type": 0,"text": "The Salt Trident: This +1 white trident is blessed by the goddess of the sea, and grants the wielder the ability to the create a small pool of salt water upon planting it into the ground. The water created by this action is holy water The Wielder rolls a 1d100. On a roll of 90 or lower. nothing happens. 91-95 A small fish spawns in the water. 96-100 A Hostile water mephit spawns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "FU6qf5SrFIo3fx1v","flags": {},"type": 0,"text": "Horn of faith: one use per Long Rest. When blown by a Paladin or Cleric of level 10 or higher, it seems to make no noise. A single Spirit Guardian, in the form of a paladin of the user’s faith, appears near the player. It will engage the strongest enemy in the player’s vicinity, attacking once when summoned and then once per round, just before the summoner in initiative. An attacked creature takes 3d8 radiant damage on a failed Wisdom saving throw, and cannot escape the guardian except through teleporting away. The guardian disappears after the targeted enemy is defeated, the enemy escapes, the guardian is dealt any magical damage, or the summoner is knocked unconscious. In the latter case, the guardian vanishes on its turn and the player regains 2d8 hit points. If blown by an evil creature, the horn shatters, dealing 1d4 damage to the user.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "EeXI5EDjPy7HoyUa","flags": {},"type": 0,"text": "Hell’s Anchor (Legendary Artifact): A brand new looking ship anchor with glimmering seaweed wrapped around it. The anchor has 10ft. Of chain still attached to it. Hell’s Anchor was ripped from the sunken ship of a long forgotten paladin, but the paladin’s rage against the evil in the world followed the anchor back up to the shore. When the anchor is within 30ft. of a fiend, demon, or undead it begins to hum softly and the holder is made aware of all fiends, demons, or undead in the radius. Three times a day the holder may speak the command word ‘Chain’ and Hell’s Anchor will extend and restrain any fiend, demon, or undead of the player’s choice (if the enemy fails a DC 20 strength check). The enemy can make a DC 20 strength check on his turn to break out of the chains, but is otherwise physically restrained. (Restrained enemy can still speak) Enemy takes 1d6 damage every turn it is restrained. Hell’s Anchor can also be used as a +2 1d8 weapon with the two-handed and reach properties.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "8evOVASlrQ2y8CsU","flags": {},"type": 0,"text": "Shield of Lord Merica’ Legendary artifact (requires attunement): This large shield is in the shape of a circle with a giant symbol of (insert chosen god here) in the center. On your turn you may throw the shield making a range attack up to 30 feet away. On hit the shield will do (2d6 + str mod) bludgeoning damage. The shield will then ‘bounce’ off the target and find another hostile target up to 20 feet away and make another ranged attack, (1d6 + str mod) bludgeoning damage. Hit or miss the shield will then redirect itself back to the owner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "Sr9dHhCqrrD4EiI0","flags": {},"type": 0,"text": "Angle’s cuiress – a gorgeous gleaming set of breastplate armour made of silver and gold. Golden featured wings are etched into the back. Gives advantage on diplomacy checks with good aligned outsiders and allows the user to cast the ‘Divine intervention’ ability like a cleric does once a week.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "PoRyT4JtUxAFEW7b","flags": {},"type": 0,"text": "Jury’s Conviction; it is a locket which has magical properties, as long as you put in a piece of paper which on it has oaths, morals and other such things. Then while out of combat you gain advantage while defending the oaths which you have written in any situation, be it social (persuasion, intimidation) or physical (chase and rescue encounters). So for example; if on the oath it said ‘defend the masses’ or ‘protect the poor’ you will gain advantage on rolls which would be like; convince the mayor to offer help to the masses in their time of need, or go to a farm and help out on the fields to get food for the poor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "w2niNwnGHvnn0fDY","flags": {},"type": 0,"text": "Pendant of Faith’s Power Shared: Pendant in shape of the Paladin’s Holy Symbol. When worn by a Paladin and one or more of their allies within 20′, the allies weapons attune to the Paladin’s Smite power. When the Paladin uses Smite, the allies’ weapon cause smite damage equal to that of the Paladin. If the ally is also a follower of the paladin’s God(dess), then both the Paladin’s Smite Damage and the ally’s is doubled. (requires attunement by all.) Normally, at least a pair is found.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "0RYB3Bk98Fy9b6dK","flags": {},"type": 0,"text": "Mirror of Detect Alignment – Allows the paladin to get a better sense of their own alignment to judge themselves. Such introspection has been known to drive some mad.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "Cjs1yCnq4B57f0Oe","flags": {},"type": 0,"text": "Gloves of Reach (Requires attunement): A pair of gloves made of silver thread. While attuned and wearing these gloves, the range of Lay of Hands increases to match that of your auras. Upon activating lay of hands, a gaseous silver cloud shaped like your hand extends from your palm to the target.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "baVIQZR0yFKITh31","flags": {},"type": 0,"text": "Saviors Pendant (Requires attunement): A pendant made of three silver loops. Inside each loop is a small magically glowing sapphire. It has 3 charges. You may expend a charge to use Lay of Hands as a bonus action. Upon expending a charge, one of the gems loses its glow. It regains all expended charges at the end of a long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "j7eJjSoPvDwBWC29","flags": {},"type": 0,"text": "Shield of Bolstering: Shield (any). While wearing this shield, the first time you use lay of hands between each short or long rest, the target gains an additional 5 temporary HP.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false},{"_id": "zlkJzFXLa14FpKAp","flags": {},"type": 0,"text": "Wolf Pelt of The Wild Saint: Once per day while wearing this leather and fur wristband you can flip a coin for a 50% chance to transform into a wolf (or dire wolf after level 10) for up to an hour or the entire night of a full moon. Flipping the wristband also causes your weapons and armor to merge into your body and you gain the appearance of a dirty hermit with a walking stick.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [101, 101],"drawn": false},{"_id": "7G4wfuhmuoDqhWBo","flags": {},"type": 0,"text": "Silver Wings of St. Alicia: the silver necklace causes ethereal wings to sprout from your armor. Your flight speed is 15 feet, but you also have a 5% chance of blinding opponents upon activation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [102, 102],"drawn": false},{"_id": "2hzJ5L8lkzIi8P5q","flags": {},"type": 0,"text": "Shield of The Green Man: An old +3 AC shield. Made of petrified black ironwood by an art lost to time it bears the face of the legendary Green Man. Some say it whispers ancient knowledge while you sleep. Give +1 to your Wisdom and Charisma scores while equipped. You have advantage against Fey and can cast Goodberry, Entangle, or Speak With Plants and Animals once per day. Also once per year you have a 5% chance to create a plant based simulacrum of yourself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [103, 103],"drawn": false},{"_id": "fN7NVtUpohGhWTIU","flags": {},"type": 0,"text": "Divine Knowledge(requires attunement): A small trinket, gem, or jewel. When a paladin wishes, the gem identifies those who are Lawful Good or a Paladin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [104, 104],"drawn": false},{"_id": "GbIhwlnIwAL6NtcB","flags": {},"type": 0,"text": "Lie Detector: A small crystal ball. A paladin’s will to be honest is so overpowering, a small crystal ball detects when lies are being told.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [105, 105],"drawn": false},{"_id": "rw2DUQSaZDINeQOx","flags": {},"type": 0,"text": "Candle of Divine Power(requires attunement): A small candle. Has 3 charges and regain d3 charges each day. One charge is used for this function: In a thirty foot diameter circle for 5 rounds, all Lawful Good creatures gain +1 to hit, +1 damage, and regain 3 hit points per round.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [106, 106],"drawn": false},{"_id": "sErboR494fTEVVub","flags": {},"type": 0,"text": "Savior Sword(Artifact): A +3 Two Handed Sword that only exceptionally powerful and Lawful Good Paladins can use. This exceptionally large sword radiates divine power. Any undead that is struck by the sword is destroyed provided its HP total is less or equal to the Paladin’s. It can use Know Alignment(From 2e. It identifies 1 person’s alignment in a 60′ range) at will. The sword has 10 charges maximum. It can use 1 charge to cast a Wall of Force that works only against Undead and Evil Creatures. It can use 1 charge to cast a Lightning Bolt with holy based damage. It can use 2 charges to cast Heal. It can use 8 charges to cast Power Word Kill against Undead. It regains 2d4 charges at dawn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [107, 107],"drawn": false},{"_id": "ov4yVkcYpbmOHUwv","flags": {},"type": 0,"text": "The Undaunted – This large rectangular shield with a dragon rampant emblazoned across its front gives courage to the brave while condemning the weak. It gives a bonus equal to the challenge rating of the foe compared to the bearer – so while a level 5 paladin facing a CR7 young black dragon would receive a +2 bonus, a level 9 paladin facing the same foe would be penalised with a -2. The shield is intelligent in that it is an intelligent item, however it is as dumb as a bag of rocks, and will actively encourage its bearer into greater and more suicidal acts of ‘heroism’ which it will then relate with gusto to the next poor sod it’s bequeathed to.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [108, 108],"drawn": false}],"formula": "1d109","replacement": true,"displayRoll": true,"_id": "ACmpnQxSXt3T0jMW"}
