{"name": "New Darklords and Domains in the Ravenloft Setting","description": "One hundred new Darklords for the Ravenloft campaign setting that will make even Strahd tremble in his boots.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "01CbD3ZYNR1BRFz1","flags": {},"type": 0,"text": "Gorthaur, The Gargoyle Lord, is the darklord of a great gothic city full with gargoyles and statues of all types, many of which are coming to life at night. Evil and cruel as those gargoyles are, their presence is the only thing keeping away the evil spirits threatening to annihilate the city. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "6Dxly6AvnskdAWAC","flags": {},"type": 0,"text": "Gulgolatha, The Skull Lord, was a supremacist elven king (eladrin) who led a genocidal campaign against all other races, seeing them as inferior and impure. His plans backfired, resulting at the destruction of his kind. Now he is a skeleton warrior with long white hair and ornate armor, sitting on his throne among the ruins of his once magnificent city, his sword which turns flesh into dust in his hands. Surrounded only by ghosts and skeletons, he is fully aware that the other races thrive while he belongs to history – but still dreaming that his time will come…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "2dbF7ZYYjBsy03Q8","flags": {},"type": 0,"text": "Archimenes, The Nihilist, was a philosopher who preached so convincingly his philosophy of nihilism and meaninglessness, that the people in his kingdom were all persuaded to end their lives, and he was left alone, unable to die himself. He has the power to convince anyone at his pessimistic philosophical views (nihilism, immoralism, determinism, materialism etc.) with logical and scholastic arguments; those visitors he doesn’t persuade to kill themselves, he sends to other domains to spread his destructive ideas. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "0EpE6pAqd9qBrXxG","flags": {},"type": 0,"text": "Jezebel, The Harpy Queen. She wanted so much children of her own, so when she found out she couldn’t conceive, she stole others’ babies and children, taking them to her castle and never letting them out. Cursed to become a harpy, she and her harpies’ clan now terrorize the people of her domain, many of whom bind their children to heavy-weighted chains or lock them in cages in an attempt to keep them from being taken away. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "2jzQTMpKtvYHVSdQ","flags": {},"type": 0,"text": "The Man in the Yellow Hat. Mastermind of crime, the white-skinned, ever-grinning Man in the Yellow Hat is a truly bizarre, creepy character, capable to grotesquely twist and change his body, control his surrounding, pull strange objects and creatures out of thin air, and perform other cartoonish fits ignoring physics and logic. He has a sick sense of humor and absolutely no morals, and always plans insane crimes to shock and terrorize the city. Nobody knows his identity and background, and nobody suspects the real lord is not the man but the yellow hat possessing him – a hat containing the soul of a mad artist, failure in life but all-powerful in his death (Inspiration: imagine a combination of Judge Doom from Roger Rabbit, Jim Carrey’s The Mask, and Batman’s Joker)   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "Ui1icccOLwvLuZtv","flags": {},"type": 0,"text": "Lilith, the Mistress of Souls. It is uncommon to see a whole domain holding a 10th old girl at such awe and fear, but it is understandable when this girl is the current reincarnation of Lilith Lathenus, the matriarch of the noble Lathenus family, who has been reincarnating through her granddaughters for hundreds of years. Ever calm, controlled and unemotional, Lilith has the power to manipulate souls; she has a collection of thousands of souls stored in bottles, dolls and other vessels, which she may instill into a living, dead or inanimate bodies, torture, sell, consume or anything else. Some whisper the ravens bring her the souls of the deceased. Though everyone fears Lilith, many come to her asking to have their beloved ones’ souls instilled into new bodies, or other requests, which she might grant – for a price.   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "sIeBRFVDf7OYJPdB","flags": {},"type": 0,"text": "Anita, the Lady Wasp. This insect-themed domain is swarming with all kinds of insects, normal, giant and monstrous. The darklord Anita is a werewasp, sadistic priestess of Calistria, who tries to keep the balance of power between her, the assassin weremantises and the conspiratorial werespiders (see ‘entothorpes’ in Pathfinder Bestiary 6).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "9JASFmrHPjusfwGI","flags": {},"type": 0,"text": "Graf, The Unseen Troll. The forests, mountains and under-bridges of this Nordic domain are inhabited by ravenous trolls. However, the human denizens don’t believe in trolls, considering them nothing more than children’s legend. When cattle or people are missing or found devoured, it will always be attributed to bears, bandits or natural causes. Even if someone actually sees a troll or attacked by one, he will forget it a moment later, believing the experience to be something else. When troll dies it becomes a stone, so no evidence is left to his existence. It is all part of the curse of the dread troll lord, who wants humans to fear and respect trolls, but can’t make them even acknowledge their existence. (Inspiration: the movie Troll Hunter)   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "bQM2U1VbBzF19ATg","flags": {},"type": 0,"text": "Kazan Khan, the Great Conqueror, was once the great Khan of the vicious Neuroni Horde on the prime material world of Barovia. He was a ruthless conqueror who razed cities and slaughtered whole populations, piling up huge pyramids of severed heads and offering their souls to the demon lord Irlek Khan. He believed his people were destined to rule the world, but his great empire came to an end by when he was assassinated by the Baal Verzi. Now he exists as a giant ghostly head, hovering inside an oriental palace full with maddening illusions of exotic grandeur and horrors, issuing commands in a thundering voice. The tribes of the Neuroni live in the vast planes of the domain, still proud and ruthless, but now just a shadow of their former glory, to the great dismay of the Khan. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "NKmwTpa32Z4RkjSv","flags": {},"type": 0,"text": "The Grand Possessor. People of this domain are often being possessed by mysterious entities. Each possession lasts from several minutes to couple of hours, during which the possessed behaves like a whole different personality. There are about 20 documented recurring possessors (though many more might exist), each with a unique character and behavior, some are just weird or embarrassing and others are extremely malevolent and dangerous. When a possession is recognized, the people around will usually try to contain the possessed or simply avoid him until the event is over. The darklord is a greater possessor who knows to disguise himself well, and may inhabit anyone at any time, forwarding his malicious plots gently or brutishly at his will. His (or her, or its) nature, background and goals are mystery. (Inspiration: the book Pandemonium by Daryl Gregory)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "GVKDKOE8o9G9izBG","flags": {},"type": 0,"text": "Tor-O-Gon, The Caveman. On a world of advanced technology, Doctor Egon was a scientist who abandoned all morality in name of scientific progress. The Dark Powers made him a chief of a cavemen tribe (who mispronounce his name as Tor-O-Gon). Now is forced to lead his tribe in a dark, Paleolithic domain, teeming with prehistoric beasts and primal spirits, forever devoid of progress. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "94N74Zydx1y0a01B","flags": {},"type": 0,"text": "The Empty Woman. Somewhere in the mists stands The Empty City, a large, abandoned, decaying city, inhabited only by the souls of the lost and the damned. Visitors tend to get lost in the city, wandering for days without finding the way put. Somewhere in the city is the dreadful Empty Woman. The black holes of her eyes and mouth, and the cold emanating from her, reveal she has done things that would make other darklords go pale – culminating in deicide. She is looking for several hundred items scattered and hidden about the city, the gathering of which will enable her to complete her unfathomable goal. She might send visitors to search them for her, offering them freedom if they agree and devouring their souls if they don’t. The search for the items requires terrible tests and prices though, almost surely damning the seekers (see The Holders series on the net for inspiration to such tests, and The Lost Room TV series)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "7KlFcqlmNRKReMJt","flags": {},"type": 0,"text": "Emil, The Scarecrow. This small town is populated by grotesque, crudely-made animated scarecrows, mannequins, patchwork folk (see Book of Shadows) and other animated objects. The scarecrow darklord rebelled against his human creators and killed them, leading his ‘people’ into this land of their own, where they ‘live’ in mockery of human lives. He can animate and command any artificial object, and hates true humans more than anything else. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "3EFVfGkVJIn8dnDC","flags": {},"type": 0,"text": "Vashti, the Naga. Beginning her life as a human slave, Vashti worked her way up into a concubine and then the king’s mistress, using seduction, manipulation and lies. She poisoned the queen and strangled her children to ensure her position as the new queen and mother of the heir. The Dark Powers transformed her into a giant naga, making her the lord of a small jungle domain. She dwells in a hideous temple in the heart of the swamp, surrounded by smaller nagas, snakes and serpentine monsters she despises. More than all she hates women, whom she has grown to see as competitors, and for whom she saves the worst tortures.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "eWn5ZHvELsBHabmV","flags": {},"type": 0,"text": "Zarizinia, The Gremlin Princess was an elven princess who always loved making harmful pranks and embarrassing-to-deadly mischiefs to anyone around her. When her mischievous behavior became too evil, the Dark Powers gave her the hideous face (which she often hides behind a veil) and scaly skin of a gremlin. Now she rules the humans, elves and gnomes in her domain from her heavily booby-trapped palace, served by her hosts of gremlins and gremishkas, and no one is save from her mischiefs.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "ywOOtdtFxaUDQ0qu","flags": {},"type": 0,"text": "Kasar, the Centaur was once a human warlord, the champion of the Bright City, who led his troops against the savage human and demihuman tribes of the wilderness. He slaughtered them mercilessly, seeing them as nothing more than animals. An ambush made him sink with his horse in a quagmire; he emerged as a giant black horned centaur. Kasar is now cursed to roam the ever-darkened wilderness of his domain, surrounded by monsters and wild creatures he loathes. In a role reversal, he tries in vain to lead them against the Bright City in the center of domain, the only place where the sun still shines, but he is unable to enter it.    ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "Qb3Yk5qDx0apydd9","flags": {},"type": 0,"text": "Hagatha, the Spectral Hag. The people of this small domain burn every woman at the stake on her 40th birthday. Most women go willingly though tearfully to the stake, knowing that every day past this age the chances are growing for them to transform into monstrous hags and devour their beloved ones. The source of this curse is the spectral hag lord of the domain, who was burned at the stake herself, and only by destroying her can the curse be lifted.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "Vw6GtjvwTz0Y9jDJ","flags": {},"type": 0,"text": "Louis, The Rat King. The rightful heir to the throne, he was thrown away to the sewers as a child due to his deformities, while his good-looking brother inherited the kingdom. Growing in the company of rats, the Rat King – now a truly twisted, three-headed giant rat-thing – returned with a revenge and an army of disease-infected rats. Now he rules his plague ridden, debris filled kingdom from his crumbling castle, never seen in public. His domain reflects Europe during the Black Death, when fear and superstition ruled, and vile magic and twisted creatures abounded.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "FWRip6KldIQKHDTJ","flags": {},"type": 0,"text": "The Great Fog. This once thriving metropolis is locked now in a perpetual heavy fog, obscuring sight and making breath difficult. There is no escaping from this foul, dark miasma. The population has greatly dwindled, and the remaining denizens are struggling to survive in this hellish atmosphere, find supplies and fight against madmen, bandits, wild dogs and obscure monsters. The fog itself is the darklord, feeding on the fear and despair of its prisoners, though who or what is it and how did it come to be is unknown. (Inspiration: the short story The Fog, by Morley Roberts, in Strange Tales from the Strand, and the movie The Mist)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "8dCNzZaeoyObnptL","flags": {},"type": 0,"text": "Uzhos, The Ogre. He was a brutal bandit, taking by force anything he wanted: money, objects, women. Now he is an unstoppable, horrid-looking giant ogre, who can easily take everything… but all those things are simply too small to be of any use for him. He terrorizes the villagers in his domain, bending his frustration on them in cruel methods. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "TJWQL9ichDUTE6Rm","flags": {},"type": 0,"text": "Daniel De Silva, The Lord of Sin. The horns on the head of this vile tiefling force people to tell him their darkest secrets and desires, which, at his bidding, they act upon. Whenever someone in this domain gives in to his or her desires, he or she becomes more fiendish-looking, sprouting horns, tails, scales, forked tongues etc. Many denizens revel at their fiendish looks, while others struggle to resist temptation and keep their purity. The darklord believes all humans are perverted inside like himself, and coming upon pure souls, he will do everything to corrupt them and prove his point. (Inspiration: the book and movie Horns)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "ZgUytFcXBZeNH7jy","flags": {},"type": 0,"text": "Gustave Tooms, The One-Eyed King. In the land of the blind, the one-eyed man is king. This darklord, who lost his eye as a child, infected all of his kingdom with mystical plague, making everyone but him permanently blind. He now rules the community of survivors, using and abusing them at will, since they know they utterly depend on him to find food, medicines and supplies. His eye is playing tricks on him though, showing him things that aren’t there, and his great fear is to lose his sight or connection with reality.  (Inspiration: the books The Day of the Triffids, by John Wyndham, and Blindness, by José Saramago) ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "4Yq8vpfWimGcJ8LJ","flags": {},"type": 0,"text": "The Fly. The smallest darklord in Ravenloft, this priest of Baalzebub has committed such horrible atrocities that he was cursed to become a fly. He is still very dangerous though, and may inflict illness and whisper madness, possess people temporarily by crawling into their brain through the orifices, and control swarms of flies. His most horrifying power is a curse transforming people into man-fly abominations. His domain is a city surrounded by marshes, heavily infested by flies, mosquitos and other insects. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "o4WHOiLYHUECePsH","flags": {},"type": 0,"text": "Lazaralin, The Wish Giver. When anyone makes a wish in this enchanting, Arabian-nights’ style city of delights, the beautiful female genie darklord makes it come true – in a dark and twisted way, of course. The city is in a state of constant chaos due to all the wishes and counter-wishes made by all its dwellers and visitors all the time. No matter how harmful are the results, people never give up and always try to remedy the situation by more wishes (everyone can use up to wishes a day). The only wish the genie can’t grant is her own – to be free from her enslavement to those pesky humans. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "xkfdc1PTLInJiUJW","flags": {},"type": 0,"text": "The Faceless. This mysterious woman has white gown, long black hair and no face, only two wild eyes. She’s got powerful psionic talents and is completely insane. Visitors in the abandoned, rusty town of her domain will be subjected to vivid hallucinations drawn from the darkest recesses of her and their subconscious and deepest fears. The closer they come to the Faceless, the more powerful and horrifying their hallucinations become, manifesting as phantasmal killers. But there are hidden messages in those mad hallucinations as well, and figuring them might supply key to escape. (Inspiration: Silent Hill and the movie Re-Cycle)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "uPB9yJ2vzQmscPUk","flags": {},"type": 0,"text": "The Wendigo. An Indian-like shaman has channeled into his own body the evil spirit of the deer-skulled Wendigo in order to drive away the invaders threatening his people. He has succeeded, but now his evil is tainting his vast Native-American styled domain, and the lands of the tribes are plagued by evil spirits, demons and the undead. (Inspiration: Totems of the Dead and Deadlands RPGs)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "Vmoez4Pn9OVMqi3q","flags": {},"type": 0,"text": "Heidrich von Aizenshtat, Governor of the Living and the Dead. In this large city, the upper class and nobility are vampires, the hard-working lower class are slow-minded (though sentient) zombies, and the middle class are mortal humans and demihumans of several races. The mortals and the undead live in coexistence, and most of the mortals dream of the rarely given promotion to vampire status (so there is no lack of volunteering blood donators), and dread the punishment of demotion to a zombie.  There is a constant tension however between the different fractions, derived from envy, fear, hatred, suspicion and prejudices, which often erupts in violent ways. The lord governor, a cynical business-like necromancer, and his council of necromancers have hard time keeping the peace and balance in the domain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "rkfdwHQU1slUe886","flags": {},"type": 0,"text": "The Alhoon. Everything looks peaceful in this lovely, sunny town. People live their lives happily, facing no unusual problems other than occasional sudden death cases, attributed to illness. The horrible truth however is that this pleasant reality is a façade, a constant mass hallucination broadcasted into the denizens’ minds by an artifact from the alhoon darklord’s tower, superimposed on the actual reality. In reality, the city is crumbling ruins, the air is filthy, and everything is dirty and decaying. Some individuals might get glimpses of the truth, and even notice the illithids monitoring the people, but they’ll be treated as insane if they speak of it. (Inspiration: the movie Virtual Nightmare. Note that unlike the Matrix, the people here live bodily in the physical reality, only their perceptions of it are twisted).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "KpLekBiYxQYv92th","flags": {},"type": 0,"text": "Sasha Orlov, The Transmogrifist, wanted to be free of all categories, and gradually changed his body surgically and magically into a truly grotesque and alien shape. Now he/she/it wants to share with others his ‘freedom’. He flies his floating domain, the Cathedral of Flesh (which looks like an abominable organic spacecraft, made from the twisted flesh and sinews of thousands of creatures), abducting people and uses his power of fleshwarping to help them ‘ascend beyond humanity’, causing lots of misery and madness. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "tydikocdQLMs1ykD","flags": {},"type": 0,"text": " Sharana, the szarkai. This female szarkai (albino drow), the ruler of a powerful drow city, is cursed by a trait most uncommon among her kind: a conscience. She tries everything to rid herself of it, indulging in great depravities in her attempts to silence its voice, but it only makes her feel more merciless pangs of guilt and shame. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "nFIRLFXy51riwU5b","flags": {},"type": 0,"text": "The Amalgam. For many years, a crazy mage collected the evilest, most powerful ghosts and spirits from all over the world, trapping them in his Well of Souls, where they fought, devoured, consumed, mixed and merged with each other. When the final result finally burst out of the Well – an amalgam of dozens of murderous, insane ghosts – it was such a powerful and horrid being, that the Dark Powers immediately made it the lord of the surrounding city. Having killed since all the living citizens (making many of them lesser ghosts and undead), the Amalgam still haunts the empty city, waiting for more souls to torture, kill and add to itself. It has about all the salient powers from Van Richten’s guide to Ghosts, and more.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "rpAq0ApZYXiJTJBx","flags": {},"type": 0,"text": "Melchizedek, the Eternal King. This unbelievably ancient, withered-looking vampire has ruled his kingdom for 10,000 years, leading it from the bronze age to the space age, from a savage tribe to a galactic empire. The Dark Powers returned him to his starting point; now he rules again a bronze-aged, biblical-styled domain, populated by tribes of idolators and demons-worshippers. He rules like a god-king from his city Ur-Shalem, commanding monstrous vampiric slaves (see Buffy’s Turok-Han), but is endlessly frustrated from having to do everything all over again. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "gPEOCSuZr0MkzKkd","flags": {},"type": 0,"text": "Griffith, The Invisible Man, wanted to be famous and popular, but now no one can ever see him, and his frustration drives him to extreme violence. He rules a small clan of invisible men and women, formed when someone is being ignored and unnoticed for long.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "nExOsbokGqOWHLUy","flags": {},"type": 0,"text": "Alex, The Nerd. This large city is frequently terrorized by horrifying monsters and bizarre villains. Nobody suspects that the real darklord is an outcast, reclusive lad, with vivid imagination and the ability to make his imaginary creations come to life temporarily (as in Shadow Conjuration spell, but more powerful), which he uses to avenge himself on the society he doesn’t fit in.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "NVu3IJHrLj7ltHkz","flags": {},"type": 0,"text": " Luciano, Lord of the Masquerade. In this large, colorful Venetian-styled city, everyone wears masks of all types at all times; being seen publically without a mask is outlawed and considered utterly immodest. There are several noble houses in the city, guilds, cults and other groups, each with their own style of masks; intricate conspiracies, schemes and plots abound everywhere, and one can never be sure who (or what) is behind the masks. Many unhuman beings are drawn to the city as well, easily camouflaging themselves among the masked population. The prince darklord is a Master of Masks (see D&D Complete Scoundrel) with a huge collection of magical masks, each granting him some powers and traits of the role he is playing now – but he is tormented by his inability to figure out his own true identity.   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "5GrUDXFa5vTMpI7l","flags": {},"type": 0,"text": "Nekhbet, the Sphinx. The villagers in this small, arid domain practice all year’s long to sharpen their minds and wits – talking in riddles, playing intelligence games, and learning philosophy and logics. It is all a preparation for the annual riddles contest, in which every denizen who has come to his or her age must walk into the Maze of Riddles inside the sphinx’ temple and survive it. The sphinx lord plans the maze and riddles during the year, hoping to find some humans with brains… and hungry to devour the others.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "avgVEQGNfgGeB8lc","flags": {},"type": 0,"text": "The Mothman. Shadowy figures with wings and burning eyes, strange lights in the skies, haunting whispers in the heads, weird sounds coming from nowhere, crop circles, memory loses, time behaving strangely, second moon appearing, unnerving dreams on disaster, odd patterns of weather and animal behavior, mementos from the past reappearing, madness, bizarre behavior, laws of nature lapse – all of those eerie phenomena and more haunt the rural, Twilight-Zoned domain in the shadow of the mothman. The domain is actually locked in a time loop of 3 months and then destroyed by some calamity and restarted again. Nothing is known on the enigmatic mothman, and whether he is trying to stop the disasters or initiate them. (Inspiration: the movie The Mothman Prophecies, and Pathfinder’s Mystery Monsters Revisited) ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "FHrMcQaBG9Uvrznl","flags": {},"type": 0,"text": "The Haunter of Demons’ Island. This stormy little island near Dementlieu was used in the past as a penal colony, but is abandoned now. Visitors will experience many unnerving signs of demonic haunting – shadows, sounds, hooved footprints etc. The phenomena are scary, and intensify with time, but the real danger is mirrors. The moment anyone on the island looks into a mirror, he or she will see the demonic lord’s face peering behind his shoulder, and its horrific sight will drive them immediately, completely insane.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "1vSCNTKmHShmQOUt","flags": {},"type": 0,"text": " Rothbart, the owl-headed wizard, terrorizes this forested domain, helped by his daughter Odil, owls, owlbears and giant ravens. He has affinity for birds and polymorph magics, and among the rest has turned the local princess and her maidens into swans, who can assume their true shape only at night. Many princes tried to save her but failed. He also cursed a beautiful woman to change into a hawk every sunrise, and her lover to change into a wolf every sunset, so that they’ll never meet as humans. Rothbart hates humanity and takes pleasure from causing misery and suffering. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "n8GMyINVEDa7PnU0","flags": {},"type": 0,"text": "Griselda, The Wicked Witch is the classical evil crone: wrinkled face, black dress, tall hat, flies on broomstick, cackles maniacally etc. She only wanted to do good and be helpful, but people always treated her like an evil witch and accused her of everything bad that happened, so she actually became one in return. The villagers of her forested, mountainous little domain fear her and still accuse her of every blight that falls upon them – and now they are often right.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "LEmSFdZCSGVQl99J","flags": {},"type": 0,"text": "Jolly Roger (the original one), also known as the Pirate King, is a skeletal pirate ghost. He rules a large tropic skull-shaped archipelago, used by countless pirates’ captains as their home and operation base. He draws the cruelest pirates from many worlds to his domain, offering them the opportunity to use the mists to raid many worlds and escape back – in return to their souls. When such ships drown, their crew become undead under his control. His curse is never to sail again himself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "SOaJpKjqsI1mcaQ7","flags": {},"type": 0,"text": "The Shogul. The mysterious Shogul are seven powerful entities (or one entity with seven bodies). They are the rulers of a dark Lovecraftian-Chinese domain of ancient cities, pagoda temples, bizarre stone monuments, odd slanted-eyed people and eldritch cults, where everything is done according to ancient traditions. The Shogul look like hooded figures in black or yellow robes, the only parts seen of their bodies are six glowing eyes for each and withered hands. They have the powers of wu-jen, but their true nature is unknown. Any wizard anywhere who knows the secret key of the Shogul, may access their collective minds network and learn their dark secrets and spells. The more he learns, though, the more the Shogul’s influence takes over him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "IowyRD3mTJDOUl4v","flags": {},"type": 0,"text": "Anthony, The God Child. It is not clear how this little pampered boy became nearly omnipotent, but now all the denizens of his small, secluded village domain live in constant fear of him, doing their best to keep him happy and pretend to be happy as well. Those who even think unpleasantly about him… well, better not think of them. (Inspiration: the short Story It’s a Good Life, by Jerome Bixby)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "IPgXhonCJ4jr3ziU","flags": {},"type": 0,"text": "Dumas, The Angel of Death. The domain known as the Valley of the Shadow of Death has been the scene of a great battle, followed by the brutal massacre of all the local population. Now it’s a misty, shadowy wasteland littered in bones, haunted by the ghosts and shades of dead troops and civilians, whose keening of lament and dreadful spectral visions fill the hearts with despair. Only the foolhardiest enter willingly to the valley, tempted by the forsaken treasures allegedly found there. The lord is a memitim psychpomp (see Pathfinder Bestiary 6), who betrayed the souls he was supposed to deliver to the afterlife and left them behind, and now is cursed to dwell forever among them.   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "NaNN2eHvycLgHBeS","flags": {},"type": 0,"text": "Borash, The Demon Bear was an ancient Celtic-like king given to fits of rage, in the course of which he slaughtered his wife, son and brothers. He was cursed to become a terrible dire bear, and has been roaming his country for centuries by now, feared by all and unable to return to his throne. Many warriors and hunters died attempting to slay him, and he seems to be invincible. (Inspiration: Mor’du from the movies Brave and The Legend of Mor’du).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "gJ5zbkW8pHCO2xjW","flags": {},"type": 0,"text": "The Phantom of the Manor was a rich frontier settler who strongly objected his daughter’s wedding to a simple man. An earthquake collapsed his gold mine and killed him before the marriage, but he returned on the wedding day as a phantom, lured the groom to the attic and hanged him. The bride remained alone with in the decaying house, never removing her wedding dress and flowers bouquet, waiting forever for her beloved’s return, singing softly while ghosts and spirits revel around her in eternal party. The laughing phantom haunts the manor, summoning more undead spirits to the house and the nearby ruined town. (Source: Disneyland Paris’ Phantom Manor’s background story. Dread Possibility: the groom somehow became the Phantom Lover, cursed to lure countless women to their doom but never return to his true love)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "DiA53YQuW9zoboDI","flags": {},"type": 0,"text": "Andrew, Lord of the Castle of Horrors. The Castle of Horrors is a huge dark castle the size of a small mountain, with countless rooms, halls, towers, dungeons etc. Virtually any monster, creature, trap or puzzle might be encountered within its walls. Many adventuring parties are drawn to the castle, and might spend weeks inside exploring it without seeing everything (assuming they survive that much). The darklord was a Dungeon Master from earth, who believed Ravenloft to be real, and used to murder his players when their characters died as a sacrifice to the Dark Powers. Now he is a demilich skull in the top of highest tower, waiting for worthy heroes to consume their souls, and fully aware of his strange situation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "QOm9e2XxkdJcfH20","flags": {},"type": 0,"text": "Brutus, the Pig. Huge, obese and filthy, this crude and boorish man nicknamed ‘the Pig’ takes a particular delight in giving offense, violating taboos and defiling anything sacred in the most degrading, repulsing ways imaginable. He works ruthlessly to corrupt and debase his surrounding, scorning any kind of faith, morality and decency. His domain, a stinking, lawless countryside of swamps, farms and criminal dens, is populated by inbred crazy farmers, vicious bandits, cruel slavers and the worst human scum from all over the domains (and beyond). Even the local animals and livestock are twisted and corrupted. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "b65ssfDPKXx0fpsa","flags": {},"type": 0,"text": "Honoria, The Pallid Lady is a mute zombie lord, brought to unlife by her desperate alchemist husband after many failing experiments. Her domain is known as the Mansion of the Dead, a vast and dilapidated mansion set in the middle of a sprawling, crumbling cemetery, shrouded by green-tinged mists and eternal gloom. The Mansion and the dungeons underneath are home for many walking dead, mutants and necromantic experiments. It is a floating pocket domain which may appear temporarily everywhere, and the Pallid Lady is constantly looking for new consorts and servants, and spreading the undead infection. She fully controls the house and can move the walls and chambers at will. (Inspiration: Bottled Imp Games’ The Lords of the Night: Zombies, pgs. 53-56, and Resident Evil game)  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "rf1BMe4LMzGB5acE","flags": {},"type": 0,"text": "Heartless. Evergloom is a darker version of Everglow (from Ponyfinder RPG), a mystical, colorful domain full with magical races, talking and humanoid animals, satires, fairies etc. The good races must fight for their freedom and lives against the forces of shadow and darkness. The darklord, a dark veiled sorcerer/fiend, is known as Heartless, and his wish is to wipe all emotion, happiness and love from the world. (Inspiration: a combination of No-Heart from Care Bears and Quellor from Teddy Ruxpin, in a more mature version, of course)  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "ZvZB2nAldWrTdH9v","flags": {},"type": 0,"text": "Gebbeleth, The Eye Tyrant. The darklord of this Sword & Sorcery domain (think Steve Jackson’s Fighting Fantasy style) is a cruel, genius giant beholder. It rules the ancient, magnificent cities with its nobility of beholder underlings and monstrous minions, though in the wilderness some barbarian tribes still hold to their freedom. The domain has a large share of aberrations, demons and terrifying monsters of all types. It embodies the horror of being oppressed by truly inhuman monsters (See Neil Gaiman’s A Study in Emerald for inspiration on such society).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "NQsIBNLo4bs7Mw66","flags": {},"type": 0,"text": "Khamil, the Shadow King. In the cities and the forests of this perpetually shadowed domain, every shadow is a threat. In addition to the large number of shadow-creatures and shadow-monsters, the Shadow King controls all the natural shadows and may spy throw them and animate them at will. He was once a great emperor, but now he is the power beyond the scenes, pulling the strings of mortal society and conspiring to bring it and the physical world under his absolute control.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "mO99g9ypu9LWAp7D","flags": {},"type": 0,"text": "Shadrakh, The Black Dragon, rules its coastal city and its business harshly but efficiently, ever increasing its wealth and power. It is stuck in human form, to its great dismay, but can send its draconic soul into other people, haunting and killing its victims inside their minds (they alone see the dragon as if it was real, while others around them only see the victims staring and struggling with thin air, though wounds do appear physically on their bodies). Every victim ‘sees’ the dragon somewhat differently, its shape reflecting their inner fears. The people of the domain have no idea that this frightening phenomena has something to do with their charismatic ruler. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "jWgCuoe4HXqZMigT","flags": {},"type": 0,"text": "Ludwig Hecht, The Skeptic. This ex-priest who lost his faith wants magic, miracles and the supernatural to be real, to have a hope for the afterlife; but he is so skeptic that his very presence dispels every magic and nullify any unnatural phenomena, making him angry on his ‘foolish, superstitious’ denizens. He and his men persecute any religious believers and people claiming to have supernatural powers, punishing them severely if they can’t prove their claims under scientific examination (which obviously they can’t in Hecht’s presence).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "CZpSEN8saBFsWRXd","flags": {},"type": 0,"text": "The Gamemaster. All around Ravenloft there are legends about the dreaded gamemaster, about men and women awakening to find themselves in his dungeons, forced to participate in a cruel game of puzzles, choices and traps, putting to test their wits, morality, views and will force. The stoic Gamemaster sees his work as educational, and maybe he is right, for those who survive his games come out changed, scarred in body and mind but with better understanding of themselves. (Inspiration: movies like Saw series, Cube, and Would You Rather)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "3QFLYRFGqBVOwzv3","flags": {},"type": 0,"text": "Lodin, the Siren (- mermaid), has had her heart broken by a human prince, and now lures sailors with her singing to her little iceberg domain, sinking their ships and killing them. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "jXkbJP4XDkU46EGJ","flags": {},"type": 0,"text": "Ordelia, the Perfectionist. This glorious, golden-haired aasimar at her forties (think Nicole Kidman in The Golden Compass) demands perfect order from everyone, in everything, all the time. Everything must be clean, polished and well-trimmed. She has no tolerance whatsoever for poor manners, bad grooming, offensive language, or anything she defines as immorality – including impiety, irreverence, disrespect for elders, use of alcohol, and sexual promiscuity. Any flaw or breaching of the rules result in punishment and ‘correction’, which may include turning the offender into a statue, painting or other piece of art. Ordelia’s domain and manor are truly beautiful and radiant places, but everyone lives at constant fear from her frequent surveys, trying at vain to match her impossible standards of perfection.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "1V27WGK6NtrySxGb","flags": {},"type": 0,"text": "Honeytongue, the Liar Fairy. This mischievous pixie is a masterful liar. She looks like a diminutive beautiful elven girl, 1-foot-tall, with impish smile.  Her lies have incited wars, ruined families and lives, and caused endless strife, which only made her laugh. She has the power to make anyone believe anything she says as long as it’s a (sensible) lie; when she says the truth, however, no one will believe her. She flies around her domain, spying on people invisibly and looking for the best ways to lie them to their doom. The denizens are all suspicious of each other, and accusations of lies and cheating are common, but still they all fall for Honeytongue’s every word.    ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "LYDh9adrHVNzg0Fr","flags": {},"type": 0,"text": "Sabag, the Ghoul Lord. This is truly a domain of dread, with shadowy cities, forests of gnarled, twisted trees, vast creepy graveyards and frequent thunderstorms. The people live in constant dread from the ghouls, ghasts and other undead who reach everywhere through the tunnels crisscrossing the land, and whose attacks seem to be orchestrated to create maximal terror. The demonic-faced Sabag, a serial killer and artist of the grotesque for whom the whole domain is his playground, can assume the shapes of his former victims, and haunts his victims both in their dreams and in reality; many poor souls have awakened from a nightmare in which their bedmate turned out to be the ghoul lord, only to see it coming true.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "FVecIE51VBpThVhP","flags": {},"type": 0,"text": "Rabbi Mendel, the Kabbalist. An aging Jewish rabbi and master kabbalist from Gothic Earth’s Poland of 17th century, Rabbi Mendel came to be despaired at the hopelessly corrupted world. After years of studies and preparations, he tried to perform a ritual to retrieve all creation into nothingness, but found himself instead surrounded by the Mists along with his Jewish shtetl (little town). Convinced he was trapped by the Qlippoth (forces of evil), he delves deeper into the secrets of the kabbalah, searching the mystic formula to end all existence. He almost never comes out of his room, nor letting anyone in, except his golem and other unearthly servants. The Jews in the shtetl try to cope with the hardship of their lives and the occasional dybbuks and bad spirits. Rabbi Mendel is a most powerful kabbalist, who can control reality on basic levels of time and space. With his wild, grey hair and beard and burning eyes, he has an atmosphere of awe around him, and few dare approach his room.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "4OKUB2ADblN58EHt","flags": {},"type": 0,"text": "Zelig, the Shrinker. This twisted gnome hated to be the smallest of all, so he devised a ray that shrank all the people in town to 2-inch size, making him a giant in comparison. Now they are trying to survive in the domain composed of his messy house and surrounding garden, searching for resources, fighting mice and insects, and trying not to fall prey for Zelig’s experiments and abuses. Visitors to the domain will quickly be shrank as well by the crazed gnome, but perhaps they’ll be able to find a cure in his dangerous lab…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "WmgEC4YzJb5Oabwb","flags": {},"type": 0,"text": "Ozymandias, the King of Kings. Compared to this egomaniac, even the other darklords look meek. The dark-skinned, giant of a man known as Ozymandias feels nothing but contempt toward all other beings, utterly convinced that all must obey him. He ruled a huge African-like empire, forcing his subjects to worship him and construct colossal statues in his image, starting a process of apotheosis. But eventually a rebellion has ruined his kingdom. He found himself in a copy of his capital, where he is all-powerful indeed, but he knew at once that nothing of this was real. The people in his domain are just dream stuff, without real consciousness and feelings. Though he tries to pretend otherwise, he knows there is nobody here to truly acknowledge his superiority… unless some outsiders arrive. A ruined, colossal statue of Ozymandias might be found in the Amber Wastes. Reading the writing on it and touching it draws those who did it to his domain, from which one may escape only by realizing that it is just Ozymandias’ dream. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "LQbmrhJaoFcIbXKC","flags": {},"type": 0,"text": "Tash, the Rooster from Hell. Once there was a good hearted farm boy, who wanted to stop the killing and eating of animals by men. He found and performed a druidic ritual intended to give speech ability to all the animals in the area, believing humans won’t kill talking animals. The ritual worked, but some of the animals got more than he intended, becoming twisted, demonic and evil. The evilest and most dangerous was a fierce rooster named Tash, who became a giant, human-sized pyrolisk (a variation of cockatrice whose gaze can burn victims to ash). He led the other animals against the humans, killing them all. Now Tash and his lieutenants (Grogar the ram and Taurus the bull) rules tyrannically over the other talking animals in the farm and surrounding lands and woods – some of which wish humans to return and rescue them, or developing strange religions and rituals. (Inspiration: books like The Book of the Dun Cow, Watership Down, The Wind in the Willows etc.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "jGNbnR9Rv7OPPdlT","flags": {},"type": 0,"text": "The Dreadknight Lord. This vast domain is ruled by the cold, emotionless Dreadknights, an order of heavily armored knights, mercilessly devoted to their unflinching vision of absolute law and order. The Infernal affects all aspects of life in the domain, and all denizens are forced to take part in diabolical rituals, knowing from early age that their souls are bound to hell. Little is known about the leader of the Dreadknights, an awe-inspiring figure in blood-red full plate armor, only that he formerly belonged to the Hellknights in Golarion; some whisper he is no other than Daidian Ruel, the legendary founder of the Hellknights himself, who descended into diabolism in his obsession to rescue his suicide son’s soul from hell. Other says he was the leader of the lost Order of the Blood sect (see Parfinder’s Path of the Hellknight for details). ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "DxnaYvngv6bf3PgK","flags": {},"type": 0,"text": "Blind Paul, the Monk. What greater curse can befall a scholar who lied and murdered in order to get possession of a grand, ancient library, than being struck with blindness, forever unable to read the countless books surrounding him? Blind Paul is now the lord of the floating pocket domain known as the Library of the Mists, rumored to contain all kinds of arcane knowledge. He eagerly waits for visitors to capture and force them read for him, hoping to find a cure to his blindness in some book. Though blind, he is very dangerous, and may darken the library at will and use his sharp hearing and smell senses and monk’s fighting skills to overcome his foes.    ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "xBNVhkCfFXX97Zhr","flags": {},"type": 0,"text": "Horacio, The Silent Bard, is a bard and assassin who loves music and singing as much as he enjoys killing, but now he rules a domain engulfed in perpetual magical silence, where no one can hear you sing… or scream. Unable to sing, at least the silence makes his assassinations in the service of the three noble houses so much easier. The population has adapted to life in the silence, communicating through sign language and writings. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "JR8MhVXdowK5L3Hb","flags": {},"type": 0,"text": "Vor-Tola, The Worm that Walks, was a mad sorcerer who believed worms to be the ultimate life form and the destiny of the world. Now his body is made of thousands of worms, and he is the darklord of a post-apocalyptic domain drawn from a reality where the fabled Age of Worms has come to pass. The remnants of humanity struggle to survive in a ruined wasteland crawling with wormspawn – giant worms, avolakia, ulgurstasta, wormdrakes, sons of Kyuss, other worm-like aberrations and the undead. this domain is part of the Weeping Ruins cluster, composed of several post-apocalyptic domains. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "FheljOxtQTEcLh65","flags": {},"type": 0,"text": "Varus, Herald of the Apocalypse. Cold, indifferent and utterly analytical (think Agent Smith or Albert Wesker), Varus leads a society of scientists, necromancers and arcanists devoted to the Xammux – a group of six alien entities representing forbidden knowledge (see Book of Vile Darkness 3.5). In their quest for knowledge and world dominance they opened a gate to another dimension, summoning an eldritch electrical storm that and animated the dead all around the world, resulting in a zombie apocalypse slaying most of humanity. Varus and his followers reside now in their secret bunker while the storm is still raging outside, and the remaining survivors are fighting against the undead hordes and other eldritch horrors. This is one of the domains in the Weeping Ruins post-apocalyptic cluster. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "Cl03l9p0nW8bUEBv","flags": {},"type": 0,"text": "Ricardo, the Zombie Master. Another post-apocalyptic domain from the Weeping Ruins cluster. Survivors from the zombies’ holocaust are concentrated in this fortified city under the cruel governor Ricardo, a half-Vistani with an innate ability to control the zombies, who feeds them with anyone who fails to obey his whims. The survivors must bend to his rule, knowing his will is the only thing keeping the undead hordes at bay. Recently however some zombies have started developing sentience and break his control, banding into groups and organizing attacks on the city, causing Ricardo much concern. Other local governors might rule similar city-domains in the wastelands of the Weeping Ruins. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "tr6n3bthpSfxxyyU","flags": {},"type": 0,"text": "Jess, the Left Hand of God. Corrupted sheriff in a wild-west styled frontier land, Jess can psionically change people’s perceptions of reality and even of themselves: make them see, hear and feel things that aren’t there, believe they are somebody else, conceive him differently or not at all, etc. He can make a woman believe she’s his wife, or make a father see his children as demons. But Jess is delusional himself, frequently having revelations of angels and demons giving him orders or threatening him. He sees himself as an agent of higher powers, ‘the Left Hand of God’, and uses his powers to twistedly punish those who ‘deserve it’. The domain has a large share of madmen, religious fanatics, criminals and self-proclaimed prophets and messiahs, so trying to figure out the truth may cause one lose his mind.   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "woMwo5fhdgnYCuOM","flags": {},"type": 0,"text": "The Pumpkin King, a pumpkin-headed being ruling a big city where humans masked as monsters and monsters masked as humans mingle under the orange moon in an eternal Halloween night, joy and horror overlap, and everything is possible. (Inspiration: the RPG Worlds Numberless and Strange, pgs. 64-71)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "GtN64kKnse6VZ6ak","flags": {},"type": 0,"text": "The Animal Lord. Grown among the apes and learned to despise humankind, the white man known as the Animal Lord is now the terror of the jungle tribes, using his skills and control on animals to make sure they know who really rules the jungle. He is cursed to lose his speech ability, becoming mute like the animals he loves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "kYIvBZCRMQSDc6U4","flags": {},"type": 0,"text": "The Fear Itself. The sewers of Timor might have been relocated to Paridon, but the city remains, and now it has a new darklord: a 5th rank fihyr (see Quoth the Raven 11, ‘Report on Fihyrs’), manifested from the collective, continual fears of the Timorians. This abomination uses its vast powers and intelligence to increase further the fear level in the city, thus creating even more of its kind. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "KURb7yAH4lJfniuO","flags": {},"type": 0,"text": "The Big Boss is a crime lord who reached the top of the criminals’ hierarchy thanks to his genius and psychokinetic powers, and ruled his metropolis with iron fist. Now his city is secluded from the rest of the world, shrouded in perpetual night, and almost all color was drained from it, leaving the domain in hues of black, gray and white, with only some flashes of bright color here and there. This is a noir/Sin City styled domain of existentialistic despair, where countless criminals, antiheroes, gangs, guilds, mafia families and other fractions fight to achieve dominion, money and meaning. The supernatural is also present in the forms of vampires, succubi and other inhuman beings. The Big Boss, a large, bald man with wrinkled face, is still the most powerful and feared man in the city, but he must struggle to keep his position, and he suffers greatly from the lack of lively colors in his world. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "4W73rMxEMzgxTZO3","flags": {},"type": 0,"text": "Prince John doesn’t look the stuff of a darklord. Sure, this thin, straw-haired, freckled young man is far from being a pleasant person; he is sour, rude, pampered, short-tempered and capricious, but not more so than average princes of his teen age. He is never known to have killed or tortured anyone, and is not even overly debauched. What he embodies is just that – evil that comes not out of acting, but rather out of neglect and lack of caring. Prince John doesn’t care about anyone or anything; the people in his kingdom often suffer from raids, floods, failures of crops and other problems, but even though John can solve them with his magical power to create matter and objects out of nothing, he just doesn’t bother to do so, keeping this power to himself and complaining about how other people are such a nuisance. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "tjvP5dOv3bkPSqOm","flags": {},"type": 0,"text": "Theona Bell, the Monster Huntress. The dreaded baron of this domain seems to be a grotesque nosferatu, brooding in his dark castle and hardly seen in public. The people tale all kinds of horrible things about him. Actually he is just a non-evil man suffering from deforming disease and sensitive to sunlight. So are the other ‘monsters’ haunting the domain – the ‘vampires’, ‘werebeasts’, ‘hags’ and ‘ghosts’, though scary-looking, are all pathetic and harmless creatures, or just diseased humans. That doesn’t stop the real darklord, the venerated monster huntress Theona Bell, of the glorified Bell dynasty, from hunting and killing them mercilessly; though she knows the truth, her hatred to monsters goes beyond reason. She fancies the baron to be her arch-nemesis, but her planes to destroy him always fail. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "TNPvmXVNdNuHRjZg","flags": {},"type": 0,"text": "The Tall Man. Few understand death better than this silent, thoughtful tomb giant (Pathfinder Bestiary 6) death delver (Heroes of Horror), but now he wants to understand human life as well. The people of his gloomy, sparsely populated domain speak fearfully of ‘The Tall Man’, whose shadowy cloaked and hooded figure roams the land, looking for victims to abduct or just watching from afar. Those he abducts he takes to his underground caverns, where he subjects them to incomprehensible psychological and physiological experiments, trying to figure out how human mind and emptions work. He doesn’t look malicious, only curious, but his tests are often horrible experiences. The Tall Man’s height is 4 meters (12 feet), but he has the power to assume semi-corporeal shadowy form and become much, much taller.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "GdGniaNYBxiPM7KS","flags": {},"type": 0,"text": "Hanako, the Yurei. The people in this small Japanese-style domain rightly fear the night, for their land is haunted by yurei (Japanese ghosts), noppera-bo (faceless, corporeal ghosts often masquerading as humans), kuchisake-onna (slit-mouth women who cut your face if you fail to answer their questions properly), and other horrors from Japanese folklore and movies. The darklord is a powerful yurei of a murdered girl, seeking revenge. (Inspiration: J-horror movies like The Ring, The Grudge, The Eye, Dark Water, Shutter, One Missed Call etc.) ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "lxXFQ7xtYvzOMHvI","flags": {},"type": 0,"text": "King of the Underworld. Very little is known about this grim dwarf (if a dwarf he truly is). Presumably he is a Theiwar or Zhakar dwarf from Krynn, who rules an underground kingdom of darkness and strange purple light, and possesses a magical crown with the power to command almost every creature in the underdark. His servants and soldiers are a mishmash of duergars, derro, troglodytes, fomorians, cave giants, kuo-toa and many other underground races and monsters, which sometimes he sends to raid the surface world for his nefarious purposes. He is overly paranoid about his crown, always fearing someone will take it from him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "t98ZWQ63IUsVUUuQ","flags": {},"type": 0,"text": "Papa Santos, the Dealer, is a flamboyant, jovial and heartless dealer and pimp, who keeps the people in his domain at his leash by addicting them to various types of ‘stuff’ only he can supply. Even the most virtuous men and women can be reduced by him to slavering beasts who will do anything to get their next ration of bliss and ecstasy. His domain is a city full with shining casinos, fun houses and drug dens, bright façade hiding dark alleys and terrible corruption. Papa Santos himself has his own inner demons tormenting him, but no amount of stuff can free him from their grasp. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "h3M8qtGsUHRjOUG5","flags": {},"type": 0,"text": "Leo and Rose, The Ghosts of Love, were in life two passionate lovers whose love became dark, possessive and obsessive, leading to their mutual poisoning of each other. Their domain is a truly beautiful landscape of stunning sunsets, shining stars and intoxicating flowers. The people are a beautiful, deeply emotional folk, sensitive and romantically inclined, easily falling deeply in love with each other or with nymphs, dryads and other fairies and spirits of the forests. But romance and tragedy walk hand in hand here, and those love affairs lead too often to suicide, death or other disasters, thanks to the influence of the jealous darklords. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "dwGiz8TKjbpQDp9P","flags": {},"type": 0,"text": "Lovinia, The Ugly Queen. This girl maimed and disfigured other girls in order to be the most beautiful. The Dark Powers made her stunningly beautiful indeed, but the people in her domain are all ugly and horrid to look at, and they have reversed esthetical standards – they see ugliness as beauty and beauty as ugliness, making her utterly disgusting in their eyes as they are in hers. Visitors to the domain will quickly become ugly like the locals until they leave it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "ChtTsY2z0yoe5CEh","flags": {},"type": 0,"text": "Chomolungma, Spirit of the Mountain. This princess was so cold and aloof, seeing herself far superior to all other humans. Now her undying, skeletal spirit lives far indeed above anyone else – on the top of the highest mountain in the world (Everest style), swept by fierce winds of ice and snow, where very few adventurers dare to climb. Legends warn everyone from the wrath of the mad spirit, combined with the natural hazards of the ascent, but also tell about some rare treasure hidden at the top – a most powerful relic, or a gate out of Ravenloft. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "Vj46Um0ISa89lQBO","flags": {},"type": 0,"text": "Taitachak, the Last Winter. Thought that Vorostokov is cold? Apparently you haven’t visited this Lovecraftian-arctic domain of black ice, polar bears, wild Eskimo tribes (some of them cannibals), ancient temples buried under the ice, yetis, orcas, winter wolfs and ancient horrors. In the heart of the domain Taitachak is trapped in the ice, an ancient xixecal (see Epic Level Handbook) who brought an ice age to his world and wishes to expand it further. His evil thoughts and dreams affects the domain and its denizens.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "OJMj9RkAjXrLNJWb","flags": {},"type": 0,"text": "Archbishop Lacosta, the Hypocrite. Lacosta is a lecherous, disgusting spidery old man. He holds the reigns of both religious and political power, preaching publically about piety and virtue while hardly trying to conceal his lustful and greedy behavior. By doing so he makes people lose their faith in the church, gods and human virtue, pushing them to corruption as well. His ability to cast priestly spells and create miracles for his benefit only helps to convince the populace that the gods themselves must be hypocrites as he is. Shortly put, he embodies the worse of organized religion, using faith and the gods as a thin plaster to further his basic urges. He suffers from ugly skin disease no prayer can cure, though.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "Bf8isSlxcj7XyY2Y","flags": {},"type": 0,"text": "The Minotaur. Many years ago, people of this city used to sacrifice young men and women to the terrible minotaur who dwelled in the labyrinth beneath them. The minotaur was slain, but his spirit lives on, looking for a proper vessel. When someone in the city gives in to strong anger or acts violently, sometimes the darklord might possess him, transforming him into a monstrous, demonic-looking minotaur with half-skeletal head. Sound of alarm horns will be heard then in the city, and the labyrinth itself will manifest all over it, superimposing itself on the houses and streets. Then the minotaur will go on a hunting spree.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "dSSTNbqXuN3lFhgr","flags": {},"type": 0,"text": "Shimdon, the Imp. Every man, woman and child in this domain have an imp as familiar. The imp appears near birth, telepathically bonding with his patron and becoming his or her closest friend, assistant and advisor. The imps assume any small shape desirable by their patrons (cherubs, fairies, small animals etc.), give them information and perform errands and little magic for them. Thanks to the imps’ help and advices, the domain have advanced significantly… but so have corruption. The imps coordinately manipulate the individuals and society into depravity, slowly but surely. The darklord Shimdon is the ruler of all the imps and the personal imp of the governor, pulling deviously all the strings from his position.   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "nf0v7NtL3TtSDJn7","flags": {},"type": 0,"text": "Anabubali, Mother of Dinosaurs. A powerful witch-doctor, Anabubali created dinosaurs on her prehistoric homeworld by using foul magic to defile reptilian eggs, making herself an army of monsters. She ruled her world tyrannically until a meteor strike directed by her rivals destroyed her kingdom and creations. Her domain is known now as the Isle of Monsters, full with dinosaurs, giant insects and other monstrous abominations. Anabubali is a blackened lich, covering her skeletal frame with black robes and heavy ritualistic mask and headdress, her voice a chilling raspy whisper. She rules a city of tailed humanoids, worshipped as bloodthirsty goddess and rarely leaves her temple. Though cunning and powerful, she has a primitive mindset, superstitious and pagan. Visitors from more advanced lands make her jealous and suspicious, envying the sophistication beyond her reach.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "j93vHLO7Mr8TQrZC","flags": {},"type": 0,"text": "Kiran Darkstorm, the Storm Bringer. Kiran was born on a particularly stormy night and abandoned as a baby from unknown reasons. He was found and raised by an order of mystic monks, and his soul was stormy as well, always in turmoil, trying to figure his place in the world. He found he can actually call down winds and lightning when in emotional state, sometimes unintentionally. Kiran became a wandering hero, but tragedy seemed to follow him; unknowingly he killed his father and married his sister, becoming the Lord of the exotically beautiful Dusk Islands. Upon discovering the truth, he killed her and their children in a burst of emotions manifesting as lightning bolts – followed by a raging hurricane that laid waste to the city. Kiran is a strikingly handsome man, with athletic body, shoulder length blond-white hair and grey eyes; many women seek his company, but his tortured soul and turbulent passions make him a very dangerous man to get emotional with.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "vCB9c7oPgumn6lPL","flags": {},"type": 0,"text": "The Mimic. This super-dangerous domain looks like an abandoned town, but actually is full with mimics of all sizes and shapes, including house hunters (giant mimics disguised as whole buildings), and animators of every rank. Every object or structure might turn out to be a deadly killer. The darklord is a mimic who tried to ascend into human shape and failed, becoming a huge shifting mass of tendrils and melting human visages (see Pathfinder’s Dungeons Denizens Revisited).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "v3qFqmAUGpA5ItdX","flags": {},"type": 0,"text": "The Storyteller. The Black Forest in this domain is the home of the dark and twisted Grimm’s fairy tales (and others), where one may encounter a vampire Little-Red-Riding-hood, seven evil dwarves, undead Rapunzel, children-eating witch in a house of candy, petty kings and queens, giants and so on. The denizens all know and respect the Storyteller, a kind old hermit who lives with his talking dog and seems to know the stories of all the denizens of the domain. Little they suspect that he is the one who brought all those horrors to life with his stories, and whatever he tells becomes true. (Inspiration: Grimm RPG and The Storyteller TV show)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "NTrvsLF4shBuO6SX","flags": {},"type": 0,"text": "Sir Hugo, The One-Woman Man. This black-hearted, bass-voiced nobleman led a life of debauchery, until a meeting with a beautiful vampiress changed him into a vorlog. Now he is constantly looking for a surrogate to his dead vampire lover. Unfortunately for him, all the denizens in his domain are perfect doubles of this maiden; even newcomers (regardless of their sex, age and race) are transformed overnight to look exactly like her. The sight of his lover’s face everywhere drives the vorlog mad, and he tries hopelessly to find out which one is his ‘real’ lover. He replaces his surrogates often, convinced every time that this time it’s the real one, but eventually gets frustrated and murders them viciously.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "a7jRFDZvyyzw38aF","flags": {},"type": 0,"text": "The Illusionist. One can never know what is real and what is not in this domain. Any person, animal, object or structure might be an illusion, temporal or permanent, harmless or dangerous, and not exist at all or be different from how it seems. It is all the handiwork of the mysterious Illusionist, but very little is known about this enigmatic figure: is it a man? A woman? Is it human at all? What are his goals? How can the truth be found under so many layers of illusions? ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "9MhyhVAVCWumykbF","flags": {},"type": 0,"text": "Dom, the Jailor. The muscular body of this bald, hulking half-ogre is all covered in scars and tattoos over his grey skin. Born and raised in one of the worst prisons imaginable, Dom has never set foot in the outside world for single a day in his life. Thanks to his exceptional strength and cunning, he became the head of the prisoners, eventually leading them in a bloody riot against the jailors. But when he finished exacting his terrible revenge and was about to finally step out of the prison, he found the Mists surrounding it. Now the prison is his domain. He is both curious about the outside world and tortured by dreams about it. The Mists keep bringing him new prisoners, some are vile criminals and others truly innocent. Dom doesn’t care; he does his best to make their imprisonment a living hell, with the help of his sadistic underlings. If he can’t be free, nobody will. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "SOmLTMdxx0xU1r39","flags": {},"type": 0,"text": "Nikolai the Terrible, the Tsar. With his mane of gray hair, long drooping moustache and feral looks, Tsar Nikolai Ivanovich is an impressive and frightening figure to behold. He rules over a large Russian-styled domain, where humans and fairy folk from Slavic lore once lived together in happiness. But when Nikolai came to power, not only he became a cruel tyrant for mankind, he started persecuting and destroying all the magical and mystical creatures as well. As a result, his kingdom became a cold and dark land, devoid of joy. Many magical beings are still hiding in the woods, and Nikolai’s campaign against them is going on. He is not above recruiting the darkest of those beings to his side as an assistance against their brethren. Nobody knows for sure what motivates his hatred, but it seems it has something to do with an early age encounter he had with Baba Yaga. Some speculate he is some unnatural being himself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "LdcRv6ToFRUq5ZFp","flags": {},"type": 0,"text": "Maia, the Amazon, is a beautiful red haired warrior woman who hates men with all her heart, the result of all she suffered from their hands. Her domain is a women-only island, and women from all over the domains are drawn to it, where they are trained to be powerful warriors, able to defend and avenge themselves. They are also indoctrinated to see all men as inherently evil and despise them. Every man setting foot on the island is killed, tortured or transformed by Maia’s power into predatory animal under her control (reflecting how she sees them). But for all her efforts to make her domain a safe haven for women, Maia is cursed to see it falling time after time before men invaders – pirates, bandits, troops, agents of other darklords etc. – who always manage to defeat the amazons in spite of all their training, and kill or enslave them. In the wake of each such invasion Maia is left alone, determined to make her disciples stronger next time – and her hatred burns even hotter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "RGZOHqu5HU1j719o","flags": {},"type": 0,"text": "Doriath the Dark is a stunningly handsome half elf, with midnight black hair, golden hypnotic eyes, and white skin covered with many runes and strange symbols. Doriath always believed a great destiny awaits him, and was willing to go to any length to find it. During the hundreds years of his life, he has studied and worshipped countless evil gods and deities, archdevils and demon lords, reaching quickly to the highest ranks and then moving on when he wasn’t satisfied by the results. He learned the darkest secrets, performed the darkest rituals, and achieved countless boons and banes. He seems to be able to look into the darkest pits of the abyss or hell without losing his calm. Now he leads a huge university devoted to the practical studies of everything dark, and the population around supplies everything the students need. Doriath is convinced now that the Dark Powers hold the key to his destiny, but no matter how much he learns and tries, it still seems to be beyond his reach. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "mCqzKRd6Hmu6Rhsx","flags": {},"type": 0,"text": "Sebastian, the False God. Those islands look like a tropic paradise populated by happy, friendly tribes – until one finds out that the greatest desire of the local people is to be eaten by the White Gods, who live in the Jungle! They strive to keep their bodies in perfect health and shape, to be tastiest as possible for the gods. The ‘gods’ are actually Sebastian and his friends – normal sailors who came to the newly discovered islands, pretended to be gods, made a show of power and convinced the awestruck locals to care for all their needs while they live debauchedly in the luxurious villa they built. But when the Mists came, the ‘gods’ found that they have indeed became godlike – invulnerable, powerful and beautiful – but now they must eat human flesh to survive. The locals became all too eager to donate their own flesh, but it pushed Sebastian and his fellows to the edge of madness. Some of them believe now they are actually gods.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "Y7zGpP4L5GT3QVWL","flags": {},"type": 0,"text": "Yorak, the Barbarian. Several savage barbarian tribes are constantly fighting and raiding each other in this chaotic evil domain, each trying to exceed the others in atrocities and cruelty. The domain embodies the horror of pre-civilization society without any semblance of morality or order, where compassion is seen as weakness and brutality is equated with strength. Yorak is the leader of the strongest tribe. He relishes destruction and death, eating the hearts of his foes and making drinking cups from their skulls. Every day he passes without a killing he loses some of his mental attributes and becoming stronger in physical attributes, gradually transforming into an ogre-like monstrosity (like the curse of the Sword of Arak from Realm of Terror). Sometimes he does so intentionally before great battles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "3PzutLHWAqzJD8mi","flags": {},"type": 0,"text": "Sheila, the Wight Queen. The queen of this truly dreadful domain and her court are true were-wights, capable to shapeshift at will from living humans to hideous wights, gaining the advantages of both mortals and the undead (some are were-ghouls, were-vampires, etc.). Many people in the domain are infected were-wights, living most of the time as regular humans but transforming into evil dead when triggered (their undead aspect has all their memories and intelligence, and might resume illusory mortal shape for short time, adding confusion. Think Evil Dead). Queen Sheila is a decadent hedonist, making the most of both of her shapes and savoring the shock and horror of her victims while she devours their souls (take some inspiration from Pathfinder’s Urgathoa, Inner Sea Gods). In this domain, normalcy is an illusion which might be ripped at any moment, revealing a horrific undead reality.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "olNT2bCwVKUIsUbq"}
