{"name": "Diseases","description": "One hundred horrible diseases that your players HOPEFULLY don't catch!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "hg0BAfbGws1EJk2y","flags": {},"type": 0,"text": "Red Rot – A disease that is contracted by direct contact with a red ooze. The ooze attaches itself to the skin of the person and slowly rots the flesh away at the point of contact. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "YUtKbRc8FUN1FHIV","flags": {},"type": 0,"text": "Gambling Addiction – Will save or compelled to gamble when presented with opportunity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "bMMqUtxcjXtpPIE7","flags": {},"type": 0,"text": "The Screaming Sickness – The victim moans and screams in their sleep, making it hard for those sleeping near the victim to get a good night’s rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "tuZsqZQAIQrLibTL","flags": {},"type": 0,"text": "Slate Fever – An uncommon sickness that causes skin to become hard and brittle. Originating from the underdark and eventually making its way to the surface, Slate Fever propagates through contact with mosses and fungi contaminated with the disease, as well as through contact with the affected skin of those with the sickness. Early symptoms include a slight grey discoloration of skin tone, uncomfortable stiffness, and unusual amounts of neck and back cracking when moving. The symptoms eventually progress to the point where the diseased becomes noticeably grey and stiff, causing them to move in small, jerk-like motions and have their speed reduced by half. In addition, the diseased develops exceptionally brittle skin that cracks easily and painfully. This gives them vulnerability to bludgeoning damage and causes them to frequently make Constitution saving throws to avoid taking 1d4 damage from shattering parts of their skin with excessive contact. The disease itself usually passes by itself over the course of one week resting and recuperating, but can be cured within 2 days if the diseased is properly treated with a combination of various tree saps. Catching this disease once results in the diseased being more vulnerable to it in the future.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "gSTsmm3b2sAOdE2N","flags": {},"type": 0,"text": "Spectre’s Decay – The victim’s soul and body separate but continue to move in unison. Without a soul the body rapidly degenerates and decays over the course of a year, however wherever the flesh forms holes or rips the ghost of the person continues to stand. This continues until the body has completely decomposed and the ghost is left to wander the earth, unable to pass into an afterlife. This disease can rarely be contracted through contact with undead who have lingering souls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "ZdHshjOX5UZ3OPmX","flags": {},"type": 0,"text": "Summoning Sickness – Due to a teleportation spell gone wrong, your stomach and head are all turned around. Disadvantage on ability checks and saving throws until all your parts manage to realign properly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "Q5Y22a3xTONQrZAc","flags": {},"type": 0,"text": "Casters Cough – Due to a nasty infection having spent too much time in a component pouch, you have a nasty magical cough. Whenever you cast a spell there is a 25 percent chance that you must roll on the Wild Surge Table.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "yiId0bC0zGt5ftvY","flags": {},"type": 0,"text": "Goblinitis – every hour you have a 50% chance of alternating between your normal form and that of a goblin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "AJlsAB2hSJIqpF58","flags": {},"type": 0,"text": "Hydrophobia – you are afraid of any body of water larger than a small puddle. Disadvantage on ability checks when in or on water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "xE88PS3gGn29kfut","flags": {},"type": 0,"text": "Begger’s Pox – weeping sores break out over your face, making you hard to look upon. Disadvantage in charisma checks without some form of face covering.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "xnu0cPSrKVjIp7MK","flags": {},"type": 0,"text": "Drunken Fool – slurred speech and perpetual dizziness make you appear drunk, disadvantage on acrobatics checks and charisma checks unless engaged with someone drinking alcohol.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "qdAM4I4CpotAZQDc","flags": {},"type": 0,"text": "Sewer Rat Flu – When bitten by a sewer rat, the effect is just like the regular flu, but 3 times worse. PC vomits through out most of the day. To determine when PC vomits, roll a percentile die every 30 minutes in game, If even then vomit, if odd, nothing happens. Vomiting will force the PC to stop what ever action they are doing, and breaks concentration. Vomiting every 3rd time will also cough up blood. Roll 1d4 to calculate damage. The cure is to drink very hard alcohol, and let it dissolve the stomach acid poison. Another option is to survive 10 hours. A lesser restoration spell automatically cures it. Orcs, Half-orcs, and Drow are immune to this.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "hoXSLXe5R3R974wW","flags": {},"type": 0,"text": "Transmutation Overload – this can happen if multiple transmutation spells occur on the same time on the same subject or subjects. it deforms the subject to something in the middle of all of them, but also makes the sick immune to transmutation spells, no more room for magic on this body! (based on the wonderful manga dorohedoro)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "Cco9lKJ7pgvP4mH2","flags": {},"type": 0,"text": "Magical Discord – You begin to lose connection to the forces of magic. Each day your spellcasting ability drops by 1 point until you’re cured.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "iG0EZitC0qITbqGM","flags": {},"type": 0,"text": "Vorel’s Phage – Disease starts by imposing one Exhaustion level on the affected creature, in which small patches of bumps errupt on the inflicted creature’s skin and the joints swell painfully. After an incubation period of 1d4-1 nights, the creature gains another level of Exhaustion and the bumps become raised and fungal looking. On the firstboccurance of a new moon after the incubation period, the infected creature gains 2 more Exhaustion levels. If this kills the creature, it rises again after 1d4-1 nights as a wight. If a blood moon occurs at any point after incubation, the creature instead just succeed in a DC 15 Constitution saving throw or die immediately, raising in a minute as a wight. Exhaustion levels gained by this disease reappear every morning and only a miracle, wish or some other similar magic can permanently remove them without curing the disease.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "69sMZht4ovtCJVrS","flags": {},"type": 0,"text": "Swordbearer’s Bane – The disease is contracted by contact with an infected creature’s blood. After the incubation period of 1d4 days, the hands and feet of the infected creature begin to swell and become tender. This causes the creature to lose 5ft of movement and imposes disadvantage on Dexterity (Slight of hand) checks. After another 7-1d4 days, the infection causes the hosts extremities to go numb. The infected creature’s movement speed is halved and the creature is treated as if it were under the effect of a Bane spell until it is cured.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "NAE2LiECfakyFYDx","flags": {},"type": 0,"text": "The Turquoise Death – This disease is contracted by contact with a creatures bodily fluids, and the disease remains infectious weeks after the fluid has evaporated, but only if rehydrated. After the initial 1d3 day incubation period the infected will start to notice heart palpitations, and will note slow recovery rates. The infected creature can no longer remove levels of exhaustion, and failed death saving throws permanently reduce the number of death saving throws the creature can fail in the future before death occurs. Both effects are permanent after the creature has gone without treatment for more than a month.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "XDePXOGraVqg8o32","flags": {},"type": 0,"text": "Hippogryff Hives – A an itchy rash that makes it unbearable to wear armor or heavy clothing until it’s treated. Highly contagious via skin to skin contact.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "HJ82i1IHyKQxkvMS","flags": {},"type": 0,"text": "Tapeworm – Unnoticeable for the first month, for three months after must eat twice as much as normal each day. After three months, receives a penalty to constitution as you can no longer extract enough nutrients before the parasite consumes the food.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "eroQMGAOMokncGSi","flags": {},"type": 0,"text": "Monstrous Tapeworm – As above, but after six months, it eats it way out of the stomache, kills, then finally consumes the host. Treatment is recommended before that happens.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "PuoQ4mxflOc7zrE9","flags": {},"type": 0,"text": "Brain Fever – caught from proximity to Underdark denizens. Causes paranoia (disadvantage on Charisma checks due to distrustfulness)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "2n9az4NksbJ643OI","flags": {},"type": 0,"text": "Carrion Fever – Causes migraines and an intense craving of raw meat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "88nWLxufEJcwcw72","flags": {},"type": 0,"text": "Acidblight – Slowly causes blood and other bodily fluids to become more and more corrosive, dealing acid damage slowly over time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "NchdNfvb2kbPOWB6","flags": {},"type": 0,"text": "The Yellow Plague – Pus and bile ooze from the afflicted’s pores. They gain a level of fatigue every day it is untreated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "ZM2b6SpxFnbMZIgS","flags": {},"type": 0,"text": "Ser Avidore’s Fire – Magical multi-colored rashing of the skin. Can sometimes flare up and deal a type of magical damage to those afflicted. Common among magic users.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "PUN0mwljUimEgrUc","flags": {},"type": 0,"text": "Cobblestone Sickness – After a bite from a cockatrice, the body will slowly turn to stone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "56YLtEMgWD7nUiCR","flags": {},"type": 0,"text": "Two-Left-Feet Syndrome – Any kind of saving throw is disadvantaged as well as -4 for any number for any roll.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "zVvUilRcYljjbI4M","flags": {},"type": 0,"text": "The Common Cold – Just a cold. You’ll cough and sneeze, but that’s about it","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "nvIlwjGsMfkBT8Wq","flags": {},"type": 0,"text": "Conjurer’s Mania – A mental illness that worsens over time. The afflicted believes that they are able to create life, and seeks out new ways to do so. Becomes obsessed with anything that they have ‘created.’ If the afflicted has no means for creating life, magically or otherwise, they may start to irrationally believe that inanimate objects are their living creations. May start believing other ‘summoners’ creations’ are their own creations that have been stolen. May eventually progress to compulsion to steal newborn animals, monsters, or humanoids, or become unstable when seeing another magic user summoning a creature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "7GmnR4KBUYlDkHFn","flags": {},"type": 0,"text": "Third Eye Blind – Unable to communicate telepathically, but also unable to be targeted telepathically and is unaffected by any method that would not work on a creature without an intelligence. Recalling images from memory become hazy and unreliable. Penalties to any checks to recall visual information from memory. This disease tends to present itself in those who have been the target of many unwanted telepathic intrusions. Some humanoids are hereditarily predisposed to this disease, and may be afflicted upon after their first telepathic intrusion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "RNuks1UhL3eG31n2","flags": {},"type": 0,"text": "Desert Fever – Skin takes on a red tinge, fever & bouts of cold sweat. Treat unusually warm or cold weather as hazardous temperatures. Often a physical ailment caused by interacting with malicious djinn magic. May be transmitted orally.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "xIwgzPqLLvKpplzJ","flags": {},"type": 0,"text": "Displacer’s Malalignment – Appears to be the common cold, but is actually a disease that can be deadly for magic users & planar travelers. Afflicted must make a check to succeed any teleportation spell or ability. On a failed check, will move the afflicted 1d6ft in a random direction. Afflicted may be damaged or killed if teleported into a solid object. (If playing DnD, use the Teleportation spell’s Mishap rules) This disease often causes magic users to be incredibly wary of those presenting symptoms of the common cold. Spread through ingesting of bodily fluids, most commonly from the sneezes or runny nose of the afflicted.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "XSjUSJBuU0hJBD4M","flags": {},"type": 0,"text": "Woodland Mania – Afflicted believes to have gained the ability to speak with animals. The animals that they believe they are talking to may or may not exist, and all conversations tend to cause paranoia. Spread through bites, may be transmitted by animals.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "JGbP3LYLxZ7w7seW","flags": {},"type": 0,"text": "Other-Otherworldy Whispers – A mental illness that causes the afflicted to believe that they are receiving knowledge from another dimension. In truth, the advice & knowledge that they get are delusional. The Afflicted tends to become a know-it-all, and the whispers encourage & bolster their cockiness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "KTQIuy6xS3yRWTIY","flags": {},"type": 0,"text": "Slippery sickness – Your skin constantly oozes a greasy fluid. Without shoes, you’re liable to trip. Without gloves, you’re liable to drop objects. The upside is that monsters will have a hard time grabbing your skin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "PNMfsNIm6YJpOSYu","flags": {},"type": 0,"text": "Brilliant Urine Disease – You get dehydrated twice as quickly as usual, and your urine glows neon yellow, brightly enough that a pint glass of it could substitute for a torch. Spread through pollen in heavy forests, this disease is the bane of scouts, spies, and hunters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "0ekh4kaZ3ZGEEMWn","flags": {},"type": 0,"text": "Wild Stench – You give off an odor that is undetectable to humans and many other humanoid species like dwarves and orcs, but can be smelled by most mammals, fish, and insects from far away. They find it highly offensive and will flee from it. Only the bravest scent hounds can be convinced to track such a scent. It is rumored that wild stench is the partly successful result of a magical experiment to keep crops safe from wild animals. Curiously, dragons find it pleasant and may ask where you got that enchanting perfume.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "z9n1hGclOMQmz4vr","flags": {},"type": 0,"text": "Beard Agnosia – You lose the ability to recognize a beard. You have great difficulty recalling or describing a beard, or noticing that somebody has grown or shaved a beard. In advanced cases, sufferers of beard agnosia can be looking at themselves in the mirror and be unable to tell whether they just shaved off their beard or they’ve gone a month without shaving it. Fortunately, this disease is less common in men than women. Unfortunately, it is more common in dwarves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "LCTFYjFcUPKBICec","flags": {},"type": 0,"text": "Puffs – Fungi based parasite. Creature becomes infected after inhaling airborne spores. First sign of symptoms appears to be nothing more than mild acne. Soon, several of the ‘zits’ begin to grow larger. Not unnaturally large for such blemishes. Finally, a single ‘puff’ quickly grows to the size of a grape and bursts into a small cloud of spores that quickly spread in a breeze, infecting those around the host, as well as leaving a large ‘pockmark’ in it’s place. The fungus, while growing inside the host, causes ever growing feelings of loss and loneliness, pushing the host to seek out more and more companionship. If the fungus is allowed to reach fruition and spore, the sense of loneliness transitions into a permanent and inconsolable state of depression.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "qBydDREDh5KsmweW","flags": {},"type": 0,"text": "Tiny Devil – when having an unprotected sexual intercourse with dwarfes you have a 35% possibility of getting this disease. Tieflings and succubusses are immune to this disease. Dwarfes do not suffer the effects of this disease but can infect other humanoids. If you have the Tiny Devil, your skin becomes very dry and making Athletics checks, Acrobatics checks and Dex sabing throws gives you 1d4 slashing damage(little wounds forms on your limbs, they can be cured only by magic). If you are a male, your ding ding dong burns very bad(no damage suffered unless you have sex. If so you take 1d4 fire damage per minute). To get rid of this disease: female: this disease will go away in 1d12 months. male: you need to cut your THING of infect 4d10 humanoids with this disease.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "R0Gur7iPrKMcMmt9","flags": {},"type": 0,"text": "Death Luck – if you fail a saving throw with a 1 you have 10% chance of getting this disease(1d100, from 90-100). While you are infected you produce one Wild Magic effect every 2d12 hours and your skin hardenes(you have disadvantage on Dex checks aka all skills that count on dexterity and all saving throws but you gain +1 to your AC). This disease is contagious and can be transmitted through touch. It can be cured with 25 days of resting doing nothing but eating, drinking(alcohol might help) and sleeping.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "rqvQnenxn4idBJLN","flags": {},"type": 0,"text": "The Dreaded Mallergy – Few have survived the infliction of this fabled contagion. Not much is understood about the Mallergy, but patients are struck with a deep sense of dread as they become bedridden and sweat constantly. 48 hours after the disease has set in they can no longer move. If they do not fight off the infection they succumb to asphyxiation and perish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "P6SkoWq3Q67ITKLc","flags": {},"type": 0,"text": "The Wariness – PCs develop this disease though interactions/attacks from psychic creatures. All insight checks result in the PC believing that others are lying to or trying to harm them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "VpWZgNp2IcGIzmlc","flags": {},"type": 0,"text": "The Illusionary Insomnia – The first symptom is an inability to sleep through non magical means. After 2 days the patient begins to hallucinate. After three days these hallucinations begin to manifest as magical illusions. As the patient nears a week without sleep, the illusions become more physical as their mental state deteriorates. The user finally falling asleep through magical means is the only known cure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "aLCRKO7YGyc0EgFq","flags": {},"type": 0,"text": "Marked Blood – After swimming in any sort of sewage, under a city or in a refuse dump, microscopic creatures have sublimated into your blood stream. They lie dormant until you move to a different sewage system. Once there you have to succeed in DC x wisdom saving throw or you use your action to slash yourself till your blood pours out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "dfhOcYFkBvZg44hS","flags": {},"type": 0,"text": "Wraith Eyes – The person goes blind for random d20 periods of d10 minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "OTrnhSLRnCf6ujug","flags": {},"type": 0,"text": "Necrotic Blight – The disease causes double the amount of necrotic damage to be dealt to this infected person.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "j1vEjJMKS667NXam","flags": {},"type": 0,"text": "Happy Cancer – This disease causes people to slowly die over a d20 period of days. At the end the infected is over joyed with the sweet release of death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "EoZIiBedN9sdLQXo","flags": {},"type": 0,"text": "Ogre Poisoning – Turns the infected humanoid into a Ogre after d20 days of being infected without treatment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "gIO4sjAA8bloaYxh","flags": {},"type": 0,"text": "Winter Insomnia – When the temperature around the infected person drops below fifty degrees, the person will pass out and won’t awake until the temperature increases.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "Ivk78AAEjav5NE8V","flags": {},"type": 0,"text": "Hostile Cough – When someone infected coughs on another humanoid who isn’t infected that person becomes hostile toward the person who coughed on them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "XqVoJthLbyvb8bkj","flags": {},"type": 0,"text": "Soft Bones – The player’s AC drops two points until cured.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "AGbgh76xRUjQNm4j","flags": {},"type": 0,"text": "Golden Tumor – The tumor starts as a small gold tumor then advances to the rest of the body. Once the disease has ran its course the subjects body is completely made of gold. Bet you didn’t known were gold coins came from.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "cewX9R6G5GPrS3BK","flags": {},"type": 0,"text": "Swamp Rage – Pissed off about swamp people.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "bAB8VIqucR7SjzCr","flags": {},"type": 0,"text": "Beer Depression – When the infected person drinks more than 2d6 cups of beer they become depressed for 4d4 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "g2YTYprFW7nyabp6","flags": {},"type": 0,"text": "Demon Ears – This person can only hear what demons tell it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "kSZU85v8wXZ0A3bf","flags": {},"type": 0,"text": "Zombie Delirium – Becomes Delirious about the undead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "nESKhxdjl8f2obEY","flags": {},"type": 0,"text": "Rabbit Panic – This person can’t eat rabbit without being panicked for 2d8 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "oR6E3TLolcfbCBVC","flags": {},"type": 0,"text": "Hemophilia – double bleed damage","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "IDFXAb1As6jA91UN","flags": {},"type": 0,"text": "Tetanus – disadvantage on dex throws after 1 day, total paralysis after 4 days, death check every day after the 7th day","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "0hK2EXEERKRqEBHv","flags": {},"type": 0,"text": "Creeping cough – disadvantage on infiltration throws","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "2yWWicXV8C7PUdnW","flags": {},"type": 0,"text": "Spasm of The Entrails – the PC cannot regenerate health by eating and resting, can be caught when fighting against animal abominations","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "aih5k7eYmX3UEBuG","flags": {},"type": 0,"text": "Skin Rose – a red mark that slowly spread around a wound like a flower, after 2 weeks spawns little parasites that will drain the PC of his energy (disadvantage on CON throws). the pattern has to be burned deeply to kill the parasites. Take care of your handsome heroes","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "8QOxDG48mweIYEvM","flags": {},"type": 0,"text": "Leprosis – the PC’s skin start to slowly deteriorate and wounds don’t cicatrize anymore, the PC also becomes slowly immune to physical pain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "il4zNReeJRm3rGoD","flags": {},"type": 0,"text": "Narcoleprosy – Your limbs and digits have an extreme tendency to fall asleep in relaxing conditions. If left untreated, your arms, legs, fingers, and toes can become shortened and deformed, as cartilage is absorbed into the body.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "xxVRdUgvf5fXVf24","flags": {},"type": 0,"text": "Humanoid Immunodeficiency Virus – The diseased person suffers general flu-like symptoms (runny nose, coughing, aches in joints) for a few days that eventually pass. The true danger of this disease comes later. If the underlying virus is left untreated, the affected’s immune system degrades tremendously, temporarily losing one ability point in Constitution each month until the disease is treated, gaining all lost Constitution back on the next long rest. If left untreated, the affected will also suffer a permanent level of exhaustion every 6 months that does not go away even after the disease is treated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "QBldNsu2RDQzRcbU","flags": {},"type": 0,"text": "Arboreal Petrification, or The Dryad’s Rot – They say to slay a dryad is bad luck. But killing a dryad who is ill or favored by the gods will surely inflict this disease should any of her sap touch your skin. First, blindness and deafness slowly takes you, soon followed by sluggishness and fatigue. Then, your body begins to painfully turn, inside out, into the hard, coarse bark of an old dying tree. Your body rejects food, so you begin to starve. You require ten times the amount of water you normally do, or you will die of thirst. Your limbs become too heavy to move and your skin takes the flaky, layered appearance of wood chips. Your throat will eventually become thick and you will die of asphyxiation, and finally your body will be grown over with bark, and you will become a misshapen pile of vile sap and wood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "Rpy1mfDaXK0jYPOa","flags": {},"type": 0,"text": "Hairasite – Many of the entities hairs have been replaced by long, light worms, latching on to the victim’s scalp. Disadvantage on all charisma checks until the victim takes fire damage or is magically healed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "1NuGdf8n1gfjO8JV","flags": {},"type": 0,"text": "Involuntary Mirror Touch Synthesia – Whenever the victim sees someone take damage, they take 1d4 psychic damage. If the victim is the one attacking, they take an additional 1d4+1","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "c7VwPnoQUCYpbset","flags": {},"type": 0,"text": "Chronic Shrinking – A possible effect of transmutation magic gone wrong. The victim shrinks to one half their previous height every week until cured. This disease is contagious if anyone is near the victim for an extended period of time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "ntASLWw0M13E28xy","flags": {},"type": 0,"text": "Grave Grub – In infection given from maggots that have grown inside an undead creature that were transferred to a living humanoid during some close-quarters encounter. Causes the infected to make a DC 15 Constitution saving throw, on a failure the infected’s movement is reduced by half, their Constitution & Charisma score lower by 1 point and and they get Disadvantage on Persuasion checks due to visible greenish rot growing out of their ears, mouth, nostrils, and eye sockets. Every midnight they can make another Constitution saving throw, if they fail 3 in a row the humanoid suffers the effects permanently.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "v9E9gEEbBbtP06Hm","flags": {},"type": 0,"text": "Magic Allergy – You experience a mild allergic reaction to prolonged exposure to anything even slightly magical. ‘Oh is that an achoo everburning torch? achoo!’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "19QNYE7qGA1yO43C","flags": {},"type": 0,"text": "Cheatersbane – you vomit vigorously when attempting sexual contact. May be made to explicitly allow intimacy with one particular person. Intended for suspicious spouses, but accidentally found a cult following among emetophiles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "rFpm2hsAzlUXWdue","flags": {},"type": 0,"text": "Noblewind – you fart uncontrollably, but it smells sweet. Everybody notices.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "zy1IucY8ugYQkZNY","flags": {},"type": 0,"text": "Polychromia – each of your eyes view the world as if through a randomly-colored sheet of glass. Every day, the colors change.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "aCAyLyTr2cJ7iNyT","flags": {},"type": 0,"text": "Bard’s Revenge – your ears constantly hear a repeating brief tune.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "ZyYxp87ATPPh3KQG","flags": {},"type": 0,"text": "The Twisted Tongue – The patient begins to swear and insult others by chance. They can’t controll it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "NwqdOd5SbFdzOclp","flags": {},"type": 0,"text": "The Paralyzed Tongue – The patient is not able to move his tongue while talking. Very often they let their tongue stick out to of their mouth get rid of their pain too.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "GNtm76jqo4kVzAOL","flags": {},"type": 0,"text": "The Shaking Parrot – Whenever a trigger word comes up during a conversation (said by the patient or someone else). The patient repeats the word out loud. Sometimes they repeat the trigger word combined with a whole sentence (always the same). While they are triggered they jump around or shake their body or repeat one specific movement again and again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "Galnt8C4fHeg23HB","flags": {},"type": 0,"text": "The Soldier’s Fear – Whenever fear or high stress manifests in the mind of a warrior they begin to see illusions. If the fighter spots an enemy his will is testet (DC10 or DC15 if the infection is older that 2 weeks). If his mind fails he sees multiple enemys or enemys in a different more dangerous form.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "N6PImS3WdUOZjzwI","flags": {},"type": 0,"text": "The Golden Vision – One becomes obsessed with gold. The patient recognises the true worth of everything. They try to take possession of everything valuable to sell it for gold. They stop at nothing. They steal or use force. However if they get only a glace on gold pieces they lose the ability to count and just want to take the money with them and leave. They often begin to store their gold in a hidden place or bury it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "M8AAvV27k8rsmLQe","flags": {},"type": 0,"text": "Oil of Ferrosix – Slowly turns those infected into mindless Warforged. Highly contagious but can be cured or halted by golems and Warforged.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "f34p9Nw8xhMXNYrU","flags": {},"type": 0,"text": "Animaseperatism – Over the course of 1d6 days, your soul slowly exits the body. Over this time you may lose interest in a hobby or lose motivation in fighting the big bad, it can be stopped if you meet a cleric fast enough, but if not, you must acquire a vessel for the soul and roll disadvantage on all skill checks for 1d6 days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "FoOWWjENYJxI15Ka","flags": {},"type": 0,"text": "Cephalogorgonism – colloquially referred to as getting medusaed, your hair turns to snake (yes all hair). The only known treatments are a buzzcut or using a lot of shampoo.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "61PUViUsrQiiBJex","flags": {},"type": 0,"text": "Medusa Rash – A slow growing petrification. Lasting as short a month to as long as several years the rash will slowly spread causing the flesh to turn to stone. The disease is 100% fatal with the disadvantages becoming more pronounced as full limbs become petrified.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "F38P3YUqZyJGD9nv","flags": {},"type": 0,"text": "The Vanishing Plague – Turns people invisible, highly contagious.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "ZNoXH5J8e5nsiRaB","flags": {},"type": 0,"text": "Tinder Sickness – Gives you a dry cough and vulnerability to fire damage, you explode if you are dropped to zero hit points by fire damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "DRRqBI2k7dJBNmng","flags": {},"type": 0,"text": "Slime stomach – A slime is in your stomach. It could have crawled in when you were sleeping,  or maybe it was a spore in something you ate.  It causes major pain, gives you bad acid reflux, and devours your food, leaving you malnourished.  The only known solution is to swallow baking powder and pray to a god of healing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "2RqCd4J89gFv94gr","flags": {},"type": 0,"text": "Burning passion – A magical disease that causes you to get burns whenever you do something you love. first degree for eating your favorite food. Second degree for practicing your hobby. Third degree when you express love to your closest ones.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "Lzebst8QDFw9VrBt","flags": {},"type": 0,"text": "Frogtongue – The afflicted’s tongue gradually becomes malleable and sticky, like a ball of taffy, and the afflicted gradually loses the ability to pronounce words and enunciate. At its most advanced stages, the tongue can be protruded and retracted exactly as a frog’s tongue, and the afflicted loses the ability to speak. Other symptoms include a craving for flies and an undying hatred for the wizard that crafted this ailment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "wYEu5OAtj5jcyr3C","flags": {},"type": 0,"text": "Mindbane – A magic psychic ailment passed by proximity with the afflicted, Mindbane shows those suffering it The Things Man Was Not Meant To See. Early stages of this ailment only seep into feverish nightmares, but later stages show unrelenting visions causing dissociation from reality, permanent psychosis, and even apparent death from insanity. This ailment can arise organically from contact with certain creatures from outside the mortal world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "a7AhCB4ruRvc9kfY","flags": {},"type": 0,"text": "Green-Skinned Death – This disease causes the unfortunate afflicted’s bones to decay inside their bodies, becoming brittle and snapping with regular usage and movement. The one tell-tale sign is that the afflicted’s skin develops a pale green hue from the decay. The most common forms of death from this ailment are high blood toxicity and internal bleeding from a bone shard rupturing a vital organ.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "ZuJKHQCPMCE5EHNX","flags": {},"type": 0,"text": "Bloodfungus – A parasitic mushroom spread by internal contact with spores, bloodfungus grows mycelium throughout the mortal body, feeding on the nutrients passed through the digestive tract and blood stream. After two months of relatively silent incubation, the mycelium will flower, bursting small fruiting-body stalks the size of an index finger from the skin along the afflicted’s appendages, which flower in a day and quickly begin to release spores. Further, the mortal’s nervous system is affected, producing extreme anxiety unless they seek out contact with other mortals.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "NmpMyfVfPEe4lRFe","flags": {},"type": 0,"text": "Devil Rot – A horrible disease caused by contact with devils and demons, the vicitm’s flesh becomes hotter and hotter to the touch. While victims eventually spontaneously combust, in the meantime they gain resistance to fire and their touch does an additional 1d6 heat damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "Tr8EcdeJMNfmNSWD","flags": {},"type": 0,"text": "Moor plague – An unplesant illness caused by scratches and cuts in foul swamps, this illness slowly turns the victim’s skin green; additionally, the victim begins to emit the most unpleasant stench. Victims are Slowed while suffering this disease.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "jZLsSwZieqno5RKF","flags": {},"type": 0,"text": "Salt plague – This unpleasant disease feeds on the victim’s salt levels.  The victim eventually loses her humanity as her salt cravings become so intense that she becomes violent, seeking the salty blood of other victims.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "I0A4o8lNpdyl5pJf","flags": {},"type": 0,"text": "White Fog – This illness attacks the eyes of the patient, slowly eroding his vision.  Patients tend to see an increasingly opaque white fog obscuring their vision. Victims are Blind while suffering this disease.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "eSnq4bdsjHpYhgHb","flags": {},"type": 0,"text": "Wyrm Flu – Supposedly an illness originally suffered by great dragons, this injury-transmitted disease is often suffered by those who survive attacks by wyrms and similar creatures. Victims are fatigued while suffering this disease.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "csJhDRdk7wKP6wkE","flags": {},"type": 0,"text": "Dragon fever – A magical disease contracted by being near Draconic influences for far too long. The symptoms start as a simple change in the eyes, making them take the look of a dragon, but other than that the paitent feels fine. If not treated then the second stage of the sickness begins, the patient becomes near obsessed with wealth and money, and will do anything to get it even at the expense of others. This may be subtle at first but once the third phase begins most people know exactly what has happened. The final phase involves a fever that if not treated constantly can kill the paitent. However if this last phase is survived, the patient finds themselves with some sign of Draconic nature, like horns or a small scales on parts of the body.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "KVhpYUgf1ntISkpT","flags": {},"type": 0,"text": "Qi Disconnect Disorder –  You have advantage on physical skills made with just the right side of the body,  disadvantage on all other attacks and skill checks. Cure with 1d4 days of meditation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "t5AibxY1IH7FHHyf"}
