{"name": "Ship Names and Description","description": "One hundred different sea-faring vessels that will make the high seas exciting!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "l7TlzrkEwepHzE4k","flags": {},"type": 0,"text": "The Blue Marlin – A medium sized vessel with bright blue sails. This ship is known for it’s speed. It is used as a scouting ship for larger battalions of ships.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "ECZ1a8midU8u3wIf","flags": {},"type": 0,"text": "The Antelope – A mid-sized ship that can carry 20-30 crew members and cargo. Tattered sails and a poorly maintained; captained by Elcid Barrett.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "cn5IYDOOis0id86f","flags": {},"type": 0,"text": "Big Terry IV – A slow and ugly looking ironclad model without sails. It’s a steam belching floating fortress as much as a vessel, but it’s exotic design would never survive the open ocean. It’s known for sinking three times prior, being maneuverable as a brick and once turning a famous ship to a cloud of unsalvageable splinters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "MUnxEPc8pG8hxM8v","flags": {},"type": 0,"text": "The Indomitable – A large ship, made of ebonized woods that is deceptively fast for its size; captained by the murderous Dread Pirate Jazeera, who, in ironic turn of events, has turned to a life of piracy and bloodshed in response to her father being press-ganged into the service of another pirate when she was still young","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "yL453rqDHVoMmgTs","flags": {},"type": 0,"text": "The Nightshade – an old rickity retired slaver ship with crimson red sails with an enourmous brig.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "fRaS5OWhheY85lhW","flags": {},"type": 0,"text": "H. L. S. (His/Her Lordship’s/Ladyship’s Ship) Revenge; Pride of the Enderren Empire – Small boat, space for 8 people if they really squeeze in. No sails, just oars. Literally a dinghy captained by an eccentric mad man/woman.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "HrsJTZTTcJ4cMChY","flags": {},"type": 0,"text": "The Gentlemen – A large and ornate steamboat of the southern rivers. Hosts a large crew of servers, bartenders, and cooks, and a fine crew. Despite the shiny exterior, the cargo hold contains a plethora of illicit goods, and is rumored to even be used in the slave trade.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "otfopX8Du5OAlgTG","flags": {},"type": 0,"text": "The Flying Danishman – a small, quick vessel with deep red sails with a large white chefs hat on them. The ship is home to a great baker and his crew who sails from port to port selling their baked goods.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "qLhqFsRImqRIGuNU","flags": {},"type": 0,"text": "Silence – a massive man-o-war, enchanted to the gills for stealth. The ship is widely believed to be a myth, but all the myths agree that the figurehead is a beautiful, gagged archeress.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "n6aMkxhMKTSYZeWT","flags": {},"type": 0,"text": "Hunger – a sleek corvette. Widely known as the fastest ship on the sea, many of her yard arms are hollow. She is known for the shrieking sounds the wind makes as it passes through her rigging.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "Psc0qXXmoHk8tQdJ","flags": {},"type": 0,"text": "Bella Orcus – A cruise liner used for pleasure voyages made from a massive undead whale that has been hollowed out, fitted with cabins and rooms, kitted up with modern amenities, and staffed by zombies. Naturally, it can cruise above and below the surface. Its eccentric necromancer captain decided that a margarita-sipping, toes-in-the-sand, sunset-on-the-beach lifestyle was better than toiling in a dungeon to please some abyssal master.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "QAuWeH4tVnD6dhmu","flags": {},"type": 0,"text": "Xanathar – A reconnaissance submarine of about 150 ft long. This submarine was uniquely constructed to serve the needs of a merchant boss who suspected his employed captains of sabotaging shipments to undermine his power. The submarine is equipped with two high-powered periscopes that allows two crew members to scan the waves at the same time, both with advantage on Perception (WIS) checks. (1900-1910 timeframe)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "fx5iOMjoPVnkNP3t","flags": {},"type": 0,"text": "Cutter – This steam-powered icebreaker has a grand history of arctic expeditions. Slow but powerful, her steel-plated hull allowed her to penetrate coral, ice, and sometimes large marine wildlife. For especially thick ice, the Cutter was armed with a single field cannon (bow) armed with explosive shot. Since the death of her captain 30 years ago, she has remained dormant in a scrapyard, waiting for more journeys. (1860-1870 timeframe)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "qwhc8izYZ2VJrhaW","flags": {},"type": 0,"text": "Fortune Favors Ko-Bold – This swift monitor-style warship was commissioned for a company of Kobold privateers. Only 100 ft long, the interior of the ship is often hot and uncomfortable for medium-sized humanoids. The Fortune lies low into the waves, only revealing the raised portion of her iron hull containing a single powerful 16-inch gun, which jostles the ship when fired. The only flag the Fortune flies depicts a Kobold making a rude hand gesture. (1860-1870 timeframe)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "jIjoUiuGrSjwWwJh","flags": {},"type": 0,"text": "No Quarrels – This whaling ship was converted to a minelayer to combat sabotage by merfolk against fishing interests. She is armed with mines, depth charges, a harpoon gun (bow), and two scattershot swivel cannons (stern). Her sails depict a regal longsword bisecting a snapped trident. (1830-1860 timeframe)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "XPvYID2GAIVumLhn","flags": {},"type": 0,"text": "Recherche – This freight steamer was converted to a scavenger ship. Outfitted with lower-deck viewing windows, powerful hull lights, and retractable spyglasses, this ship allows its crew to scrutinize the floor of shallow waters. She is also equipped with a 3-man submarine, capable of diving to 10,000 ft. (1900-1910 timeframe).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "1SU5ELqVWHmPjx0j","flags": {},"type": 0,"text": "Gully’s Pad – A rickety swamp boathouse of discarded boards and salvaged swamp logs, it is home to the most ornery witch doctor ever heard of, and where he conducts most of his business.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "yhLXbkT2RPqSs8vx","flags": {},"type": 0,"text": "The Floating Pizzeria – the work of Chef Gaston’s life, this ship houses a 20-man crew, and a big kitchen. Some of the crew works with making and selling pizzas. The ship travels throghout the seas, selling pizzas to every port, and buying ingredients.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "dQWiIk0B2DzwBJw5","flags": {},"type": 0,"text": "SS Firefighter – this ship looks pretty normal at first glance, but it contains a complex mechanism to take water from the ocean and pump it into large hoses, that the firefighters use to put out fires in other ships, miraculously without sinking them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "L46lXDiil0VoZFNa","flags": {},"type": 0,"text": "The Airboat – a rather small ship without a sail, that has two giant airbags on the sides. The ship itself stays a couple meters over the surface of the water, and is maneuvered by enormous rows. It’s only advantage is that it can’t catch on fire, for it was built by a wizard.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "xCZtEpDBheJtWVs5","flags": {},"type": 0,"text": "The Hourship – this small, but hella fast ship was created by a band of folk heroes who decided to make an organisation that could respond to threats in less than an hour. So, the crew is made of fearless adventurers, who scout the seas looking for pirates and evildoers, and are constantly on the lookout for anyone who needs help.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "gWR8TgArxZRtJBLd","flags": {},"type": 0,"text": "Tsunami – this giant, irregular metal behemoth is feared by anyone who lives close to the sea. It is a massive steel ship, with tons of holes and chunks of metal coming from it, all with odd gadgets attached to them. It is home to deadly pirate crew rumoured to be composed of 100 men, who use their devices to effectively fight any opposition.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "KJamPSn2kaU2kicr","flags": {},"type": 0,"text": "Copan – a ridiculously large ship, that’s home to over three thousand people. It is a completely self-sustainable city, and makes little to no contact with ports. They are happy to help anyone in need though, and are capable of defending themselves against all attackers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "DSoXpg4MvV16xtzU","flags": {},"type": 0,"text": "SS Squared Sun – with a 40-man vigilante crew, this ship is constantly moving, on the lookout for unethic actions. If they see anything questionable, they capture and torture the suspects, and then decide on a sentence, that sometimes include imprisonment in the ship’s large prison.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "8hH1HNY25Ekf66uW","flags": {},"type": 0,"text": "Motherboat – a steam-powered circular ship, that works as a military base. It houses several smaller ships, that the crew deploys when in combat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "2Ds6OaMYDaIlXyth","flags": {},"type": 0,"text": "WaterTower – this was originally a wide and tall wizard tower, in which many magic apprentices studied. At some point, a wizard got so powerful that he could lift the entire tower, and put it on a ship. Now, it is a floating magic school, and it’s stability is only maintained by the magic powers of many residents combined.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "ZRrh533or8qMZdNH","flags": {},"type": 0,"text": "The Ark – a big, bulky ship. It’s crew is composed of a family of elders, rumoured to be several thousand years old. People who come near it say they hear all kinds of animal sounds coming from inside. It is said the ship contains one pair of each animal in the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "WQUXwTSMUSKQ6h0Y","flags": {},"type": 0,"text": "Meatgrinder – a medium-sized whaler ship, with a crew too large for it’s size, and with too many harpoons. They are extremely effective in their business, though.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "J7Zadlw7AyBbIXFJ","flags": {},"type": 0,"text": "Shipsled – a big ship with some long boards coming out of it’s front. The boards have several cables tied to them, and each cable is also tied to one or more dolphins, who control the ship in exchange for food.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "6qNZARG2TTucy8Pw","flags": {},"type": 0,"text": "The Scarred Hulk – An old, weatherbeaten ship with a severely beaten, nearly unrecognizable Dwarven figurehead. The ship is actually sentient, but is so gruff and old that it rarely speaks, and then only if it has something worth saying.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "FIMEhm3P5ZRSnAsV","flags": {},"type": 0,"text": "The Mudkip – A dainty-looking vessel decorated with gold and white paint. Rides incredibly light in the water; in the right hands, according to its captain, it can sail where canoes run aground.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "0oYL8DTCgvRq1pUA","flags": {},"type": 0,"text": "The Red Coquette – A small, swift caravel. The captain, an elf named Rytial Harkenouten, made a desperate deal with a Kraken decades ago. Now she tries to send as much gold to the bottom as possible to pay off her debt without being noticed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "D7NJmt2IJ6Tyj539","flags": {},"type": 0,"text": "The Ruffled Pigeon – a hardy merchantman, the Pigeon has been reported sunk by storm, pirate attack, or swamping over two dozen times, but has returned home every time. The ship is patched and scuffed, but in excellent condition; sailors compete for crew openings, as they believe the ship is mystically blessed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "V9brMOAr27ecrwKK","flags": {},"type": 0,"text": "Hearthside- This ship is outfitted and decorated with iconography of Aseraph, the Mother Goddess of Home and Peace. Hearthside is a cartel ship, a place for treaty signing and prisoner exchange. A calm emotion spell is constantly in effect on the ship and in a circle around it. It is said that every peace treaty signed on the ship lasts at least a generation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "PTvSHjTJPW0Gups3","flags": {},"type": 0,"text": "Shippy McShipface – It’s figurehead is a different ship, and it ships miniature ships all over a shipping empire that it is the flagship and mascot of. It is known as a party ship, and is definitely not known to be the most lucrative smuggling vessel on the sea.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "oNM7IHP2QSPMY23c","flags": {},"type": 0,"text": "The Seal’s Fin – which has no sails above water, making it harder to spot than most vessels. It has flukes deep into the water that manipulate the currents to propel it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "o0pIfxFfNUGvxLds","flags": {},"type": 0,"text": "The Constant Comment – Was landlocked and used as a pirate tavern for some time before the owner abruptly took out the supports and dragged it out to sea, staff and patrons included.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "4nONZBPkJxMqqooB","flags": {},"type": 0,"text": "The Sweet Molly – A midsize frigate with a crew of about 40. The ship is magically enchanted so that it can appear to be any ship it has been lashed to. This makes it a smuggler’s dream, and the captain and crew will kill to keep their secret.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "sUhPpNMTn5wRAJzW","flags": {},"type": 0,"text": "The Barque of Frailty- This large, many-masted ship seems to be manned largely by young women, with sumptuous red sails and a doe-eyed figurehead. Sailors are thrilled to meet the Barque in the open ocean; it will come alongside a ship and offer refreshment to the crew. The Barque has a surprisingly large number of cabins, some light gambling options, and a quality bar. Sailors invariably leave the Barque notably poorer, but they don’t seem to mind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "AfOzbjzM4LzmX09t","flags": {},"type": 0,"text": "Titania – A gargantuan ship that’s nigh unsinkable. The ship is so large in fact, it has it’s own city both inside and on deck. The entire economy is self sustaining, but the captain (mayor?) is known to send out small vessels to trade with mainlanders.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "lI8p6nGpqfUN1sfw","flags": {},"type": 0,"text": "The Merrow’s Marrow – A completely normal ship, but it’s made of bones of all kinds. Some bones are carved, some are attached on hastily, expanding the ship ever more as it sails. The crew appears normal, but anyone who boards the ship is considered undead for the length of their voyage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "kTArK3WLaME20uOZ","flags": {},"type": 0,"text": "The Lead Balloon – A vessel meant for air travel that never quite got off the ground. The balloon is still inflated, but is far too weak to pull the ship off the ground. The ship’s name is an insult to the original architect, who is long since passed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "Xl2Fi0VHFHsxwnmw","flags": {},"type": 0,"text": "Ta’ Garge Barge – A ship that was meant to be a way to send off a metropolis’ waste, but was quickly transformed into a pirate vessel by a hoarder with a lust for power as soon as it crossed the horizon. It resembles a haphazard mess of garbage that somehow still floats, and victims of their plundering often smell it before they can see it. The captain and crew are very, very susceptible to bribing in the means of junk for their collection.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "l1X3ZEzG2F0NPtrA","flags": {},"type": 0,"text": "The SS Aloe – A ship made by elves, for elves. Beautifully crafted in various greens and golds, with a high fee for those using their services as a traveling ship. Elves, however, get on for free, often describing their non-elven companions as pets so they are able to board. Non-elven passengers are stored in a separate lobby below deck.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "Y7bjBHYVpgzuXRj1","flags": {},"type": 0,"text": "The Drow’s Bow – A small dingey with no sails and no crew. A single porthole in the center leads down to a large sub-marine base, filled with and beloved by the undesirables of society. Adventures talk about this ship and their warm time there, filled with laughs, good food, and good stories.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "E8T9WFcPxoxDS5Jz","flags": {},"type": 0,"text": "The Open Clam – A sea brothel with all kinds of races and genders. Pleasure guaranteed for everyone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "3NF1YRce4JdVPjlP","flags": {},"type": 0,"text": "The Stalwart – This former blockade runner has seen better days. In a prior life, The Stalwart could have been a ferry ship. In her final chase, her crew sacrificed everything into her fiery engines. Anything that wasn’t essential to function or bolted to the ground was used as fuel to maintain full steam. A dark discoloration marks where there should be benches, the quarters are bare, and floorboards on the upper decks are ripped out. With 100 meters of full dilapidation, The Stalwart has yet to be adopted by any sane crew; however, she is still capable of voyages. (1850-1870 timeframe)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "ljTtJq4VyQNRGIAM","flags": {},"type": 0,"text": "The Ranger – This fine warship of dwarvish construction has been tested through a baptism of fire. The anti-piracy ship was launched a year ago. In her first battle, she and her ally, The Rot escorted a convoy of merchant ships through deep pirate waters, engaging ships almost daily. Capable of reaching 25 knots, The Ranger is swift enough maintain speed with any merchant ship. She is 160 meters long with a steel hull and is armed with twin 10-inch guns facing front and two independent 7.5-inch guns facing rear. (1900-1910 timeframe)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "x8nOTkjgsG7QlCY9","flags": {},"type": 0,"text": "The Rot – This armed steamer is known for the horrid stench of its smoke. Manned by exclusively goblins and hobgoblins, The Rot excels in chaotic and brutal battles. At 100 meters long, her steel hull is reinforced and tipped at the bow, forming a powerful battering ram. She is armed with two independent flamethrowers at the bow and a rear-facing 10-inch gun. (1890-1900 timeframe)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "LkEpaPACaXEcwfiI","flags": {},"type": 0,"text": "The Placeholder- A large, grey ship with neat sails and trimmed rigging, the Placeholder is an excellent ship for passage or trade. Captained by Cadwallader Farer, a trim man in a blue greatcoat, and by Oliver Shan, his large, peg-legged First Mate, the Seafarer and its crew are just what you would expect from such a boat; in fact, almost too much so. This is because all of it- the boat, the captain, etc.- is illusory, weaved from shadow-stuff. The only truly real things aboard the boat are the other passengers, who are unaware of the nature of the boat- except for one, Jeronimy Blackprebble, a gnomish wizard and master illusionist. Jeronimy created the Placeholder out of whole cloth, and is very much enjoying his success. He loves that the passengers can’t even tell, and if confronted, will act coy for a little, than gleefully confess and expect to be lauded for his mighty achievement. Jeronimy is a good sort who can take most things in stride- however, should the players be dangerously confrontational to him or the other passengers, he will unmake the portion of the boat they are standing on, moving them to the brig, or if too dangerous, to the ocean below.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "iKzMHJ2Q68Hi39PZ","flags": {},"type": 0,"text": "The Quiet Hand- A slaver ship, itself manned entirely by slaves. The captain is Itzaas the Moran, a large man with many tattoos and a prominent brand on his chest and neck; he is a slave just like his crew. The true owner of the ship is a consortium of trade wizards who have never seen the ship in person. Itzaas has plenty of leeway; at the moment, he has chosen to focus primarily on Elven slaves. He has two dozen currently in the hold, including 17 drow from a raiding party who found the Hand more than they could handle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "SQlyTYFFio2ZK2s1","flags": {},"type": 0,"text": "The Gorgon – An imposing Man-O-War, The Gorgon has since come under the captaincy of the vicious Tabaxi known as Lief the Purple. The sails are striped gold and purple, atop of which flies her dreaded black flag depicting a white skull with a crown of snakes. Her cannons are wreathed in carved brass snakes, and reaching out from her prow is the wicked torso and terrifying scowling face of a hideous Gorgon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "ZDkboqOi9V97T3cH","flags": {},"type": 0,"text": "The HMS Gryffon – Commanded by Commodore Montagu Knight, His Majesty’s Ship Gryffon is a 74-gun frigate who’s white sails pale only in comparison to Commodore Knight’s white powdered wig. Loyal to the Crown, the Gryffon does not shy away from a fight, as her clean hull gracefully cuts through even the most formidable seas. A gift from the King himself, her golden anchor is a sight to behold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "SFAI9C0jJkcHxCQx","flags": {},"type": 0,"text": "The Toucan – This re-purposed merchant ship has become a sloop-of-war. Her colourfully striped hull is almost comedic, however what this ship lacks in grace, and austerity, she more than makes up for with agility and speed. The Toucan is affectionately captained by Red Jeyne, an equally flamboyant female elf, who is in the employ of Governor Sudcliffe and aims to prove herself as a most opportune privateer… Having quickly pulled off many daring deeds and maneuvers on the open sea, she is beginning to make a name for herself and The Toucan.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "UIIq8nBjFPKHTLNY","flags": {},"type": 0,"text": "Harthaq Grinuul (‘The Cleaver of the Horizon’ in Tide Dwarven) – Little is known of Tide Dwarves; more reclusive even then their Mountain Cousins, their pale blue skin and green-brown hair makes them resemble tiny storm giants. They are brutally self-sufficient and tend to avoid other races- but, like all Dwarves, they are more than prepared should war find them. Harthaq Grinuul is a Quadrireme Warship, with both sails and rows for oarsmen. By means of an ingenious technical design, sets of oars are locked apart, allowing a Dwarven oarsman to power two oars at a time- one via arms, the other via feet. This, combined with the wind and wave magic the Dwarves have developed, allows the ship to obtain speeds human sailors can only dream of. The ship’s figurehead, a Dwarven Maiden with a mighty Bearded Greataxe, is strong and sharp enough to allow for the ramming attacks the ship is built for; Tide Dwarves do not take prisoners, and prefer to avoid contact rather than skirmish. When they fight, they intend to leave none alive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "aKNV5txKrpxqqCXW","flags": {},"type": 0,"text": "The Century Hawk – A crappy looking cargo skiff with a charismatic captain and an unkempt Tabaxi first mate who speaks no common. The captain claims the ship is fast but his boasts make no sense. A second inner hull allows goods to be smuggled in secret compartments.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "qL0hxswGm1oRgqWO","flags": {},"type": 0,"text": "The Winged Gourmet – an incredibly fast light cargo ship (of exotic woods and, if available in world, plated with a very thin metal (cooper historically, mythril if available) underneath to prevent barnacles) specialising in transport of small quantities of perishable and fine foodstuffs. The captain, Ilsaril, is a refined but personable male elf with a small wizardry talent and prodigious cooking skills and honed sense of taste and smell. He is a renowned tough but fair negotiator. His navigator Lisbet is a young human woman with scars on the left hand side of her face which she covers with long dark hair. She speaks little but is a skilled assassin. The ships boat is called A Pinch of Spice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "QvtbgLXPCoUkpKyx","flags": {},"type": 0,"text": "Sandy’s Folly – a cargo ship crewed by just one man and a golem, although it was designed for more. Nobody knows who ‘Sandy’ is, nor how the ship manages to make a profit, nor how it always seems to know how to avoid/escape trouble.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "14hKXff1E2OSPleW","flags": {},"type": 0,"text": "The Nemesis – an armored frigate with an ironclad hull. Having a small number of large cannons, the ship’s primary offense involves ramming into enemy ships.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "C6JrwjYaHVRLJvsF","flags": {},"type": 0,"text": "The Dreadnought – A massive ancient vessel, rumored to be crewed by ghosts. Moves faster than any other known ship in the Material Plane and legends say that it is propelled by magic instead of sails.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "DPys7yWzV7ZrMbTb","flags": {},"type": 0,"text": "Naginata – class vessel – A warship designed by the master shipwrights of the Far East. Can be crewed by 150 men. Costs 5x as much GP to buy compared to a normal warship. Can move 1.5x as fast and is equipped with two ballistae and numerous sea mines.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "Na0mGyb8zBj795qu","flags": {},"type": 0,"text": "The Anex – Although it is just a small caravel, this airship earned its legendary status when the gorgon Karametha took up residence within. An engineer and wicked necromancer, she built a terrible device capable of dropping shells charged with the mortal souls of those she takes captive, unleashing devastating blasts below while her ornithopters swoop down to take captives up to her deck, replacing her enslaved crew or becoming fodder for her weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "P0PeB6PhPE5kOD1q","flags": {},"type": 0,"text": "Ossa Mare – An ancient, massive ship with a city of sea pirates upon her back. She is a living being, some say the avatar of a sea god, and those who live upon her dedicate their lives to teaching the crafts of ship building and weather control.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "Sj7o7uDSo2LagX4s","flags": {},"type": 0,"text": "The White Pearl – A 90ft long ship with a matching pair of massive white sails. The deck holds 6 cannons on rails that would rotate around to the proper side of the ship. Sailors pass on tails of how the cannons can fire from 40 nautical miles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "10Tt6k9mDNrrWqcH","flags": {},"type": 0,"text": "A.G.S. Noble Forte – Five masts, square rigged with spanker and proper foremast. Heavily armed freebooter interdiction platform also housing a small detachment of marines for the occasional brown water operation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "J7zrZXx0uYdn5bsN","flags": {},"type": 0,"text": "A.G.S Heatherleigh – Four masts, triangular foresail rigged on a longer than usual bowsprit. Weatherly and seaworthy, she’s one of the fastest ships on the open ocean when her captain, Cyrus von Altibene, can run her close-hauled. His crew is well-seasoned and loyally follows him into any fight against the corsairs that continuously pressure their home port, Askeltoft.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "vMyibqFw5wnjp3JO","flags": {},"type": 0,"text": "K.G.S. Battlespite – An older barque with a storied history of guarding the deepwater harbor at Kuhnmouth. Nearly scuttled when Maelpsirath emerged from its Rite of Becoming and subsequently upgraded with much more effective anti-ship ballistae.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "r8Td9SBb9X0wwEh7","flags": {},"type": 0,"text": "Ban Sidhe – Six-masted passenger schooner. Fast and luxurious and her crew are cordial, professional hosts. Normally features a rotating complement of regionally prominent bards as entertainment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "HtEYINQfdCHzdRos","flags": {},"type": 0,"text": "Flayer’s Wave – Famous for once escaping the Askeltoft flotilla while yet fully loaded with plunder, this lateen rigged three-masted brigantine was built long and narrow with a deeper than usual draft. She’s capable of heeling almost to the gunwales in order to tack more aggressively than perhaps any other ship under difficult wind conditions. Carries no visible mounted weapons above deck.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "IlxeoivbhrGKY9Gz","flags": {},"type": 0,"text": "Crosswing – This blue-water caravel is almost an institution on the Tefield-Kuhnmouth inshore route. A suspected freebooter ship, she’s been repainted and reflagged so many times that the navy’s running joke is about her impressive wardrobe. Her beams are rotten to the bilges though. It’s only a matter of time before she’s aground or sprung a last, fatal leak in her hold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "S7jLpbBIhQSNqBzD","flags": {},"type": 0,"text": "Vannivar – Has a reputation for being cursed, but her captain and crew are affable and well-liked. Of course, they’re the fifth crew in as many years, but it’s probably a coincidence. Pirate vessel with an expanded bilge used as smuggling space.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "cLPam99MaumEjN7w","flags": {},"type": 0,"text": "Pistonram – This ship has been upgraded by dendromancers to use fin-like propulsors just below the waterline in becalmed seas. Consequently, her crew has made considerable coin as they’re almost the only ones willing to attempt the South Passage around the Gyrewild and its otherwise lethal effects on the easterly wind currents at that latitude.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "lmgUEQ3PxHyYu8L1","flags": {},"type": 0,"text": "Sam Tick – Dhow-rigged brig. Common style corsair vessel. Cap’n Westley Voshel is well known in the community and always has his beers bought for him when anchored at Freedock Hold","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "rcAbCPSCL6yxns33","flags": {},"type": 0,"text": "First of Infinite – This famous pirate vessel is partially crewed by seagoing minotaur and partially by mixed humanoids. It is the only ship known for this split crew arrangement. Somehow despite the obvious cultural divide, Cap’n Grace Hayashi has united and forged them into a murderously effective crew. She’s begun arming the two upper middle decks with Gnomish experimental blackpowder cannons–eighty of them to starboard, eighty to port–to supplement broadsides of heavy arbalests on the upper and main decks. It’s an event every time this lethal ship pulls into port. Nominal crew complement of 160.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "JiJA7WiHZTvdjy6X","flags": {},"type": 0,"text": "Swift Vengeance – Captained by Tabitha the Butcher, this mighty pirate vessel commands fear and respect all throughout Tohs Abyss from Nightgarm Freehold in the north to beyond the Wall, a thousand leagues to the south. Her upper and main decks are either ornamental cherrywood or they’ve been stained with blood so many times the wood has taken on a crimson appearance. Rumors abound about this ship’s disciplinary cannibalism practices. More than one barge convoy has scuttled itself and fled aboard its escort based on this reputation alone. Flies a long, dark grey pennant.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "v5QSoV897vedTMXc","flags": {},"type": 0,"text": "Vesper Regalia – Repurposed corvette bought as naval surplus fourteen years ago. Light and square-rigged with extra-tall masts of ironwood, she’s capable of scrambling aboard her own bow wave and practically sprinting downwind. Suspected pirate vessel, but never yet confirmed officially.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "h5CMBH1EMYTRKef3","flags": {},"type": 0,"text": "A.C. Victorianus – a tiereme with two masts and three sets of rows. On the front there is ram of iron for crushing other ships hulls and on the bow of the ship, a small siege tower is built up on deck, sporting a balista that is able to shoot flaming darts or pots filled with burning tar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "CtAxLQOknqLOpo26","flags": {},"type": 0,"text": "Stonehewer- a dwarfen ironclad with 10 cannons each side and a bombard (artillery) in the front of the steelmade battleship. It has two masts, though the main source of propulsion comes from a gnomish invention. The demonic power reactor that turns modern screws. This ship is far superior than all the other ships on the oceans at this time. With her sistership Iron Maiden, they are the only real naval power the dwarfs and the gnomes have. Though they are each as strong as a fleet on their own.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "HADxA0ovtEjk51aF","flags": {},"type": 0,"text": "Weatherlight – an airship of some prestige, known to be the fastest and most agile air cruiser there is. Her Captain, Hannah is rumored to be the best airship captain in this world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "loNJAwqsM70uU2XJ","flags": {},"type": 0,"text": "Airship Yamato – the biggest airship ever built, comes from an eastern Empire and has the most impressive armament of all time. Apart from uncountable cannons on deck, hidden in the bow of the ship, is a 46 cm canon, that is rumored to split mountains. No one has ever seen this ship in actiom, though the rumors are steadily spreading about the colossus in the sky.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "nXWfzkkJvRwfmSQs","flags": {},"type": 0,"text": "Casterly’s Prize – A modest sailing vessel that once been owned by an ostentatious wizard. The boat was lost at sea, but if it is encountered is in filled with both mundane and dangerous enchantments and traps. Also contains a small chest of magical treasure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "CvtAo4EYcm8r0RI6","flags": {},"type": 0,"text": "The Grim Jackdaw – A boat that appears (because of an extremely low middeck) to be always sinking. It is sailed by a group of hardened escaped slaves, who capture and attempt to ransom any rescue parties.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "bKnm2H5tvK305RRz","flags": {},"type": 0,"text": "The Sir’s Prize – A ship created as part of a large-scale treasure hunt for the sons of rich noble magi. The Prize is a prize ship, crewed by actors who will put up token resistance, but will break character if any real damage is threatened. It is in some very out of the way place.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "2xUR61ILzPYvLV6s","flags": {},"type": 0,"text": "Scrack’s Scuttler- appears to be a strangely carved and painted vessel. Actually a Reclusivary Cuttlefish, a strange and rare species related to the Kraken. The ‘ship’ is in fact built into the beast’s shell. Captain Scrack, a goblin with ‘VERMIN’ burned into his cheek, has befriended the creature; the beast has a symbiotic relationship with the captain and his crew.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "W3xQ4G5pc9Zx6RDP","flags": {},"type": 0,"text": "The Dread Burg – A large battleship, built entirely out of ice and crewed by Frost Giants and their thralls. From afar, it appears as a normal iceberg.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "0phNXXnBn90QIsfr","flags": {},"type": 0,"text": "The Algalita – a small fast sailing vessel with the main mast being an actual living tree. The ship is captained by a human druid who sails around punishing any ships or ports that would spoil the ocean by dumping pollution.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "WcXp55ZH4aUshlR3","flags": {},"type": 0,"text": "The Miss Fortune – A pirate brig, well armed and swift, it seems cursed. Currently it is infested with Goliath bird eating spiders, the wait in the rigging and leap out at passing sea gulls, reminiscent of a World War 2 Destroyer shooting down incoming dive bombers. In addition, a howler monkey has taken over the Crow’s nest and it’s his now. The curse seems to extend to everyone who sets foot and ensures that the ship will sail head first into any random encounter that the gods of fate think will be most ‘exciting,’ ‘dangerous,’ and ‘challenging.’ It is also instantly recognizable and is hated when arriving in port, partly due to the Howler Monkey bellowing at all times of the night and day, partly for the spider infestation, and partly for the smell of the Swedish Valhund mascot and the capybara ‘Francis’ that lives below decks and will leap over board to happily swim at every port stop.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "FWPZHulkTmjHlpeD","flags": {},"type": 0,"text": "The Big Ogly – A slow, dark, hulk of a ship. It is made with a two-part hull, with a metal-filled slip between two wooden hulls. The ship is sturdy and tough and slow, with a rolling, syncopated gait. Originally named Great Oggestriantate, but no one calls it that.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "F1oYHIz8hOoJay0n","flags": {},"type": 0,"text": "The Countervail – A mid-sized Corvette, turned into a mail ship. The sails seem oddly backwards, but the ship sails normally.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "kv12gAsa6bTKK85X","flags": {},"type": 0,"text": "The Widow’s Blush – A pirate caravel, with black hull and black sails. The ship is enchanted such that any non-black paint sloughs off, and sails slowly turn black within a day of being hung. The ship’s crew is grim and brooding, partly due to their dark atmosphere.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "0JuwoJjHRsf6xV5i","flags": {},"type": 0,"text": "The Green Witch – A large merchant ship. A strange spell on the ship has put the left half 12 hours behind the other half- it is night when the right half is day. Sailors say it takes two weeks to get used to the change.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "4zcMDus8zzG3gLAa","flags": {},"type": 0,"text": "Saffron – A thin yellow catamaran with bright sails. Toghe Drummond, a half-elven explorer, is the owner and captain of the ship, and he and his wife and children live on the boat. There is a trapdoor in the floor of the catamaran that leads to an impossibly large (for the boat) cabin, the size of a modest 5-room house.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "HK4OmxmdyOXAtDFF","flags": {},"type": 0,"text": "The Fish Wagon – A small vessel, filled with halfling pilgrims of Yondalla. They offer free passage to any halflings headed in the same direction. The ship is comfortable and homey for small folk- bigger visitors smack against bulkheads and must stoop through doors and passageways.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "rKpnoFN1QThwNYkq","flags": {},"type": 0,"text": "The Orchard of La’Clemant – An abandoned tub called the Nancy Tremaine was repurposed by an eccentric island druid, who had been shipwrecked for three years. The Orchard is now almost completely filled with Roselemon trees (the Roselemon is a tangy pink fruit with a taste like raspberry lemonade- delicious!). La’Clemant offers fruit to any ship he happens across, warning of the dangers of scurvy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "FLhGL0NFLrxqdCBd","flags": {},"type": 0,"text": "The Dewdreamer – A beautiful clipper, now looking a little haggard and ragged. The ship belongs to Lady Zisten, an elven woman who began as a star-struck adventurer and now is a pirate and slaver. The ship, like her captain, seems filled with dashed hopes and a creeping loss of morality.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "lINV0iAIQqsSCe2E","flags": {},"type": 0,"text": "The Wooden Ingot – A ship infested with Rust Quivers, an amphibious form of rust monster. The ship is made entirely from wood and stone, and anyone travelling on it is warned to keep all metal in a stone strongbox. If the ship is attacked, the captain will unleash Rust Quivers on the attacking ship.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "BCsyaoIJWL6e9wDr","flags": {},"type": 0,"text": "The Black Opal – A frigate constructed from a rare wood that gleams like an Opal. It’s commanded by a Half Elf Bard and a crew of friendly skeletons which obey his every word – provided he is playing a soothing tune.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "zUXXOdJS733uYj2m","flags": {},"type": 0,"text": "Old Unfaithful – A piece of driftwood that was ridden by a halfling to escape an island they were deserted on. After returning to society he used his noble status to pull some strings and have it officially recognized as a seaworthy vessel with its own paid for spot to reside at, in the harbour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "MC19HhwZcqSxPYdC","flags": {},"type": 0,"text": "WaveDasher – This small ship is only large enough for one rider, but it can go faster than the speed of sound with a capable captain, unfortunately it has no defensive capabilities but it can be used to bash into other ships at high velocity due to the high strength living wood it is made out of that also serves as a way for the boat to regenerate itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "GiFftj2Uf7fFbJ4I","flags": {},"type": 0,"text": "The Anex – Although it is just a small caravel, this airship earned its legendary status when the gorgon Karametha took up residence within. An engineer and wicked necromancer, she built a terrible device capable of dropping shells charged with the mortal souls of those she takes captive, unleashing devastating blasts below while her ornithopters swoop down to take captives up to her deck, replacing her enslaved crew or becoming fodder for her weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "IBeGRgNaN1jBhHZo"}
