{"name": "Interesting Temples and Monasteries","description": "One hundred amazing temples and monasteries that your players can make a pilgrimage to!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "vDBvvTs2Shlg3ia9","flags": {},"type": 0,"text": "Temple of the Golden Leaf – A training ground for up and coming paladins and clerics. The temple features a training ground, study hall, dormitories, and chapel. In the center of the temple is a massive, ancient tree with vibrant golden leaves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "ihnLRy8Yk0XDB7mV","flags": {},"type": 0,"text": "Dais of the Ancestral Spirit Guardians – This long stone platform at the center of the village is the community hub, often lit by torches at night for ritual dances patterned after the constellations. During the day, the coastal dwarves of this village mend nets and weave baskets and tapestries here. The dwarven elders make elaborate heirloom headdresses, necklaces, and armbands for important ceremonies, often incorporating beads of totemic bone, sacred wood, and precious stones into their work.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "yToZYtlFfu8bQdMO","flags": {},"type": 0,"text": "The Dark Aerie of the Unkindness – Kenku from all over the city assemble by night under this rooftop cupola. Religious dread pervades their gatherings like the smoke and incense they incorporate in their rituals, as they twine their mimicry into the “Lament of the Flightless.” Their misanthropic worship is full of secrets only intelligible to their own kind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "kOQTG3l6EKYf3wnx","flags": {},"type": 0,"text": "Ark of the Unknowable — This obsidian-walled church is surrounded by the sulfurous wastes of the holocaust swamp. The long, rectangular structure is the symbolic home of the Hexune, a six-aspected deity of arcane magic, and the worship center for the cryptic wildfire elves who have adapted to these hostile environs. Like the inscrutable energy of flame, the elves believe that their god, and the volatile magic that it births, are inherently unknowable. Certainty is shunned, and paradox is embraced. The only thing held firmly by the church is that all life is miraculous and sacred, and must be protected zealously. The garish vestments of the clergy are orange, adorned with the holy symbol of a six-faced lantern.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "EpKnA4PvpMO1egMQ","flags": {},"type": 0,"text": "Hollow Hill — The reclusive firbolg regard the vapors from this heat vent as the breath of the earth, and revere the site for its healing properties and as a possible passage to the spirit world. Their ancestors wove a great willow structure around the heat vent, and plastered it with sod, creating a wide, low hillock hiding their sacred sweat lodge. The clan shaman hosts regular sweats here, often inviting trusted guests, for reflection, shared wisdom, and purification from greed. Any humanoid who spends at least 2 hours in a sweat here gain the effects of a greater healing potion, although they may also experience hallucinatory visions of ancestors, totemic spirits, and/or surreal landscapes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "IT10mQlBk9OBs6d7","flags": {},"type": 0,"text": "Veil & Key — A chain of less-than-respectable taverns, concealing an expansive mystery cult. The tiefling proprietors secretly transmit an esoteric wisdom tradition culled from tomes, sacred sites, and communities across the planes. The upper suites, attics, and/or towers of these out-of-the-way establishments are off-limits to all but the approved initiates who bear a very intricate geometric tattoo.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "aQ13lSmQTaOGwGZ1","flags": {},"type": 0,"text": "Serene Tide Pools of Sing-Lai – The tortles of this rocky bay pensively care for the tide pools here, wondering at the tender life surviving the searing sun and savage surf. They’ve built a massive temple on stilts, comprised of several ramada-style shelters around a central great hall. The great hall’s floor is a glass sheet, through which the disciples observe the tide, seeing its ebb and flow as loving gestures shared between the earth and ocean. The bay is protected from incursion by an ancient dragon turtle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "8XNWCXHZNR1egWBP","flags": {},"type": 0,"text": "Harmony-of-Chimes Palace — Particularly religious Tabaxi enter the ornate palace grounds by climbing the eight broad steps between two massive statues: a topaz tiger (representing primal ocean currents) and an amber lion (representing fiery desert winds). Inside, supplicants ply the Fortunes for good luck through an endless variety of rituals, and bring whimsical offerings to allay bad luck.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "aQ8hRupJd3PGKVkG","flags": {},"type": 0,"text": "The Crack – A sacred place spoken of often by the locals. On a battlefield in a long-forgotten war between Orcs and Humans, legend has it the ground split open during the fight and demons from another plane flooded the battlefield. The Humans fled, but the Orcs stood their ground and, after a long and grueling battle, repelled the invasion. A shrine of discarded weapons and colossal demon skeletons surrounds the large chasm in the ground as a treatment to the strength and honor of Orcs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "VN6wYzI60UAkWn06","flags": {},"type": 0,"text": "Prodigal Manor — An eccentric noble houses this monastic order on a quiet country estate, as a public relations effort to seem spiritual. The monks, in turn, give away almost all of their possessions to the needy, their food to the hungry, and their cells to the homeless. To maximize their charity, the monks live under simple canopies on the grounds, eat only what they forage, and wear threadbare habits and no shoes. Their rule insists on the primary tenets of generosity and hospitality. They have no idea that their patron has been living among them in disguise for the past month…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "6Amw5d97Pa9ShWcE","flags": {},"type": 0,"text": "Terraces of Truth — The sisters who live in the winding burrows of these sloping hills are utterly devoted to understanding and wisdom. Their key teaching is to discard ignorance, which is the fount of fear, and to seek to uncover ignorance’s strongholds, to rout it out. Nobles and rulers of many kingdoms have sought the service of these women as mediators, translators, and cultural advisors, and more than once have some attempted to buy their influence for their own selfish ambitions — always to negative results.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "rLdR5rCLzUzP6xa3","flags": {},"type": 0,"text": "The Kitchens of Delight — This jovial friary is a converted castle overlooking a robust farming village. The entire region, however, is experiencing a year-long famine, so the great room of the castle has been made a banquet hall. The friars gather all the limited produce and lanky livestock they’ve received as tithes, and they concoct master menus for their weekly feasts, to which the entire region is welcome to come and eat. The dishes prepared here are quickly becoming legend far and wide, as peasants leave with their health and strength and joy renewed. A hidden herb garden is the friary’s closely guarded secret…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "o0e8QkQDQt2qDoag","flags": {},"type": 0,"text": "Heirs of the Phoenix – Devotees to the Primal Flame undergo extreme tests of perseverance and zeal among these open lava flows. Those who withstand the heat are rewarded with special insight into the nature of fire: its gifts, its beauty, and its dangers. Some stay to continue their meditations, while others leave to spread the message they heard in the fire. No one escapes without some burn or scar to remind them of their trials and to continue teaching them throughout their life.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "Qow2ad5tT3Y6hyo1","flags": {},"type": 0,"text": "Blood Run Wat — This Yuan-ti temple complex emerges from the surrounding coastal jungles like a great coiled serpent of alabaster stone. Eight carved gateways open up into a towering circular temple with open arcades and ornately carved pillars. As stratified as the Yuan-ti culture, the many layers of the temple each welcome only certain worshipers. All feature massive stone altars on raised dais, with deep channels tracing the sloping stone floors and gruesome hieroglyphics carved into the walls as backdrops for the countless bloody sacrifices that take place here. The drained humanoid sacrifices are then peculiarly mummified: the corpses are fed to a rare carnivorous plant on the temple grounds, which desiccate the bodies of all remaining moisture before depositing what remains in hard, glossy red pods.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "3GRjFwcFFLC85a4l","flags": {},"type": 0,"text": "The Halos — These floating islands are home to a network of shining rotundas guarded by Aarakocra acolytes. When adventurers arrive here, their first impression is one of celestial majesty and quiet austerity. Very quickly, however, they discover the Halos are a tribute to trickery and a refuge for frivolity. Each rotunda is the home of a copper dragon, attended by bards and performers of every kind. Wealth and power mean little here; inventive wit is celebrated above all else, but practical jokes and shameless parodies are also greatly enjoyed. The Aarakocra caretakers laugh at the politics of the surface dwellers below, and sojourners breathe easy in the carefree atmosphere here.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "gGQBn2xNboTtCBdj","flags": {},"type": 0,"text": "A century ago, the head of an order of paladins declared that wherever he finally died would be declared a holy site. Unfortunately, he died in a nearby tavern after suffering a stroke. A century later, the church has brought all the properties surrounding the tavern and have converted them to a temple in the paladin’s name, but the family that owns the tavern itself refuses to give up their business even after a century of legal battles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "HtUhrlybK5RuO3bB","flags": {},"type": 0,"text": "Exile’s Rebirth — This ocean-view monastery is a voluntary prison, where penitents dwell together in Spartan conditions, committing to live together in silence until fully rehabilitated. A redemption paladin stewards the compound as his own form of penance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "gMyAiD22npdBudDe","flags": {},"type": 0,"text": "Grim Grotto of Claw and Fang — The lizard folk commune is only accessed through a series of subterranean pools, swimming submerged against the current. Surfacing in the final pool, the lizard folk enter a wide-domed cavern filled with the harvested parts and trophies of kills, into the center of which a narrow waterfall streams. This atrium opens onto several passageways in which the Long Death monks dwell, train, and study. Bullywug slaves skulk about the grotto, serving their captors eagerly (lest they be killed and harvested, or worse, vivisected for the lizard folk’s macabre studies).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "Lf1ENAnGkX106Qhw","flags": {},"type": 0,"text": "Halls of the Serene Eye — A storm giantess graciously hosts this undersea monastery, keeping the pupils in lavish comfort as they train in various elemental disciplines. The storm giantess gives gentle counsel and disciples her guests in methods of detached contemplation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "UlbzsMF0xmQY8CXf","flags": {},"type": 0,"text": "Cabinets of Quietude — This pacifist sect of orcs and half-orcs practices rigorous martial disciplines as a means of mastering the self, achieving inner peace, and strengthening the will. They focus almost entirely on self-defense forms. Their adobe cliff dwellings in the arid mesas are decorated with surprising hanging gardens.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "ktsPZcDS49hF1s0p","flags": {},"type": 0,"text": "The Prismatic Haven — Considered by most to be an abomination in the world, dragonborn of every hue and luster find welcome refuge here. Troubled, resentful dragonborn arrive here to be mentored by their more altruistic seniors, devoting themselves to a modest agrarian lifestyle, and to studious reflection. Once a year, the fellowship selects one of their own to serve as an Emissary, leaving the Haven as an adventurer. These dragonborn Emissaries are tasked with forming positive, helpful, reciprocal relationships with those in the wider world, commending dragonborn as trustworthy, responsible, valuable citizens.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "V8FmVgLig4lfqgl3","flags": {},"type": 0,"text": "The Theopolis — This towering temple is a feat of arcane architecture, and a world wonder, spiraling toward the heavens and dominating the skyline of this metropolitan city. All the known deities of the world are represented in this worship complex, given their individual shrines in the superstructure of this dazzlingly ornate edifice. Perfect sculptural representations of all the deities serve as pillars holding up the many floors of this super temple, looking outward over the city. The entire city has had a hand in building and maintaining the Theopolis in some way, and it is the glory of the city and the region. A temple market surrounds the super temple, where religious texts, prayer aids, holy symbols, saintly relics, and sacrifices of all kinds can be purchased.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "lOTu05ZR4Nm4itiN","flags": {},"type": 0,"text": "Catacombs of Hallowed Martyrs — Countless skeletons of many different races have been re-assembled in artful, macabre patterns covering the interior of this subterranean catacomb. Death is hallowed here as the great unifier, and the ones who willingly embraced death in the service of their deity are enshrined immortal here. No names can be found anywhere, and no one knows who is responsible for the grim beauty of the catacombs. Only the most devoted disciples of death know how to enter the skeletal sepulcher, or are willing to do so.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "hf3C2vZle68ffA97","flags": {},"type": 0,"text": "The Anchored Cathedral of the Radiant One — A floating cathedral comprised of the prows of twenty-some ships, all from different eras and cultures of sailing, arranged like a massive sunburst anchored at open sea. Merchant vessels chart their course to intersect this temple to the deity of sea, sun, and wealth, making generous offerings here to ensure safe seas and fair winds. Acolytes practice pearl diving as an act of prayer and devotion. A flotilla of warships crewed by protection paladins fend off any threat of piracy. In the place of a central crow’s nest, a huge, iridescent pearl stands, reflecting the sun’s light for miles around. Other ship’s crow’s nests are incorporated into the architecture, serving as minarets from which the clerics call regular prayers over the waters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "twRmTZrEOmz1kmIl","flags": {},"type": 0,"text": "The-Skies-Cry-Out-And-The-Mountains-Answer – Yak-folk clerics serve their savage deity at this stave church, blowing long blasts on the eight, massive alpine horns each morning, haphazardly causing avalanches throughout the mountains. The yikari priests narrate this ritual as their evoking the loud praises of the mountains for their god. These avalanches have been devastating for dwarven expeditions, mountain settlements, and adventuring parties, as the victims were buried alive, an act of sacrifice to the yikari god.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "2jiIogjzOENhV3N9","flags": {},"type": 0,"text": "The Gymnasium of Bodily Perfection – A temple dedicated to exercise, nutrition, and hairstyling. Worshippers spend hours working themselves into a sweaty sublime state of connection to their gods. There’s a lot of grunting and staring in mirrors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "Fo8owNU4cHiKSCOy","flags": {},"type": 0,"text": "The Ivory Faces – This perpetually misty ring barrow is hallowed ground, as the region primarily practices ancestor worship. Grief, Memory, and Honor swirl closely around the “Faces:” large, smooth monoliths of bone inscribed all around with the names of the deceased, and their genealogies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "squyR7SILlnA0SXh","flags": {},"type": 0,"text": "The Hammer of Heaven – A massive meteorite composed of an alien alloy, vaguely resembling a hammerhead, stands in the center of a wide basin. Surrounding the basin is a circular stoa, where the aasimar forge clerics teach acolytes metallurgy and forging as an act of worship. Sanctified masters also practice their trade, crafting unique weapons from the meteorite’s alloy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "pAdAtf05pVfnAPka","flags": {},"type": 0,"text": "Flotsam Altar – Shipwreck debris and driftwood has been lashed together with thick rope to form a massive statue of a capricorn looking out over the ocean. On the eve of a long voyage, crews will carouse long into the night around bonfires on the rocky beach, before they pour out drink offerings on the statue for safe sailing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "ksDcfSW4qJb3JsFV","flags": {},"type": 0,"text": "Grotto of the Resilient Ray – This Underdark cavern’s stone ceiling has been polished to a dark mirror finish. When the eccentric fire genasi light cleric lights his candles — all carefully arranged on the floor in the patterns of the constellations of the night sky — the reflection of stars overhead is deeply therapeutic for adventurers suffering deep madness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "5hMFvSXGXFxZSVW4","flags": {},"type": 0,"text": "The Wise and Worthy Wilds – This temple is a demiplane of untouched wilderness protected by fey spirits. It seems to be an overgrown nature reserve in the center of the city, which extends far too widely for the city space it occupies. Druids and barbarians, and any feeling suffocated by urban life who seek the chaos of the Wild, are welcome to enter the gate (a portal to the demiplane) and spend as long as they like “forest bathing” here. The centaurs that live here are friendly to visitors, and extend hospitality and rustic counsel graciously.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "RejxA4X7a4Cp4K6v","flags": {},"type": 0,"text": "Moss Cradle – This abbey celebrates and nurtures Life itself. Visitors are first struck by the sprawling gardens immaculately kept in all seasons. Exotic flowers, ancient trees, and rare herbs are cultivated for delight and peace and health, as well as heirloom orchards and greenhouses for food. Bees buzz lazily, making the honey for the abbey’s renowned mead. A cheery, playful atmosphere presides over all the activities of the novitiates, and the patients in the infirmary (often expecting mothers about to deliver), and the hermits living in the temporary havens here. Settlements from miles around bring their orphans and castoffs here, where they are welcomed and valued and schooled. A unicorn is the protector of Moss Cradle’s many children, blessing the entire region with its presence and patrolling the low stone periphery, warding against threats.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "anNdETacKy62Yu83","flags": {},"type": 0,"text": "The Tears of the Steel Mother – These chapels are found in places of war-torn turmoil, in service to a beloved deity of war, lament, solidarity, and protection. Refugees especially are under her care. As such, these chapels are hidden in remote places, kept by vigilant, compassionate clerics, and feature shield-shaped vaults filled with reserves of long-lasting provisions and durable clothing for times of crisis. Many are built near or around a water feature, either a natural spring or waterfall, or an engineered fountain or magical pool, symbolizing the tender tears of their goddess.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "tszP2Hno568rJi1T","flags": {},"type": 0,"text": "The Golden Basilica of the Sharp Eye and Strung Bow – Graceful arches soar overhead, and motifs of a golden eye with an arrow-slit pupil adorn this martial temple. War Clerics and Conquest Paladins bustle about the brightly lit corridors: they train in archery on the expansive grounds surrounding the church, as their war goddess is credited with creating the bow as a blessing to her faithful chosen; and they practice their calligraphy in the scriptoriums, recording the four Golden Oracles’ omens about wars to come.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "nPQGG3ys8s8l3iWk","flags": {},"type": 0,"text": "Court of the Lightless Fire – A temple devoted to Asmodeus or another being of great evil and law. The members of the temple act as the lawyers and police force in the town. They are surprisingly fair and helpful, or at least they appear so.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "FuXps7nbQEektBVS","flags": {},"type": 0,"text": "The Eye of The Storm – The training ground of the Stormborn, this place is atop the bluffs. There is no roof, and the monks endure the storms that rage through their home, growing hard as the cliffs, and learning from the fury of the elements.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "ofYI5zJ33x4soePO","flags": {},"type": 0,"text": "The Temple of the Last Farewells – the temple is hidden amongst a patch of Yew trees that only appears when someone truly requires it. When you enter the temple you have to fight the twelve lifeless husks of the followers of Saint Hollandaise. Saint Hallandoise was a priest of (insert death god here) who could summon spirits of the dead by calling their name for mere minutes without necromantic spells. When you defeat the skeletons (or other harder undead) and reach the end, Saint Hallandoise will appear before and call anyone spirit you wish to spend some time with and share a last farewell. With this temple you can make things as teary as you want. You can also add some puzzle doors if you would like or flush it out further as you wish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "SXEbwZnyCknehj88","flags": {},"type": 0,"text": "Old One’s Hall – After the Horde rose up and slew their tyrant god a thousand years ago; they built a reliquary cart to house its corpse. The hall is built of wood and hide, and painted throughout with vivid depictions of their rebellion and theocide. Each of its wheels is larger than a house, and when they make expedition upon the steppe, whether for trade or war, four-score oxen must be harnessed to drive it with them. The shamans who tend the Hall are said to have accomplished many things by drawing on the power of the Relic, from calling rain to bringing down sandstorms on their enemies. No outsider has ever infiltrated the hall or beheld the Relic within: they keep it always at the center of their encampment, encircled by war wagons and protected by the entire might of the horde.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "mw25xhN2gvW0JEA8","flags": {},"type": 0,"text": "Temple of the Holy Names – A monastery high in the mountains where monks are in the process of finding and uttering all the names of god. Monks meditate, calculate, and scour scriptures brought from afar in order to find new names. When the last name is catalogued within the monastery’s walls, they believe, the material world will be reabsorbed into the divine, and space and time as we know them will cease to exist. Recently, they have installed some mechanical calculating machines, which they hope will speed up the work considerably…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "TnMMJ3HlXaPe4Ckv","flags": {},"type": 0,"text": "The Timeless Library – A deceptive looking building from the outside. The cylindrical temple appears to be small and in ruins but inside it is countless stories tall and in perfect condition. It has an impressive collection of books dating back before the current kingdoms even existed. It has one librarian that knows the location of any specific book you might be looking for. However, the librarian is bound to the library and so long as they do not leave the temple, they will not age. If they do step out, the librarian will age all the time they were inside instantly and the library will rapid decay. Only a new librarian to be bound to the temple library will restore and maintain the structure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "JIMPdMXQ2NkneL2E","flags": {},"type": 0,"text": "The Portable Temple – The temple is marble and resembles a miniature version of a temple with a small stone statue of the Traveler. The entire thing is no bigger than a backpack. An acolyte carries the temple on their back as they travel throughout the land, praying to it in hopes of guidance and helping others. The temple is heavy to carry but the acolyte has practiced to the point that it is no longer a hindrance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "ku2kyrio0hvlpvy3","flags": {},"type": 0,"text": "Asylum of the Still Mind – A bastion dedicated to a forgotten god of balance located in a repurposed illithid’s lair. Adherents act as monk hospitallers to those with minds broken by spell casters or eldritch beings. A complex series of surrounding wards inhibit aberrations and mind magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "Z1Vp2SJz3kTdD3TJ","flags": {},"type": 0,"text": "Lotus Sanctum – A metaphysical monastery located only in dreams. Students practice throughout the world, maintaining tutelage through rigorous consumption of sleeping potions. As their bodies fade from disuse they compensate with unparalleled mastery of ki.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "XzrTWiixlULJGW5T","flags": {},"type": 0,"text": "Hexbane Abbey – An extraplanar repository for strange and cursed artifacts. The monastery was founded by a group of skilled witch hunters who act as both archivists and guardians. The deepest vault houses an iron maiden where the first masters sealed the Brood King long ago.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "zNjoGCPujINqfVG5","flags": {},"type": 0,"text": "Cathedral of Ash – Cathedral-like in construct and built out of a white metamorphic stone, a temple dedicated to deities of fire and all things infernal. A 25ft-diameter fire burns in a massive brazier in the middle held aloft by bronze chains, a large hole in the ceiling above to let out smoke. The brazier hangs above a large circular pit only a few inches greater in diameter. You swear you hear something coming from beneath. A library containing tomes and documents on demons named and nameless is attached to the main structure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "z5c3mZxreNr5NVEL","flags": {},"type": 0,"text": "Stonepushers’ Temple – A constantly changing temple to the gods of strength built from large blocks of stone that are pushed around in new configurations frequently. Prayers are written onto the sides of them, so pushing them is a form of both prayer and practice. Some parts of the temple stay constant for the sake of practicality, but much of it is constantly in flux. During the day, many of the disciples work at a mine nearby.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "bBeYtA94CdcQOhxw","flags": {},"type": 0,"text": "The Storm Pillars – A series of naturally formed pillars of stone roughly 200+ feet tall, each capped with vegetation through which the buildings are faintly visible. The area gets unusually high precipitation. The disciples are known for climbing the pillars and meditating during storms – peace in the chaos of the storm. They sleep in hammocks and colorful cloth structures anchored to the side precariously and seem to fear no heights.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "nBVT8gJti6OAb1Ca","flags": {},"type": 0,"text": "Four Fang’s Rest – The meeting place of dimensional dragons whose bodies incorporate temples devoted to the four elemental planes. Genasi bards and wizards use these shepherds to pass between the elemental planes and the conference is a peaceful biannual meeting of the minds to swap song and spell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "bIs8L6FVwd2va6oj","flags": {},"type": 0,"text": "Raindrop Retreat – The monastery is a collection of open pagodas built on a chain of small islands stretching out into the placid fjord. Quiet peace pervades as the disciples meditate on the still waters and train in water walking.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "tybVAgqJRQKcadD7","flags": {},"type": 0,"text": "The Crown – A temple to the Lord of the Forest, hidden from all but the most perceptive, nestled in the center of a circular copse of 16 white oak trees. Markings in druidic warn of the dryads who keep the temple grounds. An offering of water from a naiad’s pool ensures safe passage through this region.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "aRDKdNPZSfZbt3Dp","flags": {},"type": 0,"text": "Rhmbhelm Enclave – This mountain retreat is kept by a Goliath village, under the stewardship of an earth genasi. Pupils train with tetsubo great clubs, mastering feats of rugged endurance, stony resolve, and daring courage on the cliff faces. The rite of ascension is to slay one of the wyverns that roost in the cliffside aeries.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "QcGZ3UFTDR7wa83H","flags": {},"type": 0,"text": "Abbey of the Open Heart – This discrete abbey, dedicated to Love, is not what people expect when they enter. It is not sexual love that is hallowed here, but tender, compassionate charity. The only beds found are for the homeless and sick. The only pleasures found are in rustic bread and clean water shared simply with the city’s hungry and poor. The main entrance is located behind the edifice, not to protect the identities of supplicants, but to preserve the dignity of the needy. Instead of drawn curtains, soft shadows, and innuendo, worshipers find the stark, naked realities of poverty, and discover there an improbable beauty that stirs the heart to selfless action.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "WGGbxW1alt2RlfDP","flags": {},"type": 0,"text": "The Way-Watcher’s Pocket Shrines – The Way-Watcher, a deity of travel and commerce, once gave these septagonal medallions to tinkers, his favored charges, packing their inventory cross-country, vulnerable to brigands. With a brief prayer invoking the Way-Watcher, and an offering of a gold piece (which is consumed), the medallion conjures for the traveler a small divine shelter: from the outside, the shrine has seven lustrous black walls traced all over with intricate, radiant gold threads of divine magic, and no discernable doors; within, the traveler (and up to six companions) are accommodated luxuriously on low divans in an aromatic, well-lit pavilion. A warning to the interested: there are now counterfeits of these relics being manufactured, but never to the same level of quality, and quite often to harmful or even disastrous effects.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "5wKaWGzWoeyNr0oe","flags": {},"type": 0,"text": "Howl House – The folk living nearby do not worship at this ancient chapel, having found newer gods to worship than the Primordial Wind. And yet, they cannot ignore this small ruin on the moor, as it emits a voice-like, plaintive tone whenever a strong wind is about to blow past. More than once this structure has saved rural herders from deadly storms, warning them in time to seek shelter in the nearby grottos. Anthropologists have studied the chapel’s construction, finding artfully placed tubes and channels in the stonework that redirect winds into musical pitches, like a static pipe organ. Even the slightest breezes produce haunting strains within the brown stone room. Many signs indicate this chapel was built by hill dwarves who were both awed and terrified by the region’s severe winds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "qzIxCn1ObQJTkzqu","flags": {},"type": 0,"text": "The Well Within – a psychic sanctum preserved by Githzerai, accessible only to initiates who have been given a linked grounding item. Meditating on this item (a child’s game piece, or a bone, or a rare coin, just so long as it is unique and meaningful) draws the visitor’s mind into the Well Within. There they appear much as they would on the Astral Plane, or as per the Astral Projection spell. Once there, their minds find clarity and peace in the surreal arboretum, training under the crystalline trees’ cloud-like foliage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "RxemYu9WF2o9uEiw","flags": {},"type": 0,"text": "The Chambers Luminous – This temple to Beauty houses a thriving and diverse artist community. The entire city district seems to point to the dazzling edifice, with its bright banners streaming and glass mosaics shining. Art patrons of all kinds bring gifts and offerings to provide for the many works being created within. Music is perpetual, and bards stand in the many antechambers to lead worshippers of Beauty in reverent devotion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "EPhbRZcxBXJ4pkba","flags": {},"type": 0,"text": "The Nests of Fa-Roth-Sir – The four elements neighbor beautifully on this volcanic island. The Aarakocra monastery here trains in mastery of the forces of nature, dwelling in elaborate, nest-like, wicker apartments.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "GBk6aLLsb1bSfhEp","flags": {},"type": 0,"text": "The Enigma Vaults – The monastery’s wide, low ziggurat almost blends into the horizon. The Shadowfell encroaches on this savannah like a panther stalking its prey under the acacia trees. The initiates of the monastery built here commune with the intruding plane, drawing its power and learning its secrets. Unfortunately, an increasing number of shadowed blades are emerging from this ziggurat, granting power-hungry opportunists remarkable eldritch power…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "Wdu0LjcOsEFZoJHX","flags": {},"type": 0,"text": "High Sight Monastery – The martial candidates here live, study, and train in their floating tower. They spend hours a day honing their skills with polearms, favoring dance-like forms with dual-ended spears. The tower floats over arctic seas, where anklut hunt in pods.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "mWLCMYh3yMfCE32x","flags": {},"type": 0,"text": "The Pilgrim Sanctum – This sanctum was once a graceful, stone structure summoned from the earth by druids as a waystop for pilgrims and hermits. Eventually a group settled there, and, in an effort to maintain their pilgrim lifestyle and bring their message of simplicity and detachment to others, they summoned a zaratan (MToF) — named Bonshu — beneath the artful abode. Now the merry men are always on pilgrimage, and a fellowship has begun following them across the world. Their procession can be heard from many miles around as they go, singing and making music all the way.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "4aOMfvhjgXloQY6U","flags": {},"type": 0,"text": "The Shaded Canopy – A shadowy gigantic tree in a forest home to wood elves who practice the way of the sun soul to fight in total darkness, conjuring arrows of light.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "wUejPo2vm37mBYP4","flags": {},"type": 0,"text": "Temple of the Blessed Malt – A Brewery-temple devoted to a god of Merriment. Features a brewery and taproom as well as places for travelers to offer tribute for safe and happy travels. Warm beds and beer available in exchange for a donation. 1/2 off pitchers on Wednesdays.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "2Prz6ToZEp2ei6yc","flags": {},"type": 0,"text": "Temple of the Still keepers – A small structure off to the side of the burial grounds of a large city. The few devotees there study a variety of funereal rites so as to provide appropriate services for the diverse inhabitants of the city. Technically worshipers of the gods of Death, but far more tolerated than usual due to their benevolent nature and abhorrence of Necromancy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "OacfvEnq6IMOzf2G","flags": {},"type": 0,"text": "The Temple of the Wind’s Bounty – A rural place of known for its farmlands and array of windmills. The resident clergy produce flour and baked goods and participate in stewardship of the earth and blessings for the farmers in the region. They oversee offerings for bountiful harvests and try to avoid becoming embroiled in violent or political conflicts. That said, there is a well-known account of the resident clergy fending off a raiding band armed only with their farm implements and not losing a single member.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "JPivfhH8xBxkRQVn","flags": {},"type": 0,"text": "The Temple at the Martyr’s Cliff – Built on the holy site of a Saint’s plunge into the sea below, having chosen death over the renunciation of her faith, the temple grounds offer a picturesque view of the sheer cliffs and oceans below. It has become a frequent destination for the suicidal many of whom find their minds soothed at the last moment, turning away from the cliff only to be embraced by one of the clergy. The benevolent reputation of this shrine has earned it protection from numerous marauding armies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "V24Vo4C9XZAbyBbk","flags": {},"type": 0,"text": "The Hospice Church of the Merciful Mother – Offering healing services for all, the Sisters of the Church attract philanthropic donation from a number of wealthy patrons and provide healing and medical services free of charge in a variety of communities. Due to their policy of being open to all, the order has seen itself charged with high treason for treating enemies of the crown many times, though their considerable political sway has always seen them absolved of these charges.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "ug1l4gCMJpFMxSGJ","flags": {},"type": 0,"text": "Temple of the Great Court – Serves as a court of law in the city. There is a zone of truth as soon as you enter the court room.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "lwgvINzDJqQgF11F","flags": {},"type": 0,"text": "The Secret Monastery – Built in order to protect the world’s greatest secret. In fact, contains a well-guarded parchment that reads, “Alice has a crush on bob”. Not even the monks know whether this is all an elaborate prank, or whether it’s a distraction from the true secret, which remains hidden somewhere inside the temple.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "3GSgL3YFUdJ3sXEt","flags": {},"type": 0,"text": "The Everfountain Temple – This temple is dedicated to the worship of a water goddess. Built behind a waterfall, it is hidden from sight and many pass by it without noticing that it is there, although they are welcoming to visitors. Inside, the waterfall’s roar obscures sound, which priests believe aids in meditation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "JOcCRTwVHJYkVN5p","flags": {},"type": 0,"text": "The Temple of Knowledge – The entire temple is a gigantic library. Every single wall is covered in shelves of books. The priests are librarians. There is a permanent silence spell cast inside the temple, keeping it absolutely silent at all times.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "x361DfyU0bVdF6Dq","flags": {},"type": 0,"text": "The Frozen Temple – This temple located inside a tall iceberg locked in place by a frozen sea. The floors are connected by stairs and slides carved into the ice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "CX0iNoNtD2u8iI0z","flags": {},"type": 0,"text": "Clockwork Monastery – This small monastery is built in a great clock tower in the center of a city. It is built around the gears with the carillon directly above.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "32KvIbiRZgKrEhYJ","flags": {},"type": 0,"text": "Ra Monastery – A large rectangular stone complex with patterns and reliefs etched into the ground. When the world continues in its cosmic cycle. The sun’s rays, obscured by portions of the stone complex, charge particular markings and reliefs on the ground. The charged portions glow vibrantly throughout the night until they need to be charged the next day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "qksYgU0dtxzaHOC2","flags": {},"type": 0,"text": "Temple of the Fighting Cocks – a once all-male and now newly-coed monastery that raises the tastiest chickens in the land. Acolytes have to fight well-trained roosters: the monastery produces the quickest and deadliest monks in the land.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "hqXzNnyljGeYM7Ge","flags": {},"type": 0,"text": "The Tip of the Iceberg – This monastery is built inside a massive iceberg. Only the surface level is open to the public however. Only members of the order are permitted to go deeper. Only the High Priest is allowed in the deepest level, and only he can give permission to go there, although he does so rarely.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "wpzXtdNsuq4DJfz2","flags": {},"type": 0,"text": "Temple of the Living Rock – A Dwarven fringe group that believe the planet is a living being, and the tunnels dug by Dwarves are its arteries. They seek to live in harmony with the soul of the Living Rock and to steadfastly dig out its body.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "MzPNzN3m2C9x0IML","flags": {},"type": 0,"text": "Monastery of Cascading Water – This Monastery is built on the jutting rocks that poke out from an enormous waterfall. There are no bridges between buildings, as the monks who made their home here were known for their water walking ability and aquatic manipulation. They would ride the roaring waters up and down the waterfall.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "ht6ga73JvKyzI9rz","flags": {},"type": 0,"text": "The Wayfarers Mirage – Hidden in plain sight, many people speak of this temples existence but few ever see it. Located in a large salt flat that seems like nothing more than deserted wasteland for miles. This temple is visible after rainfall leaves a reflective thin pool in the salt flat creating a large mirror miles wide. Upon looking down in the mirror or water the temple appears visible & the adventure must use this reflection to attempt to enter its hall. Many wanderers see the temple in small pools or water or mistake it for a mirage and go mad hence its name.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "uyD836qMdm4rl6sR","flags": {},"type": 0,"text": "Monastery of Radiant Combustion – This curious monastery is located in a sunny green valley paradise high in the mountains and watched over by a powerful Kirin. It is inhabited by Aasimar Monks who train and live their entire lives to become living weapons. One day each will be given the honor to go out into the world and face down evils that cannot stand up to the radiant energies naturally exuded from their bodies. These Aasimar warriors know that they will die in their set task, but face the task gladly if it means that the people of the world might be safe from demons and undead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "PVbxYEpDdOXOgefK","flags": {},"type": 0,"text": "Temple of Supreme Knowledge – A small mailbox sized quartz cube with it’s name engraved on the side. A series of runes on its front depicts the location of the key needed to open it. Inside is a book with all known library addresses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "v9eNsnxdFZmVr3cI","flags": {},"type": 0,"text": "The Green Monastery – Occupied by a strange order of druid monks, the Green Monastery is located in the deepest parts of the primordial wilds. Here, the monks tend to gardens full of rare plants, commune with the Demi-Gods of the forest, and provide care for sick and wounded animals. Here, mortals are safe from threats such as the Wild Hunt, unless they do something to harm the forest or it’s denizens.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "fuim7q0Hi8k0BqCG","flags": {},"type": 0,"text": "The Burning Tree – a massive tree hanging above an active volcano. Druids live in the branches, meditating in peace. Whenever the volcano erupts, the surviving druids all plant a new seed and use their magic to grow the tree back to its original size. The monks that train above the lava are known throughout the lands for their resistance to fire and their ability to hold their breath for long periods of time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "dsbxDWgwan2ZZo3J","flags": {},"type": 0,"text": "The Temple of Masks – Originally the headquarters of a forgotten order of spy-monks, the Temple of Masks has since become a place of worship dedicated to Cromos, the Dual natured moth-god of secrets, magic, and causality. Here the priests (all former master spies) deal in secrets, lies, and plots, all of which please Cromos just as much as conventional prayers do The temple also maintains a strict “no-killing” rule which is enforced by a collection of magical constructs controlled by the temple grandmaster. The Temple gains its name from the masks worn by those who enter the temple grounds; visitors receive ornate and outlandish masks, while the clergy receive special shapeshifting masks, better to charm secrets from their worshippers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "msHby38Vn81YijSl","flags": {},"type": 0,"text": "A library serves as a joint temple between worshipers of the Deities of Knowledge and Invention (Oghma, Milil, Deneir, and Gond). A series of mechanical bookkeepers deigned and built by followers of Gond keep track and guard the millenniums of knowledge.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "HkyffpVpcpyyd8qU","flags": {},"type": 0,"text": "A temple built around a supposed gateway to the Feywild. The gateway is locked away deep in the most secure area of the temple, where only the highest-ranking members of the clergy can access. Only they know the secret of the gate: It hasn’t worked properly in a century.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "Zd58GZnlqN9TrV4J","flags": {},"type": 0,"text": "The Most Blessed Eatery – many ‘temples’ with some variation on this name exist. Most are family-owned restaurants who pass down a set of secret recipes, dishes they claim impressed their god of cuisine when he appeared to them. All are free to come and eat. The families subsist on donations from the locals. Families likely have intense rivalries with each other, especially if they coexist in the same district or town. The god’s followers believe that if they share their secret recipes with others, their ancestors will be cast out of the afterlife and their own judgment will be put into question; they also believe that they must continue on the same tradition of cooking to appease their ancestors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "338c54yQArh2XDg8","flags": {},"type": 0,"text": "Temple of the Merciful Moon – a ziggurat of black and grey stone, polished in many areas using a special technique to reflect moonlight especially well. It’s built so that the local river runs down the middle, with a cliffside waterfall pouring down into the northern end of the ziggurat; the water fills channels and pools before washing out to the lands below. Clergy perform healing and therapy for the injured and traumatized who find their way to the temple’s steps, and mummify the recently deceased before setting them on a journey down the river. In the glow of a full moon, the high priests bathe in the central chamber pool and receive visions of what suffering they will be tasked to alleviate in the coming months.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "mjxx4guvwCZb8TQA","flags": {},"type": 0,"text": "Three Sisters’ Convene – three separate temples situated on adjacent limestone cliffs, each dedicated to a sister goddess; the red one Discipline, the blue one Compassion, and the yellow one Righteousness. Under their vaulted domes, each mountain temple trains their disciples in a specific philosophy, martial art, and style of magic. The three temples’ cliffs are connected by wide stone bridges to a central pillar, housing a pagoda where the disciples duel and debate each other. This isn’t to prove one sister’s teachings superior to the other, but because their philosophies are meant to be tested against each other to achieve a better understanding of oneself, morality, and the wider world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "mmZizf3a3MBw50V5","flags": {},"type": 0,"text": "Monastery at Macchana – the brotherhood of monks here all came from a military background. Other places of worship from the same faith send them young men who need discipline and order in their lives. The monks train them into peerless janissaries who master pole and chain weapons, while also learning the word of their god. Each don a crafted metal mask upon the completion of their training, and are used as inspiring military officers in this country.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "5UcDepNa7cqzYMw3","flags": {},"type": 0,"text": "The Anteschatonal Nexus – this strange, three-sided pyramidal temple is constantly undergoing repairs. Everything, from the architecture to the mosaics to the holy symbols and genuflections, all contain incredibly complex geometrical designs with perfect trilateral symmetry. The clergy believe that as long as the temple stands, with its geometric wards in place, the region is protected from some cataclysm that will happen sometime in the future. Certainly, there have been no disasters, natural or otherwise, in the region ever since the temple was refurbished several decades ago. Yet the temple itself still continues to undergo mysterious incidences of severe damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "OWrg6L1ENPVIi84Q","flags": {},"type": 0,"text": "Circle of the Wandering Order – long ago, a nomadic people discovered writing. This forever changed their religion, which was focused around wandering to accrue new stories and experiences. A schism split the people, with some wanting to settle down and write down their oral traditions, while others wanted to continue with the old ways. The Circle was created to heal this divide. A large, circular white stone gazebo amidst grasslands, the Circle sits atop a subterranean library of holy texts. An ornate metal cage sits between its pillars, containing a dull white orb of light. As the priests sleep on their bedrolls next to it, they commune with other priests traveling abroad, and take in their stories to write down later.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "eZ0PyYdWLV5wWY1X","flags": {},"type": 0,"text": "“The Shortcut” – This ‘temple’ dedicated to a trickster god appears to an outsider as a simple alleyway. In truth, the alley is it’s own pocket of extra dimensional space, with the exit and entrance to the alley corresponding to completely different places. It is common for worshipers of the trickster god to direct those who are lost through “the shortcut”, only to have them end up on the other side of the city, or in another city entirely.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "d3jqNvXpBwVH3xRE","flags": {},"type": 0,"text": "The Den of Vulpec – a single-story monastery surrounded by the forest and centered around a garden with a tall natural rock outcropping. An unroofed gateway-flanked path leads to the garden from the outside. Fennec foxes roam the grounds alongside the monastery’s humble clergy. Anyone who climbs to the top of the outcropping would see a tight cave mouth, in which the patron spirit of foxes is said to make its home. The monastery has a cellar for fermenting wine; the cellar connects to a dark grotto beneath the garden where the monks pray routinely.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "uYYmqRT5xJcJPvRE","flags": {},"type": 0,"text": "The Asballicuo – as old as the city itself, the Asballicuo is its heart in more than just a geographical sense. Under the watchful eyes and fiery inspiration of their god, guided by dutiful priests, ordinary craftsmen perform wonders. The temple-forge is always running, supplied with materials mundane and exotic from pilgrimages, divinely chartered trading routes, and tithes from campaigns of conquest. All things created here – from armor and clothing to glasswork and furniture – are of excellent craftsmanship and are blessed with unusual properties by the god of labor. Of course, care must be taken not to abuse the works of the Asballicuo, for its god’s blessings might become curses when misused.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "ZPwVrtDzl4XRLq2g","flags": {},"type": 0,"text": "The Old Mounds – ten artificial oblong hills spread over nine square miles are all that remain of an ancient culture. Each is roughly the same size, and each have a set of stairs that run up one side and down the other. A fortified cathedral and its surrounding village lie at its outskirts. The priests document all the specific paths one can take when walking the ten hills, at different times of day, in different orders, in search of the ‘shadow mounds’. These are artificial hills that lie in both the Prime Material Plane and another plane of existence, but can only be found by walking a specific path in the old mounds. So far, the only empirically documented shadow mound leads to the Shadowfell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "X7Jo0O1kpkulPlYG","flags": {},"type": 0,"text": "Temple of the Peregrine – this large, granite-hewn temple has three progressively larger chambers each shaped like a trapezoidal prism. A straight brick path of orange feldspar connects all three and leads out to where it connects to the local town’s roads. The first chamber is for purification, where guests shed their shoes, have their feet washed, and are otherwise cleaned; this is a public service that both trainee clergymen and volunteers perform. In the second chamber, guests may pray quietly for guidance and direction on prayer rugs, or they may offer alms at the central altar (which the feldspar path weaves around) in order to bestow good fortune upon a journey. The third chamber is strictly for clergymen to pray and fast- it is closed off to the public.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "fos8xO8iEHosbIwn","flags": {},"type": 0,"text": "Journey’s End Monastery – A sacred temple built by retired adventurers in the husk of an ancient castle. Here, many adventurers that no longer have a family or anyone to go home to can find their place and be surrounded by many other like-minded people. They share stories and song of their adventures every night. This location has an aura of stillness and peacefulness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "wHhuPtVJ1ED3DaXi","flags": {},"type": 0,"text": "Wind Song – A monastery built within the ruined remains of a large grounded sailing ship. this place is guarded by a tribe of humans that worship the sea and the wind. In order to even step foot inside, you must have at least spent 15 years of your life at sea. A large whalebone altar has been set up in the center of the temple, where this tribe prays to their god for good weather and safe sea travel.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "5PJcWxJ8OXAhvaZF","flags": {},"type": 0,"text": "The Rotten Cathedral – A massive cathedral built in the center of a massive graveyard. Many aspriring necromancers make a pilgrimage here to learn their vile craft. Those that have been inside have told stories of massive bone golems that guard the halls. It is said that a massive fountain of ectoplasm is located on a lower level of the cathedral, and newcomers must bathe themselves in it’s horrid goo. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "Q6CgYRhpITmMDqUT","flags": {},"type": 0,"text": "Temple of the Frozen Wastes – This incredible structure is entirely carved from ice. Due to the frigid temperatures of the region, it never melts and hasn’t for hundreds of years. It was said to have been build by frost giants before they all traveled farther north. Today, it is a safe haven for travelers who wish to get out of the frozen winds and rest a while. Some say that you can still see the frozen corpses of frost giants within the walls if you look hard enough. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "8W0m3DEjmGhL0NHj"}
