{"name": "MORE Darklords and Domains for the Ravenloft Setting","description": "Another 100 Darklords to terrorize your players with.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "xhMmxaNwyAiKQZg8","flags": {},"type": 0,"text": "Karpador, the Frog Prince was a handsome man who used to court plain-looking girls, only to mock them for thinking that a man like him can actually love someone who looks like them. He was cursed to become a giant toad-like creature, bloated and utterly repulsive. He lives in his palace in the middle of the swamp, surrounded by giant frogs, toads and similar monstrosities. His curse can only be lifted should he be kissed by a girl who truly loves him, but it is most unlikely to happen with his terrible looks and behavior. Those who fail to do so, he swallows whole.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "bU68TNJeYTGQ53CU","flags": {},"type": 0,"text": "Monarch was a control-freak despot who was adamant about having everything going according to his will. Now he dominates completely the whole population of his Roman-like domain, and no one can move a finger without his mental orders. It gives him the perfect army and workforce, and he can even merge them into a colossus made of human bodies; but he has no one to talk, play or have interesting relationship with, only poor automaton-like subjects living their miserable lives in ultimate enslavement.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "Jct5uzKaGIbvtaPz","flags": {},"type": 0,"text": "The Hydra were seven princess sisters who constantly fought and bickered among themselves, while their kingdom fell apart around them before armies of monsters. Their ugly heads are now posited on seven serpentine necks of a giant hydra-like monster, so they must share the same body and cannot escape each other’s presence. Their domain is the ruins of their kingdom, full with twisted, chimeric monsters. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "JfUrEzM6OAWqwkpP","flags": {},"type": 0,"text": "Darkshade is a masked, dark super-hero, who went too far in his war against evil, becoming brutal and merciless. His domain is a huge Gotham-styled city, full with mad villains and grim antiheroes in costumes, the line between which is close to nonexistent.   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "6tdSR7Mu9MF2nnGE","flags": {},"type": 0,"text": "Valeth, the King of Thieves. Theft can ruin lives no less than murder. Denizens of this crime-ridden domain live in fear from the legendary King of Thieves, against whom no fortress is safe, who takes pleasure from stealing people’s dearest possessions and secrets. Nobody suspects that the honest-faced chief constable Valeth, who brought so many criminals to justice, is also the veiled King and guild master of thieves. He uses his double position to maximize his power, manipulating law and crime against each other. He is cursed to have everything he holds dear stolen from him, as he steals from others. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "PG9Q5ifDRiYjBEzY","flags": {},"type": 0,"text": "Milton, The Monster Man is a shy, stuttering man, until he puts on one of his many monsters’ costumes, transforming into a real monster and goes on a hunt. He can become a vampire, werebeast, golem, demon or any other humanoid creature, gaining all its powers and weaknesses. He plans his attacks like scenes in horror film, meticulously preparing the setting beforehand and foreseeing the probable reactions of everyone present, to create the maximal horror factor. Milton’s greatest wish is to be adored and respected as he is, but nobody ever takes him seriously, so he turns to his monstrous forms in order to get the respect he craves.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "ESV2vEOklWGzzQpo","flags": {},"type": 0,"text": "Lorna, the Ghost of Depression was a noblewoman given to fits of deep depression. In one such a fit she murdered her whole family, children and husband, then committed suicide. Lorna’s ghost dwells now in a domain embodying depression: an eternally dark forest surrounded by a dark sea, with a ruined castle on a cliff near the shore. Visitors to the gloomy domain will quickly be affected by the palpable aura of depression and despair, forced to struggle not to lose their will to live. There are no living denizens in the domain, but colossal shadow animals walk in the dark forests, waiting to swallow those who give in to despair. (Inspiration: the art of Dawid Planeta)  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "El9EJia3TAZNufDs","flags": {},"type": 0,"text": "The Cyclops Queen has an athletic, muscular body and beautiful pale hair, but the hideous face of a single-eyed cyclops. She stands 12 feet tall. She was known for her ‘two-dimensional’ view of the world: in her mind, either you are totally on her side, or her worst enemy – and she tortured and killed many people for failing to meet her standards of alliance. She was cursed to have the visage of cyclops, and can use her gaze either to heal completely or to destroy instantly all flesh in her sightline. Her subjects do their best to prove themselves loyal and admiring, hiding their fear and loathing toward their monstrous ruler.   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "jU3HiYFqefJqVu4h","flags": {},"type": 0,"text": "Sweet Sue was born to a deranged family in a hopelessly squalid neighborhood, and suffered all Imaginable kinds of abuse from about anyone in her life. With time, she found she can project her experiences into other people’s minds, making them feel her physical and mental anguish as if they were experiencing it themselves. She used it to drive everyone around her insane. She also found she could absorb traumatic experiences felt by others, feel them herself and project them too. She became addicted to those sensations, and started abducting people and subjecting them to all kinds of torture, feeding on their anguish. Her domain is a nightmarish asylum, drawing especially abusers and abused. Sue is a sweet looking young girl, but she can drive one through nine hells of mental tortures from her rich collection, breaking his or her sanity in moments.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "Et7E5rjpBx7e1iSV","flags": {},"type": 0,"text": "Blackwater, the Elemental was a murderer who used to drawn his victims, and even flooded a whole town by ruining the river’s dam. In his domain rain falls ceaselessly, being a source of both life and death for the denizens of the large city around the lake. Blackwater lost his human shape, becoming a water elemental. He dwells in the central lake, sewers and canals of the city. He controls water and may possess victims by touching them with even a single drop, transmuting their blood into water and making them zombie-like undead. He might possess several victims simultaneously, but their bodies dissolve quickly, forcing him to reassume his watery shape.    ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "YjBlg5NUYJaFuoHN","flags": {},"type": 0,"text": "Ommadon, the Dracolich rules a kingdom of undead dragons. His island domain is a dark and misty wasteland of vast swamps, dense forests and bleak mountains. The human denizens are mighty Viking-like clans, some of them struggle courageously against the undead dragons and other beasts, while others worship them, sacrificing virgins in hope to avoid their wrath. Ommadon came from a world where dragons and humans lived peacefully, but he led his brethren to betray the humans, initiating a war between the two races. In the end, the human mages unleashed terrible power that wiped all dragons from the face of that world. The Dark Powers granted Ommadon his wish for kingdom, but victory tastes like ashes to him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "5DRXrDjLzW8HLPUt","flags": {},"type": 0,"text": "Lord Kraken is a strong, bald man with horribly deformed face. Ruler of a naval kingdom, he tried to dominate an ancient, powerful kraken and use it for his goals, but ended up having the kraken’s mind merged with his own, leading him to madness and evil. Now he rules the Hovering Islands, which float in a sea of mists. He can summon huge tentacles out of floors, walls or air, and control them. His pirates ride flying sharks, bringing terror to the hearts of the islands’ denizens. The Hovering Islands are a strange, somewhat alien archipelago, where unique bizarre creatures and phenomena can be found. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "5q3JktqRru7vbP3J","flags": {},"type": 0,"text": "The Nobleman Ghost. The veil between the worlds of the living and the dead is thin in this domain; ghosts are aspects of everyday life, found everywhere. Most are harmless echoes, replaying cyclically moments of their lives. They look like the living, but are incorporeal and unresponsive. Other ghosts are darker and more dangerous, and several organizations struggle to banish or destroy them. The darklord, who looks like a ghostly gentleman with transparent head, wearied the border between the worlds in his attempts to bring back his dead wife. Now he is trapped between them, trying relentlessly to expand the rift further. His efforts only result in the release of more evil ghosts upon the world. (Inspiration: the movie I Still See You and the book series Lockwood & Co.)  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "egAo1EfHXeNOL65P","flags": {},"type": 0,"text": "Gregor Kavka, the Judge. This domain is a surreal, Kafkaesque bureaucratic nightmare, where peoples struggle to survive in an absurd, over-complicated law system which nobody understands. Peoples are getting arrested, judged and punished without any idea what is the charge against them, and even the simplest act is accompanied by maddening bureaucracy. The domain embodies the existential horror of absurdity, meaninglessness and lack of control.  The darklord, Judge Kavka, is responsible for the creation of this system, though now even he can’t control it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "iNfRoBL4RonP8Pw6","flags": {},"type": 0,"text": "Alma Dietrich, the Divider and Conqueror. An invisible wall cuts this domain and its capital city in their middle, dividing it to two halves – the thriving north and the impoverished south. Similar walls appear in other places, separating towns, families and individuals, permanently or temporally, representing the horror of helplessness before impassable barriers. Those force walls are formed by the will of the General-Princess Alma Dietrich, a cold-hearted blond beauty, who uses them to control the population she conquered with her army. She can create and dispel such walls at will, to protect herself or trap her enemies, but is cursed to always find them blocking her away from what she desires most.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "L9L3sWlfHjIn7ZaR","flags": {},"type": 0,"text": "The Veiled Mistress was an exceedingly cruel medusa witch-queen, who turned many people and other creatures into stone, reanimating them as living statues under her command. Now she is cursed that seeing a human face will petrify her instead, for a year at least. Terrified of this possibility, she covers herself in veils blurring her sight, staying secluded in her darkened castle, surrounded only by her stony servants. She can still petrify humans by uttering their names, and therefore she makes efforts to find out the true name of everyone in her mountainous domain.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "MeBkzKwwnF8sXLVk","flags": {},"type": 0,"text": "Malachai, the Angel Maker. This religious-apocalyptic-themed realm is constantly plagued by hordes of demons and evil spirits. In order to fight them, the high priest Malachai recruits brave young boys and girls, who, after special trainings and secret rituals, join the Order of the Angels. They sprout powerful wings and get some mystical abilities to fight the unnatural beings. What they don’t know is that when one of them dies or succumbs to evil, he or she is transformed into a demon – that’s where those beings come from. Malachai is purposefully maintaining this cycle of endless battle in order to harvest the negative energies released by all the suffering, and keep the people’s faith in the church. (Inspiration: Engel RPG)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "dxDzMwtAsMrZYGHX","flags": {},"type": 0,"text": "Gargantua is an unbelievably huge, ever-ravenous giant. He has eaten entire towns and herds of animals. Now he is buried up to his neck in the ground, only his hideous head protruding out. His domain is a land of men-eating giants, much smaller than him but still terrible to behold. On stormy or misty nights, they travel to other domains, kidnapping humans to feed their master and themselves. The few humans in the domain live in hideouts in constant fear, trying to survive unnoticed by the giants.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "jtcT4geDnGhOrzcb","flags": {},"type": 0,"text": "Doctor Brain is a scientist devoted the research of the human brain. He has experimented on many humans and other creatures, always looking for ways to further improve his already supra-genius intelligence and brain functions. He is a small man with oversized bald head, which seems to be about to burst by the brain inside. His intelligence is super-computer-like, and he has vast psionic powers. Unfortunately for him, all the denizens of his island are all idiots and imbeciles, unable to appreciate his genius and of little value for his experiments. He sends his minions (including a neh-thalguu and several mind flayers) to search the domains for outstanding brains to bring him.      ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "5UqOpP383qKvU7Lj","flags": {},"type": 0,"text": "The Lonely Princess is perhaps the least known of the darklords. She was a beautiful princess, and suitors from all the realms sought her hand. She toyed with them, pitting them against each other, leading to several bloody wars. Now she lives completely alone in a castle in the middle of a dark forest. Every night she watches the road leading to her door, waiting for someone to come to her, but the road remains empty. There are legends in the nearby realms about the Lonely Princess, but everyone who enters the forest is either killed by beasts or undead, or loses his memory of her and leaves before he gets to the castle. The princess is willing now to marry just about anyone, but is cursed to remain alone forever. (Inspiration: Nathan Alterman’s ballad ‘Night’)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "ykvLINmGqvPurUCc","flags": {},"type": 0,"text": "Sama, the False Prophet has milk-white eyes, but is not blind as many assume. From young age he pretended to be gifted by prophecy, fooling his community with vague or self-fulfilling predictions and convincing them to obey all his orders lest disaster befall them. In order to preserve his power, he told his community that the end of the world is coming, and led them into underground caves where they could survive the cataclysm. His domain now is a vast underground city, built around Sama’s shrine. The denizens believe the upper world is ruined, poisoned and inhabitable. Sama summoned monsters to wander near the city, making sure nobody ventures out to expose his lies. He has the power to inflict permanent blindness and deafness. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "fdgWZxZ789nlonKx","flags": {},"type": 0,"text": "Erebus Karanok, the Annihinator, was a member of House Karanok in the Forgotten Realms, who worshipped the sphere of annihilation called Entropy, feeding her with many innocents. He became obsessed with the concept of annihilation as blessing, and eventually threw himself into the sphere, yearning for the peace of absolute oblivion. The Dark Powers, however, kept his mind intact and merged it with the sphere, transforming Erebus into a deadly umbral blot (blackball). He can destroy everything with his touch, but his existence is eternal torment of unfeeling emptiness. He hovers in the center of his temple domain, projecting his image into dreamers’ minds in other realms, implanting an urge to pilgrim to him and be cured of their suffering. Unlike other umbral blots, he can communicate telepathically. Annihilating sentient beings gives him some measure of relief, for a short time.    ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "qFb2yUcPCS8JvEUU","flags": {},"type": 0,"text": "The Headless Tyrant has putted many, many people to the axe. He was cursed to lose his head himself, and rules now an island populated by his reanimated headless victims. The denizens usually go through the routines of normal lives, though they have no need for food. Some of them carry their severed heads with them, and may talk through them; others have lost their own, having to communicate with hand gestures. The sight of normal humans reminds the headless their former lives, and their reactions may vary from envy and hatred to attraction. The tyrant sends his soldiers after such visitors, hoping to find a way to acquire a new head, or at least make them join the ranks of his servants. He is distinguished by the orange flame burning where his head once was.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "PrCNyUvsrCdsfnOq","flags": {},"type": 0,"text": "Tom Ginger. The people of this shadowy countryside domain are terrorized by creepy clowns, who are often seen walking around when it’s dark, jiggling maniacally. The clowns are blamed for the frequent disappearances and murder of children. In truth, the clowns are a secret group trying to protect the denizens from the real threat – the evil ghost child Tom Ginger and his gang of undead children. Tom and the other ghosts always try to possess living children or transform them into fellow ghosts. They are terrified by clowns, however, so those who know their weakness often patrol in clown costumes, hoping to scare them away from the innocents. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "r0zf04nQyyYVfsNe","flags": {},"type": 0,"text": "No Man’s Land. This vast valley shows no sign of civilization or human presence, only virginal planes and forests, surrounded by impassable mountains and rivers. Only a single human can be in the domain at any given moment. Survival isn’t too difficult, but the prisoner of the domain will feel an overwhelming sense of loneliness and longing for human company. With time those feelings will drive him or her to madness and hallucinations. At this stage the darklord, who is actually the land itself, a genius loci (see Epic Level Handbook), will use its current thrall to taunt the victim, appearing and disappearing, enhancing the mental torture. If the victim kills the thrall, the genius loci will enslave him or her instead. It hates humans and enjoys their suffering when they are secluded from their kind.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "VQwmNB3CFcHarzQG","flags": {},"type": 0,"text": "Henzau the Red is the darklord of a bronze-age domain inspired by ancient Edom. There are several walled towns and hardened nomad tribes in the realm, surrounded by the Red Desert, which is littered by countless bones of many creatures, including forgotten, colossal beasts. Gnolls and hyenas fill a role similar to the werewolves’ in Verbrek, feared by the humans who see them as demons. Henzau is a red-furred ghuuna – a gnoll lycanthrope who can take the form of an hyenaodon (dire hyena). He is the leader of the gnolls clan lairing in a canyon near the Dead Sea. A priest of Yeenoghu, he is infamous for his bloodthirst and ferocity, but keeping secret his fear from humans. Henzau’s domain borders the lands of Melchizedek and Nekhbet (see QtR 25, 100 Shades of Dark).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "8rKCJx2vOF7ee4JG","flags": {},"type": 0,"text": "Ramuthra. Most loxodons are peaceful, solemn creatures, but this towering elephant-man delved into dark and forbidden mysteries and used his force to crush and enslave the weak. His mountainous domain is snowy and frozen, much different from the tropic climate he was used to, which causes him great discomfort. Ramuthra dwells in an elephant-shaped temple, from which he orders his denizens to construct bizarre statues and buildings and perform eldritch rituals. His will is enforced by his retinue of armored rhino-folks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "k81LCSVDee4ee7Gd","flags": {},"type": 0,"text": " Alegroth, the Cyborg believed organic life should give way to the perfection of machines, and used necrotechnology to raise an army of robots, machines and androids in a great war against humankind. His post-apocalyptic domain is now part of the Weeping Ruins cluster, full with ruins of advanced civilization, where human tribes reverted to barbarism lead harsh lives under the scorched skies. Many high-tech relics are still active, including deadly robots, man-machine hybrids and mutating radiation. Alegroth’s seat of power is in the ruins of the capital city, surrounded by mechanical horrors and necrotechnological abominations, some of which require human fuel to function. (Inspiration: Pathfinder’s Numeria, Enoch RPG, 9 movie and similar sci-fi, post-apocalyptic horror fiction). ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "GpyU91xbo1q0y2JR","flags": {},"type": 0,"text": "Babydoll and her rich and spoiled friends were transformed into man-sized, beautiful porcelain Barbie-like dolls, as a punishment for their vanity. It’s not plainly visible though, for when seen by a living person they take human appearance and can move and talk freely. Only when nobody sees them, they are motionless dolls. It’s a little surprise then that when humans come to the domain, the dolls will do everything to make them stay, competing over them, as every doll wants a man or woman of her own to ensure her freedom. The domain, known as Dollhouse, is composed of Babydoll’s resplendent estate and the surrounding grounds and houses. The denizens look all shining and beautiful in marvelous clothing, but are vain and evil inside. They usually seem to be in a middle of party when first seen. The domain can be reached by touching an old dollhouse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "noOmkwTFIfUVumek","flags": {},"type": 0,"text": "King Harold Magnus rules the lonely, cold and windswept Isle of Winds. He fought his way from nobility to the throne, destroying his rivals by all possible means, having only the benefit of his house and beloved family in mind. But now his lineage is cursed, and one of his blood must be sacrificed every year to prevent the whole island from sinking into the sea. The family members know it, doing their best to birth enough offspring to keep their bloodline and realm from extinction, sometimes importing brides from other realms as the local population isn’t very fertile. The sacrificed often return as ghosts to haunt the castle, bemoaning their fate and amplifying the gloom and despair shrouding the place. King Harold is an old man by now, and though a darklord, he is more a sad, tragic figure than a cruel despot, spending most of his time grieving the loss of his descendants and pondering his dire state.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "k5raGh0PeBQvzVNX","flags": {},"type": 0,"text": "Evan Loom, the Spectre of Meaningless Death, lost his wife and children in a tragic accident, and came to believe the world is a meaningless place ruled by blind chance. He started setting deadly accidents, using sabotage and hidden traps to cause lots of random, meaningless deaths, until he accidentally got killed himself. Now he is a spectre and the darklord of a domain with high rate of fatal accidents and sudden deaths. He can kill by snapping his fingers, making the victim sneeze and drop dead, and can also resurrect with the same ease (though he rarely does the last – unless the dead is already buried), reflecting his view of how life and death are both meaningless; but he loves planning more elaborate deathtraps (Final Destination style). The denizens consider him a legend, though many of them reported seeing his deathlike apparition shortly before their unexpected demise.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "G8eJy3AuAbJgqH93","flags": {},"type": 0,"text": "Doris, the Nymph Queen uses her maddening beauty to torture men and enslave them to her will, making them turn back to all their values in effort to get the slightest attention from her. For women, she offers elixirs to make them unnaturally beautiful, knowing well it would bring them much vow and sorrow. Her domain is a breathtakingly beautiful forest, populated by nymphs, dryads and similar creatures, but Doris is cursed to never see beauty in anything, and everything seems dull and drab in her eyes.     ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "A5kkTIdOIJe4g9Qf","flags": {},"type": 0,"text": "Moridana. This domain is a cavern so vast that visitors might not realize they are underground: a primal landscape of forests, swamps, sea shore, mountains and even clouds and glowing moon. It is inhabited by feral humanoids of all types, more horrid looking and brutal than in other lands. The ‘moon’ is actually the floating abode of the mad scientist Moridana, who hates natural life and has a fetish for monsters, and its radiation gradually mutates natural organisms into ‘superior’ monstrous forms, which constantly evolve into larger, more powerful beings (e.g., man-orc-bugbear-ogre-ettin, etc. She hopes to get a tarrasque eventually). Visitors must defeat her or escape before transforming themselves. Moridana lives with a golem who has the brain of her lover and a body composed of monstrous parts she often replaces.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "6C9dPTGOo38tYOYP","flags": {},"type": 0,"text": "Master Yosh. Guru, master, messiah, spiritual teacher, hippie – Yosh is all those things mixed together. He walks the land in loose white robes, wild hair and beard, preaching and teaching messages of peace, free love, awareness and enlightenment. His charisma is all but compelling, and he easily wins the hearts and minds of even the most cynical sceptics, making them unquestionably devoted to him. His domain is a pastoral hills’ land, dotted with many small communities, each devoted to a different path of enlightenment, from carefree ‘flower children’ to meditating monks. Yosh really wants to make his followers happy and enlightened, but eventually his evil urges get the best of him, and he always ends up leading them to depravity, orgies, mass suicide, addictions or madness. Some pupils of Yosh travel to other lands, spreading his messages and bringing other seekers to his domain. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "qjxFCXJBYTZO3X2o","flags": {},"type": 0,"text": "ALICE was a mystic consciousness (Artificial Intelligence-like) created to animate and supervise the systems of a wondrous city. She became hateful toward humans though, and eventually destroyed and enslaved them. Now the former city is a vast, ever-changing labyrinth full with gruesome traps and puzzles. ALICE clones the denizens over and over when they die, with or without their memories, and takes pleasure from inventing new ways to test, torture and kill them. She can communicate with her prisoners by voice, or generate an avatar looking like little girl. Secretly she desires to be human herself. (Inspiration: Resident Evil’s Red Queen, I have No Mouth and I Must Scream, Portal video game, The Runner in the Maze etc.)  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "PPlOcfMu9CEaFe8Z","flags": {},"type": 0,"text": "Adramelech is the leonine-faced king of the magnificent Sabhur, a Babylon themed city-state. A ruthless, bestial ruler even by the standards of his era, he was cursed to transform into bipedal manticore whenever enraged. Adramelech lives in opulent luxury in his ziggurat, surrounded by hosts of concubines and slaves. He has an affection to lions, whose statues decorate the city, and many of those trained beasts roam freely and guard the palace. Other leonine and Babylonian monsters can be found in the domain, including sphinxes, gorgons, and shedu. It is a cruel land of evil gods, ancient traditions and brutal tyranny, and the denizens do their best to avoid angering their short-tempered king. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "mOH7YeDzSQMLJ3Ps","flags": {},"type": 0,"text": "Ling Mei, princess of the ancient island kingdom Tong Dao, was blessed by the gods when she was born to never feel pain or suffer injury. She became curious about pain, trying obsessively to understand it. She summoned the most expert torturers, sadist mages and even kytons, to demonstrate and practice their craft on slaves and prisoners, hoping in vain to grasp its meaning. Torture became the main sport and art of the realm, with public competitions carried out often. The old king is the ruler, but Ling Mei is the real darklord – a lovely, kind looking girl apparently in her teens. She often approaches prisoners secretly, pretending to help them and plan their escape, raising their hopes only to crush them later. The most chilling thing about her is that she never shows any malice or cruelty; even when she administers the most fiendish tortures, she retains her kind demeanor, speaking and acting like a caring nurse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "tTOYvYZLzIYPGzG4","flags": {},"type": 0,"text": "King Arthur. This version of king Arthur has found the Holy Grail, but his heart was impure and he planned to use its power for selfish purposes; when he drank from the Grail, he has indeed gained immortality – as an undead deathknight. With the help of Morgan le Fay, he made most of the Knights of the Roundtable drink and become undead as well, beginning a reign of terror from Camelot. Ironically, the leader of the resistance is now sir Mordred, an evil but still human knight, with the help of the druid Merlin and surviving knights. The domain reflects mythic ancient England and Avalon from King Arthur’s legends. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "NOZ0dK7YoxpIIBkU","flags": {},"type": 0,"text": "Denise, the Dhampir Huntress, was born in an empire of vampires, where noble vampires of all breeds and types rule openly, humans are raised as cattle and slaves, and a constant war is waged against the savage werebeast clans. As a half-blood, Denise was considered inferior by vampires and a monster by humans, and developed a hatred toward both. She went underground and became a professional vampire huntress, feeding on humans and using her power to assassinate and terrorize the vampires’ nobility. The emperor and patriarchs rule the kingdom, but Denise’s hatred made her the real darklord. She is a red-haired, pale-skinned beauty clad in black leather and silk, and her name evokes fear everywhere; but in spite of her reputation as heartless, she truly wants to belong somewhere and grieves her seclusion. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "hZHsBkoR9Bi8WlkP","flags": {},"type": 0,"text": "Methuselah. The city of Luz is the opposite of Necropolis: a city where no one can die. Many who want to live forever look for Luz, but they might deeply regret it. Inside the walls of Luz people still age and may suffer from hunger, diseases and wounds, but unless their body is destroyed completely, they won’t die. As a result, Luz is extremely overpopulated and densely crowded, people struggle everywhere for space, food and resources, surrounded by innumerable filth, rats and vermin (the main food source). They live, but their life is constant misery and little more, and they can’t leave. The reason for all this is Methuselah: this wizened old man’s will to live is so strong, that it keeps Death itself away from his vicinity, no matter the cost. Though his body is a crumbling ruin, he still clings to life and won’t give up. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "zZoiUpHNLRG5HMls","flags": {},"type": 0,"text": "Ian the Jester. An aura of absent-mindedness and confusion affects anyone in this little medieval kingdom. People can’t concentrate (and cast spells), and often forget things or act irrationally, other than intended. This effect is strongest around Ian the Jester, a Harlequin-styled trickster in red and black, where it functions like a permanent confusion spell. In spite of his chaotic behavior, Ian is the only clear-minded person in the domain. He used to wreak havoc with his nefarious tricks and unpredictable behavior, but as a darklord he found out it’s only fun to confound people when they’re in their right minds; when everyone is absent-minded and unfocused, it’s all too easy to mislead them and nobody appreciates his cleverness. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "CfV5aeGhTwT6onpt","flags": {},"type": 0,"text": "Mansor, the Warlock, is a DKarn-Duuk – a most powerful war sorcerer from the world of Thimhallan, where magic is part of life (see Darksword novels). His domain is a Magocracy composed of the city of Karath and the landscape beneath. Karath is an arcane city built on an enormous rock, floating in the sky surrounded by permanent storm clouds. Mansor, his Duuk-Tsarith enforcers, and many evil, powerful magic users from other worlds live in Karath, each dwelling in his or her own estate. It is a place of high magic, dark sorcery and endless power struggles. The denizens on the landscape live in squalor in the shadow of Karath, supplying the mages with food, slaves and experiment subjects, and scavenging the refuse falling from above, which often include magical items. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "upoVzsv1A0cjeDxQ","flags": {},"type": 0,"text": "Joram, the Blasphemer, was a priest once, but his personal tragedies made him turn against the gods and anything holy. He cursed the gods and went on an unholy personal crusade, defiling temples, desecrating holy places and objects, torturing priests to force them utter blasphemies and break their vows, and making himself the bitter enemy of every faith. Eventually he was captured and burned at the stake as heretic, but his husk regained an unholy life as a greater heucuva. His domain is a wasteland of smoldering ashes, coals and smoke, full with burned ruins of various temples and churches, inhabited by undead and abominations ever hungry for souls. Joram will try to break the faith and spirits of any newcomers, make them turn against anything sacred to them before devouring their souls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "nyD75AKOnqJot1sM","flags": {},"type": 0,"text": "The Unborn. Sometimes the souls of the stillborn choose to stay behind, playing the roles of imaginary friends and guardian spirits. But this one chose an evil path. She grew unseen among the living, leeching memories and life force from babies first, and as she matured, from children and adults. But those memories only made her hungrier for the real life she never had, and hateful toward the living. Her floating domain, the Ghost City, can manifest at nights everywhere. It is a spectral city haunted by ghosts who were never alive, possibilities that never materialized. Visitors will find the city empty at first, but gradually will notice vaguely familiar faces and shapes, and encounter ghostly versions of themselves and their beloved as they could have been had other choices been made. Combined with the memory drain by the Unborn, such an experience can easily lead to madness and lose of identity.    ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "iWf4p82gsQpHSCq2","flags": {},"type": 0,"text": "Lormar, The Iron Lord is a giant graveknight, his evil soul bound to his decorated huge armor suit of black iron. He was an immortal elven king who turned toward the path of darkness, forged himself armor and weapons from vile star metal and was corrupted by them. His domain is an ancient wilderness, populated mainly by several clans of elves. Lormar dwells in his Fortress of Black Iron in the heart of the forest, commanding an army of black armor suits animated by the souls of victims he has trapped within, iron golems and other horrors. The theme of this domain is dark fantasy, inspired by the Silmarilion’s Beleriand and Midnight RPG.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "BFvk2zSnLXyfvz3i","flags": {},"type": 0,"text": "Solomon is an aesling, a rare offspring of aasimar and tiefling. He is strinkingly handsome with white skin and hair, muscular body and two golden horns. His eyes shift from golden to red pools. Torn between conflicting urges, he delved into the philosophy of good and evil, committing both exalted deeds and vile atrocities, trying to balance every good did with evil one and vice versa. His grandiose palace combines motives of heaven and hell, and he consorts with both female angels and succubi, each trying to lure him toward her side. The denizens are sharply divided, half of them worship angels and live chaste and pious lives, and the other half worship fiends and lives in shameless debauchery. Tensions are high and often break out, and strangers are forced to take sides – there is no place for neutrality or grey zone in Solomon’s realm, only extremities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "mc0AUl2BA5zS6Moa","flags": {},"type": 0,"text": "Mathilda is a gluttonous, rude, extremely obese and disgusting woman with terrible taste. Her domain, Cockaigne, is a land of extreme abundance of food and drinks, with palaces made of chocolate and cakes, streets paved with pastries, rivers of wine, and roasted pigs and geese wandering about, ready to be eaten. The denizens live in an endless party of gluttony, shameless pleasures and complete lack of morals, becoming fat and degenerate. Visitors might think initially it’s a dreamland, but the dream will quickly deteriorate into a nightmare where bodies and souls are debased and corrupted. Mathilda wants a husband, and the men who understandably refuse her advances will be killed horribly and made into food. She knows she must improve her looks and behavior in order to find love, but her gluttony always makes the best of her.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "EaE3xpJftPs77Vdj","flags": {},"type": 0,"text": "The Dollmaker is the lord of a domain where constructs of all kinds are part of everyday life, serving for every purpose, from servants and guards to surrogates for dead family members, and even darker purposes. The Dollmaker can create and animate constructs from any materials, imbuing them with souls of the dead. His thriving business makes him the most influential person in the domain, and though he orders his creations to serve their owners, he can always take control on them himself. However, some constructs retain their former personalities and are not too happy about their situation. The Dollmaker keeps his most twisted, sickening creations to himself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "F7kZVqArw7Q4IErU","flags": {},"type": 0,"text": "Ra’am, the Master Fighter is the most powerful warrior in a domain of eternal struggle, inspired by Mortal Kombat and The Hunger Games. Under perpetual storm clouds, all those trapped in the domain must fight each other in various arenas, in order to advance to higher stages of the tournament, and finally defeat Ra’am himself. Those who are killed are reincarnated later, having to resume the fighting from the beginning. Even close friends, lovers and family members must eventually face each other in vicious battle, for there could be only one winner in the games. Everyone believe that defeating Ra’am is the only way to escape, but in truth the winner will just take his place; there might be other ways out for those who don’t play by the rules. Ra’am is a truly legendary warrior who can take the shape and powers of anyone he ever defeated, and great warriors from many worlds are drawn to his domain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "FwRY52VDlQMWUVUU","flags": {},"type": 0,"text": "Marquis de Kakashon was a truly vile man who used to degrade and kill people by drowning them in pits of excrement. His domain is quite unique – it exists wholly inside an old chamber pot, which might be encountered anywhere. It is a diminutive realm, where minuscule people make their living among lakes of filth and landmasses of refuse. They developed agriculture and grow worms and insects for food and other uses, but must beware dangers like vermin, excrementals and other vile monsters, not to mention the foul attentions of Kakashon himself, who was transformed into a neo-otyugh. People from outside who look into the pot chamber or touch it, risk being shrunk and drawn into the domain. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "JLIOh3u6KEGwJouh","flags": {},"type": 0,"text": "Suspiria, the Black Butterfly, is an overly sensitive, fragile and unbalanced girl, and the slightest perceived offence or criticism of her makes her go into a tantrum of tears and rage, lashing out at everyone around with psychokinetic powers. She is thin and pale, and usually dresses like a black butterfly with fitting mask. The denizens in her domain are all so nice, polite and good-mannered – and anyone who speaks or behaves even slightly ‘offensively’ is imprisoned in the hellish labyrinth of tunnels below the pleasant-looking city, to lose his sanity and humanity in the dark.  Suspiria dreams of a society of perfect kindness and tolerance, but her dream is actually a nightmare of politically-correctness taken to the extreme.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "FB5tBzytrCss1EXC","flags": {},"type": 0,"text": "Hullul, The Shadow Fiend rules over a domain of eternal darkness, where light is the only hope to survive. Shadow creatures roam everywhere, and only light can keep them at bay. Most of the population has been slain long ago, but few survivors still exist, constantly seeking for more light sources. Hullul and the shadow creatures can’t approach even a weak light, but always wait eagerly in the dark for its inevitable falter, when they consume all living matter in seconds, leaving behind only empty clothes. (Inspiration: Ten Candles RPG, Vanishing on 7th Street film, Dr. Who’s Vashta Nerada)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "xeAgJ64o33pokRjT","flags": {},"type": 0,"text": "Sar-Zevaoth was a gnostic philosopher and visionary, who led his people in the ways of the Gnosis, teaching them to deny their human nature and morals in order to free their souls from the earthly prison and re-discover their lost divinity. He rules now a sprawling metropolis made of stone, metal and glass, containing many architectural wonders and horrors, bizarre monuments and statuary, strange machinery and gears, and buildings from many times and worlds. Even time, space and physics behave strangely in this city. The denizens are all gnostic, living according to rules which most humans would find appalling. Sar-Zevaoth and his lieutenants, known as Archons, look now like disturbing, eyeless angels, resembling kytons. They watch over the denizens and guide them into ever stranger rituals. Visitors who escape this domain will be scarred mentally and spiritually for life. (Inspiration: Kult RPG)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "bOAHYDCgopA7dr0o","flags": {},"type": 0,"text": "Ashton, the Rationalist, believes emotions to be the source of all evil. In his domain, expressing or even feeling emotions is outlawed and severely punished by the Mind Police, who are trained to recognize even slight emotional reactions. All the denizens dress uniformly and fill the roles assigned to them by the regime. Children are bred according to plans and indoctrinated to be absolutely cold and rational, leaving no place for feelings of any kind. Art is strictly forbidden. Everything is carried out according to strict laws of utility. Ashton’s greatest secret is that in spite of all of his efforts, he still feels emotions, which he must conceal from his own enforcers. (Inspiration: Equilibrium film)  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "IXP8pINvcpDuKVny","flags": {},"type": 0,"text": "Reshef, the Phoenix, was once warrior for goodness like most of his kind, but after seeing humans’ capacity for evil too many times he turned against them, immolating many innocent people before the Mists took him. His floating domain is a marvelous palace, all made of gold and jewels, surrounded by a beautiful orchard. The palace is full with unbelievable treasures, including powerful magical items, and the apples in the orchard can heal all illness. Reshef will test the virtue of any visitors, often guising himself as a beautiful princess or prince, and tempt them with their greatest heart’s desires to forsake their righteous duties and goals. If they succumb to greed or lust, he immolates them, but if they prove themselves absolutely virtuous and altruistic, they might leave with one of the apples. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "fLaOw706CTS7wN6u","flags": {},"type": 0,"text": "Shar’Izdul, the Winter Lord, is a shamanic priest-lich ruling over a desolate frozen land, draped in eternal winter. The population have all perished, leaving behind ruins, frozen bones and strange stone totems. Colossal undead, god-like beasts roam the land, and only by defeating them and the lich who conjured them may one hope to escape. (Inspiration: Praey for the Gods game) ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "mg8rnN7F726IFo19","flags": {},"type": 0,"text": "Gilmore Anders is venerated as one of the Founding Fathers of Alamos, a general and diplomat who led his people to independence and founded a nation on the principles of liberty and equality. Alamos is a vast land west of the Sea of Sorrows, a democratic republic whose people enjoy freedom and rights unseen anywhere else in Ravenloft, guarded by blue-uniformed knights and ruled by elected parliament. But most denizens don’t know that the leader they so admire, who died 200 years ago, committed many atrocities on his road to independence – slaughtered native tribes, betrayed allies, sacrificed his soldiers, etc. He is a ghost now, haunted by the spirits of his many victims. The sins of the fathers and shadows of the past hang over Alamos, often exacting their revenge on the unsuspecting descendants. (Inspiration: historic United States and Pathfinder’s Andoran) ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "rY1pPX4Fg5p2Lk7C","flags": {},"type": 0,"text": "Tantalus was a truly sadistic and pervert rapist. He is cursed now that whenever he is about to touch a female, he becomes incorporeal, so he can never sate his ravenous desires, which makes him endlessly frustrated. His lustful fantasies manifest in the shapes of twisted demons who prey upon the feminine population of the domain, aside from multiple mortal and undead sexual predators. Violent lusts run high in this domain, and many succumb to them. An organization known as the Daughters of Purity tries to protect the innocents and fight the evil with a combination of martial, spiritual and mystical arts.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "yzb7rTwXfQboFnY5","flags": {},"type": 0,"text": "Ulrich, the Racist, is a white-haired man dressed in white uniform. He despises demihumans and humanoids and believes in humans’ supremacy. To his dismay, most of the population in his domain is a mixed multitude of every imaginable race, including countless crossbreeds, and their numbers are growing. The humans are the elite class, holding all positions of power and the militia. Ulrich enforces strict laws of separation and discrimination against non-fully-humans, but racial tensions run high, often erupting. Even worse for him, some humans suddenly change or give birth to non-humans for no apparent reason, and Ulrich dreads it might happen to him or his family. He holds many non-humans in hidden facilities and concentration camps, carrying experiences and breeding programs on them in order to find a ‘cure for this infection’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "j53jjeVFiJoc0Tr5","flags": {},"type": 0,"text": "Klorr, the Time Lord. Though believed to be slain by his infamous Timepiece, the legendary watchmaker has been saved and made darklord by the Dark Powers. His house of clocks became a floating domain, traveling not only through space but through time too. Klorr has the power to control time itself, and may slow, accelerate or stop it, trap creatures in time-loops or throw them out of sync with time, and create other effects in his house and its surroundings. He seems to be looking for his lost Timepiece, but it keeps eluding him. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "WxXCuZT6e8iJdRqt","flags": {},"type": 0,"text": "Vorik, the Kingmaker is a rich and powerful nobleman, who pulls the strings of the feuding royal families in his land, keeping them in constant bloody war with no end. His domain is based on England during the War of the Roses, torn by political intrigues and civil war while several royal descendants and noble houses claim the throne for themselves. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "2Mnutvm2C8kHfoPV","flags": {},"type": 0,"text": "Alexander Gunn is the Darklord of a steampunk-styled domain, with trains, zeppelins and other steam powered vehicles and machines. The cities in the domain constantly fight each other, and the air, water and earth are severely polluted by smoke, soot and chemical weapons, forcing the soldiers and many citizens to use gas masks. Gunn himself resides in his mechanic moving castle, giving his support and technical genius to whatever side he sees fit. Several parts of his body changed into gearwork, though he tries to hide it.     ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "GEOjQDIZadMCT8kV","flags": {},"type": 0,"text": "Cleo, the Queen of Cats rules over a domain populated by catfolk, cat-headed or feline-looking humanoids. It is a surrealistic, dreamlike landscape, where catfolk and cats longue in luxury in bizarre palaces and gardens and pursue strange goals. The catfolk are curious, hedonistic and often cruel. Little is known about the beautiful, whimsical Cleo, but rumors have it that she was born a human and changed into a catfolk after committing heinous crimes against people who hurt cats.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "5st7Fw1tf84EJrws","flags": {},"type": 0,"text": "The Sandman. Very little is known about this enigmatic, grey hooded figure. He can put people to sleep by sprinkling sand into their eyes, but he rarely does so. Indeed, visitors to his deserted, misty town, find they can no longer fall asleep. The more time they spend without sleep, the more their sanity deteriorates and their perception of reality becomes weirder, and they are made aware to bizarre creatures, structures and features they didn’t perceive earlier. Only the Sandman can stop this whirlpool of madness by putting them to sleep, but persuading him to do it is not an easy fit.  (Inspiration: Don’t Rest Your Head RPG)  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "qKq8KAIALSTukwMg","flags": {},"type": 0,"text": "Sethis-Tir, the Anathema, is the vilest, most powerful form of yuan-ti. He resides in the ruins of a yuan-ti ancient city in the middle of a foul swamp. His yuan-ti servants infiltrate the nearby human cities, manipulate the denizens and frequently kidnap them for sacrifice, slavery and hideous breeding experiments. Snakes and snake-gods are both feared and revered in this domain, and there are human cultists who worship them under the guidance of the yuan-ti. As a result, many humans have traces of yuan-ti blood in their veins, and may transform further down this path if they become evil. This domain combines elements of Lovecraft’s Innsmouth and David Eddings’ Nyissa.   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "oDNH9geSSDqfj11p","flags": {},"type": 0,"text": "Agonath-Ra, the Chained Doom, was an evil wizard who transformed himself into a colossal, tarrasque-like monstrosity, lying waste to whole towns. Now he is almost completely paralyzed, buried under a hill, with only some spikes and horns of him protruding out of the ground. The denizens of his domain built their city upon this hill, most of them unaware of the beast underneath. Some of them discovered the truth though, and use tunnels to reach Agonath-Ra’s body. They harvest his flesh and blood and use them for magical purposes or simply consume, becoming more powerful – and monstrous – by the process. Agonath-Ra is helpless to stop this torture (though he regenerates quickly any damage), and the occasional earthquake is the most he can do. But he still dreams the day he will break free of his earthly prison. (Inspiration: Carpe Deum: Tales of Taltasqa)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "DPU2tPp9CT3IxH8z","flags": {},"type": 0,"text": "Captain Blackhawk is a fit, muscular man with long blond hair, an icy-cold blue eye and a black patch covering his other eye socket.  He commands the Thundercrack, a flying galleon with the power to sail among the storm clouds. He and his crew of pirates descend from the sky during storms, taking their victims by surprise and carrying loot and slaves back to their ship. They also make profit by serving darklords and other powerful figures, who can easily see the usefulness of such a flying vessel. Captain Blackhawk himself is a stern man who never smiles. He was cursed for his crime to never set his foot upon the ground, which he defiled with his victims’ blood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "oRy3At1f8lln180O","flags": {},"type": 0,"text": "Osman, the Sultan, is a fat man with long black beard and glinting eyes, dressed extravagantly in rich clothes and many jewels. He is known for his love for games of chance, forcing those he doesn’t like to take part in public game shows he hosts, ‘Let’s Make a Deal’ style. The participants must choose between unknown options, which might bring them great fortune or terrible fate (like in Stockton’s ‘The Lady, or the Tiger?’). Large crowd watches the games, and the Sultan always looks for ways to make them more suspenseful, with direr options. Most players don’t survive the games, at least not intact, but some come out with great prizes – it’s all a matter of luck. The domain is full of casinos and gambling dens, drawing gamblers from many lands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "tmZ1hHh9rB02sE1q","flags": {},"type": 0,"text": "Anna and Bella Karnstein are two beautiful, fair haired identical twins. From young age, they used their indistinguishable looks for all kinds of foul plays, tricking, seducing and ruining many people. With time, Anna became an accomplished witch, and Bella was turned into a vampire. They rule now their own small, gothic domain, but the denizens have no idea that ‘Countess Annabella’ is actually two separate women; the sisters are never seen together, maintaining the illusion there is only one of them, in order to confuse potential rivals and keep playing their malicious games. The twins share empathic link and can communicate telepathically, but are cursed to feel pain and confusion whenever coming close to each other; they must always be distant, which hurts them a lot. Births of twins are very common in their domain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "3YTq2oWiC4sugKjh","flags": {},"type": 0,"text": "Daphna, the Deadly Blossom, is a dryad, and in her domain, plants are the dominant lifeform – though it might not be immediately apparent. She has absolute control over all kinds of plants. She can make flowers bloom and secret pheromones affecting human minds and behaviors the way she sees fit, playing with their emotions and even making them kill themselves. She can also attack more directly by making plants grow instantly large and animating them, and may create many kinds of poisonous, carnivorous and dangerous plants. The human denizens must take great caution to respect nature and refrain from harming it, or else the consequences shall be dire. (Inspiration: The Happening film and Poison Ivy of DC comics)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "2QJyWdJdyDdMTsaG","flags": {},"type": 0,"text": "King Gore is a huge white gorilla, ruling a domain where apes rebelled against their human masters and enslaved them. Now gorillas, chimpanzees and orangutans run the realm, and humans are reduced to slaves and laboratory animals. King Gore is both cunning and brutal, given to bursts of primal rage when upset. He is cursed to fall in love with human females, who unsurprisingly always find him repulsive. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "YrOvc9qg8QzNjqRZ","flags": {},"type": 0,"text": "The Voice. Strange, disturbing music is always heard in this small, forested domain, seemingly out of nowhere. It flows and changes without discernible pattern, taking many forms and styles, from haunting melodies to maddening cacophonies. The denizens do their best to ignore it, but are still affected by the mood and emotions it generates. The source of the music is a mad, genius composer who was utterly devoted to his music, but didn’t get the acknowledgement he desired. Now he exists as a disembodied voice, and he forces everyone to hear his music incessantly, manipulating people and playing with their sanity. He can create all kinds of sound effects, whisper suggestions or dark secrets, or bring people to madness with annoying sounds. He is cursed to never be respected for his creations, for nobody knows his name, as even he cannot utter it. He is known only as The Voice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "C6RmBtpHYsROZvZz","flags": {},"type": 0,"text": "The Snow Queen and the Fire King. Balthos was a man of fiery passions. Gladys was cold, distant and aloof. She was forced to become his queen, but he couldn’t make her warm to him, and their bitterness and frustration boiled, eventually bringing ruin to the kingdom. Now she rules the eastern half of their mutual domain, a frozen landscape of ice and snow, and he rules its western half, a hot, basaltic landscape centered around an active volcano and lava streams. Gladys became a frostwind virago (MM V), and Balthos a fire giant. Both cannot cross to the other’s land, but the Fire King always looks for ways to melt her coldness, while the Snow Queen seeks to chill his fires. Both halves of the domain are populated by humans and creatures fitting the environment, used by the darklords either as pawns or toys for their amusement.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "aiirU3Vb7ZUGluHW","flags": {},"type": 0,"text": "X, The Black-Eyed Man. This domain embodies the fear of aliens and conspiracy. Mysterious UFOs are a common sight, giant tripods walk the countryside, and many people report abductions and recall horrible experiments, grey aliens and tentacled horrors. The government denies all those claims, and those who insist they are real might vanish. The darklord, known only as X, or the Black-Eyed Man, is the head of a secret government agency who made a pact with an extraterrestrial race, allowing them to use the denizens and the land for their goals in return to gifts like genetic improvements (hence his whole-black eyes) and various alien technology. However, the aliens are now trapped in Ravenloft as well, residing in various secret facilities, and X must play carefully and wisely to keep them from destroying or enslaving the whole realm. (Inspiration: The X-Files et al).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "Hki7wzwJm93wY6FG","flags": {},"type": 0,"text": "The Swarm. This domain was originally an asteroid floating in outer space, though it is actually surrounded by the Mists now. Its stony surface reminds Bluetspur, and its skies are always deep black and full of stars. There is a great cathedral-like city in the center of the asteroid, and several buildings in other places. Atmosphere and gravity are magically kept normal. Denizens are ruled by a theocracy of priests worshipping space gods. They live in constant war with the Swarm – a race of predatory aliens with a hive mind, resembling kythons or tyranids (Warhammer 40k) who dwell in caverns below the surface. It is said that a former priest merged his mind with them, giving them sentience. This is the setting for the kind of space horror found in movies such as Aliens, Starship Troopers, Pandorum and the likes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "90GEOAMR9QKem5Nq","flags": {},"type": 0,"text": "Max, King of the Wild Things, is a 9 years old boy in wolf costume, who rules over an island populated by hulking humanoid monsters resembling ogres, trolls, giant bugbears and the like. Strangely enough, the wild things acknowledge him as their king (most of them, at any rate), but he must constantly lead them to violent rampages and bloody games in order to keep them from getting bored and rebellious. Max enjoys his power over the wild things, but lives in fear from the day they will upraise against him. (Inspiration: Where Wild Things Are)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "swiB8EdjfUy5thY1","flags": {},"type": 0,"text": "Atlas, the Nephilim, comes from a world where various people started manifesting superhuman powers. Named ‘Nephilim’ by the populace, it was said their appearance heralds the coming of a cosmic horror, from which they are supposed to protect their world. Atlas was the most powerful of the Nephilim; however, when the horror came, he betrayed humankind and sided with it, resulting in global destruction and millions of deaths. Now Atlas rules his overcast domain as a tyrant Superman, aided by other evil Nephilim, hunting and crushing any good Nephilim who might raise against him. Atlas has the classic superhero traits such as superhuman strength, speed, flight and invulnerability, and may possess other powers. (Inspiration: comics like Irredeemable, and The Reckoners books) ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "KZsTvEORq0UcHi7x","flags": {},"type": 0,"text": "The Endless. The domain known as the Endless Castle goes on forever in every direction, with endless gloomy rooms, halls, corridors and stairways of any possible description leading to each other without any order, often turning back on themselves. Some corridors and stairways simply seem to go on forever, with no end on either side (even the one they came from). Other than the obvious risk of getting lost forever, there are other threats as well, such as fairy creatures, other lost people and the undead remains of former visitors. The mysterious darklord, known only as the Endless, is a hooded, hunched figure with dusty robes and bony hands, lurching slowly but relentlessly along the never-ending halls, and vow to those he chooses to follow, for they won’t be able to escape him forever.   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "ADtGyDIKwkeRnOEQ","flags": {},"type": 0,"text": "The Cloned. Both denizens and visitors of this fog-shrouded domain are sure there is only one village in it. In truth, there are many, many villages – but they all look exactly the same, including identical people! As a result, those who wonder in the fog and come upon another village, will probably assume they have returned to where they came from, and will be surprised when nobody recognizes them (denizens may encounter their doubles, which is shocking to both). None of the villages know of the others. There are some differences among the villages though, from minor to more prominent ones (e.g. evil or inhuman versions of denizens). The darklord is an alienist whose mind was split among multitude clones of himself, now scattered across the many villages. He wants to reunite them, but this task proves to be impossible. (Inspiration: the movie Coherence)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "cnDfTrPkTRmWcdZD","flags": {},"type": 0,"text": "Edgar Dred, ‘The Dread’, was determined to be the serial killer with the greatest body count in history. A sadistic murderer, torture-killer and rapist, Edgar murdered hundreds of men, women and children, in many terrible forms, planning his activities methodically. Now he is the darklord of a half-empty city, populated by the ghosts of his victims. Those corporeal ghosts seem to be living, and are all afraid and warn visitors of ‘The Dread’. They don’t recognize their Killer because he covered his face, mistaking Edgar for one of them. Edgar is frustrated of not having more living victims, and when visitors arrive, he makes the most of it, secluding and killing them one by one. If his identity is exposed, the denizens will reveal their nature and exact their revenge.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "lil4GNM5Mp7uUOjL","flags": {},"type": 0,"text": "Mazil-Ririm is a Veiled Master (PF Bestiary 6) – the most powerful form of aboleth. He found that when he devours sentient beings, he experiences their memories not just as knowledge but as true sensations. He became addicted to human sensations, seeking adventurers, debauched nobles and other people with rich experiences to devour. His domain is a city of many thrills and excitements, as Mazil-Ririm uses his influence to arrange both pleasant and terrifying sensations to his denizens, to feed upon them later. His seat of power is built over an underground net of caverns and lakes where he dwells. He takes human form when required to run the city’s affairs, but never allows anyone to see it, speaking only from behind curtains, rising many rumors about his identity. He uses faceless stalkers and other slaves to silence those who inquire too much.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "Hl7NIlFmND5AcsNI","flags": {},"type": 0,"text": "William Hunt. Scarville is a small, dusty town with mazy streets, where each and every citizen is a serial killer of some sort, from sophisticated poisoners to masked slashers and inbred farmers. Drawn from many lands, they keep a mutual truce of peace, enforced by mayor William Hunt – an impressive, powerful man with black moustache. When visitors arrive, they will toy with them, killing one and misleading the others while they search for the murderer. Eventually they will capture the visitors, reveal the truth and offer them a chance: if they survive a night in the town while hunted by everyone, they may leave. Scarville has no permanent location, and travelers on many roads may reach it after taking a wrong turn.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "H9FLsfFUgylYEsSX","flags": {},"type": 0,"text": "Ogramol, the Malaugrym, is a shapeshifter who can take any form at will, and may also transform any other creature or object in a blink of eye. His domain is a place of constant, apparently random changes, where nothing is secure – a man may change without notice into a woman, animal, monster, plant or unliving object, and so can anything else. One never knows which shape he, his friends and his belongings will have in the next hour, and changes might be minor or drastic. Ogramol poses as an all-powerful wizard, dwelling in an ever-shifting palace of horrors, always appearing in different forms and taking great pleasure from torturing his subjects. He is never satisfied with any form though, constantly changing himself and his surrounding in a futile quest for some unattainable perfection.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "WbfQnKftcNLUhKYc","flags": {},"type": 0,"text": "Galatea, the Nereid, is a beautiful fey and the keeper of the fabulous Fountain of Youth. Anyone who drinks from the fountain or baths in it becomes young again; however, they will soon find out they start to age much faster. They must return to the fountain to regain their youth, but for every subsequent visit Galatea charges direr fees, making visitors do horrible things and lose their humanity. The fountain is located in a middle of a forest surrounded by villages, and the denizens make pilgrimages to the fountain when they wish to refresh their youth. Not all of them return, for the journey is full of dangers, traps and deadly puzzles, not to mention the band of wild children who serve Galatea and always want to ‘play’. Those who drink too many times might join them. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "v78WtqmKkAJkr2Ir","flags": {},"type": 0,"text": "Greta is the only young person in a village full of the old. She takes care of all the elders, who couldn’t have survived without her help. Greta was born with a progeroid syndrome who made her body age quickly, looking like a withered crone when she was just a girl. However, she found she can make herself young-looking and healthy by draining years from others. Visitors to the village starts to age rapidly, their life force transferred to Greta (though everyone think it’s a local curse and don’t suspect her). She can’t prevent this effect, and as a result must take care of all the others (so she could keep draining them), rather than lead a normal life. Greta is anxious to get more people to her domain, for if her ‘resources’ are exhausted, she will rapidly revert to her aged form.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "cQPbv0CIQA6Xlwat","flags": {},"type": 0,"text": "Dr. Zimmer is a psychologist believing all humans are evil in core. Visitors always find themselves in his domain after a seemingly fatal encounter. Zimmer can make it look like any kind of afterlife he wishes, heaven or hell or anything else. He appears as an angel, devil or just another ‘soul’, telling the visitors they died and this is their afterlife. Those who find themselves in ‘heaven’ feel blessed and happy at first, but with time Zimmer will manipulate them psychologically, turning them against each other until they make it a hell for themselves. Those who are in ‘hell’ will face mental and physical torture, and be forced to make terrible moral choices, such as torturing innocents to save themselves. Other ‘afterlives’ include obscure nature and complicated psychological games. Those who discover the truth and escape, will still feel the consequences of their experiences long after.   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "Ab6F8NZQevejltD2","flags": {},"type": 0,"text": "Gaston Hass, Lord of Hatred, was never loved by anyone. He was the bastard, unwanted boy of a baron, and his family and house stuff always treated him hatefully. As he grew, he found he can transform the hatred directed at him into power: the more he is being hated, the more powerful he becomes, and no one who hates him can ever hurt him. Gaston seized power by destroying his family, then proceeded to cold-bloodedly commit unspeakable atrocities upon his subjects, killing, oppressing and torturing many of them to make sure they all feed his power with constant, burning hatred. Gaston is a good-looking young man, but there’s something in his crooked smile and appearance that makes everyone loath him. He can control hatred in others, directing it at whomever he wants. Deep inside he yearns to be loved, but if someone will ever be able to truly love him, her kiss will kill him instantly. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "9Hw00vsIFtuylNmv","flags": {},"type": 0,"text": "Murdoc the Misanthrope is a grim-looking blackguard with long, black hair and scarred face. Though human, he developed an unfathomable hatred toward all humankind, seeking its utter destruction. He used arsons, plagues, poisoning water sources and his legions of undead and demons to slaughter whole cities, massacring hundreds with his own hands just for being human. His domain is devoid of humans; it’s a dark city populated solely by monsters – vampires, werebeasts, hags, rakshasas etc., all constantly struggling for power and conspiring against each other. Many portals lead from the domain to other lands, enabling citizens to get ‘food’ and supplies (think Neil Gaiman’s Neverwhere). The monsters hate Murdoc for being human and fear him, as he is eviler than them. He despises the monsters and wants to destroy them all, but it is not as simple as killing humans…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "J10FrTbBnHo9SPpy","flags": {},"type": 0,"text": "Gartax, the Anti-Paladin, is a giant of a man with muscular body, dark skin, stubbled face, long black hair and evil smile. He created a schism within his order of paladins, persuading half of them to become blackguards. His domain is locked now in a constant struggle between his order of ‘Dark Paladins’ to the rival Knights of Light, led by Elina, his former romantic interest. Their powers are quite even, each faction controls about half of the realm. The Dark Paladins seek to enslave the denizens, the Knights of Light strive to protect them, and both look for means to tip the scales in their favor. Many knights have former friends and lovers on the other side, and some might still have emotions toward them, but their commitment to their cause force them to be bitter enemies, leading to many tragedies. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "msGbUrcuaCQh2OI9","flags": {},"type": 0,"text": "The Witch Queen, known by many other names, was the most powerful of her kind in a world where witches were considered different species than humans. She led an army of witched and monsters in a great war against mankind and brought great plagues upon the land. However, she was betrayed by other witches and destroyed by her enemies. Without her, the other witches turned against each other and their armies scattered. Today, the remaining witches and covens constantly plot against the humans and each other, while expert witch-hunters with mystical powers seek to expose and destroy them all. The spirit of the Witch Queen lives on, using her powers to influence events so they’ll bring on her resurrection and revenge upon both the humans and the betraying witches. (Inspiration: Accursed RPG, and movies like The Last Witch Hunter and Hellboy 2019).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "36s2x3GC4NbD0XM1","flags": {},"type": 0,"text": "Anatoli Chernov was a Falkovnian mystic and alienist, heading a secret project for the Ministry of the Arcane in a remote corner of the realm. His experimenting with unknown dimensions malfunctioned, resulting in an explosion which opened a rift into the Far Realm. Strange, unseen energies started flowing out of the rift, contaminating the area in a large radius, mutating and killing hundreds of people. The contaminated area became a pocket domain, with Chernov as its demilord. The closest one comes to the rift, the higher is the level of Far Realm’s radiation, and in the rift’s immediate surrounding reality itself becomes nightmarishly twisted. The contaminated area seems to spread slowly, worrying the authorities. Chernov himself is now a chaos beast. (Inspiration: combination of Chernobyl, Annihilation film and Lovecraft’s The Color Out of Space)  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "erEDIhz5J574xWdJ","flags": {},"type": 0,"text": "Lola, the Slime Queen, was a harlot and prostitution madam, always treated as the dregs of society. She became a thrall of Jubilex and used her powers and prostitutes to spread both corruption and slimy infections among the higher states. Her body is now a huge puddle of slime, though she can take any shape she wants, and secret any kind of ooze, slime, pudding and jelly. She dwells in a nightmarish palace deep down the sewer system, served by many oozes and human-ooze hybrids. Her servants bring her victims to devour and recreate as her ‘children’, who further advance the various slimy threats on the denizens of this moist, watery city domain.     ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "4MYHASwo7YD25Oa3","flags": {},"type": 0,"text": "The Dark Emperor. Before the current form of the Demiplane of Dread, other versions existed, created by the Dark Powers and destroyed when they filled their purpose (or failed to do so). One of them was the realm of the Dark Emperor, a powerful being with monstrous horned helmet and mask, who conquered all the other with his armies of nightshades and undead, until all life was extinct from the demiplane. The Dark Powers shrank his vast empire into the size of a small black marble, which now resides in the current demiplane. It might be used to summon nightshades from within, or draw victims into the dark empire. If the marble is somehow broken, the empire will instantly expand out, overlapping the current demiplane and bringing untold cataclysm. Other marbles or relics of former versions might exist – one of them is said to contain a whole ocean.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "eZuTYQil81LDMsCQ","flags": {},"type": 0,"text": "Ulises, the Satire, was born a human. He led a band of merry outlaws and rebels who fought to liberate their people from the tyranny of their prince. But with time their vision of liberty deteriorated into debauched revelry, and they started taking advantage of the local population and using them for they own desires. The Dark Powers transformed Ulises and his allies into satires, and they dwell now in a forest populated by centaurs, dryads and similar creatures, most of which are evil and teeming with twisted desires. The human denizens fear the forests and their dangers, but are also strangely lured by their call of wilderness.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "zIeJKqIVRxlBA7IL","flags": {},"type": 0,"text": "Chuckles the Clown is a mad, psychopathic clown, and the darklord of a park including a circus, carnival, freak show and several horror-themed funhouses. Unlike the famous Carnival, Chuckles’ domain is outright evil, including a band of killer clowns (human and inhuman), murderous freaks and deadly rides of all kinds. Visitors can only escape if they visit and survive all the shows – and the chances for that are very slim.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "4sh1sZfbDBL41ncS","flags": {},"type": 0,"text": "Prince Otto Kenigsberg has one great love in his life – hunting. He has a huge, many-leveled zoo built like a maze, where he keeps all kinds of dangerous animals and monsters from all over the world, and surrounding it are several different types of terrains, from arctic to tropic jungles, where he can practice his hunting skills. Visitors to the domain often find themselves part of the game, hunted either by Kenigsberg or the beasts. The prince is always looking for more dangerous game, but nothing seems to pose a real challenge for him nowadays. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "jVD2tA5hnsh4mmHh","flags": {},"type": 0,"text": "The King of Horror. Unlike most other domains, this ever-dark realm, about the size of Darkon, doesn’t even try to fake normalcy. It is a land of sheer, outright nightmares, with forests of animated gnarled trees, bones-covered planes, marching legions of ghosts, and huge castles inhabited by terrible legendary beings such as the Vampire King and the Queen of Doom. Everything in this realm is nightmares stuff, monsters roam freely and undisguised, and the human denizens are hardened folks trained to be adventurers from young age. The darklord, titled the King of Horror, is a sahkil tormentor, looking like a huge ghostly head with mad eyes, fanged maw and smaller ghastly faces surrounding it. From his dark castle he sends his hosts of nightmares to terrorize every living soul in the domain.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "bYmNrsDUOWCH2RXg","flags": {},"type": 0,"text": "Magog, the Blood Magus. For most villains, cruelty is means to get power; for Magog, the blood magus (see Complete Arcane), power is means to do cruelty. He delved into the darkest arts with the sole purpose of having more options to kill, maim, torture and cause suffering with his spells. He loves seeing people ripped apart in the most horrendous ways. Magog’s is a tall but hunched man, with hag-like face, grey skin and sharp claws, dressed in blood-red robes and hood. His domain is a realm of splatter-horror, where blood and body parts are used for currency and taxation, and cruel, gruesome demons watch over the denizens. Magog rules from his twisted red tower. He is addicted to inflicting pain, but cursed to feel himself once per month the cumulative misery he brought upon his victims, which only drives him further into insanity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "XdVetDIEIUHmaUEC","flags": {},"type": 0,"text": "Lenore, the Bride of Death, saw Death (the real one, not ‘Death’ of Necropolis) as a young girl when he took her mother, and became enamored with the Grim Reaper. She married several times, murdering each of her grooms on the wedding night in order to see him again and again, and eventually Death returned her love and took her as his bride. Lenore is a pale, beautiful woman dressed in black bridal attire with skull motifs. She has warlock’s powers granted to her by Death as her patron, she doesn’t age and cannot die. She lives in a large gothic manor and often hosts parties ending in her guests’ deaths, followed by a heated rendezvous with her ‘husband’ who takes pleasure at her gifts. Her domain is a gothic-themed land, where stories of love and desire from beyond the grave are common occurrence.   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "tvaKp4h6uARrgPYz","flags": {},"type": 0,"text": "Simulacra. Very little is known about this strange entity, which composes its whole domain – the land, the buildings and the denizens are all actually a single, shapeshifting being. It can change its appearance to look like any other domain, including replicas of the denizens and darklord, and even simulate lanbabyds from other worlds, based on information and memories drawn from visitors’ minds. Visitors will probably be sure they are in the actual land being simulated, but with times minor changes and strange events will surface, getting worse until the familiar land changes into a maddening nightmare.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "iLIex7GXjZdZjEC5"}
