{"name": "Gargantuan Creatures","description": "One hundred monsters that are truly larger-than-life.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "NpUsHBZ54EdkAsIY","flags": {},"type": 0,"text": "The Living Mountain – What happens when really powerful magic items are placed into a tomb and truly forgotten? A cache of powerful magic items began seeping magic into the earth around it, causing the very stone to come alive. This mountain takes the form of a massive humanoid shape. The only way to stop it is to traverse the dungeon in it’s body and remove the magic items.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "UwPtVJlaeRWASoFJ","flags": {},"type": 0,"text": "Y’uum, The Evergrowing – This massive creature is a mile-long collection of spores and mold that travels slowly across the landscape. Food and plantlife instantly wilt and go bad when Y’uum is near. If Y’uum comes into contact with a living creature, it will slowly burrow into it’s skin, eating it from the inside out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "i2wB7ir1lHUD82FV","flags": {},"type": 0,"text": "Nimir, Demon Lord of the Ruinous Oblivion – A massive, nearly invisible figure draped in long, disgusting cloth. Nimir oversees the creation of wraiths. When it is time to create a wraith, Nimir descends to the ethereal plane and infuses a soul with a massive rush of negative energy. If one looks directly upon Nimir, it will almost look like you are looking at a mirage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "zre17l1Jt06zRhWG","flags": {},"type": 0,"text": "Shuggdus – The gargantuan, monstrous-looking, water-based creature. They have powerful hearing, especially underwater. The Shuggdus move along on tentacles instead of legs. They are completely blind and rely on touch and sound to get around.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "jKrRtgkYwaoJ3gks","flags": {},"type": 0,"text": "Yazothle – A formless blob that consumes everything in it’s path. It gains the knowledge of anything it eats. The souls of the eaten are sometimes seen trying to escape the creature’s ooze-like body, but to no avail. They are trapped for all eternity. Whatever this creature consumes increases it’s size.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "qg2vWYBAmxtxN4Ox","flags": {},"type": 0,"text": "The Dreaming Maw – A castle-sized crystal floats above the ground, every so often pulsing red. Its lower half goves way to a mess of tentacles, some hundreds of meters long, that twist and writhe ceaselessly. It moves slowly, inexorably, for reasons unknown, and as it does the lands near it warp; first gaining a slimy texture, then sprouting tentacles, eyes, mouths, arms, then becoming those things until there is no trace of nature in them, only squirming fields of flesh. From these places sometimes life emerges, but not as life known to Men. Floating orbs of flesh and eyes, nearly normal creatures with grotesquely large features, fragments of stone from which sprout tentacles, and many other forms which cannot escape and fall back into the warped earth before presumably being destroyed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "MkZonWGXN9Ugh5Wh","flags": {},"type": 0,"text": "The Bickering Hydra – This creature started off as seven princess sisters who constantly fought and bickered among themselves, while their kingdom fell apart around them before armies of monsters. Because of their cursed bloodline, their ugly heads are now positioned on seven serpentine necks of a giant hydra-like monster, so they must share the same body and cannot escape each other’s presence. Their domain is the ruins of their kingdom, full with twisted, chimeric monsters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "MnfYJSqAfqOReMur","flags": {},"type": 0,"text": "Gar-Khoza – Strangely enough, this gargantuan beast is quite passive, usually not paying the living much attention and only ‘feeding’ on corpses and dead plant matter. It resembles a giant amalgam of body parts from various creatures formed into a vaguely humanoid shape. Its state of decay, or lack there of, makes it seem much younger than it actually is. It’s an entity of rot, exhaling and surrounded by a necrotic mist. The occasional animal will make their home inside it, usually a swarm of insects or a vulture perched on its back. It shambles around aimlessly, leaving a trail of harmless, albeit alien, fungi and bugs in its wake. It’s known to defend itself violently if the need arises.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "VXmyfM2JFRnaiQmE","flags": {},"type": 0,"text": "Gzgeth, The Wandering Maw – This bulbous abomination closely resembles a starfish, but house sized (but technically never stops growing). Long arms that extend out radially, as well as thousands of tube feet that propel it forward (see starfish movement). On the top side of its body where all the arms originate is a massive radial maw that its arms are always dropping things into. Its maw contains layers upon layers of teeth all the way into the gullet. The maw emits such a stench of decomposing matter that the word ‘stench’ makes it sound pleasant.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "FElEFR6Hz3Ay2kIw","flags": {},"type": 0,"text": "Seklitlosri, The Black Tear – A massive winged toad with tentacles on her head to bring prey into her razor teeth maw. She has amassed a group of followers who collect her tears in urns. Any living creature that drinks from water polluted with the substance mutates into a toadish creature like them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "Nbr611vU22NhET75","flags": {},"type": 0,"text": "Borovoi – A towering creature of long thin limbs, it hides among the trees, taking the appearance of the forest it inhabits. Preferring the flesh of the apex predator, the Borovoi attracts woodland creatures to serve as bait. The bait is kept docile and unaware, luring the hunter close enough to become the prey.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "zkPDRn7XrkJ5GGy1","flags": {},"type": 0,"text": "Aspect of Fenris – The shadow of a giant dire wolf of the Apocalypse. The howl of the aspect blots out the sun and shakes the earth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "OoLcNYFJjouX0nCW","flags": {},"type": 0,"text": "The Clone Worm – A cosmically large worm hundreds of millions of kilometres across, consisting of the warped and deformed bodies of countless assimilated civilisations. The worm senses and is attracted to the formation of empty husk bodies, like those formed by the Clone spell, and when it draws close enough to be seen twisting and turning in the sky, any creatures created through cloning or through creating genetic copies come out wrong, deformed, warped, often beyond recognition at all, sometimes huge and bloated and other times spindly and wicked. Interestingly, this also affects creatures who have used teleportation magic, as well as any who have been reincarnated or resurrected.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "TueALe2sMjkAhglw","flags": {},"type": 0,"text": "The Vrenbliock – A gargantuan monster consisting of nothing but murderous eyes, hundreds of long spiny arms, and a large mouth. It disguises its grotesque body as a cloud. It uses its hiding place in the sky and its long arms to reach down and pick up unsuspecting prey. The only problem with its disguise is that it’s closer to the ground than most clouds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "ilRJKX0aD5SYIS1V","flags": {},"type": 0,"text": "Crealeth – A hulking monstrosity that waits in the darkest depths. A fleshy transport for the vile creations of the aboleth, the Crealeth is a large whale like creature covered with pustule abrasions that constantly leak a black tar. The creature is host to an exposed maw of needle like teeth as large as the fiercest warrior and a row of blind eyes wrapping around its large dome-like head. The Crealeth is a means to an end, an unstopped leviathan carrying in its stomach the oozing and decaying armies of the aboleth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "llguWp6ra1ISl1no","flags": {},"type": 0,"text": "Tagrabui, the Rotten Being of the Marsh – A gargantuan half-decomposed bear with sloth-like front legs, blind eyes and moss growing on its back. Drool drips from its ever open maw: it ultimately hungers for the Sun, which it’s destined to devour when the time is right. Being in its presence causes the sensation of drowning and objects around it act as if they were underwater. Certain swampland tribes, who do not know any better, worship it as a god of death and rebirth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "sWuNgipoVeHem7D8","flags": {},"type": 0,"text": "Cavestep, The Hill Titan – Thought to be creatures of legend, a Hill Titan rests only a few hours from the player’s hometown. In appearance, they resemble a hill giant, but are much bigger. The back of a Hill Titan is covered in a small mountain range. When they awaken, they rise from the earth, taking everything that was built on top of it with it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "HR5r2ccL2m4FG0Al","flags": {},"type": 0,"text": "Graveteeth – This graveyard golem is the result of a necromancy spell gone horribly wrong. Instead of ressurecting a single corpse, this necromancer unknowingly gained a massive boost of power from his patron and ended up ressurecting the entire graveyard. Made of rotted limbs and tombstones, this shambling creature can be smelled long before it can be seen.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "i4CsJIWSCC1mgtNM","flags": {},"type": 0,"text": "Drak’Munshoo, Eater of Stars – This ancient lunar dragon resides on the dark side of the moon in your fantasy world. When the moon is full, it’s iridescent scales light up and it shoots across the sky, feeding on small stars. What is commonly mistaken for a shooting star is actually the lunar dragon flying across the night sky, belly full of stars.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "y963dJFI5uZmavBO","flags": {},"type": 0,"text": "The Herder – This massive worm takes residence in the temperate mountains and spends just as much time above ground as below. It’s primarily herbivorous, swallowing small forests for it’s meals. The herder has an odd fascination for the goats of it’s mountains, watching them as a past time. If any harm comes to its goats, the worm will do everything within its power to destroy the attacker.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "QrYMVGioB3mdnom9","flags": {},"type": 0,"text": "Turukto – Told to be a gift from the gods of nature, these crane like creatures stand almost 120 feet tall. They mainly act passive against any creature that approaches it, and if dared one may climb onto its wooden body. On its legs sprouts orange fruits of bittersweet honey that goes well with the view from the top of their body.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "bAJfvXxsxEFA2UyR","flags": {},"type": 0,"text": "Jericho – An enormous cannon that fires highly destructive bolts of demonic lightning. Around it grows the living flesh of a tormented siege beast who relies on the cannon to act as its spine and controls it directly with its brain. This ‘creature’ resides in the Nine Hells, eagerly waiting to be used for war.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "Ptk1Z5fuBbrf7U3N","flags": {},"type": 0,"text": "Roga’th the Unmoving – Legend says it is a massive statue that appears to be praying to a god in a field. It is instead luring travelers and creatures to investigate where it will then smash it’s hand down, killing most creatures caught under it instantly. It is unknown how this statue has appeared in almost every continent. Perhaps it is magic, or maybe perhaps there is more than one. One thing that is certain, however, is that it always seems to appear near holy sites…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "lkxgvmqe3GnaGbVH","flags": {},"type": 0,"text": "Skylla – A gargantuan creature that lives near coastal towns. She resembles a Hydra in form. Skylla has six heads, and will devour crewman with each of them of any ship that comes too close. She eagerly waits beneath the waves for oncoming sea vessels.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "DMxZBtSmdMvmG8E0","flags": {},"type": 0,"text": "Nüthmetaya – A gargantuan snake, the size of 20 men around and easily 200 feet long. Many a myth has been based on this beast. Despite the many tales, it is strangely passive, preferring instead to feed on tiny organisms in the waters it swims through. Though it lives underwater for most of its life, it does surface once every 70 years or so for one week to refill its massive lungs. It possesses immense psychic abilities, and uses these to communicate, or to defend itself in the rare occasion something actually threatens it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "UEhpIdktdQHSWXgI","flags": {},"type": 0,"text": "Totoma, the Golden Calamity – Before you stands a dragon unlike any you’ve encountered before. Standing 30 feet tall and at least 50 feet long, Totoma has a mixture of draconic and feline features. His face is an elongated feline face with swept back cats ears and long whiskers, with intelligent amber eyes. A pair of white bone antlers rise from the back of his skull. His elongated body is covered in golden scales that seem to shimmer black, giving the appearance of shifting leopard spots. Around his neck these scales are much larger and longer, giving the appearance of a mane of golden blades. Each of his four legs end in massive paws with wicked hooked claws.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "zzU6be4wBYZtRUAD","flags": {},"type": 0,"text": "Akuma, Beast Of The Dark – A giant bear that sleeps within the forest and protects it from harm. Those that dare to enter his domain and harm it must pray that he doesn’t find them. For the ones he manages to kill, he feeds them to his forest friends.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "f29oIhKBcppZF7yL","flags": {},"type": 0,"text": "The Skeletal Titan – The Skeletal Remains of long dead immortals, be they titans, fiends, or even celestials who fell in battle in the wars of the distant past, their corpses may have been left behind and now all that remain are their skeletons, enduring like adamantine. Only the most powerful of necromancers can reanimate these remains, which act as powerful siege weapons and even weapons of mass destruction should the mage be able to channel more of the titans old self. Lesser mages sometimes try to enlarge the remains of already large skeletons, but they never match up with the real thing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "P18Fyr8HYIr52V9J","flags": {},"type": 0,"text": "K’lyfrd the Red – A giant hound, red and large, that wanders the land and befriending folk. Ultimately more of an NPC, as it is not particularly hostile.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "yOlSzbdKVAjrZFdu","flags": {},"type": 0,"text": "Kwoptarr – A massive frog that lives in a swamp in a massive hollow tree who loves to learn. If you befriend him, his spit is a powerful poison that he will bestow upon people who can tell him a riddle he hasn’t heard before.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "V8IrhNTTpOX4Z9eV","flags": {},"type": 0,"text": "Charybdis –  Charybdis looks like a hideous bladder and twice per day gulps up the water of the sea, creating massive maelstroms that utterly devastate any ships that come too close. According to old sea tales Charybdis is the organ of an ancient God of the Sea that has long since been slain. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "QubHTWoTHu7lOJib","flags": {},"type": 0,"text": "The Cadaver Colossus – The Cadaver Colossus is a truly gruesome creation. It is a giant flesh golem created with the bodies of hundreds of corpses. To animate such a massive body of dead flesh, a group of 7 necromancers are needed to conduct the awakening ritual.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "GlwrzLBW0s7Wn1qo","flags": {},"type": 0,"text": "Vegoreth – This creature is a massive bison that roams the great planes and prairies. He normally travels with other bison, who look to him for protection. He is often mistaken for a large hill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "SXgipHGg4Yq6FY7q","flags": {},"type": 0,"text": "The Nameless Tunneler – Drow, Svirfneblin, and Duergar mythologies all reference a creature which their cultures first encountered when exploring the deep parts of the Underdark. Something truly massive lives down there, even below the entrances to the Abyss and other portals. Explorers’ logs discuss gigantic walls of slowly undulating gray-green flesh filling tunnels hundreds of feet across, slowly corroding the tunnels with acidic slime, yet expanding to fill the space as well. No head or tail have ever been found, so it’s not known if it’s one creature or many, but known locations are hundreds of miles apart. Hideous parasites like enormous flat ticks are occassionally found and attack all observers viciously.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "s4LFfb5BJm38CPMF","flags": {},"type": 0,"text": "The Mithril Defender – A construct created using a ludicrous amount of mithril and multiple uses of the wish spell, the Mithril Defender is possibly the most devastating weapon ever created, save for one flaw. The construct’s two heads are completely independent of one another, leading to it being prone to being easily disoriented.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "xI9ZNq3V9YdjhGqP","flags": {},"type": 0,"text": "The Ruinbringer: Legends say it comes from the outer planes, and others say it’s a twisted form of fiend. Whatever it is, one thing is certain: anything that crosses the path of this dragon-like monstrosity is in danger of total annihilation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "cXdXLztYfvcNkLL2","flags": {},"type": 0,"text": "Black Cloud of Death – These dreadful creatures are incredibly powerful, sentient monsoon-like beings that survive by acts of death and ruin. They appear as thunderclouds, and can be encountered in any warm desert and can move contrary to the course dictated by the wind if it suits them. Their rolling depths do little to conceal the occasional flares of red lightning; the winds that precede them echo with thunder. Their winds carry particles of soot and ash, darkening the ground and the air as they approach.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "9gUViK7Tqu2NesRu","flags": {},"type": 0,"text": "Arachnarok – Of the many spiders that infest the world, the gargantuan Arachnarok is the largest of them all. It is a silent predator bigger than a townhouse. In the depths of the forest, the eight-legged monstrosity stalks and entraps entire herds of wildlife, as well as larger prey such as giants. After capturing larger creatures with its rope-like web and flesh-dissolving venom, the spider would begin to drink up the liquefied innards of its paralysed, but still living victim.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "3Kj9ksMzbWNvT5QU","flags": {},"type": 0,"text": "Iceberooze – A gargantuan Ooze that is mistaken for huge icebergs detached from the ice continent. Those poor ships that collided with the ice that surrounds it were absorbed without a trace by this creature. Once, a powerful group of adventurers managed to end one of these Ooze, which grow to these dimensions due to the amount of waste and food they find in the sea, but these adventurers suffered many casualties. If they cut it, it would simply divide. The only way they found they could stop it was to hit it with powerful fire magic. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "SmF4jsQCdR6KMamF","flags": {},"type": 0,"text": "Jörmungandr – Also known as the world serpent. His scales extend to the far reaches of each continent as he slumbers within the ocean. Much of his body is often mistaken for mountain ranges. And when he rustles in his sleep the continent quakes. Try not to wake him up. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "anKxwcnk87tQzMMD","flags": {},"type": 0,"text": "Eater of Worlds – A giant, brown worm, with eyes running down its whole body. It splits into smaller worms when cut. Feeds off of sin and Corruption. Always at odds with the Brain of Cthulhu.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "AnDuv9Vh6G1D2qtD","flags": {},"type": 0,"text": "The Brain of Cthulhu – A giant, pink brain, with a mass of tentacle attached to it. Reveals a mouth with jagged teeth, with a heart in the center, after taking enough damage. Controls a Crimson infection. Always at odds with the Eater of Worlds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "PKfCKtARxqwAH8hv","flags": {},"type": 0,"text": "Kalkurruka, The Scream fron the Stars – Most would describe it as a worm that came from the night sky, roiling about with no obvious sign of how it flies. It is entirely covered in mirror-like bladed scales, from the tip of its tail all the way to it’s circular mouth that lead to endless rows of teeth of the same material. No visible eyes, ears, nose, or any limbs. Its scales vibrate a harsh clanging, chittering sound wherever it goes, like a million screams floating by. It will occasionally descend to the ground to devour any plant or animal life in it’s path, growing larger and shedding scales to regrow new ones. Anyone who find and cuts themselves onto those scales may be inflicted with a curse that leads to a slow transformation into a sort of hybrid with mirror scales and only a circular mouth for a head. Kalkurruka and its hybrids seem to be searching for something on this plane, though no one os certain what.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "fN8QT6R4zKbIPLQ9","flags": {},"type": 0,"text": "Black Pudding Lake – This gigantic mass of black ooze slowly creeps along, dissolving and absorbing anything in it’s path. This dark ‘lake’ easily regains any lost material by ‘eating’ everything it dissolves. When it creeps through a city, any buildings in its path are toppled as their foundations are completely eaten away, causing mass destruction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "MYt0GF7rHnFmjXHY","flags": {},"type": 0,"text": "Animated Temple – Your party enters a temple that seems unguarded. You quickly and quite easily reach the center where a magic artifact awaits. You take it and begin to feel tremors. The entire temple is shaking around you. You’re running to the exit and are violently thrown around the walls and onto the floor as you make your way out. You see the light but you notice the outside world seems to be moving? You exit the temple and turn around and see that the temple itself is alive, and it wants its heart.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "eAKZYPhECN0Y3I2I","flags": {},"type": 0,"text": "The Yawning Chasm – A large canyon that is, in essence, a giant mouth. Its opposite walls meet each other over the course of a hundred years so it can absorb or ‘swallow’ the rocks and dirt that have fallen in and been forgotten, thus preventing the creature from ever eroding away. Digging into the its walls can reveal treasures and trash left to the canyon over millenniums. Though the Yawning Chasm is unlikely to bother most living creatures, 100 years is only a quick bite on a geological timescale and quite dangerous for most non-living things. Once the canyon has been sealed, it stays such a way for a year, leaving only a baron, thin stretch of dirt where its lips once were. When it finally begins to open again, it loudly echoes a day-long, droning sound for which it gets its name, after which it will be another hundred years before it is fully open again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "N89tPkqwLCFj30jb","flags": {},"type": 0,"text": "Reefback Leviathan – Colossal whale like creatures that are often mistaken for moving islands in the oceans they traverse. Their backs are entirely covered with coral reefs and embedded shipwrecks that have collided with it. They are a prey species for a much larger leviathan creature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "nCWujA13cqz4aZsJ","flags": {},"type": 0,"text": "Jorrenfilg – A massive cloud of dark fog, miles across. Somewhere in the cloud is Jorrenfilg, once a beloved queen, now a complete terror. She’s about 20 feet tall, her body gaunt and her skin bronze, both in color and material. Along each of her arms are a dozen silver serpents, able to extend and armed with searing fangs, and her hands replaced with unicorn horns which she uses to help support her frail legs. The fog constantly bellowing out from her lower face, though it clears somewhat in a small area around her, her lower jaw is split apart and now more like two tusks, the upper part of her face is unchanged and that of a beautiful woman, with tears streaming from her eyes and becoming deadly bolts of electricity zipping throughout the fog.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "lZuzWdvGLDPsndDX","flags": {},"type": 0,"text": "The Meta-Inevitable – If the plane of Mechanus somehow were to fall in to disarray by it’s own hand from conflicting imperatives or Inevitables, this towering construct will be called into action. Build from clockwork parts, it’s titanic form shakes the earth as it walks the planes with an unstoppable determination to set its lesser versions straight. Half modron, half titan, the Meta-Inevitable will always override its orders from Primus if they conflict with its prime directive from the Creator.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "6TLoztG54BIedeec","flags": {},"type": 0,"text": "Ardenvot – Nobody knows what it is, where it came from, or anything else about Ardenvot. Ardenvot wanders the world, usually slowly, killing anything it comes across. It has no destination or objective as far as anyone can tell, but it does often travel in strange patterns, zig-zagging, moving in a circle then spiralling down to the center, going back and forth across random areas, and many more, sonetimes repeating the patterns or ceasing them to start another or travel randomly. The base of its body is a series of hexagonal prisms, 500 feet long, each face 30 feet wide, made of an incredibly tough dull grey metal, forming a larger hexagon. On the inward facing edges of the prisms are white lines, from which spear-like tendrils attack anything in the middle with lightening speed. The prisms are connected to eachother by black spheres with a diameter of 60 feet, from these spheres it can form appendages as it wishes, though fragile and weak they’re able to form legs to hold it up and walk around, and pull or fling whatever life it comes across into the middle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "cjLJ3XX2eJwIRYFX","flags": {},"type": 0,"text": "Kylix, the Cloud Spider – This colossal silver arachnid hangs from a web of altocumulus clouds past the edge of the world, constantly spinning wispy clouds from the water vapor in the air and feeding them to the wind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "u3eDRknNeSEQn16v","flags": {},"type": 0,"text": "Quercus, The Living Ecosystem – This gigantic oak-based treant, whose branches are full of life, rests sleepily in the middle of a dense forest. Birds, squirrels, bugs, and bees all nest on or in him and all will defend him with their lives.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "tEczFBhoXgKHzUov","flags": {},"type": 0,"text": "Garrus, The Stone Watcher – a giant earth elemental who melded his body into a mountain with only his face showing. He watches over the valley. Most people think his face is merely a rock formation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "ZzVtMq8BPwFzD3tf","flags": {},"type": 0,"text": "Sidderous, the Malevolent Moon – Once a demon lord, Sidderous was tossed into orbit and crushed by space rocks by the Gods, forming a small moon. This moon still contains the demons essence and he can blight the world or cause bad luck on the world below.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "ijEgNvb4NiyeYj9M","flags": {},"type": 0,"text": "Hoydecko – A stoic, wraith like creature that stands unmoving over the great valley. Hoydecko’s masked face is parallel to the mountains on the horizon. It’s body is almost transparent and things pass through it unharmed. You could be forgiven for mistaking Hoydecko for an illusion, but it’s gentle breathing can be heard and felt echoing behind the mask. Hoydecko has stood longer than the oldest tribes in the valley. He is a feature of many myths and prophecies. What is is there for? Is it sleeping? Standing guard?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "T9g3H5HVPuXKFudY","flags": {},"type": 0,"text": "Queen Oryst – The first dwarf. Over thousands of years, she has grown to immense size. Her beard is like a grey forest and her spear is as tall as a mountain. She is wise and peaceful, but has no time for elves and reacts violently to drow. She might be immensely old and patient but she is still a dwarf, grim and doom-driven.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "fStnwL5dxaEAaLP3","flags": {},"type": 0,"text": "Teref-zanab, The Many Wormed – A writhing mass of worms that lives below the land, its million appendages gathering information and food for the large, central body that is unknowable under the writhing mass of its body. Those that approach feel themselves draw ever closer to the central mass before they are torn asunder by a million writhing worms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "q5Ev4BOQIHxEXo6Y","flags": {},"type": 0,"text": "Kroll, The Many-Scaled One – A giant chimera, with the head of a snake, the body of a lizard, and the tail of a fish. Kroll is the byproduct of some ancient goddess who got frisky with some monsters eons ago. It does not have too much sentience, but does remember the thousands of years it has lived so far. Kroll does not like to be disturbed in its solitary life at the coast, but more than that, Kroll does not like to be hungry. And it is always hungry.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "g6XWMGTck3UuwjRM","flags": {},"type": 0,"text": "The Wandering Island – Sometimes seen out at sea, appears to be an undiscovered island. However, stories of it’s location are constantly changing. Some people claim to have stepped foot on it only for the island to submerge into the sea, forcing them to swim back to their boat. Others claim to have seen it emerge out of the water. Most people claim that it’s is a reverse mirage, land where there shouldn’t be. Further investigation may reveal that it is a Gigantic Turtle that wanders the ocean.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "O3KdsnRLD1JOijhV","flags": {},"type": 0,"text": "Kletterhaus – A somewhat sentient wizard’s mansion on six lengthy limbs of living wood that can be used to walk and climb. When its master is away, it feeds by lowering it’s basement chamber onto trees, opening wide its cellar doors, and then biting off their tops. It runs away from fire, but defends itself against persistent pursuers. The legs regrow, albeit slowly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "crK816L3iCzvTLHa","flags": {},"type": 0,"text": "Unz Bak – The name comes from an old orcish dialect, and rather poetically means ‘large ball’. These coast-dwelling beasts are somewhere between reptile and mammal, covered in thick, flexible plates. They can be found squatting above or in ocean shallows, heads rooting around for any food submerged beneath the sandy floor. When a herd has exhausted a stretch of coast, they move to solid land, bite their tails, and roll towards the next stretch. Unz bak are prized for their armor plates and man-sized eggs, which are often deposited close to shores they intend to revisit, but keeping track of them is also important to coastal fishing towns due to the fish swarms that follow in the wake of an unz bak feeding. Unz bak are fairly docile, but can be rather crudely ‘trained’ for battle, a practice that orc warbands have used before for devastating pillages.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "Ny0FsTJniOKaBuiv","flags": {},"type": 0,"text": "Cloud Drifter – Cloud Drifters are translucent sacks of organs bound inside an oily, bubble-like membrane. Gossamer filaments drift behind them on the winds, catching stray meteoric material and food particles. The one fully opaque part of a cloud drifter is its beak, a metallic, serrated cone between eight to twelve feet long, which can thrust downward to rip the flesh off of any creature that has somehow ascended to the cloud drifter’s altitude, thousands of feet above the clouds. Cloud drifters react poorly to higher air pressure; every bit of their corpses except for the beak tends to disintegrate before reaching the ground, making it hard to prove their existence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "EUrWVxlSshYZ1Nri","flags": {},"type": 0,"text": "Trappercaps – Trappercaps are chitinous monstrosities, with twelve gnarled legs supporting a fleshy structure not unlike a mushroom cap, thirty feet in diameter. It has no discernible eyes or head, but the top of its cap is studded with mouth-like orifices. Each orifice contains a hook-tipped tentacle, which trappercaps exude when hunting for prey. They appear to sense primarily through smell, touch, and vibration. Trappercaps lie dormant for weeks, legs burrowed into the ground, letting foliage, debris, soil and snow cover their tentacles until something steps on one, at which point the offended tentacle plows upwards, hooks the unfortunate prey, and retreats back into its corresponding mouth. When overwhelmed with multiple prey items, the trappercap bursts from the ground and begins an indiscriminate, frenzied feast, before relocating at high speed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "VSRdtBAcKqeKGqZv","flags": {},"type": 0,"text": "Daruur Adag – This massive creature, often mistaken for several landmotes, drifts through the sky. In actuality, it is a sky octopus clinging to a collection of landmotes, carcasses of sky whales and the ruins of some lost great civilization. It is normally docile, but occasionally releases a stream of flammable gas to adjust it’s bouancy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "TPnoF3GskCg4ExfX","flags": {},"type": 0,"text": "Heke – A massive roc that is three times the size of the average roc. It has been terrorizing the countryside for close to 400 years now. Nothing can seem to match it’s strength and speed. It feeds off large herding animals.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "byMMe95EGPYoOXey","flags": {},"type": 0,"text": "Killith – A giant six legged, two tailed crocodile that stalks the Oka Maobo swamps. Tribes in the area dump a portion of their food into the swamp every night to appease the great Killith.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "09g93SYAssst5tzh","flags": {},"type": 0,"text": "Galia – The mother of all dryads, Galia is found in a forest in the feywild and is said to be 100-300 feet tall. Galia is responsible for creating seasonal change. If Galia dies she simply is reborn from her old corpse. Galia is lawful in nature and will only appear to those who she wishes to see.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "mXV7mnJfmQS6Xe0A","flags": {},"type": 0,"text": "Hemorgolix – An incredibly large sentient clot of blood. The blood flows and beats as if Hemorgolix was a giant heart. No one truly knows where Hemorgolix resides but it’s worshipers one day hope to summon it into the material plane.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "8otFbMlCPExcaWa6","flags": {},"type": 0,"text": "Hammerclaw – This vast crustacean will hunt anything from wales to ships. Resembeling a massive crab with two sets of claws, Hammerclaw sometimes attack coastal settlements as well, especially if he is feeling territorial.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "1EwvuYSYU07Q19nk","flags": {},"type": 0,"text": "Oarthen, The Old – Oarthen is the very first elephant, placed on this planet by the Gods as a protector of humankind. It is his job to watch over the human race, and to destroy anything that would cause harm to it. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "p163A9YpSFhX2Tva","flags": {},"type": 0,"text": "Cliffracer – Cliffracer is a bird-like creature that has a wingspan of almost thirty feet and a long verticle sail along it’s spine. Cliffracer lives in large caves along an ocean cliff, and patiently waits for ships to pass by. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "pnxVycu3io6XmH4R","flags": {},"type": 0,"text": "Dragondie the Dragonfly – Not much in this world is scarier than a dragonfly big enough to feed on dragons. Earning the name Dragondie by an adventurer who claims he saw it take down a dragon, Dragondie resides in the forest and is thought to be a primordial bug.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "NpXDbB4kMtomXLZS","flags": {},"type": 0,"text": "Giennu the World Owl – This fey creature often befriends Sylvan creatures, and despising anything else. Giennu sits at 15 feet high and only appears at night. If travelers are walking the roads at night, it is almost certain that Giennu will swoop them up, never to be seen again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "9Fagduqw7Raf0TnX","flags": {},"type": 0,"text": "Garg-ANT-uan Ants – These massive ants live in cliff formations in the desert. They are the size of horses, and their tunnels are said to reach the center of the earth. Dwarves love them for the tunneling abilities, but fear the sort of things that they might awaken in the earth below. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "U7h2cKROkFflfWzV","flags": {},"type": 0,"text": "Hellfang the Rat – This disgusting creature resides in the sewers underneath a major city in your campaign. This massive rat, usually accompanied by hundreds of other regular rats, scours the sewer tunnels looking for fresh meat. People have claimed to see Hellfang reach up and grab people from the sewer drains, in broad daylight, and drag them down into the sewer. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "u3twFZd3MAlFSPTM","flags": {},"type": 0,"text": "Corpseface – Corpseface is a gargantuan bioluminescent bat that lives in deep caves, coming out only at night to feed. The body of Corpseface glows a bright neon green due to the millions of microorganisms that flow in it’s bloodstream. Corpseface gets its name by the gruesome appearance of it’s face after it feeds. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "kOHII4yeMinT1n1b","flags": {},"type": 0,"text": "Kalut, the Devourer – This titanic insect-like fiend is a master of Rot and Decay. Anything organic that this creature touches will soon rot and wither away. It takes the form of a massive locust, but walks around on two feet (when not using it’s wings). It tries to spend it’s time desicrating holy temples and shrines.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "1Pm9nokcsJ0pVXry","flags": {},"type": 0,"text": "Rusted One – While the Rusted One does not have a definitive form, it is a conglomerate of rusted armor that gets left behind in dungeons after their wearer suffers a horrible fate. The creature can smell rust, and immediately drags it’s loud, clanging body through a dungeon to retrieve the fallen armor. After 400 years, the Rusted One has a cult following of dwarves that wish to dig this massive creature out of the mountain, and release it upon the earth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "ADw0DVSqPosQ9zU3","flags": {},"type": 0,"text": "Colossal Apes – These immense apes are incredibly dangerous and predatorial. Found on large jungle islands, these apes drive away or kill anything that gets bigger than it, in fear that something might be bigger than them. There aren’t many left on the planet, and fewer live to tell the tale of seeing one in person.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "EzpxlODQ3oKdJuXQ","flags": {},"type": 0,"text": "Roots, the Shambling Mound – Left to grow for centuries, this Shambling Mound is said to have roots that travel for hundreds of miles. Massive trees have grown into the back of Roots, which is a testament to the amount of time that it has laid dorment. Over the past few nights, people in the local village have felt the ground begin to shake. It is time for Roots to awaken.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "9lFiOwl2GnCqbios","flags": {},"type": 0,"text": "Elder Tempest – These creatures are some of the most powerful of Elementals. In this case, the Elder Tempest takes the form of wind. Created by dark clouds, wind, rain, and thunder, the Elder Tempest looks like a massive feathered serpent. The Elder Tempest controls massive storms that have been known to bring cities crumbling down with ease.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "29gU097UqqeSYlUu","flags": {},"type": 0,"text": "Abis, Demon Lord of the Deep – Abis lies dormant in the impossibly deep trenches of the ocean, waiting for his worshippers to bring him the body of a kraken. Only after he finishes feasting on the kraken will his hunger return, and then, the waters of the world will run red with blood. Abis takes the form of a massive nautalus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "hbu3LS9xgxopLi7C","flags": {},"type": 0,"text": "Agonath-Ra, the Chained Doom – This creature was an evil wizard who transformed himself into a colossal, tarrasque-like monstrosity, lying waste to whole towns. Now he is almost completely paralyzed, buried under a hill. The denizens of his domain built their city upon this hill, most of them unaware of the beast underneath. Some of them discovered the truth though, and use tunnels to reach Agonath-Ra’s body. They harvest his flesh and blood and use them for magical purposes, becoming more powerful – and monstrous – by the process. Agonath-Ra is helpless to stop this torture (though he regenerates quickly any damage), and the occasional earthquake is the most he can do. But he still dreams the day he will break free of his earthly prison.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "VZy3pamWgCd1AurE","flags": {},"type": 0,"text": "Shriek of the Caverns – This obnoxious creature hides in crags and small caves. Its shriek can be heard from miles away, and those who linger too long near it will begin to feel their bones crumble from the pressure created by it. Up close, it resembles an extremely round and fat beetle, however, where its face would be is an impossibly large maw.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "gyLVx0QxJwJYEl6x","flags": {},"type": 0,"text": "Gorefang, the Gargoyle Lord – This creature is the dread lord of a great gothic city full of gargoyles and other statues, all of which come alive at night. Gorefang sits upon a massive cathedral, waiting for travelers to come to his crumbling city so that he may feed again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "BmYjltVaD5z06hJG","flags": {},"type": 0,"text": "Pale Strider – From the foggy mist extends a long, gigantic and lithe limb attached to a large clawed foot. The flesh is human like, but is a sickly white and translucent showing the network of veins below. The creature’s body is obscured by an ever present ethereal fog that is chilling. It moves silently for its size and is rarely hostile unless provoked. It’s fog does necrotic damage and wherever it travels, a plague seems to follow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "cH3j2qh8K6B60O9d","flags": {},"type": 0,"text": "Terror of the Sands – This creature resembles a massive scorpion out in the middle of the Taz’ring desert. Brought to life by a sinister cult that could not contain it, this creature wanders the sands looking for it’s next meal. It can run insanely quick for a creature of it’s size. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "w194CHdrjiWw4DZX","flags": {},"type": 0,"text": "Kobold Stack – This ‘creature’ is just ten kobolds standing on each other’s shoulders. In the kobold’s mind, bigger is better, so why not be as big as you possibly can? While, yes, it IS startling to come across, they are very easily knocked over. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "JXOs7uGwsIXvKsKT","flags": {},"type": 0,"text": "Gravegrub – A massive grub that constantly feeds on corpses beneath graveyards. Local funeral homes offers special adamantine caskets so your loved one won’t be eaten by Gravegrub. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "Vsjd0gz1fLo3PoAX","flags": {},"type": 0,"text": "Smiley’ the Serpent Lord – This creature resembles a massive snake with a human face, stuck in a permenant smile. ‘Smiley’ has been seen wandering closer and closer to a swamp village in the region. Reports have said they they see a massive human head smiling at them from below the murky water, just watching them. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "jTmUFQGUpxu50MfK","flags": {},"type": 0,"text": "Loo’shin, the Giant Squid – The giant squid is one of the most feared creatures a ship can face on the open sea. Loo’shin is no exception. She loves to collect shipwrecks and bring them back to her lair.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "FONoavxepF4VrMJr","flags": {},"type": 0,"text": "Crystal Colossus – A towering golem-like creature whose main crystal color determines its temperament. If you witness a red Crystal Colossus, run as fast as you can.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "PwVh4OjapPohqHdk","flags": {},"type": 0,"text": "Seaweed Giant – These giants lurk in the deeper bays around the shore. Getting up to 30 ft, these large creatures feed on huge clumps of seaweed that form in the bays. They are thought of as protectors of coastal villages, as long as the villagers bring it enough seaweed to eat daily. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "D3NbzlWwBucPsPoD","flags": {},"type": 0,"text": "Huge Arcane Jellyfish – These jellyfish are crafted from pure magic. A few have even grown to the size of small towns. Because they are made of magic, these creatures float aimlessly in the sky. Their long tentacles sometimes hit the ground, causing a massive explosion of electrical energy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "9k2gfporP9ZG9LUO","flags": {},"type": 0,"text": "Pephellius, The Talking Forest – Long ago, a druid awakened a popular tree. That tree spread through its roots sending up new shoots, now the whole forest is sentient.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "dSpcEeoIzBInwwqv","flags": {},"type": 0,"text": "Adamantine Tortoise – Also known as Adamantine-Shells, these gargantuan turtles are found deep in the Underdark, gorging themselves on minerals and ores. As it eats, the minerals are absorbed into the turtle’s shell, making it even stronger over time. These creatures are very protective of their caves, and will charge at any light source it finds underground.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "hDWaEavW20vXSWRO","flags": {},"type": 0,"text": "Rust Dragon – These dragons have an insatiable hunger for weapons and armor, making them a very diificult foe to fight. They are gargantuan creatures, and their rust colored wings block out the sun when they fly. Rust Dragons feed upon small mountains, trying to get to the delicious ore inside. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "qRr4v2MjNTlajC0a","flags": {},"type": 0,"text": "Sheyeoxks – This extra dimensional being, the size of a solar system, creates wormholes to tunnel through the universe one dimension at a time. Its true form, being of hundreds of dimensions, is impossible to conceive. It’s so big it has its own gravitational pull.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "egAEqKT2BHfZZfNK","flags": {},"type": 0,"text": "Giant Bees – Originating from deep in the Fey Wild, these bees were created by an ancient order of druids that sought to protect their domain. Unfortunately for the druids, these creatures are bumbling and lazy, just like a normal bee. Every once in a while, a riff in the Fey will open up and one of these bumbling oafs will make it’s way into your realm. While they are funny to look at, if provoked, they can become very dangerous. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "20Gxt3EJO39zM5XH","flags": {},"type": 0,"text": "Bismark – One of the first complex creatures to evolve on this plane, Bismark started out as a nautilus type creature feeding in primordial seas as an alpha predator. He has fed and grown, fed and grown, using his size to overpower anything he came across. After eons of racing evolutionary branches (some he fathered) and winning, he was discovered by one of the first deities who changed him into their planar battleship, spearheading the invasion of worlds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "RbTpuaoxk5VGIUdn"}
