{"name": "Shops and Stores","description": "One hundred interesting shops and stores for your campaign.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "otDvAaENbpesVJG9","flags": {},"type": 0,"text": "Madame Ortho’s Oddities: A curiosity shop that sells useful (sometimes cursed) trinkets. Examples of some of her wares: a mummy hand that tries to strange it’s owner while they sleep, a compass that points to the person that hates the owner the most, and a stuffed Vargouille.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "gh6kIZ41czoqwyNY","flags": {},"type": 0,"text": "The Cobbler: A store that sells all kinds of horseshoes, for all kinds of reasons, but you notice, this town has no horses. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "i0DzvIyAA3JIEa0H","flags": {},"type": 0,"text": "A Man’s Burden: A blacksmith who displays and sells exotic weapons, made using blueprints gathered from across the land. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "Vg4J5BrcsrS7asqg","flags": {},"type": 0,"text": "Row after Row: A store specializing in boats, specifically, boats that use rowing to move. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "nEyU63Kf7CFnnm35","flags": {},"type": 0,"text": "Gertha’s Topography: A woman who sells maps she has found and made across the continent, from huge full continent maps to small maps of ruins and towns. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "uaTkeuxshBYYgVow","flags": {},"type": 0,"text": "Fran’s fortuitous froths: potions of dubious origins and craftsmanship, they almost never work as advertised, but always help you in a way you didn’t know you need. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "QHmC8f6gJFDiPVZu","flags": {},"type": 0,"text": "Sofie’s softies: pillows of the highest quality, stuffed with feathers of magic beasts, and enchanted with various effects. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "l6Xp5c6dbbki10jw","flags": {},"type": 0,"text": "All the RAGE: battle axes and fashionable shirts. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "I9r1hyQCmZ6KPAOS","flags": {},"type": 0,"text": "Wrench warfare: magic craftsman tools that can change into weapons. Great for sneaking weaponry past the border or into the castle. You can place custom orders. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "jZrxAaXAQ0v4BL4k","flags": {},"type": 0,"text": "Caesarean’s Palace – “Veni Vidi Veni”: The strip club on the bad side of town. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "MQlfneaVddGlqenR","flags": {},"type": 0,"text": "Head, Shoulders, Knees, and Toes: A store ran by a mysterious wizard, it only sells human appendages. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "6Pq1Dyd7SrqAfhlo","flags": {},"type": 0,"text": "The Lotto Grotto: A store that sells magical items, but the item could be cursed or enchanted, and the buyer only knows after using it once. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "EDQX8l09S9Xro7Cm","flags": {},"type": 0,"text": "Gertrude’s Trinkets:A dingy magic shop on a back street that sells surprisingly good (we’re talking some top notch stuff here) magic weapons and trinkets for ridiculously low prices (half the price of normal on average). At midnight anything bought from the shop returns back to the shop magically, and the shop teleports to another remote location. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "JUtiUuOYBuxWx94B","flags": {},"type": 0,"text": "The Satyr’s Pact: A tavern run by a satyr who offers musicians a deal. If they impress him and the crowd with a song they earn a instrument that is always in tune and free room and board for life. If they fail, they work in his tavern for a decade but can audition again for the same deal, years do add up. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "g8fvNwhBIRefjBrX","flags": {},"type": 0,"text": "Rock Candy: Sells and buys a wide variety of gemstones. The shopkeeper is an Oread who has a tendency to eat the product, much to the dismay of the shop owner.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "WgFJXy1LPyDKARS4","flags": {},"type": 0,"text": "Scrumdidilyumptious: This bakery is owned by a sorcerer whose focus is on her craft. She likes to infuse her goodies with spells, from rainbow cookies that make your tongue temporarily a new color to a slice of chili cake that makes your fire spells scarily more potent for a while. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "8aEvxIRvz7GXs14g","flags": {},"type": 0,"text": "Munsters R Us: A tiny Pug stands at a crate, hollering in broken common to come over. He’ll buy your scavenged monster parts (albeit at varying prices) from you. If you give him enough, he’ll turn them into an item. It’s disturbing, but how can you resist his cute lil’ face? ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "KqaaJCwjifWBdjto","flags": {},"type": 0,"text": "Furever Homes: Offers small and under-sized creatures as animal companions and pets. They have the basics, like rats, spiders, etc., but if you have enough money, you could adopt more exotic creatures. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "5rJxZMPzemqRAhHi","flags": {},"type": 0,"text": "The Mountaineer’s Bandolier: Sells survival kits, potions that help you adapt to weather, and various supplies that help explorers get through tough climate situations. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "TarY45hQQ7WC3Sqj","flags": {},"type": 0,"text": "Fizzlesprocket’s Dairiticiary: A quirky gnome runs this ice cream stand and tries to pawn off bizarre treats. You won’t know if you like it till you try it. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "W7mGl7C4i9pI4CyQ","flags": {},"type": 0,"text": "Blood letting: general store takes payments in different kinds of blood. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "OC1NgilQUP2v2fLn","flags": {},"type": 0,"text": "Binxes potions: potion store run by the Sanderson sisters from hocus pocus. Don’t let kids near this place they have an unfortunate habit of disappearing. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "BK23uyzDFmmjjMhR","flags": {},"type": 0,"text": "Morticias morgue: will hide and remove bodies, perform autopsys etc in return for rare bodies/monster parts. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "zjh75OqJLA7cA3Oa","flags": {},"type": 0,"text": "Tinker and sons: apocalyptic/doomsday prepper family of ghomes will fix, repaid or mod weapons in return for canned foods, junk weapons and scraps of metal. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "wU15OaIZyw96CF4L","flags": {},"type": 0,"text": "Fallen from a star: A well known bar/pub can find different celebritie style characters like Worgen Freeman or Clint Westwood. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "NZK4wKZPnvHY97Ak","flags": {},"type": 0,"text": "Seamus the Imp Peddler: A travelling peddler, riding a covered cart led by a mule, stops by the party. He explains that he specialises in the sale of imps, but so far the only ones he has been able to obtain (trade secrets and all) have limited lifespans. It’s a mixed bag in his opinion so all the imps cost the same. Imps cost [1d20/1.33] GP each, half this if it’s raining. On purchase the imp is bound to the character until the imp’s unique demise. Each imp has a craving and a fear; if the character is helpful in these regards the imp’s loyalty will improve. Each imp also holds a secret agenda of mischief. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "qyftpLl5Mumr6odn","flags": {},"type": 0,"text": "Herb the Hatters: Herb makes exquisitely beautiful hats which are quite uncomfortable. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "0j13xKRT6XX3YVq5","flags": {},"type": 0,"text": "The Transport Tube: Any common item will fall down from a tube from above, assuming something of value has been put in the slot in the cubicle. Approx 5ft square circle room. Out the back, some creatures would be feeding the items in. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "Jz9YskNLdHClQURZ","flags": {},"type": 0,"text": "Murray’s Theatrics: The half-elf Murray retired from the life of a wandering bard eight years ago, but still loves the trade dearly. His shop (which is really just the anteroom to his house) stocks sheet music and scripts for the lutist looking to expand her repertoire, or the troupe seeking to get ahead of the new fashion in comedies. The texts cost next to nothing – Murray remembers what it’s like to travel on a performer’s income. The real money comes from his younger brother, Astor, whose potions create audience-dazzling special effects. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "mTGebrFGl8aXbmRA","flags": {},"type": 0,"text": "The Furrowed Brow: Esmeralda Turnbottom’s mother made wards, and her mother made wards, and her mother made wards… And Esme has never been one to spoil a good tradition. The wares range from mundane (a pendant against forgetfulness, carved from gingko bark) to the specialized (ground cat’s tooth to drive off harpies). Once a year, she closes up shop for a much deserved vacation, and returns with an armful of oddly specific wards. Such as “protection from a stampede of your own cattle frightened by a thunderclap on a moonless summer night”. And yet they always get bought, and they always end up useful… ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "d7S49hcMpQbpa67O","flags": {},"type": 0,"text": "The Sizzler: An exotic restaurant run by a very jovial, and very fat, half-ogre named Thog. They specialize in rare meats of all kinds and will pay well if what you have is fresh. From drake wings to spider legs, if it’s fresh and serviceable they’ll buy it. Their meals are renowned for being tasty and surprisingly filling, and the exotic nature of their ingredients has been known to impart certain temporary boons to the consumer. The house special is constantly changing, so get in quick before the line forms! ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "OWlrqu3ix0fi5oGv","flags": {},"type": 0,"text": "Nero’s Place: A shop run by an aging, paranoid neurotic elf that is convinced there’s a demon after him. Nero sells a wide assortment of scrying crystals, mirrors, looking glasses, and patented listening tools that he uses on a daily basis. Some of his inventions are actually helpful, like his ‘Peek-around’ that angles two mirrors inside a square tube to look around corners. Others are less helpful, like his ‘Hearing Helm’ that is basically two gramophone bells welded onto a bucket. He also sells protective charms and wards to help keep… well anything off your back, really. For the paranoid inside us all, Nero’s Place is the Place for you! ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "D2mde9S12QdbbJiB","flags": {},"type": 0,"text": "Goldie’s Locks: a wig shop selling enchanted wigs that are just right. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "COrpd6DcTS3tNjm4","flags": {},"type": 0,"text": "The “ooks” Store: A dingy store front window displays “ooks” peeling gold lettering. Inside the dimly lit shop are shelves upon shelves of musty old volumes fill up the space until only narrow paths await the adventurous customer. After searching the store you might find what you want…or need in the future. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "ZMHk99jiz0ykhMzH","flags": {},"type": 0,"text": "The Amazing Omar’s Shop of Curiosities: Omar, a flamboyantly dressed merchant waves, you over to his display wagon to view his wears. Various charms, potions, knick-knacks, and unguents are on display for all to see. If you are a polite and interested customer he may be persuaded to showcase his more interesting items… ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "Yx0T7EB8pXdcgic7","flags": {},"type": 0,"text": "Adon’s Exceptional Reflection Collection: A good sized shop that sells mirrors of various shapes and sizes, run by a reclusive and eccentric old gnome named Adon. Mirrors hang from almost every surface, with some even dangling from the ceiling or the bottom of other mirrors. It is incredibly easy to get lost wandering the store, and the inside seems significantly bigger than its outside appearance belies. An observant customer will notice that some mirrors occasionally reflect fantastic locations with startling realism. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "w6xZRTBk9Gwawa9D","flags": {},"type": 0,"text": "Ketterman Barley’s Stonecarving and Statuary: Ketterman is a stone carver of some renown, and does all kinds of stonework from bas-reliefs and fountains to statues and headstones. He’s expanded his business recently by offering smaller, personal busts of the client for a reasonable sum, depending on the quality of the stone. Ketterman typically sells to the upper class, but as long as you can pay he’s more than willing to work with just about any customer. But here’s the catch: Ketterman is actually an accomplished diviner as well. Every time he carves an eye into his stonework he can use those eyes to scry through at any time. Ketterman uses his vast network of eyes to spy on anyone within their gaze, and if he comes across something particularly noteworthy he sells that knowledge to the highest bidder, or uses it as leverage for blackmail under his assumed alias of ‘The Emerald Pool’ (because his eyes are green). Ketterman has been operating for almost two decades now, and his work has traveled far across the land. Odds are his stone eyes have seen something you didn’t want to be seen. So tell me friend; what are you hiding? ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "mee7fPOSWaRlcB9K","flags": {},"type": 0,"text": "Blood Of Thy Enemies/Blood Of My Blood: Half the shop weapons & instruments of death run by tiny, aggressive woman. The other half a healing shop run by a large barbarian type man who’s gentle. They are a couple…opposites attract? ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "kuMOUgYNq4yOtflz","flags": {},"type": 0,"text": "Rats, Bats, & Vats: Your typical cauldron witch type store. Alchemy, herbs, could be run by hag. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "GnY5UFWjdQSh1JNm","flags": {},"type": 0,"text": "Kern The Hammer’s Hammers: Shout out to Critical Role. Half-Orc Kern The Hammer has given up on fighting in the pits after the loss to Grog the Barbarian, the shop has every kind of hammer you could ask for. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "HrU1fPuRNOCaFHlW","flags": {},"type": 0,"text": "Maybe It’s Adamantine: A clearance type shop of magical items. Genuine as advertised Magical Items are in stock but rare. Lots of faulty or completely misidentified items. Create any additional rules, such as refund any item after purchase but at 30% of it’s value, no identify spells allowed on store premises, etc. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "EJZv2qpbTdR3Tvki","flags": {},"type": 0,"text": "Ninth Level: Hell themed. Run by a demon or devil. Opportunity to buy existing contracts or forge a new one. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "IaZsFzeYo3iymCE9","flags": {},"type": 0,"text": "Mendelsen’s Magnificent Mending: Mendlesen is the most talented mender in the world. Clothes, artifacts, magic items, you name it & he/she can mend it. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "2FpxYjTo3hPzoaW6","flags": {},"type": 0,"text": "Carts & Crafts: Every kind of vehicle for sale & rent. Can purchase passage on different methods of transportation as well. Purchases come with option to register as a transporter to provide passage & collect fares. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "98NnX3ceBqgm6Ljw","flags": {},"type": 0,"text": "Dark Arts & Melted Hearts: Your typical “Dark Arts” type store, but complete with a tavern type meeting area that regularly provides a speed dating-esque environment for undesirables, villians, & general ne’er-do-wells. Everyone deserves a shot a love right? ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "GAOBZPkdN3TR65BF","flags": {},"type": 0,"text": "The Dock of Many Flings: A store either on the water or with a large well inside. There are no items, only shelves and shelves of pebbles worth different tiers of gold. You buy a pebble, then stand over the designated area and cast your pebble into the water. You gain a random magical effect, item, or etc. (eg. A Mini or alternate deck of many things) ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "TC2XTyY7IbMRqHVX","flags": {},"type": 0,"text": "Whispers & Secrets: The only goods bought and sold here are rumors, secrets, other generally unknown information. You cannot pay with traditional currency, must offer hidden information of your own to barter with. Use either an unbiased magical system (such as speaking your secret into a glass jar, putting the lid on placing upon a magical scale that determines it’s weight/value), or for more interesting roleplaying opportunities have a totally biased shopkeep the players can haggle with or try and persuade. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "ka4DDyVyymbnIiVD","flags": {},"type": 0,"text": "Proctor & Son’s Deadly Traps: More a small dungeon than a store, the ceiling to floor to finally the basement is covered in traps. You must survive long enough to actually disarm and then purchase your chosen traps. It used to be a family business but that didn’t last for very long. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "dTdJyt9L4mmFdWdE","flags": {},"type": 0,"text": "Impeccable Times: In a building stylized as a home befitting a cuckoo clock, the sound of ticking from countless mechanisms dominate the senses. The blind elderly craftsman shows no concern for anyone except his owl which is never far from his side. Secretly, he can hear from every watch and see from every clock he creates. The owl is also a mechanical contraption. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "J8ysrAI5BzZHA4tf","flags": {},"type": 0,"text": "Ayesha’s Insult Emporium: The store’s name, in simple black lettering, is all that infers what lies inside. A friendly middle aged woman (presumably Ayesha) wearing a sari greets customers entering this store’s antechamber with a sharp personal insult. Anyone who takes great offense to the insult is teleported out of the shop and can’t re-enter. However, those who accept it in good spirit will be led by Ayesha to the main room which contains shelves and cabinets filled with scrolls, books and scraps of paper containing some of the most brilliant, sought-after and mind-bending insults to ever have been uttered or penned. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "7utDOUFCTHQpzNsu","flags": {},"type": 0,"text": "The Green Room: This inn, hidden by an entrance in the sewers, provides lodging in rooms made completely of thick glass. The floors consist of different types of soil, and beds are constructed from clay with meagre hay mattresses. Patrons that stay the night develop a slight green tinge to their skin that persists for a week. For this duration, as long as one stays in direct natural sunlight for at least 4 hours a day, they need not eat. Sleep is required as usual, and water requirements per day to survive are doubled. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "ghcbHcK0nD1letxP","flags": {},"type": 0,"text": "The Potato Is Just An Illusion: A comedy club and tavern frequented by illusionists, diviners and enchanters. Patrons dine, drink and listen to wizards from the local guild tell comedy that is usually highly academic in nature and augmented by various creative illusions. STRICTLY NO IMP FAMILIARS ALLOWED. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "24fd7AsBycQMXW7t","flags": {},"type": 0,"text": "Piander’s Books: A poorly lit bookshop filled with books of ancient lore. Run by a seemingly mute man in a dark cloak, he watches visitors closely from the shadows. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "9xmQTNmSUMtSDTXm","flags": {},"type": 0,"text": "Alethra’s Tear Shop: A medium sized store with shelves full of tiny bottles of tears, the are all carefully labeled with the date the tears were shed, the name and race of the being that shed them, and the reason they were shed. Run by a middle aged woman named Alethera, an unusually cheerful woman who is as eager to buy new tears as she is to sell them. Alethera is especially interested in the tears of adventures and famous people. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "pDQiaUsqQjwM8R28","flags": {},"type": 0,"text": "Adventure’s Emporium: On the outside it looks abandoned and if you ask around town you will be told it is cursed or haunted, but when adventures enter the building they enter a spacious, well lit store full of ten foot poles, iron spikes, torches, and other adventuring gear. It is run by a retired adventurer. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "v9onbQC3MITSjqw9","flags": {},"type": 0,"text": "Darvin’s Dandy Dolls: A shop with shelves full of dolls, many of them resemble important political figures of the region. It is rumored that some of the dolls have power over the people they represent. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "MNUi4YFuE4dQ5Teg","flags": {},"type": 0,"text": "Sprog’s Spirits: A dark shop run by a well tempered and grim half orc. It’s shelves are filled with bottles that Sprog claims hold the spirits of the dead. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "djueIfOPC8qDLUvV","flags": {},"type": 0,"text": "Anton’s All-porpoise Absolutions: An office run by a cleric of a god of mercy. A place where kings and commoners alike go to repair their relationship with their gods and other extraplanar patrons. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "lECjDtRPC4vgfg7k","flags": {},"type": 0,"text": "Magroma’s Jewelry: A “jewelry store” run by an old woman where all of the jewelry is made out of the polished bones of various creatures, some of them quite exotic. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "MQm09Mb7AutAB9TR","flags": {},"type": 0,"text": "Arcadia Glass: A small shop with shelves filled with tiny and exquisitely beautiful glass statues. Run by a half elf, behind his desk he has a small collection of graphic statues that appear to depict past and future events. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "FTs8MfS16WxvUcbB","flags": {},"type": 0,"text": "Gulthric’s Curiosity Shoppe: A mostly nondescript store from the outside, this shop is run by an old copper dragonborn. The inside of the shop is sectioned off with all sorts of magical items for sale, and there is the slight smell of incense. The shopkeeper will sell magic items in trade for a true story. The more important the story is to the character, the more likely they are to receive a more powerful magic item (limited within DM’s reason, of course). Magic items range from a large selection of small trinkets to a rather limited selection of powerful items. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "hNHNkIDGEK3ce8fW","flags": {},"type": 0,"text": "Fletcher’s Hunting Goods: A traveling fletcher who makes high quality bows and arrows. More likely to be seen in a frontier town or on the trails in the wilderness. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "w5KcU7pTluTHcJBX","flags": {},"type": 0,"text": "Clara’s Haberdashery: a half-orc woman makes and sells fashionable hats to normal patrons, but sells magical hats on the black market. Her hats are imbued with special abilities by using rare and wonderful items. She’s an artist to her core and she’ll try to accommodate your request, but at the end of the day, it’s her final word. Imagine wild versions of hats you know, precursors to hats we have now, but much more ornate and fanciful.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "oG1FWrTas93aYPTX","flags": {},"type": 0,"text": "People, People!: It’s a shop where you can hire people. There’s different races and strengths of people for different prices. You can hire a commoner for 1 gold as usual, but there’s a few stronger people, or twin halflings that come as a bundle, or an old lady that’s very expensive. There’s not usually shops where you can easily hire people. Here one is. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "o4E2RCVStW7kYRav","flags": {},"type": 0,"text": "The Flying Dutchmans’ Insurance Agency: A pair of brothers, The Dutchmans, enchant items to levitate back to a predetermined location after using a keyword. Useful for if an item is stolen. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "UogbG5fqjbXeTMvW","flags": {},"type": 0,"text": "Mounds of Masks: A disorganized store stuffed with various masks of all kinds. Owned by a retired, deranged playwright who is rumored to have fallen into the occult. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "In7wPcYNrDHTdXP8","flags": {},"type": 0,"text": "Dundragon Family Goods: This store appears to be an average general goods store run by a small family of three, a father, a mother, and a daughter, but any local criminal will know that “Dundragon Family Goods” is actually the best place to find illegal supplies without attracting attention, as the whole family knows thieves cant. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "MVR26a4iRrcI8Jch","flags": {},"type": 0,"text": "Ship Shape Ships: A shipwrights store that constantly smells of the sea. Behind the shipwright’s desk are a collection of model ships in bottles that represent real ships, and whoever owns these models owns the real ship. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "GxICj31fwLMLZCzG","flags": {},"type": 0,"text": "Stiletto Emporium: Stilettos give bonuses to charisma on female characters, but reduce speed and increase noise. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "LrYEeqlSWC1OY30C","flags": {},"type": 0,"text": "Beets Beets Beets!: They sell Beets! ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "4sCmlXCTgXqDPNjc","flags": {},"type": 0,"text": "The Weather Station: They have bottles of weather. If you open a bottle, the weather inside comes out and fills the room. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "UFzreXgWPzm7bH6m","flags": {},"type": 0,"text": "The Rusty Key: Sells Keys. Sells rings of keys. Sells keys for specific areas or boxes. Simple keys, giant keys, intricate keys, one magical key. They recommend using keys for decorative purposes only. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "gEzwqcUaUNMWBT3L","flags": {},"type": 0,"text": "Dirt’s Dirt: Sells dirt. Also small stones. sells mystery dirt and a “dirt mystery bag” that has dirt plus one item in it. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "FgcMCUbW07mqMYHI","flags": {},"type": 0,"text": "Balloons and darts: Every balloon purchase also comes with darts. You can get transport on a hot air balloon and tons of darts. Balloon animals and dart animals. Buy a balloon (and dart!) and get a balloon (and dart!) free! [On walking out, the dart is thrown at the balloon]. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "kGprxtvYKtbrhbCe","flags": {},"type": 0,"text": "Rosewaters: Sells tinctures of water. Rose water, holy water, filtered water, spring water, toilet water, alcohol water, etc. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "O5Vt0cWBmarFwsR5","flags": {},"type": 0,"text": "Lukas’ Lucky Oddities: At the start of each day, Lukas rolls twice on the trinket table and chooses one trinket. He must sell it for an exorbitant price before dusk. Such is his curse. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "3GVPQUXEvPGKF9kr","flags": {},"type": 0,"text": "Madame Tralancet’s Veritable Shop of Disguises and Costumes for the Modern Journeyman: She has an enormous selection of suspiciously cheap costumes, disguise kits, wigs, and other fake parts. She has seven drawers bulging with moustaches alone. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "ZYSKxHg2qwlVb6sc","flags": {},"type": 0,"text": "Doctor Nehantil’s Reputable Establishment: In a rundown shack in a bad part of town, a half-orc woman runs reception. Give her your appointment card, and she’ll tear off the planks from the back wall where you can meet Dr. Nehantil, a “physician” with cheap prices and even cheaper services, no questions asked. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "FcOi4jJeWf5kKViG","flags": {},"type": 0,"text": "Mira’s Oozes: A pet store of sorts filled with living oozes of all colors stored in jars. Run by a young and naive sorceress who insists that the oozes are harmless when properly handled. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "2leF5si6CofAKhVB","flags": {},"type": 0,"text": "Temple of the Tiny: A quaint little store stocked with holy symbols and other religious merchandise, all marketed towards children. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "ScuAceOUdCCVksna","flags": {},"type": 0,"text": "Kesheki’s Weapon Shop: A store in the darkest corner of the town run by a curiously well mannered female gnoll, Kesheki. The shop sells all kinds of the most exotic and vicious weapons imaginable. The only currency Kesheki will accept are the scalps of humanoids, the stronger the creature the scalp was taken from the more valuable the scalp is. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "8KayK1RjuUnafeiq","flags": {},"type": 0,"text": "Walters Watch/Warehouse/Witchcraft/Wizardry/Weaponry: Walter is an aged peddler who settled in a small town. He has a bit of everything, is the towns postmaster and guard. The shop’s sign says “Walter’s ” on the left side. The right side is a stack of signs he changes as needed. “Watch, Warehouse, Witchcraft (Herbs), Wizardry (mostly useless magic items) . When not selling he switches to “Walter’s Watch” and earns his wage as the only townguard. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "6VYgifYLpzV5430O","flags": {},"type": 0,"text": "Clifford’s Catastrophic Candys: a candy shop that only sells empty bags that fill with either just the treat you want or something utterly disgusting once you get hungry. You must eat what appears before it fills again. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "mO5fxC2FY446obde","flags": {},"type": 0,"text": "Place Your Hand: An old shop, completely empty, run by and old human wizard. In the shop you can find only a table, and this old man sit on a wooden chair, behind the table. Over the table there is a Bag of Holding; for 10gp the old man let you pull out one random non-magical object, from a rusty pan to a brand new plate armor. Every thing is possibile in this shop! Are you brave enough to “Place your Hand” in the bag? ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "ETvAuC00gWkdsEwX","flags": {},"type": 0,"text": "Tomes of Tombs: A shop specializing in information on death, undeath, and graveyards. Includes biographies of famous figures buried in local area as well as maps of some family crypts. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "eJ0OvY72xTUqFX8S","flags": {},"type": 0,"text": "Old Elmer’s:  A wooden building that walks on several insectile legs, ran by an aging half-elf with a wooden leg, a glass eye, and a fully animated brass hand. Sells prosthetics of all kinds, magical and mundane. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "3tok1LVqtkyx9iLE","flags": {},"type": 0,"text": "The Meat Place: A luxurious, popular tavern with really good food, mainly specializing in one kind of meat. An still living animal covered in scars is suspended from the ceiling, chains covered in glowing runes. Occasionally an employee comes in and cuts it up, carrying the meat to the kitchen as the animal heals. Neither the staff nor the patrons seem to have any issues with this. The animal is a 1: Pig 2: Sheep 3: Goat 4: Cow 5: Irrecognizable mass of scar tissue with a distinct taste that you cannot place. 6: Roll twice. Both. If a die lands on a 6 again, it’s a sapient being being kept against their will. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "bE4PidnTKI62xAxn","flags": {},"type": 0,"text": "Frey’s Fresh Fish Flesh; A middle-aged female water genasi carrying a large Urn of Infinite Water, as well as various fishing supplies. Sells fresh fish, which she fishes out of the urn, as well as fishing supplies. Often found in deserts. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "fTq6h9gQoBMkogj7","flags": {},"type": 0,"text": "Skeleton Shop: A large underground complex selling all kinds of animate skeletal animals. The owner is a jovial skeleton who only accepts currency taken by force, without the previous owner’s consent. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "tIu9pTcITsmbR4b7","flags": {},"type": 0,"text": "Howard The Doe Has A Shop Now Come Check Out Howard The Doe’s Shop: A rundown house obviously built as a home and not as a shop. Staffed by a very excited yet forgetful doe, Howard, who insists on maintaining bipedal gait while the party is present despite being really terrible at it. Will attempt to sell anything not nailed down, and is surprisingly persuasive despite having obvious trouble speaking with her doe vocal chords and holding objects with her doe hooves. Has no actual grasp on what objects are worth or even what constitutes valid payment and will often overcharge or undercharge the party to ridiculous degrees. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "e2qnRmwXdga3kSMU","flags": {},"type": 0,"text": "The Tavernacle: a tavern run entirely by beer-making monks. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "bvxd2ruoe7EXGIi4","flags": {},"type": 0,"text": "QIA – Questions, Information, Answers: This business buys and sells information, brokers missions, offers services. Gathered by magic means, bought from adventurers or received from distant locations a party can find the information it needs, learn about a mission offered by a trader or use the shops scrying or message service for a fee. This shop and some traveling business wagons are run by an elderly, stonefaced dwarf named “Harthos Adori Treasurebringer” in wizard robes with a nameplate saying “Hat Wizard”. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "x6tsnEKGdeRuAcex","flags": {},"type": 0,"text": "Wyatt’s Wandering Wares: This shop, run by a young half elf, is of a special kind. It appears in a free spot in a street, and when it appears it has always been there. Wyatt is a good natured trader, selling wares with magic properties that often are unknown, and always trying to play a little trick with his customers. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "Vzche7Qk4k5u2zNF","flags": {},"type": 0,"text": "Kabooms and Korpses: A fireworks store that has been almost completely blackened by numerous incidents. Run by a goblin inventor who is also an amateur undertaker, offers to use some of his bigger rockets to give loved ones a glorious send off. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "9ApHh0dGGB0xzIRC","flags": {},"type": 0,"text": "Dolores’ Café & Dispensary: – a public shop for purchasing all kinds of alchemical reagents and paramacutical goods for healing, potion making and poison brewing – Also doubles as a delightful café where patrons can drink hot brews of cocoa and indulge in their preffered choice of reality enhancing herb. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "STeeBf4hIUmVXsnJ","flags": {},"type": 0,"text": "The Gold Chain: They sell gold. Great place to exchange currency types, trade figurines or valuables for gold. They sell a few gold coins with magical properties, like the boomerang coin and the communication coin. Sometimes they have slow sales so they have a “buy-one-get-one-free” deal on gold coins. Deals primarily in gold. Also can melt gold into shapes like rings and earrings. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "fcpsGAKRZUV5SOrn","flags": {},"type": 0,"text": "Store Store: Sells stores. You can buy storefronts ranging from a clothing store to a hot dog stand. Not cheap! They also have an enchanting business, password protected chests, charms to prevent theft, money pockets that only the owner can withdraw from, and alarm bells. They also sell signs of various types, some with glowing lights. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "06YaaLrhz2WrTyDe","flags": {},"type": 0,"text": "The Prime Meridian: This store has one person inside with very, very shiny golden shoes. “These are my prime shoes” they say. They will sell you almost any item, and have it back to you within two days. However, there is a significant charge to getting the item, and some items might not come within two days. Unfortunately, before you can buy, the man tries to up sell you with a long list of items, and won’t begin getting your item until bombarding you with the other items. Things like a bard service to follow you around with music, a chef service to cook you food, an enchanted rock that you can talk to, but also tells him your preferences in case you come back, a painting delivery service that sends you paintings every week for you to look at, but the paintings are pretty bad, like a child drew them. Each service costs 2-3x the cost of the item they are going to get in 2 days. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "FxHxMtPZPxZyG8TY","flags": {},"type": 0,"text": "Sew it seams: A textiles shop full of misleading fabrics and clothes. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "0wsDKPFZVn0ZPJus","flags": {},"type": 0,"text": "*ALWAYS A WINNER!: A lottery outlet. To enter, you have to put a GP into above the doorknob. You walk in and bells go off – you’re a winner!! A crowd cheers around you and you see then number 10,000 person. A sash is placed on you. You’re the 10,000th customer! You win a large cash prize! Congratulations! You can either stop now, or take the chance to double or nothing your earnings!! The shop has a large prize wheel. Roll a D10 – anything other than a D10 loses! You just have to sign here and pay the deposit of 10 gold coins! If the PC does so, they earn the prize of 1,000 gold coins. They check their pouch and a faint golden vapor is leaving their pouch and moves toward the lottery. If they re-enter, they must pay another coin, but the building is empty. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "nzFNptamiJRcBfaQ"}
