{"name": "Jobs Posted to a Tavern Community Board","description": "One hundred different jobs that the citizens need help with!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "pXTzMJwQj4rdjtLX","flags": {},"type": 0,"text": "‘Wanted Dead or Alive – Bonecrusher, Orc Chieftain to the south! Warning: very heavily armed and dangerous. Has many henchmen. Reward: 1,000gp’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "2n1mdbfSHgQsPumy","flags": {},"type": 0,"text": "‘Missing: a large turtle named Hubert who has escaped from the Caster’s School of Polymorphing. Please return if found!’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "Zm2Wy7eBPnnTuhCp","flags": {},"type": 0,"text": "Chicken Wrangler Needed! Some jerks smashed my coop and now 100 chickens are loose. 1GP/chicken to return them, no questions asked.’ (Poster is True Neutral witch in old haunted forest; all the chickens have been enlarged.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "V8jUiHdGhdOS3eEj","flags": {},"type": 0,"text": "Need men to form a small honour garrison for the banquet I am holding in my manor. Important people are involved, so discretion is mandatory. 200GP per person, payed upfront. No questions asked. (All the guests are vampires.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "vEVjNpTVWdYP2ZeP","flags": {},"type": 0,"text": "The book store has a shipment of rare books coming in and needs people to help unload them. Will pay 100gold per person and not responsible for any injuries incurred on the job. (Caution: dangerous magic and pet books around.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "F8XYIIblkCR4Tv7m","flags": {},"type": 0,"text": "Exterminator needed: I’ve got a mess of rats in my basement. Bring me 10 rat tails in return for payment. (Listed address has no basement and owner has no rat problem. The advert has a typo and should point to a house further down the way.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "IkvwfsAt9AgOqjFD","flags": {},"type": 0,"text": "Exterminator needed: There’s a bunch of noise coming from the attic. Like chains or moaning or something. It’s probably those damn raccoons again. I would have my husband look into it, but the lazy oaf up and died on me. Payment dependant on work done. (Listed address has no attic, but does have a basement with a rat problem. Murdered husband is haunting the house, bring proton pack.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "r5gnziqxjR4RA3Rd","flags": {},"type": 0,"text": "Strong Swimmer Needed! My simpleton apprentice left my ore cart unattended on the bridge and the blasted thing tumbled into the river! Hopefully the ore is still in there somewhere, I’ll pay gold to anyone who can get me my ore!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "djj4rYoVRZjvKLAx","flags": {},"type": 0,"text": "Sick Grandmother: My grandmother is sick and needs a shipment of medicine. Our normal courier has gone missing, so we desperately need it delivered. Expedited fee available with a bonus upon delivery (Grandma makes a mean elven bread.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "JagYJzcvBiH3v8Y0","flags": {},"type": 0,"text": "Squirrel Hunting: A squirrel has been seen in town stealing jewelry from citizens. We think there may be more than one squirrel involved — they always head west after the theft. They need to be captured or killed; a bonus available if stolen items are returned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "AS0yeSAUKeTEwuOZ","flags": {},"type": 0,"text": "Earrings Stolen: My wagon was robbed by bandits in the eastern forest. Among the items taken where heirloom earrings that were given to me by my mother. Please find them. Reward available.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "jNtiMlwl9gYoIZfI","flags": {},"type": 0,"text": "TEST SUBJECT NEEDED! We at the Barrington Bakery (insert your own name) are looking for subjects to test out our new magical breads. We infuse magic into the mixing process for a, hopefully, tasteful bread. You will need to taste each bread, and have our scholar review the side effects. You will be paid per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "DXYV6vXVdzdPBN0q","flags": {},"type": 0,"text": "Lost Arrow: While practicing with a bow, my son lost a trophy arrow (he was not supposed to use). He was practicing in the Northern plains and thinks the arrow went into the forbidden forest. Please retrieve this arrow. As an alchemist, I will pay in healing potions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "fVb6ktDWvYnd66qS","flags": {},"type": 0,"text": "Goblin encampment: A goblin encampment has appeared in the Southern part of town across the ravine. They’ve been there for days and don’t seem to be aggressive, but we can’t be so sure. Find out what they’re doing — if they’re a threat, please dispatch with them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "CAHNufAE7fgqHl3Y","flags": {},"type": 0,"text": "Wandering Skeleton: Wandering Skeleton seen on the outskirts of town. It appears armed with a sword, shield and horned helmet. Dispatch this skeleton and we’ll offer you 10% off anything in town.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "1YvhUn8ZJYy3LKRo","flags": {},"type": 0,"text": "100 List: Help! Local bard needs assistance creating a list of 100 dirty jobs no one wants to do. A small payment will be available as well as your name as a contributing author in the book I’m writing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "rd5fdZLy46csW4LN","flags": {},"type": 0,"text": "Kobold Flour: Local baker seeks Kobold Flour for the upcoming Monster festival. This specialty item can only be found in Kobold encampments. Will pay 10gp per pound (maximum of 100 pounds).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "i3BB0Qkz984MGcGq","flags": {},"type": 0,"text": "The (Insert bar or inn name here) is looking for a bard to entertain the crowds on Thursday Nights (mug for a copper night).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "Qtc8h5dEcCWMbj9y","flags": {},"type": 0,"text": "Merchants looking for armed security to escort us to (Insert town or city name here).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "6AuXjIk3cU11I0p6","flags": {},"type": 0,"text": "(Insert townsfolk name here), our beloved mushroom forager, has not returned from the forest. He was last seen four days ago. Need help finding him(her?)!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "wHd36yGbJHX9qDYq","flags": {},"type": 0,"text": "Lost mail! Important documents might have been intercepted. The currier I’ve been expecting has not arrived. Please inquire at the City Hall.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "meQLzoaqt7ftC1b0","flags": {},"type": 0,"text": "The town of (insert neighboring town) has challenged us to our annual match of Shinty (or similar sport). Let’s show them who’s best, and get that trophy back where it belongs!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "JIZUI6CQdL2IE4KM","flags": {},"type": 0,"text": "Lady Clarissa will read your future in the cards. I know you will show up. Where am I? Don’t worry, dear. Fate will guide you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "ANCTJ8eQnXR0tkrf","flags": {},"type": 0,"text": "The Imperial Army needs your skills! Join us to fight the good fight!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "KJ6ZLx0hB2BhQ6m2","flags": {},"type": 0,"text": "Koboliam Ore Needed: A local blacksmith needs Koboliam Ore, which is only found in the Myriad caves to the North. Once a Kobold stronghold, this abandoned cave is full of traps and possibly other dangers — will pay top gold for each block of Ore.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "5HGtyIS377PCK4dL","flags": {},"type": 0,"text": "Burial Escort needed: Our recently deceased father needs to be buried in the family lot, six miles north through the badlands. A small party escort is required in case of trouble.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "v5UTmU5jUUXCbIX2","flags": {},"type": 0,"text": "Bandit Kidnappers! Our beloved daughter has been captured by Bandits! They have not made any demands, but we want her back. They were last seen Northwest of the old tower — a reward for our daughter (alive), plus a bonus for the head of each bandit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "GmPxEjiIgGqIkbVt","flags": {},"type": 0,"text": "Family Bandits! My son and his two friends have left the village to become bandits. Find them and teach them the error of their ways. Reward if they return — must be alive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "muU83Nl86xE9V87L","flags": {},"type": 0,"text": "Kubo’s Strings: Local bard Kubo lost his musical strings during an encounter with a small dragon. The dragon has the magical strings attached to it’s teeth. Please retrieve the strings and you will be rewarded with a +1 AC enchantment to your armor!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "okkXjY5WzwS1kK0X","flags": {},"type": 0,"text": "Flying Monkeys: During a recent storm, Flying Monkeys came and took our poor family dog. They live in the Julliad mountains. Please bring back our precious dog — our children are lost without them. We don’t have much in money, but as farmers we can reward you with rations for all your travels.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "fuautZKbyUTxVBBf","flags": {},"type": 0,"text": "Magnificent Seven: Our villagers overheard bandits who plan on raiding our town in one week’s town. We seek seven or more strong warriors who will help defend us.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "WgZ3CAwBCFSURJGW","flags": {},"type": 0,"text": "Troupe of traveling bards need a few strong individuals to help schlep and set up our equipment on our world tour. Can pay in booze and lodging.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "3TP4kHqwrE0ZU8W0","flags": {},"type": 0,"text": "Detail-oriented individuals needed to go door-to-door to market my magical floor-sucker-cleaner. Commission based.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "JJFIcjJvb30PgfZc","flags": {},"type": 0,"text": "Need young fit person to shovel snow from my walkway (if high summer. In winter substitute with ‘mow grass’ or something else appropriate. Employer is an elderly individual from a far-off land who has enchanted their property to be more like their home country.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "6atQ6UsctTM2thQc","flags": {},"type": 0,"text": "Book keepers needed! Not really. Bandit-wizards have been trying to steal from my personal library of arcane books. Need tough, preferably illiterate, bodies to defend collection until I can secure safer storage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "3pw2xUBKnV19UUGD","flags": {},"type": 0,"text": "Tower Demolition Sought: The four story bell tower has been deemed by the city council as a stain on the communities reputation, as it was built with “ill-gotten” funds by the rencently disgraced and now former mayor, Cornul Glassen. The council is offering 500 gold to anyone who can reduce the bell tower, which was dedicated in his honor, to rubble without loss of life or other property in the town square. Plans must be approved by council before work can begin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "j0URUwVY3kAC7FmO","flags": {},"type": 0,"text": "Come join us for the first annual bucket festival! Bring a bucket and you favourite drinks to join in the festivities. Meet out back the delapited house on the edge of town at any time. You know the one, you’ve seen it in your dreams.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "zr1q5Rat4tlUaXad","flags": {},"type": 0,"text": "Needed bartender. Looking to employ a bartender for my inn, The crooked arrow. Must be able to listen to political rants on the slower days. NO GOBLINS","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "rBP43TUYlv3RJ9pk","flags": {},"type": 0,"text": "The well water has started tasting funny, someone should look into that.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "On47Taf07OZTChzc","flags": {},"type": 0,"text": "LOST Young boy named James, he has been missing for over a week and was last seen going of to play by the river. Reward if found.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "VYUCCn6xpVXwPDsq","flags": {},"type": 0,"text": "Local spell caster looking for lab “assistant.” Intelligence not required, but a high resistance to pain appreciated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "dEwYs5tEBqxGaqd2","flags": {},"type": 0,"text": "Mole Dispatch – a group of unusually large moles wreck our fields! We are in dire need of a someone who is getting rid of those pests. Payment in gold or products from our farmers market.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "notg2pNFpVHbTdXj","flags": {},"type": 0,"text": "Sheep Numbers Dwindling – We don’t know who, or what, is killing our sheep, but we cant ignore it any longer. Over the last three months, we found several mother sheep and their newborns dead. We offer 10 gold coins for whoever finds out what has happened to our lifestock and ends this from happening again. (A were-sheep has been killing the other sheep, can be found out when the heard is observed, all sheep go away when this particular one comes close to them, or when the transformation happens during a clear moonlit night.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "Sr2nQ9ZKHuotauFB","flags": {},"type": 0,"text": "A notice to those on hard times that the mines are hiring, the tag line on the bottom says “We’ve cleared out the danger that once struck our mine and threatened the safety of the miners, we are confident that resuming our operations shall be fruitful and safe for all.” (Underneath that is a hand written note directly under the text, “So much for your confidence.”)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "wRqEYzMwsywLMz4k","flags": {},"type": 0,"text": "Deal of a lifetime! I’m willing to trade a lovely tin pot, painted with cornflowers and lilies (and showing a few holes, true, but that’s a plus, for you can add a few more and look at that, you’ve got a colander) for a cart. The cart needn’t be big, can even be tiny, in fact, just so that two, or better four, people could fit in it, with ample room for bags and sacks, if possible. Could be old, long as it rides well and has new wheels, and strong axles, so actually probably nothing made longer than a year or two ago would do. Leave a message with Bohddie.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "Bw1PlrYLBEjhcg8v","flags": {},"type": 0,"text": "Cleric needed – Daughter Ill and Dying (A local father is worried because his daughter’s health has been rapidly declining. He needs someone with knowledge of medicine to determine what kind of illness… or poison or curse… is affecting her.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "TLl8aqYrv76dxQyD","flags": {},"type": 0,"text": "Adventurers needed! Our Kobold in our previous adventuring party is currently missing and is in possession of an ancient and dangerous artifact. Problem is, he ate it. Please return the artifact in tact! The Kobold (Skrazz) can be returned dead, alive, or not at all for all we care. 1000 GP Reward.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "KjZeSc3zEqWoOxtT","flags": {},"type": 0,"text": "Multi-Linguist Needed: While going through my pappy’s attic I found this really old map that I’m pretty sure leads to something cool. The problem is, I can’t read it! Pretty sure it’s Celestial, Draconian or Elvish cuz the letters are all curly. If the map leads to some sweet treasure I’ll share it fairly with you!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "bzdsuiBhV04wJ6Kz","flags": {},"type": 0,"text": "Taste-Tester Needed: Lord _____ needs a qualified taste-tester for upcoming banquet to fill recently vacated position. Benefits include All you can eat food and drink, provided medical care, lodging and pay-per-taste. Dwarvish candidates preferred. Inquire at ______ Manor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "COeB1MjjoxW1TPxj","flags": {},"type": 0,"text": "A Muse-ment Please: My brother, the head writer of our musical comedy duo is in a rut. He hasn’t been writing any good jokes for a while and I just can’t play backup to another lukewarm song like “there’s gnome place like home”. He needs something hilarious and inspiring to jump-start his creativity again. I’m taking him to the _____ tavern tonight for drinks, and if you manage to orchestrate some weird and hilarious scene I’ll pay you 10g. (by the way, don’t tell him I paid for this, just say I owe you money or something I don’t care) -Billie Doobie","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "OMa552w9HLalcLtv","flags": {},"type": 0,"text": "FOUND: Stange child’s doll. Blue gingham dress, yellow yarn hair with blue satin bow, made of painted wood. Eyes are large and very lifelike, seeming to follow you around the room. IF YOU RECOGNIZE THIS DOLL PLEASE COME AND TAKE IT I’LL GIVE YOU 5G. -23 Wyverann St E","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "JAuNwIFWAxCHDjD9","flags": {},"type": 0,"text": "LOST SHORTS: please, this seems silly, but recently my favorite lucky shorts have gone missing! I’m sure someone stole them but I have no proof. I need them before the big poker tournament tomorrow and I will pay 100g to whoever finds them! They are purple with green polka-dots and the back pocket has a recently-patched up rip. Also my name is written on the waistband. -Marty Martingale, #4 Lake Park Ave. E","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "fIc0ETRKlyXBDQS9","flags": {},"type": 0,"text": "WHO AM I?: I woke up in a gutter this morning outside of the Hill Street Inn and Tavern. I do not remember who I am, where I am from, what my name is, anything. I have a large sack of gold on my person and I am currently renting at the Hill Street Inn and Tavern for the foreseeable future. If you assist me in regaining my lost memories I would be more than happy to properly compensate you, for it seems that whoever I am, it is a man of means.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "4YOtngZLXKcF1YuA","flags": {},"type": 0,"text": "Local Tavern needs (at least one more) bouncer for annual all-you-can-drink QuaffFest Celebration tomorrow. Usual bouncer called in sick and can’t make it. Will pay 5s/hr and after your shift that evening all your drinks are free!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "RyZeJXj87CzNwGdk","flags": {},"type": 0,"text": "BARD EXTRAORDINARE: Art is the purest expression of the soul, and no-one expresses themselves more eloquently than Clover Salvatore, the hottest Bard to grace the realm. The Golem Guardian newspaper has called him, “A fresh voice, Clover Salvatore will wow your tavern with his genre-bending style, and witty lyrics. A star in the making”. Send a pigeon and book him in now!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "jxNzm7IIWTdx4DaA","flags": {},"type": 0,"text": "FIRST CLASS MALE: If you need a message that needs delivering, look no further than this First Class Male. With reasonable fees and lightning quick delivery, it’s not just the devilishly handsome good looks that make this the best way to tell someone you care. Speak to Dorian for more information.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "DOOftfhnoE4tanCW","flags": {},"type": 0,"text": "Help wanted t’ return me property: Yesterday some o’ th’ young neighborhood scalawags stole me carved wooden leg while I were pissed in th’ gutter outside th’ Salty Strumpet. I can nah chase aft them t’ git it back ’cause me backup leg be mor’n ghastly. If’n ye can get back me leg I’ll pay ye 10 gold, it holds a lot o’ sentimental-type meanin’ t’ me.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "8vDO0LNDVTNiJled","flags": {},"type": 0,"text": "BIG AWARD MONEY!! Near forest there is cave. In cave small monster. Need help with monster. WILL AWARD BIG MONEY!! (A barghest’s trap, prepared by goblins to lure adventurers in and devour them alive)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "cCMJUvnsH15JGBje","flags": {},"type": 0,"text": "Someone stole my chicken that lays all sort of metal eggs. Help me find it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "Zigo9kNTyXaDhlJc","flags": {},"type": 0,"text": "My Family is about to find out about my secret. Good liars and problem solvers in need.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "wMJ5nLxyFIenvb8M","flags": {},"type": 0,"text": "The bridge collapsed again and I lost my wagon. Will pay good gold if bridge repaired, and more if wagon retrieved. Contact Arkwright’s village store for reward. (Twist: Goblins have been booby trapping the bridge to steal the contents of wagons.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "ZF15Y63fybaL6UK5","flags": {},"type": 0,"text": "What up? We’re three cool guys who are looking for other cool guys who want to hang out in our party mansion. Nothing sexual. Dudes in good shape encouraged. If you’re fat, you should be able to find humor in the little things. Again, nothing sexual.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "U5Sot8NF0eqovCyB","flags": {},"type": 0,"text": "Missing pet! My pet has been missing since three nights ago and has not returned home. If found return to , whoever finds him will be rewarded greatly! (Twist: the missing pet is actually a small dragon.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "8Y9NN7d5mNsqIjEv","flags": {},"type": 0,"text": "Need basilisk eggs for experiment! Big reward!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "qVPqNf58rWgfXYY8","flags": {},"type": 0,"text": "Missing: One (1) semi-intelligent skeleton. 5 feet 10 inches. Last seen wearing blue cloak. He was sent to the market for some groceries five days ago, and hasn’t come home. His creator misses him very much. 50 GP & four (4) Stones of Farspeech upon return.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "eF7Igg6HKit5qmtW","flags": {},"type": 0,"text": "Love of my life! Please, I need your help to make me look cool in front of the love of my life, so that I can win her heart! I could never hope to win her by normal means since I’m poor. I will give you all of my life savings in return. Bonus if you look scary! //DM note: The plan is to have the players perform as crooks flirting and trying to pick up the girl and in turn be chased away by the contract giver to make him look cool.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "9sx6RxuwSuXR5LxQ","flags": {},"type": 0,"text": "Need to make silver quick? Why not platinum! Rent doesn’t pay itself ya’ know! Find Raul Sonderheim and ask him how you can become your own boss and never have to work a day in your life! (Can be a quest to thwart a predatory pyramid scheme OR be the starting branch in a murder investigation once Raul is found murdered, likely by one of the people he recruited.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "nJO6mBrMPmghuC9c","flags": {},"type": 0,"text": "WORK FROM HOME: Easy money that anyone can do! Finally live your dream lifestyle! Be your own boss! Make thousands in your first week! Retire early! Don’t be left out!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "6yedZJnDsHl2FHV1","flags": {},"type": 0,"text": "Open minded and discrete healer wanted. Must interview.: Despite the suspicious wording, the job is treating people from discriminated-against ancestries or with embarrassing deformities that have been persecuted, passed over, or financially exploited by other healing organizations. The pay is low, but you make solid allegiances. Word of your kindness spreads among the hidden downtrodden and you may find welcome far away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "Ltpqm9s1TiwHeskU","flags": {},"type": 0,"text": "Sales assistant wanted. Incredible pay!: It’s a multi-level marketing job. The job poster gives you a sales talk about their wonderful liniments and gizmos. They do work, but they are overpriced. You have to make a bulk purchase of the items and then try to resell them for a profit. You are unlikely to find the buyers needed to turn a profit and are stuck with too much stock.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "iuaQNxqLIzKo84Wj","flags": {},"type": 0,"text": "Horsebreaker needed! Inquire at the Post Office! The job is preparing young horses to accept the saddle and harness so they can be ridden or pull carts. They must also be taught basic commands and gaits. The job is successful if the handler can get the horses to calmly accept riders and obey simple orders.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "QPACsW6JeudDih2R","flags": {},"type": 0,"text": "Do you think you know your gems? A grand test awaits at Nappe and Klippe’s Emporium. Only those who truly appreciate mines and minerals should apply! A local jeweler’s outfit acquired a large stock of specialty mineral samples and gems from a flash sale of unclaimed shipments. They need them identified but want someone, preferentially a dwarf, who isn’t going to undersell them. The first part of the job is a basic knowledge test and then they move onto the unusual samples. They pay in wholesale gems of the player’s choice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "x9CrQ5BaSVYSAZlR","flags": {},"type": 0,"text": "Music tutor: My son Stevie wants to be a bard, but the kid has absolutely no talent. I want to enjoy my time at home without the shrieking of his horrible electric lute destroying the peace. I’ll pay you 10g to give him some lessons, and if after a couple his “Music” becomes less painful, I’ll give you a 100g bonus. Contact John Harris at 75 Leyton Ave.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "ccrBDSKqilxgsSa2","flags": {},"type": 0,"text": "Help! My mother-in-law is coming to town for a visit and I need someone professional to inflict me with some awful disease or other affliction so I have an excuse to stay in bed and not interact or be around her. Please no afflictions that cause perminant damage or death. Mildly life-threatening ok. Meet me at 10pm behind that bar that smells like old goat. You know the one. 50g upon disease delivery.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "SYGTptFnfA39dHEq","flags": {},"type": 0,"text": "Help recovering property! This is your local bard Razzle, and if you’ve seen me lately you know that I haven’t quite been myself. The truth is I lost my prize peacock feather hat in a wager at the Lusty Mermaid two days ago. The man who won it from me said I could pay him back for the value of the hat, but when I went to the inn he was staying at I found he skipped town without even paying his tab! (And I found out he cheated at that game of cards by the by) Please, I need a skilled ranger or another who is good at tracking to get back my hat! I’ll pay you 4,000 gold to go with me to get it, and I’m willing increase the price to 5,000 if our quarry proves elusive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "xFsnXab0rB1pSiUy","flags": {},"type": 0,"text": "URGENT: It is my little pookums birthday and the entertainment cancelled! Anyone may apply as replacements at the magistrates estate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "lUIU815zcNIOcg2I","flags": {},"type": 0,"text": "NEEDED: Someone competent in the ways of word to berate, yell, and speak ill of me. Willing to pay. Discretion is key. Meet me during the night 2 alleys up from the pub in order to discuss terms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "xYcPLYYcN3zW5WE4","flags": {},"type": 0,"text": "LOST: 3 peg legs, a hook, 5 eye patches, and a talking parrot. If found please return to “The Luckiest Crew” down at the pier.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "ivjrcCgfmxxzHdul","flags": {},"type": 0,"text": "HELP WANTED: Poor old widow requests the assistance of any strong and able persons to rearrange some furnishings. (She is a witch in a small town of elderly folks that help her trick strong strangers in order to preserve their own lives.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "A1OyHxvuGmJ4IEuF","flags": {},"type": 0,"text": "MINIONS NEEDED – Local Lich Looking for Less than Lawful Lackeys. References not required, no paladins. Full training and benefits given.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "DlsXs8BIeChij2e1","flags": {},"type": 0,"text": "Fence need painted. Good pay. Contact Sythi at the Inn. Twist, the fence is 10 feet tall and almost a mile long.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "U2ywpB4ehucNCD8K","flags": {},"type": 0,"text": "ISO: Skilled toymaker, it’s my daughter’s birthday and she wants a teddy. I can compensate for any materials you use. This was posted by an orc and her human husband, there’s an address near the bottom with a smiley face. The 6-year old half-orc wants a GIANT teddy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "ZpNTh1tCOkPtzoif","flags": {},"type": 0,"text": "IN NEED OF DURABLE IDIOT, WILL BE WORKING WITH IMPOSSIBLE GEOMETRIES. IDIOCY NOT NEEDED BUT DESIRED. BRING FRIENDS. snacks provided! (This was wrote incredibly hastily by a desperate wizard, and his wife. The words “snacks provided” are in much cleaner handwriting toward the bottom, obviously added as it was being posted.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "xMSBq0dfRgoBmVZG","flags": {},"type": 0,"text": "My brother an me want candy!!! (This note is barely legible and is tacked at the very bottom of the board.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "Tjunq5zDDylAD9JG","flags": {},"type": 0,"text": "Hey, we’re having a party and we need booze. Bring any and all you can carry. (Posted by some broskis at the wizard college. There’re about 200 in need of whatever alcohol they can get their hands on.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "NbKqJfgkQa9CQHOf","flags": {},"type": 0,"text": "Having trouble stocking all these books! Will pay for some big and strong people to help me! (This was posted by a small old woman who owns the local library.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "3bLNyOlos3bRt0os","flags": {},"type": 0,"text": "A set of seemingly innocuous symbols is carved into the side of a barrel underneath the board, all in Thieves’ Cant. The symbols are being used for a purpose they’re very much not meant for, and the message is patchy and uncertain. “Dangerous Area.” “Owner not home.” “Owner is Vigilant.” Meaning: One for the rogues! The local thieves’ guild has found that their missions in the area have ended… poorly. Their new recruits are raving about some kind of spirit, and the veterans insist that something just isn’t right.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "IM7WWd2kMJDd9xvi","flags": {},"type": 0,"text": "Need demolition help: A demolition company is looking for outside help to clear out and then tear down a vacant house. The reward can be money or allowing the players to scavenge what they find inside the house. (What the company doesn’t tell the adventurers is that no one will do the job because of the powerful stench coming from the house. Exploring the house reveals a locked(mechanically or magically) wooden door leading to the basement of the house. The basement contains 1d4 Dretchs accidentally summoned by the previous owner.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "AeyXHDTwwzFDlyVi","flags": {},"type": 0,"text": "Mimic hunt! Mimics are running rampant throughout the town. Find and kill 2D6 mimics. 1-6 mimics gets 100gp, 7-11 gets 300gp, and 12 kills gets 500gp.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "MLGsLirQOL3y1Sgb","flags": {},"type": 0,"text": "Being followed by crawling claws. Kill 1D4 crawling claws. Reward of 40gp.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "0HhtXiK7o18RsuJp","flags": {},"type": 0,"text": "House is overrun with rats. Exterminate 4D10 rats and 2D4 dire rats. Reward of 450gp.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "Oj3RPokvYZzGdIKP","flags": {},"type": 0,"text": "Help find my lost pet cat! Reward of 3D10gp to anyone who finds him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "7lflhm6UDHknfuPY","flags": {},"type": 0,"text": "The baker has put out a poster, looking for someone to deliver pastries to the mischievous yet kind faeiry dragon that watches over the town from its lair in the woods outside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "8Lz4MXWqMqnOtDwF","flags": {},"type": 0,"text": "Looking for riddle maker. You make riddles, we buy ’em! For more information contact your local Wizards Association.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "3H0FRQa0s2WdTptD","flags": {},"type": 0,"text": "WANTED: Internship with seasoned adventurers. I’ve admired heroes all my life and want to try my hand at it! I’m hardworking, loyal, and a team player.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "Csggd9byKDCfmluw","flags": {},"type": 0,"text": "Victimless Instigators of Loot Extraction is seeking henchmen for transportation of merchandise. Some risk is involved. Must be capable of intercepting and stopping pursuers. If interested, head to Church of St. Deegho and ask for Carmen.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "rAAGFPLgVeqSvOAl","flags": {},"type": 0,"text": "Help! My good friend Smolik Droweater has been trapped! My scrying reveals he is stuck in a 10-foot room. He has a chest of valuables with him, but needs help getting it and him out of the dungeon safely! Come to the Tower Tisential if you are willing to help! -the Wizard Quinn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "QG9pIav4yFr2YVJD","flags": {},"type": 0,"text": "Seasoned adventurers needed! Writer/Bard here, tell me the tales of your great adventures, I need some inspiration for my books/songs. Payment will be determined by how good your stories are.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "AMF2altpftcjJL6r","flags": {},"type": 0,"text": "Just bought the old mill outside of town. But there’s something living in it (make something up). Will pay 50GP and free milling service for a year to anybody who clears out the infestation and makes it safe for our family to set up!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "rykEzoc425hFsf6T","flags": {},"type": 0,"text": "Help settle a minor dispute between two noble Elven houses! House Alendrian is looking for adventurers to help draw the domain lines with the House Walopez border. If you are strong of arm and fleet of foot, inquire at the Dovestail Manor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "466AnaJWWOF5K8Gw"}
