{"name": "Warforged (That Weren’t Forged For War)","description": "One hundred interesting warforged characters for your players to meet.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "RFIXtsN1xoBacTNo","flags": {},"type": 0,"text": "Duster: Built to deliver goods through a massive, inhospitable desert. Duster’s metal skin is scored by years of travel, and his voice is dry and quiet. He has a fondness for animals and can be found in the company of a family of camels, who he travels with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "9G9BSHTM5DxEKMNO","flags": {},"type": 0,"text": "Soot: A blacksmith’s assistant who works waist-deep in the fires of a furnace, shaping metal with his bare hands. Built of tough, black iron and covered in his namesake. Soot has a rascally sense of humor and loves heat and fire.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "DN9EAENCJhdsZK9P","flags": {},"type": 0,"text": "Babble: An attempt at a mechanical jester, Babble has been relegated to life as a circus sideshow thanks to his repetitive jokes and groaning puns. He was once very fancifully decorated, and painted a faded, once-garish red and purple.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "PsFnnzWrlOlsfvp0","flags": {},"type": 0,"text": "Cognate: a wizard’s personal calculator and confidant, dressed in spartan robes and made of oak wood. Cognate has never spoken a word outside of its calculations and yet is the wizard’s closest friend.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "2wYf0cVB0JJgugOe","flags": {},"type": 0,"text": "Sigmund: a warforged designed as a therapist for the unique psychological conditions of warforged who don’t know what to do with their lives after the war. Has a… controversial theory that all warforged are secretly in love with the artificer who made them, but otherwise provides effective treatment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "bMvghqW7lHKyjqeH","flags": {},"type": 0,"text": "Wheat: built by a kindly old Dwarf Wizard who inherited a farm and needed a companion to make a proper go at farming. Used a LITTLE too much magic in their creation the dwarf was delighted to find Wheat could also summon fey spirits as helpers. The dwarf eventually passed, and now Wheat roams the countryside offering services and selling produce for coin so they can continue tending the farm until they can find the Dwarves next of kin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "bjj1WoCZmVJllNka","flags": {},"type": 0,"text": "Hush: a small warforged made for tending to a library, they have long fingers and extending arms made for hushing library patrons and shelving books.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "UxdOZr9MHXSSAoYK","flags": {},"type": 0,"text": "Latch: a series of warforged made for tending entrances and opening them for travelers. they man gates, collect tolls, and give warnings of what’s on either side of the gate  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "ozG5S1TEMbWNEhkS","flags": {},"type": 0,"text": "CC: Surgeon. has needles, scalpel, etc. in his hands, and often tries to ‘mend’ his own skin, despite having none. Covered in needle scratch marks from trying to stitch these imaginary wounds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "3ZmqoPYXZWpQl5nu","flags": {},"type": 0,"text": "Pugsy: Originally was a minor design deviation from a line of pugilist warforged. The idea was to create a non-combatant that could safely officiate the underground warforged fighting rings while dodging attacks. Pugsy was such a good referee that people began coming to her to solve their disputes. She has the voice of a domineering grandmother with no nonsense sensibilities. She has a small shop set up like a courtroom where people come to solve disputes that they don’t want in an official court of law.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "6HXmvYsUSSl7N1iY","flags": {},"type": 0,"text": "Spout: The last remaining warforged designed to maintain a royal garden that no longer exists. Specializing in creating fountains and watering systems, she travels the world trying to find gardens that require her aid. She has extensions on her body to bend pipe, shovel to dig, and different tool extensions in her hands to deal with the nuts and bolts of building a fountain. She is also waterproof.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "TfR5cGShVPtYcGfo","flags": {},"type": 0,"text": "Confessionarium Unit XVIII: a mobile church full of religious iconography and pictures, who roams the lands and visits tiny towns and hamlets who don’t have access to religious services. He can preach sermons for different gods and take confessions (and could play them back to their respective priests for absolution). ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "FqSvjpS2AXUXuBNc","flags": {},"type": 0,"text": "Hawkeye: originally made to survey battlefields and provide some emergency care in the field. He would relay information to his commanders. Nowadays, he can be found helping a bar, mainly by making their house gin called Swamp.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "jsERGaHNNy951qTD","flags": {},"type": 0,"text": "Diggs: a warforged of awe-inspiring industrious nature. Despite being built an absolute tank and designed for battle, some malfunction in his programming caused him to have absolutely no love for combat. He instead takes extreme and sincere enjoyment in developmental or construction work. He has had his huge host of built-in weapons he was created with swapped out for a comprehensive set of tools, including basically anything he could ever need. However, despite this, his favorite tool is his simple shovel which he usually keeps equipped as his right hand. Anytime he’s not doing lucrative and masterful building work he travels from town to town- often building new roads as he goes- seeking out what the town most needs and building it pro bono.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "vbZOkzDdqoS8gA9H","flags": {},"type": 0,"text": "Cleanshave: a skilled barber and stylist, with integrated shaving razors, combs, and curling tongs. The copper crest on his head is shaped like an over-the-top pompadour. His personality was designed for excellent listening skills: 90% of his conversation is simply rephrasing what others say to him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "DWVYAMBPBfj6uyF4","flags": {},"type": 0,"text": "Groom: this nondescript, featureless Warforged was built to tend to ferocious beasts of war and vicious monstrosities. Its constant companion is a cranium rat it befriended several years ago.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "KJZ3imkEm1XGChII","flags": {},"type": 0,"text": "Render: this adept Warforged was created to capture the life of a narcissistic noble as a court painter, creating photo-realistic masterpieces of everything, from diplomatic milestones to breakfast platters. Integrated brushes and palette reveal her intended design, as does the paint-stained apron in her satchel and the incessant quirk of doodling during every conversation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "FWf2ga25bk8mh5cp","flags": {},"type": 0,"text": "Counsel: a cheeky bartender, with all the necessary tools and gadgets for mixology integrated in its quick hands, this stylish, slender Warforged is a living repository of quotes from history’s greatest philosophers and popular culture’s trending bards. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "QGbX3cfwrZ7oM80b","flags": {},"type": 0,"text": "Moneychambers: a short, squat Warforged, with a simulated monocle and walrus mustache, his rotund belly houses an integrated coin counter and sorter. Intended for use as a traveling vault and currency exchange, a flaw emerged early on in his career: Moneychambers is an inveterate gambler. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "RwhLpQYWdcX0joMC","flags": {},"type": 0,"text": "Rickshaw: a brawny servant custom-tuned for pulling a rickshaw through the city’s winding streets. The athletic build and built-in sense of direction are obvious advantages for this work, but the highly polished precious metals decorating its form make it eye-catching to passing pedestrians, as well as denoting the status of its master when out on the town.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "iOgaAg2h5k1QcT8N","flags": {},"type": 0,"text": "Hearsay: this unassuming, diminutive Warforged is uncannily human-like, presenting as an adolescent boy with red hair and freckles. He is most commonly seen in service as a valet or page, always close by but never in the spotlight. This is quite by design: his integrated tools record conversations for later playback — sometimes for legitimate, official purposes, but more than once for blackmail, intimidation, or deceit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "gTZyeEhtWnRnNw3U","flags": {},"type": 0,"text": "Bigweld: an entrepreneur and philanthropist whose company provides warforged with products ranging from everyday appliances to spare parts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "Do94IjlckGbzFcNI","flags": {},"type": 0,"text": "Buckwheat: Incredibly proficient at farming. He has replaced one arm with a scythe for easier harvesting, despite his large, tall, intimidating appearance (considering the ever-present scythe), he literally cannot comprehend harming a living, breathing creature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "D06Dt2DzMQmgSkzL","flags": {},"type": 0,"text": "Wade: was used as a fishing aid, wandering deep into the depths to retrieve traps he placed in tricky locations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "gh6UI3D8GdGvvzP9","flags": {},"type": 0,"text": "Recorder: A Warforged designed to be a chronicler of knowledge. Anything from the social norms of the different species, creating maps, to anatomy of creatures, the Warforged is tasked with writing all of this down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "LN96hwm0MRWHydqU","flags": {},"type": 0,"text": "Smokey, a warforged Forge: has a large hollow cavity in his chest abs stomach area that can be superheated with a combo of fuel and evocation magics, making it hot Enough to meat down metals which Smokey can mold with his hands and a retractable hammer into metal wares. He gets his name from the fact that while he’s working thick columns of evaporating steam pour out his mouth as internal water supplies are boiled to regulate temperature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "aKUVXCfSrxZdTlU2","flags": {},"type": 0,"text": "Wheelbarrow: A gardener who feels far more at home around plants and animals than with other constructs or creatures that talk back. Has several garden tool attachments.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "UE56nvsOV3lIpf50","flags": {},"type": 0,"text": "Sooty: works the forge in the village. Mostly repairs tools and warforged parts. When he closes his fists, they can function as hammers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "D3EFyrx643YgLEx1","flags": {},"type": 0,"text": "Sultz: used to work tying ships to docks and loading cargo, but after an accident where he dell into the harbor, he likes to sell oysters and clams on the dock, far away from the water. He’s a bit rusted.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "T9AchW4Wmfmp5lwD","flags": {},"type": 0,"text": "Takahashi, makes and sells delicious baked goods in the local market. He’s only programmed to speak elvish, but anyone can order by pointing at the menu.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "7WfK2tt65K93fErJ","flags": {},"type": 0,"text": "Silt, she makes woven cloths and blankets. She’s programmed to analyze the fashion value of each outfit, and that includes her customers. The needles on her hands are so precise, she can stitch a seam on your shirt while you’re still wearing it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "dU8BC8vEy53DlmOR","flags": {},"type": 0,"text": "TooBits: female appearing warforged with the appropriate parts to provide “services” to male and female patrons. Usually going through a full cleaning cycle during the day and often found under streetlamps at night. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "mPxr2ltAPwixi3l7","flags": {},"type": 0,"text": "BlackTar: provides illicit injectables to any cash paying patron. Sets dosages correctly, unless the patron tries to dupe him, in which case he either over or underdoses depending upon the degree of the violation. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "kc9zsZCLyNhXiZ8P","flags": {},"type": 0,"text": "G-lager: primary weapon consists of a large maul that it uses primarily to crush fruit. This results in a splash zone several yards out from the point of destruction that, while generally harmless, will strain the clothing of the unsuspecting. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "WZGJdaibfgflMLTn","flags": {},"type": 0,"text": "Leaf: one of many warforged made to blend in with the forest for such things as stopping arson, poaching, goblin surprise attacks, and other such things. Leaf and other forest warforged are usually made to look like rock, living wood, or soil and almost all are covered in moss or greenery of some kind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "e941tllLCyQmgSsO","flags": {},"type": 0,"text": "Tender: an automaton designed to maintain the flora and fauna of a magically protected Glade that a wizard set up as his own private ‘green house’. Over time the wizard aged and died, and the wards that kept Tender at bay slowly faded the more the Glade was tended to. Eventually, the wards faded, and the scope of care Tender now realized was the entirety of the continent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "UaI1pCbPkT5VxTuq","flags": {},"type": 0,"text": "Carrier: a warforged made for carrying things and people! He works both as a warehouse guard, warehouse worker, port worker, and rickshaw service.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "t3iKVa9uHJffCNp7","flags": {},"type": 0,"text": "Bull: Skill in agriculture, Bull was designed to clear land for farming, as well as farm it successfully. He is a bit of a hermit, being close only to his friend Gran, and a cocker spaniel named Ruby.   ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "3I1nBLSPEK1Ufhae","flags": {},"type": 0,"text": "Gran: Skilled in masonry, carpentry, and accounting, Gran was created to establish and maintain granaries along the border regions. He is close friends with Bull. They were both sent to the region to prepare it for future habitation by citizens of the nation. Gran tends a small orchard and garden outside of her granary. She spends much time in it, canning and preserving the fruits. She wants to make sure that when the settlers finally arrive, no one will go hungry.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "EGRGgLn0ERHwqnAa","flags": {},"type": 0,"text": "Jack: Skilled in forestry and timber crafts, Jack travels the forest region, collecting specimens and marking trees that need to be culled. If convenient, he contacts Porter to pick up the massed timber and connects it to the barge. Jack whittles as a hobby and tends to leave carved figurines of wondrous things in his wake. Any traveler he has come across that has found one, he has rewarded with a carved figurine of their likeness.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "obYcB7J2TJjYntvk","flags": {},"type": 0,"text": "Porter: Porter lives on a steam-driven barge and travels up and down the river networks. He receives the timber culled by Jack and ships it to the coast. He plays a pipe-organ that utilizes the excess steam of the barge. Music is his main interest and in the isolation of the forests and rivers, he has created numerous beautiful compositions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "GpqSjd56VeX9ZsDX","flags": {},"type": 0,"text": "Ash: built and enchanted by a circle of druids to help protect their grove of Ash wood trees. Made of wood and stone. Protected the grove faithfully even past their creators passing. Slowly gained true sentience as the years went on. Their “grove” is now part of a park in the middle of a small town. They have slowly started to explore this new environment of wood and stone, but always returns at nightfall.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "nJP1z5ZyugcxTfKJ","flags": {},"type": 0,"text": "Daisy: a landscaper for a large City. Very protective of the flower growing from their head. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "GEtHzZGOIRzkcBMb","flags": {},"type": 0,"text": "The Mouth: probably built to be a translator for a traveling merchant. Until land pirates ‘borrowed’ them and decided to teach the warforged extremely rude phrases instead of the real translations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "hvYgLxORU6UG5rrP","flags": {},"type": 0,"text": "Will Smith: It is a blacksmith.  One arm is a hammer, the other is a hand with the pointer finger as a blowtorch.  Really good at making one particular sword, not that good at making anything else.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "h4Ltqz0pf2vbDRFO","flags": {},"type": 0,"text": "Muck: lives in the sewers of a large city. He cleans them out. Collects trinkets he finds. Assembles them into melancholy mosaics of an outside he’s only glimpsed through drains and his own imagination.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "FznoZlAOTPeYtOY7","flags": {},"type": 0,"text": "Hitch: A mobile hitching post that provides horses with water, oats, and salt licks. Their body rotates 360 at the waist. They have four spidery legs. Each leg can extend 5 ft above the knee and the knees can lock in place at 90 degrees to create up to four (intersecting) hitching posts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "mCsqf9E6P51n8gic","flags": {},"type": 0,"text": "Dresser: Originally designed as a mannequin, Dresser was given life to help design clothes with her creator. Dresser is much more humanoid than most warforged, so much so that people could confuse her for a human from a distance. However, her skin is far too perfect and flawless to be human. She loves looking her best and making everything beautiful in the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "ZjrTTNDKZFMH0Kd8","flags": {},"type": 0,"text": "Needle: It was built specifically to sew coats of arms into soldiers’ uniforms. Now he uses that skill to make and sell lovely tapestries. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "UpX2FuF9w0qUIcjo","flags": {},"type": 0,"text": "Flip: It was built as a one-man circus act, to entertain the other troops. He dances uncontrollably when he hears music.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "7hSyhCY3wJaJNvNI","flags": {},"type": 0,"text": "Paver: wanders a route throughout the city/region, only deviating to find replacement stones/bricks to maintain the roads; occasionally tells people to please stay off the grass, but otherwise doesn’t interact with them","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "QY93ev7nFbZV27tr","flags": {},"type": 0,"text": "Baker: abdomen is an oven, great at keeping time, is very opinionated about the cooking done in the kitchen despite having never tasted food before","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "7edTD9VCWoxSHjyP","flags": {},"type": 0,"text": "Fisher: spends the mornings fishing, the afternoons descaling its catch, and the evenings regaling the river/ocean with its fishing stories (as no one else in town will listen)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "OPETlN6f7PBGDSo4","flags": {},"type": 0,"text": "A Team of Lantern Lighters: they are spaced out and roam the highways chasing the sun, at the cusp of dusk and dawn lighting or snuffing the torches. A dark passage on the road indicates a misfortune that the others tragically will never know.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "dNhXdZx1FALvxl1b","flags": {},"type": 0,"text": "Filler: a mechanical dentist. his fingers can operate as drills, Novocain syringes, and scrapers. kind-hearted but unintentionally menacing toward children as his voice is especially artificial sounding (‘OPEN WIDE, LITTLE ONE.’)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "T8Crx7cEQ8RaeuLx","flags": {},"type": 0,"text": "Bobby: Sporting a brightly burnished copper body and a custodian helmet lopsidedly fixed to a large head, Bobby is the only remaining member of ‘the Coppers’, a warforged police force built in antiquity, and the only warforged known to speak in a robotic, but unmistakably cockney, accent. Monitored and updated frequently by the city’s guild of artificers, Bobby is (generally) considered a force for good, although the laws he enforces do date from a couple of centuries ago. Standing at 8’ tall and 4’ wide, Bobby is certainly a force to be reckoned with. However, somewhere down the line (perhaps even in his original programming) Bobby gained a soft spot, particularly for children. When off duty (Sundays; non-negotiable) he can often be seen carrying street urchins’ round on his shoulders and provides them sweet treats with his 1 silver piece per week allowance. Bobby carries a large copper truncheon but is surprisingly capable at de-escalating violence. In the event of conflict, the general result is a swift crack to the head, and the dragging of the offending party to the local jail. Bobby can occasionally be seen playing back old recordings to himself, but it is unknown who or what he is watching; any attempts by the guild of artificers to read these memories have been politely but firmly rebuffed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "rrcBypnDaPHXKUkN","flags": {},"type": 0,"text": "Arbiter: one of six warforged created by ancient priests of Erathis to act as a travelling tribunal that would assist a high priest in judicial deliberations, each with a different facet of the law process e.g. archivist, advocate, critic etc.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "uAc7kZOQIzxPZ4pY","flags": {},"type": 0,"text": "Bertha: moves easily underwater due to her design. She maintains a lucrative career as a jeweler from years of pearl diving off the coast.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "Th0jhn77jpy8ymrV","flags": {},"type": 0,"text": "Flap: acts as an early attempt at a warforged diplomat, but only spurts mangled platitudes and misremembered sayings. Works as an advisor for a king who mistakes these words as some deeper wisdom. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "VRyftKCzah1zwDG9","flags": {},"type": 0,"text": "Horn: plays folksy tunes and strange melodies to the delight of many. His unique style comes from improvising one night after a group of envious bards crushed his fingers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "EzBw7nQwN3eAAN7y","flags": {},"type": 0,"text": "Poppy: she works as an undertaker and mortician. Her work is without fault, but her bedside manner is atrocious as she speaks enthusiastically of death as aspect of her trade, rather than a tragic affair.    ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "KgS8ilqxx43ssuBj","flags": {},"type": 0,"text": "Pump: keeps the sluiceways and sewers of the city running. He curates a large collection of discarded treasures from above and takes a keen interest in the things people throw away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "9ryqYBRggvwPgmIl","flags": {},"type": 0,"text": "Judge: officiates games, duels, and tournaments of all types. His decrees are stern, but valued for their impartiality, precision, and immunity to bribes. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "XpQaLiQAE4z8CP9W","flags": {},"type": 0,"text": "Scratch: uses a pack of inks and built-in carving tools to create intricate tattoos. Meticulously sculpted patterns cover his limbs, and while expensive his designs are said to be works of powerful skin magic. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "B6WCPuLjAPovEXGQ","flags": {},"type": 0,"text": "Tamplin: works for nobility, using memorized charts and star maps to tell eerily accurate horoscopes as a travelling astrologer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "nsGDgJCGuHrGlzA7","flags": {},"type": 0,"text": "Tow: patrols the local roads outside of town. Uses built in cables and her bulk to pull travelers out of the mud, while keeping an eye on the bizarre entities that call the nearby swamps home. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "5rqKPBigtoW80WrW","flags": {},"type": 0,"text": "Wink: runs with a group of bandits that use her built in sleeping powder dispenser to steal from merchants as they slumber.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "oe3YP85DXU5DI78G","flags": {},"type": 0,"text": "Armsy:  has 50 arms, a solid third of which are always whirring about completing various tasks while you converse with him. Chopping carrots, fixing a pocket watch, sharpening farm tools with sparks flying around the room, collecting payment, etc.  Every surface of Armsy’s shop is used to hang tools from pegs or serve as a staging area for complete and pending jobs.  Townspeople come and go, mostly wordlessly, dropping off items with written task instructions and stacked coins as up-front payment. You don’t ever really converse with Armsy.  You trade handwritten notes.  Armsy lacks any discernible head and never speaks.  There is no empty space on Armsy that hasn’t been used already to add extra arms. Some think a wizard lives inside Armsy.  But that would be crazy, right?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "fUxpslvYBN7NiwWC","flags": {},"type": 0,"text": "Scrape: works in the docks scraping barnacles from the underside of ships. She has a pet blue-ringed octopus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "e1Aht2ppF7pIGC9K","flags": {},"type": 0,"text": "Kestle: They cut a surprisingly svelte figure, this swashbuckling Warforged. Currently a sailor offering their services on ships making short trips, they once dived for pearls before the local oysters were over-harvested and decimated by the growing pollution of the harbor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "tF3yqGhRdnldBkQW","flags": {},"type": 0,"text": "Rebexia: Throughout her life, Rebexia served as handmaiden to a series of socialites, women of status and nobility—her place in these entourages granting her ladies the glow of novelty. But sharp, perceptive and in possession of the faculty of total recall, Rebexia is an asset to her employers if they are smart enough to recognize it and a powerful force behind the scenes in her own right.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "WYRicFcne2b9olH2","flags": {},"type": 0,"text": "Gamma: this warforged pays little attention to the party and continues their work, Gamma’s task is to plant a forest as a last wish of a woman, to see the plains full of trees again before they were all cut down to make machinations of war (trebuchet, catapults, siege towers). Gamma has spent at least a decade planting trees and maintaining them for optimum growth, bringing life back to a place that was full of so much death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "YrqnLOy9WUZnBGAR","flags": {},"type": 0,"text": "Steambreather: previously a factory worker, after an unfortune accident his right arm was replaced with an oversized heavy lifting arm. When he’s not making forgings, you can find him in the tavern taking part arm wrestling competitions. He has a fierce rivalry with an orc, Bloodtusker, in the city and they are known for stalemate matches that can last for hours, Bloodtuskers brow sweating in frustration as Steambreather spews clouds of fog as he strains.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "KrwEB6j6RiXKXHGo","flags": {},"type": 0,"text": "Quill: a scribe and scholar built to collect lore, obsessed with finding a famous hidden library filled to the brim with forgotten secrets.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "vzD6WkcITQ4ro0PX","flags": {},"type": 0,"text": "Tapper: a bartender who DESPERATELY wants to find an alcoholic beverage potent enough to get his metal ass wasted. So far, no such luck.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "WR6OaDPmMtSvfBPy","flags": {},"type": 0,"text": "Keys: a pianist who plays “The Entertainer” on repeat in a sleepy saloon. It gets pretty irritating after a while.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "iM36JFZy8WOJCgzk","flags": {},"type": 0,"text": "Anvil: a blessing for the small town that he lives in; created to serve Moradin long ago, he is now the blacksmith. He never sleeps and he doesn’t eat, so all of the small repairs the village needs are free of charge. He’s happy to simply create things that help others…. but he dreams of making a weapon worthy of Moradin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "9iuHrznXrxSUB1h4","flags": {},"type": 0,"text": "Mind: an experiment in how much of a soul can you truly give a warforged. It has psionics, and a high amount of empathy. It wishes that it could have children and a family like the other humanoids it knows.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "qNvSmTUnKljsw21P","flags": {},"type": 0,"text": "Annie: A nanny who has been with the family for generations. Frequent sayings might be ‘You’re exactly like your great uncle so and so’ or ‘Your grandmother would severely disapprove were she still with us’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "s4wXN7dYetW3Ridr","flags": {},"type": 0,"text": "Hammer: his right arm can become a set of different sized hammers. From small construction hammers to war hammers. He does construction and security. He takes his weekends off seriously and talks in a mob accent addressing all his superiors as ‘boss’ with the drawn out ‘o’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "CjzyV73OvOp5zWLh","flags": {},"type": 0,"text": "Miner: Though solidly built and having a pick affixed to one arm, this warforged is more useful digging for iron than trying to kill. Send him into the mines and watch your ore output increase.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "Z1ASX6tHEhqvBSSz","flags": {},"type": 0,"text": "Lumberjack: Comes with an axe fixed to his arm but is better suited to turning trees into lumber than turning orcs into corpses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "ldi9Cr1xft9XddgR","flags": {},"type": 0,"text": "Halitus: Latin for ‘breath’ or one’s last breath, since he was an evil sorcerer’s killing machine, living in the sorcerer’s dark and damp cellar. A “Bring out the gimp” ordeal. Played him as a runaway assassin/hexblade.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "fRg5uqIq6wZQMeYH","flags": {},"type": 0,"text": "Dent: A warforged designed to make armor and weapons for a religious order of knights. With broad shoulders and a tall frame, he’s efficient at forging larger, heavier weapons and armor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "OKQ14ALM2hy6icIu","flags": {},"type": 0,"text": "Quar: A custom unit designed for the Kings head of research into biological weapons. It features a rotating set of compartments of various sizes in its torso, designed to hold anything from tissue samples to disease-carrying rodents to amputated limbs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "5J8u1kO3Ajo1LeKf","flags": {},"type": 0,"text": "Censer: A gift to the church, this unit was designed to hold open heavy religious texts during services, refill oil lamps, and to burn incense, the smoke from which was dispersed through specially designed vents in its body.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "wDZlW8z40bSgcEH1","flags": {},"type": 0,"text": "Dungheap: Equipped with a shovel blade, Dungheap tirelessly scrapes the dung, offal and carrion off the city streets and into the metal lined waste wagon to be hauled to the trash burning pits. When he finishes his assigned roads, he goes to the lords stable and scrapes the horse manure from the stables. Endlessly shoveling shit. A large city might employ a squad or more of this model.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "K6UY8d0xkfbn1d2p","flags": {},"type": 0,"text": "Hoss: A quadruped model with a horse shaped head, Hoss may not have the overland speed of a horse but has superior traction on steep up-slopes and he never fatigues, so Hoss has replaced equines in some cargo-hauling areas.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "XDZ1t7a8U5kVSuaU","flags": {},"type": 0,"text": "Adyan: Constructed by a wealthy family to be a bodyguard and servant for the only child. As the child grew, she and Adyan became friends, and Adyan took on a more prominent role as her lab assistant as she pursued interests in herbalism and alchemical healing. Adyan serves her happily today, even now, in her old age.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "2w5xQxflFkUpCRRv","flags": {},"type": 0,"text": "Auto: an envoy designed to transform into a hovercycle created as a personal transportation device for wealthy heirs with a need for speed. Built as a companion, their personality is a one of a people pleaser, constantly saying whatever they believe their companion wants to hear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "e8Ws8SfuTEdAbbyh","flags": {},"type": 0,"text": "Crane specializes in building tall buildings. Its hands and feet end in thin but strong claws, designed for inserting between stones to climb sheer walls. A large reel of rope and a hook on its back allow building materials to be winched into place.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "J3XVq0Mft54dIoRI","flags": {},"type": 0,"text": "Piledriver was designed to carry and lay foundations for buildings. Standing at twelve feet tall, two of its hands are massive claws which can pick up entire tree-trunks, and the other two arms ends in blunt hammers to pound them into the ground.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "LV2cKwnt9xBS7EeV","flags": {},"type": 0,"text": "Hands: a six-armed materials handler for magical experiments. Due to years of standing close to wild magical effects, it glows brightly, with different parts of its hull giving off differently colored light. Occasionally, very minor magical effects happen around it, such as clothing fading or changing color, turnips changing into onions, or tiny fireworks going off.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "AfagaUJ7CV3JQaEj","flags": {},"type": 0,"text": "Tannoy: a Warforged who was built for a vain king with a speech impediment, now long dead. Its purpose was to allow the king to speak in a dignified manner at public events. It can shout loud enough to temporarily deafen anybody nearby but prefers to speak in a whisper.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "SWzATyspNV82XegR","flags": {},"type": 0,"text": "Elevator: Designed for an up-and-coming rival city to Sharn which wanted to build tall buildings but didn’t have access to Sharn’s flight-granting manifest zone. Elevator carries a large basket on its back and can climb ladders at an amazing speed. When the rival city was abandoned, Elevator migrated to a small clifftop town, where it carries fishermen and beach-pickers up and down the cliffs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "4dSgrg4gxGuzT7bd","flags": {},"type": 0,"text": "Pump, a Warforged firefighter: Carries large reels of hose on its back, and a sledgehammer and fire axe to smash through burning buildings. Inside its chest is a fireproof chamber with enough space for one person.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "HpROwFf2VqRS8JLD","flags": {},"type": 0,"text": "Keystone: Spends its days in a quarry, making intricate stonework. With the nearby city levelled centuries ago, there is no more demand for stone, so Keystone hauls the stones up to the edge of the quarry every night and has built a large town’s worth of beautiful stone dwellings, monuments, and bridges.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "dLH7SYrRqBtz8O9p","flags": {},"type": 0,"text": "Mud and Nightsoil work at a nearby riverbank. Mud creates and fires bricks from the local clay, and Nightsoil hauls them into a nearby sewer entrance. Each of the empty dwellings in Keystone’s town has access to sewerage thanks to Nightsoil’s extensive brick-built sewer network, running with clean fresh water from a nearby mountain lake. Some of the sewer tunnels expand into cisterns and reservoirs or small natural caves, while others have walls paneled with scenes of everyday town life chiseled into the brickwork.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "DZhroUVd8DPawsX0","flags": {},"type": 0,"text": "Smithy: Created during the war as an armorer and field repair Artificer, assigned to a company of dwarves. After the treaty that granted all Warforged their freedom, he continued working under the senior officer as a blacksmith, among many other trades. In armor smithing he was especially gifted, being considered a master craftsman even by the children of Moradin. The years went by and he learned more than smithing from the stout-folk. Eventually he decided to dedicate his life to pleasing Moradin with his skills, offering help to anyone in need of either his tools or his Warhammer; all while speaking the blessings of the forge.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "GmqIds1HNfC5ihDh","flags": {},"type": 0,"text": "Archie: He’s a Warforged Archivist with a suite of pens and an ink reservoir integrated into his arm, and a Keen Mind to accurately recall the exact events he witnesses until he has enough time to record them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "QBcIuba9Bp5mx1Xm"}
