{"name": "Fascinatingly Specific, Supremely Elegant, and Utterly Useless Skills High Elves Have Acquired…","description": "SOMETHING has to happen in that 100 year span, right? What did this high elf spend their time doing?Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "2r4sNPoV0cd9pwhL","flags": {},"type": 0,"text": "…how to arrange flowers in a vase in such a way that they do not appear to be arranged at all, but haphazardly splayed about as if just dropped there. It takes a long time to learn how to arrange flowers so precisely to look completely unarranged. The first 10 years you don’t even touch the flowers, you just contemplate the nature of unarranged flowers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "v1jqaglL5JDkLwZM","flags": {},"type": 0,"text": "…the perfect comeback to a childhood rival who once taunted you by saying something mean. You said something back but upon retrospection it wasn’t very clever. Haunted by this failure you have spent the next 25 years painstakingly researching his genealogy, habits, and circle of friends, carefully refining and reshaping the ultimate bon mot should he ever insult you again. (You can’t insult him first, as you already “returned fire” as it were. Gibing etiquette requires him to insult you again before you can respond. Of course you haven’t seen him in 2d10 years, but if you do, you’re ready!)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "T3CFXornUr0xOMrI","flags": {},"type": 0,"text": "…to speak a long-dead and all-but-forgotten language perfectly without a trace of an accent. Were there any speakers of this language still around, they would likely (DC 10) be utterly convinced you are a native speaker of it. But there aren’t any.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "XxiOxwKh8IaJe1lX","flags": {},"type": 0,"text": "…how to recognize merely by seeing the color through the bottle the exact variety, vintage, and vinification method of Elf wines grown in a specific region. Of course this relies on the wine being properly stored at the correct temperature, humidity, and darkness; if something’s just a little off it will alter the color, making it impossible to know anything without actually opening the bottle to smell or even (gasp) taste it, which would be cheating.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "4T9SkCqHrKxeEUKw","flags": {},"type": 0,"text": "…the precise movements of a complicated stretching/meditative exercise similar to Tai Chi but not at all like Tai Chi. Rather than trancing in a sitting position like some bourgey Wood Elf, you can trance while standing up and making gentle hand movements.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "dLwbO0KO42NgB7ur","flags": {},"type": 0,"text": "…the delicate art of scrimshawing Elven poetry onto the surface of living leaves. It’s quite a challenge because you want the runes to be legible but you don’t want to kill the leaf. It takes many weeks of painstakingly meticulous work. If you start in early Spring and work very diligently, hours a day for weeks on end, you can finish an average length poem just before the first frost of Autumn kills the leaf. (Note your character can’t scrimshaw onto other wood, bone, or other materials. Of course they can’t. Why would they even want to? How gauche!)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "7Aub4C9g0dhlAhMQ","flags": {},"type": 0,"text": "…the byzantine rules of a complicated role-playing game you loved as a child but haven’t actually played in years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "bSr29KSGlbg1yj6G","flags": {},"type": 0,"text": "…the flavor combinations of a High Elven grain-based cuisine that is completely unknown to anyone outside of your particular Elven clan. It is so subtle that every dish tastes exactly the same to someone without at least a decade of gustatory training and discipline.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "kK1YJR0DMZ4MMJqd","flags": {},"type": 0,"text": "…the subtle art of relieving yourself of bodily necessities in the most inconvenient places without being noticed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "jT2AXXhro8qdu6yu","flags": {},"type": 0,"text": "…how to meticulously manipulate your hair, strand by strand, so that it grows into a braid. You simply need to touch your hair once every hour or so for a few months to create or modify a braid.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "aZmyiU7eULmh7pbW","flags": {},"type": 0,"text": "…mastering building card castles. The first year or so you spent your time finding the balance of each of the very specific eleven cards, so that you can find the different force members and build a structurally sound card castle. You made very interesting and elaborate castles, but since you left, you haven’t found a deck of cards with the exact same balance, and any attempts to build one with a normal deck of cards results in the castles collapse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "uhbLMweGBXtfYTHl","flags": {},"type": 0,"text": "…how to twist silver wire into intricate knots that approximate the pleasing curves of Elven calligraphy. If you had a very large spool of wire and about a year, you could make a beautiful wall hanging of your favorite poem. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "UMGcN8ywyQDzQyoQ","flags": {},"type": 0,"text": "…how to speak naturally while you are breathing in. You never need to stop talking!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "OaZ717rPeW7Hx5cc","flags": {},"type": 0,"text": "…all about Dwarven and Gnomish machinery, which you were of course forbidden to ever touch or observe in person due to its religiously unclean nature. In secret, you read every book you could get your hands on about the theory of engineering, without ever trying it yourself. Most of what you learned is hundreds or thousands of years out of date.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "CXF6rhwX1P8JkQaX","flags": {},"type": 0,"text": "…the anatomy of a rare type of fruit fly. +5 to Medicine checks concerning this type of fruit fly. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "6sxEFNXR80fNL7tt","flags": {},"type": 0,"text": "(Dark Elf or Evil only, re-roll if you are not) …the construction of Dark Elvish poetry, which involves tormenting slaves or captives in extremely specific ways that cause their screams and pleas for mercy to fit strict rules of meter and verse. Any deviations from the rubric, and the poem has to start again from the beginning. They are typically thousands of lines long. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "Cauhkl7Kd8wo5B6E","flags": {},"type": 0,"text": "…how to mix pigments into a color beyond the capability of Elven eyes to distinguish. Elven Druids have determined, after careful consultation with butterflies and mantis shrimp, that there are many colors beyond those Elves can see. After years of training, you can grind a memorized recipe of flowers, seeds, and a rare kind of seasnail shell into a pigment that is rather pleasing (it is said) to those creatures with 10 or more photoreceptors. To everyone else it just looks like a particularly ugly shade of greenish brown. Note you don’t know where to gather the required materials, or how to paint with them, just how to create the pigment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "MsrNkITUWA5tN2Ab","flags": {},"type": 0,"text": "…mastery of your mind’s eye. You can visualize as many objects moving in any way in as much detail as you want. However, the more elements are present, the slower you must make it revolve. Overall this provides no advantage when visualizing a situation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "Ju32eMdC2hgv9mZp","flags": {},"type": 0,"text": "…the evaluation and criticism of blown glass sculptures of a kind produced by the Uuajarithin Dynasty, which ruled the northwestern region of a local island for several decades around twelve thousand years ago. You can immediately appreciate the differences and similarities between the three main schools of Uujarithin glass and the aesthetic differences which caused their schism. This might be useful if only there were more than a half-dozen examples remaining on the planet. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "3MSiGx4cDXLxKE0f","flags": {},"type": 0,"text": "…the art of eyebrow manipulation. You can manipulate your eyebrows in such a way as to create a perfectly animated wave. Any attempt to use this to improve your acting leads you to start wiggling your eyebrows uncontrollably.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "7QoIM3tFlzGmLiZi","flags": {},"type": 0,"text": "…the deep formulations involved in calculating the precise distances between runes and glyphs used in the creation of magic summoning circles and wards; this is a skill that all magic-users can perform instinctively and without any conscious thought. You, however, know why they are spacing them just so.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "BwMQQB0B9PVDUMMF","flags": {},"type": 0,"text": "…blinking patterns. You have learnt to predict when some else will blink, allowing you to blink at the same time, making them believe you do not blink. If you try to use this to improve an intimidation attempt they think you are blind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "b0NyUcA2dDRsBcl2","flags": {},"type": 0,"text": "…the life of Carl. You followed the life of a Human child from birth. Carl had a relatively mundane childhood but actually left to be an adventurer in his early 20s! Those few months were greatly interesting until he was eaten by something with a lot of tentacles in a swamp. Thankfully the creature was incredibly resilient and slow so you had ample time to take notes on Carl’s death and even make a few sketches of him disappearing into the muck.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "mafLXZN6m9z2ZrPe","flags": {},"type": 0,"text": "…Human pop culture. Knowing that some day you might travel the world in the company of Humans, you spent a lot of time studying Human jesters, bards, and performers, memorizing the most popular acts. Alas, Human pop culture changes quite quickly by Elven standards and all of your references are decades out of date. Younger Humans have no idea what you’re talking about; older Humans will smile faintly as they vaguely recall something along those lines.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "noMIX2ish9QOQLEY","flags": {},"type": 0,"text": "…more than a thousand decorative knots, none of which are more useful then a thumb knot.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "9Hj0nfyOUxG2yQZi","flags": {},"type": 0,"text": "…knot-tying with your tongue. You can tie all the knots you know using only your tongue.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "GkI7ZazVKdk2Rj3O","flags": {},"type": 0,"text": "(High Elf only, re-roll if you are not) …the apologetics of a very, very long treatise on the many metaphysical reasons why High Elves are vastly superior to all other races of thinking being, on an intrinsic level. You can convincingly argue hundreds of rhetorical approaches from this book, which all other races find deeply offensive. Just bringing it up in public is a good way to start a fight with any non-High Elf.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "4nMTHtoWVsUqNgyA","flags": {},"type": 0,"text": "…the bird song of a particularly rare sub-sub-species of an otherwise very common bird. The song of the sub-sub-species is — to the untrained ear — indistinguishable from that of the common bird, and it annoys you to no end when people assume you’re imitating the song of the common bird, which almost any fool can do.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "EuiFVZVdnssID33O","flags": {},"type": 0,"text": "(Non-Sorcerers Only) …how to be a sorcerer. You tried really, really hard to be a sorcerer. Like just focusing super hard and being like “magic, magic, magic”. It didn’t work.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "el8RVXj7w0RGMpcH","flags": {},"type": 0,"text": "…the minute detail of a single small Human town as a sociological project. It was going really well but eventually Orcs sacked the place and put everyone to the sword. Ugh, Orcs, right?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "dmaAjf1TCsEsvJOu","flags": {},"type": 0,"text": "…the alphabets of any language you speak, in order, starting from any letter. You’re able to do this both forwards and backwards.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "LZC1yrK5AygXlRgi","flags": {},"type": 0,"text": "(Those without a musical instrument proficiency, re-roll if you have one) …that you aren’t very talented at playing particular instruments. First you tried to learn the lute. Gave up after six months when it got hard. Tried the bagpipes. Gave up after six months when it got bad. After many years, you now know there are dozens of instruments out there you can’t play.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "ONADaUz0WNZ2LbQQ","flags": {},"type": 0,"text": "…the genealogies, birth places, and biographies of the women who were considered for marriage to the princes of a long-ago Elven dynasty, but ultimately were not chosen. You don’t know anything about what happened to them after they weren’t chosen, just everything about them up to the point where someone else was ultimately selected. (You also don’t know anything about the women who were selected.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "lAQjbzJ0H0S72cr1","flags": {},"type": 0,"text": "(Non-Rangers and Non-Druids only, if you are, re-roll) …how to tell different species of (1d6: 1-3) wolves or (4-6) bears apart from the taste of their fur. You can accurately (DC 10) tell the creature’s age, sex, species, and current mood (usually angry at being licked). Now you only need to be able to get the animal to let you lick it and voilá it’s your time to shine!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "HVaBxZ0SX3hmvPyH","flags": {},"type": 0,"text": "…how to live with a Human. As an elaborate prank, you seduced a Human and built a life together. Two decades later you finally revealed yourself only to discover the other person also was an Elf the whole time; by coincidence they also had the same idea for an elaborate prank. (It turns out if you really had been living with a Human they would have figured it out immediately as it turns out Humans do weird stuff like sleep.) Had a laugh about it together and parted ways.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "9AzVSWrxFvNQOkOe","flags": {},"type": 0,"text": "…how to mimic the singing of a green frogmouth parrot, a bird that went extinct by men in your early years due to its horrendous sound. You can now wow archaeologists and get kicked in/from a tavern for the same reason.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "u7WHZssxuTADJXMv","flags": {},"type": 0,"text": "…illusion magic. One horrible tragedy later, sought out a mage to erase that knowledge. This was repeated with necromancy, tinkering, and cooking. You successfully unlearned all you had learned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "TSDdTZAGWtUHpEwK","flags": {},"type": 0,"text": "…the location of everything in your childhood home. Blindfolded, from your front stoop you could walk into your home and prepare a nine-course dinner. This is assuming of course nothing has been moved in the time since you’ve been away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "zIiP5qsiWSi4P447","flags": {},"type": 0,"text": "…nothing about the Sword Coast. You spent years on a walkabout up and down the Sword Coast, just to get some space and chill. By traveling only at night, hiding from all you encountered, and never spending more than the barest amount of time in any one particular place, you were able to do this without learning anything notable about the Sword Coast.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "0CO3lXgs9rrjcFHq","flags": {},"type": 0,"text": "…hair braiding. You’re really good at making intricate hair braids. Or you used to be, it’s been awhile since you practiced. To your annoyance, non-Elves usually don’t sit still for the four hours required to do a proper braid and other races apparently don’t like it if you try to braid their hair while they sleep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "zOgaeelhBFQkTPHb","flags": {},"type": 0,"text": "…thinking of creative insults for other races. Most of the insults are so sublime the other races don’t even realize they’re being insulted, which makes it all the funnier to you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "4GgXyhu3qLW9SdmC","flags": {},"type": 0,"text": "…the art of swordmaking. You are quite good at drawing pictures of people making swords.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "qj1x3JYOqJMi5t4w","flags": {},"type": 0,"text": "…water course training. By finding a natural spring (or for you more modern types a mechanical one) you slowly shape a stream bed by making minuscule alterations that will, one day, result in a unique formation. Carefully placing small stones, planting trees, or removing roots, you learn to twist a stream over the course of decades into something different. Some humans have done this with trees, but they’re just amateurs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "BVpuDLz1jjPN8V5L","flags": {},"type": 0,"text": "…chicken sculpting. Through intense study of the diet and breeding habits of chickens, you are able to feed one dish to a rooster and the other to a hen, such that the hen will lay an egg of an unusual shape or with a particular pattern or image on it. This only works with a given individual rooster and hen; to do it with different chickens, you need to learn it all over again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "8mOtNw3QcpTm6kdD","flags": {},"type": 0,"text": "…the ideal responses, mannerisms, and cadence for the best polite small talk. Not how to make any small talk polite, that was a different class. You learned how to engage in the most mathematically polite conversation possible, which happens to be about how unseasonably mild the weather was the day before yesterday in the early afternoon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "SPA9UEXI2bi1Vi74","flags": {},"type": 0,"text": "… the ability to tell by sound the material and age of any bow string made using the common techniques of your home clan. Of course, this can only be done under certain humidity conditions at an elevation identical to that of your home village. Any other elevation or humidity conditions result in a completely different sound spectrum, which you would have to spend years relearning. Attempting to recognize the sounds not under the same conditions will result in you being completely mistaken.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "GgLzYb2JIwdD1iuq","flags": {},"type": 0,"text": "…how to create pressed leaf collages in the style of trees in autumn. You’ve spent years observing the fall of leaves on the ground, the seemingly unordered but sublime beauty of each leaf landing and overlapping the next, the play of color and texture, the harmonious use of scale and repetition. Through careful study and practice, you can perfectly duplicate the style of various specific trees’ leaf collages, laying out pressed leaves in your home or garden in a pattern of intense poetry. Now when you see the last leaf of the season fall from a tree and its completed collage, you can appreciate its beauty so deeply you’re nearly moved to tears.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "C87neHrTbZ5d8ZOq","flags": {},"type": 0,"text": "…how to blink your lower and upper eyelids independently.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "0ZFxIXzobPG2DBYU","flags": {},"type": 0,"text": "…extremely accurate cylinder throwing. You can, at a glance, tell whether a given cylindrical object can fit into a hole or crevice hundreds of feet away. Further, you can throw said object so that it will perfectly land in said hole. The countless metal cylinders you originally commissioned for this purpose were geometrically perfect, however. The usual pens, pipes, and branches you can find are usually warped enough that your skill is instead to always almost throw a cylinder into a hole.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "6Q3X9Gi7qgBKvayl","flags": {},"type": 0,"text": "…the names, records, and anecdotes about the most accurate cylinder throwers in Elven history, as above.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "MDQkCIkxOf2qaHhX","flags": {},"type": 0,"text": "…the ability to accurately identify when a given patch of paint will be dry. This was learned by studiously watching paint dry and your thorough experience now makes you an expert in the field of paint drying.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "KwEWC9msEQcAHxeK","flags": {},"type": 0,"text": "…how to create beautiful, but delicately crafted ice sculpture of a flock of birds in flight. The slightest movement or change in temperature will result in the sculpture collapsing, so you cannot even risk returning to it for fear of your body temperature upsetting the delicate balance necessary to maintain the sculpture’s form.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "qU4naiDeyKja1GV6","flags": {},"type": 0,"text": "…the ability to blow smoke rings in elegant configurations. If your character doesn’t smoke, don’t re-roll — your studies were all theoretical on the off-chance you took up smoking one day. If you do, you will be able to blow some nice smoke rings… probably.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "RdxB5YnMi6lNeYI1","flags": {},"type": 0,"text": "…accurately determine the distance of objects. You spent many years placing objects at random distances in order to better judge how far away they are. Now you are able to tell how far away something is from you, as long as it’s within 1 mile.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "3PhCp1YR7G9jafz5","flags": {},"type": 0,"text": "…accurately measure objects at hand. You have extensively measured all your body parts to determine their exact width and length, so you know if something is a thumb wide it’s 7/8ths of an inch, or if it’s the span between your nostrils it’s an 2/9ths of an inch, and what-have-you. You can measure any object you can touch as long as it is your size or smaller. Measuring some objects requires that you remove some clothing. Due to the rigors of the adventuring lifestyle you must re-measure yourself each morning to ensure you are still properly calibrated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "zUR8UXFN1GgjaYE1","flags": {},"type": 0,"text": "…the ability to discern from a glance what a tea made with a particular leaf would taste like. Your particular specialty are leaves that would make particularly foul-tasting teas, which among Elves is a highly prized skill. You don’t understand why your non-Elven companions don’t appreciate you pointing out all the leaves they shouldn’t brew into tea.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "CtdXETAcAYzZyB2E","flags": {},"type": 0,"text": "…how to teach synchronized swimming to the last two surviving members of a rare subspecies of seahorse, both of whom were female. The night before they were set to perform in a much-anticipated recital, one of them died, rendering decades of work completely irrelevant. The second one was eaten by a cat the next day. No other seahorses in the world have the same behavior patterns as the now-extinct breed that you tragically lost.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "OlLCrmDBnkCEwNsa","flags": {},"type": 0,"text": "…cheesemaking, specifically, a very rare type of cheese (or mushroom if your Elves are vegan) that takes many years to ripen to perfection. It smells awful and looks hideous, a sickly pale color shot through with weird spidery veins. But the taste! The taste is… rather appalling, no matter how sophisticated the palate. But cultured Elves know the time and effort it takes to develop it properly and out of politeness always manage to choke it down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "gM68DkDXz5nBHEVT","flags": {},"type": 0,"text": "…a self-defense technique for use against unarmored attackers wielding left-handed halberds. If such a foe targets you with an attack and misses, you get a bonus action. This bonus action may only be used to point out how inept their attack is compared to the unarmored left-handed halberd wielders of yore. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "wwBpJDcS0tWkAu6V","flags": {},"type": 0,"text": "…the ability to know what kind of snow is going to fall as it falls. You cannot predict snow fall, totals, or anything else related to weather, only if the snow currently falling is fluffy snow, dry snow, wet snow, good snowman snow, etc. You also know each of the 53 words the Elves of the Northern Reaches use for snow, and always are sure to use the absolute most precise one for the type of snow that is falling or about to fall, and helpfully point out to your companions when they use an incorrect term.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "CfTVODYKiCfDj1ss","flags": {},"type": 0,"text": "…the ability to tell the type of wood an object is made from using only one of your five senses. If you roll this one again. choose an additional sense.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "LHvZXylomfp6NGDv","flags": {},"type": 0,"text": "…the ability to walk a mile in someone else’s shoes (through Astral projection), but only if you’ve met them, if you are meditating, and if they’re not wearing them while you meditate. While doing this, you can’t perceive anything while in the other person’s shoes, save the comfort level of said shoes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "VARdCgOw4RNMBNb9","flags": {},"type": 0,"text": "…every detail of an obscure point of Elven theology involving when and how one pours tea into a sacred tea pot. You are so versed in this topic and the technical jargon surrounding it that it sounds almost like a different language should you try to converse with someone not familiar with the subject. There are only two or three Elves in the whole world who might be able to argue with you about this. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "6yq5z15xqMa1AmHy","flags": {},"type": 0,"text": "…a perfect understanding of how long soaps and perfumes will maintain their scent and exactly when to reapply them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "qCmSGKTCsId7krSV","flags": {},"type": 0,"text": "…how to determine, after eating any cheese, what type of fungus also lives in the cave where that cheese matured.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "1BqYdamCk5Y2Q5XS","flags": {},"type": 0,"text": "…how to write one letter of the Elvish alphabet. You spent years practicing how to write this one letter. All other letters are average for an elf of your age, but you can perfectly draw an incredibly stylish letter of your choice. If you roll this result again, pick another letter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "jus9rwfS9KJDgiW3","flags": {},"type": 0,"text": "…how to, after much research, craft toys from a long-dead civilization. The toys are all invariably quite dangerous in the hands of children and likely led to the civilization’s demise from low childhood survival rates.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "cRsCfFIJ4AZ9L2pX","flags": {},"type": 0,"text": "…the ability to decorate the most beautiful cupcake arrangements. Your particular specialty are cupcake arrangements for funerals. Unsurprisingly, your talent is turned down by almost all the grief-stricken people that you offer it to. Note you can’t bake the cupcakes, only decorate them. Baking was another class.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "uOirhDFKI17sNU81","flags": {},"type": 0,"text": "…how to freestyle rap but only in an extremely ancient and obscure dialect of a dead language that virtually no one speaks. Including you. You aren’t quite sure what you’re saying. But it is dazzling to hear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "KlQRRa3gzZZkuqwY","flags": {},"type": 0,"text": "(Non-Clerics only; if a Cleric, re-roll) …the marriage ceremonies of many cultures around the world, and can perform them perfectly. (Whether you are licensed to perform them, however, is a different matter.) Whenever you attend a wedding, you always know when the officiant, groom, bride, or guest has committed a faux pas.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "cgeLN1zjzeoL8a1j","flags": {},"type": 0,"text": "…you have become an expert on the finer points of facial hair, including its growth, grooming and styles. The fact that as an Elf you cannot in fact grow facial hair has not deterred you, and you have taken every opportunity to study it “in the wild”, occasionally while the wearer is asleep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "TwZCzon2PF78tD9T","flags": {},"type": 0,"text": "…how to write a sprawling epic in which you created your own world, languages, pantheon of gods, mythologies, races, and histories; the glossary alone totals more than 100,000 words. Of course you would never publish it, or even allow anyone else to read it, as it’s not finished yet. What’s the rush? You’ll get back to it in a century or two.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "U5rYkevqBGpPfHPK","flags": {},"type": 0,"text": "(Non-Rangers only; if a Ranger, re-roll) …how to take very long strides. You’ve practiced taking dramatic, long steps, and you can move your feet further than most without ever having both leave the ground. Unfortunately, it isn’t really as dramatic as you’d have liked and actually looks pretty ridiculous.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "hP401SC1Iq7sOa4o","flags": {},"type": 0,"text": "…how to juggle up to eight objects very well, but they all have to be citrus fruits or else they just feel wrong in your hands. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "eknxsIMVNAPIVU1V","flags": {},"type": 0,"text": "…you spent years learning to create four-dimensional art. Unfortunately, because no one can actually perceive the fourth dimension, the results are invariably hideous (except possibly to Beholders).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "uUpMO6Pz9ARtiqv6","flags": {},"type": 0,"text": "…how to relax. As a kid your parents were really uptight, and you spent a lot of time studying. In your 50s you went through a teenage rebellion stage where you refused to do anything and spent a couple decades just hanging out and smoking goodherb. Your parents were worried you would turn out to be a bum like your cousin, who is nearly 200 years old and still lives in your aunt’s basement. But eventually you got it together.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "a4AvFoiouUOWrd1w","flags": {},"type": 0,"text": "…the art of shaping a rare kind of Narcissus flowers local to your home town. The flowers must be grown in a very specific pot, with water from a precise point in a creek, and of course the bulb itself must have exactly seven perfectly balanced lobes, otherwise it’ll just become a very ordinary looking plant. It has not helped that for the past 13 years, only five- and six-lobed bulbs have been found.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "4reBoarWm0qGBSbG","flags": {},"type": 0,"text": "…how to craft chess pieces in exquisite detail, from nearly any type of material. After 25 years you finally have three pieces finished to your satisfaction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "Ard86EZsO4WbMDtj","flags": {},"type": 0,"text": "…about snowflakes. You were determined to disprove the commonly-held belief that every single snowflake is different. You have yet to find a snowflake that exactly matched another one you’ve seen, but you are convinced that duplicates come into existence all the time, in fact you’re probably missing one right now as it melts on a blade of grass somewhere.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "8qC17mmJOUr74Lhn","flags": {},"type": 0,"text": "…underwater basketweaving. The ironweed of the Marshal Swamps can be harvested and then processed into flexible yet strong strands that can be weaved, underwater, into baskets of the highest quality — with details and patterns fine as the finest embroidery, and strong enough to survive an Elf life’s worth of usage. Note you don’t know how to harvest the weed or how to process it, or even where the Marshal Swamps are, but you are quite good at weaving the processed strands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "3e1qWenqlmVZnFi3","flags": {},"type": 0,"text": "…how to grow extremely ornate living flower crowns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "JvHmjZyyNKZshJjz","flags": {},"type": 0,"text": "…a highly complex form of advanced theoretical mathematics. It is said there are only a handful of Elves in the world who truly understand it. Unfortunately you aren’t one of them. After 25 years of study you can barely grasp the most fundamental concepts, but so few people have studied this field of mathematics that it’s easy to fake mastery of it. You’re beginning to suspect the handful of people who claim to understand it are also faking it. It would be poor etiquette to expose them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "EPOc0YgvwYz3kcUU","flags": {},"type": 0,"text": "…origami.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "CWTmLF20nfaH0XFL","flags": {},"type": 0,"text": "…your local ecosystem. You studiously watched one termite nest or anthill for a year, taking notes on all they do, the way they interact with other animals and plants, and seeing how they fit into a larger ecosystem. Then, pick one of the slightly more complex creature types they interacted with, and watch them for a year. Do that again and again, until you can trace how every single living thing within a mile of your home interconnects in the unbroken weave of life, up to and including you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "pEKSPPe2AQgzuEh0","flags": {},"type": 0,"text": "…how to cultivate an air of subtle superiority over the flora native to your home. Any plants that are endemic to your place of birth will find you to be stuck up and have difficulty persuading you to join their cause. This applies only to non-sentient plants.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "U1Q7GLyFiRrn8kXv","flags": {},"type": 0,"text": "…all about your date of birth. You did extensive research on all the events that have occurred on your birth day throughout recorded history. Unfortunately it turns out to be an exceedingly boring day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "qRAXD5pzNRshIAlT","flags": {},"type": 0,"text": "…one hundred different ways to count. Base 10 is so unimaginative.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "IGYwRQqknmk33wCG","flags": {},"type": 0,"text": "…the ability to tell, just from the smell of the smoke, what type of wood is being burned. If you get this result again, you can also determine the age of the wood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "O5Q477ChqeudJODW","flags": {},"type": 0,"text": "…the ancient High Elven method of reading through the use of a Braille-like script. You can read books printed with this script using one hand. If you get this result again, you also have mastered the art of simultaneously reading a second book using the other hand. If you get this result a third time, you can use each hand and one foot. A fourth time and you can read four books. If you get this result a fifth time, you are banned from your hometown library.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "AK2AB4N1DiFTZRtz","flags": {},"type": 0,"text": "…your family tree, back seven generations. Given that these are Elves, that’s a very, very long time indeed, requiring a lot of research. You actually don’t know much about them besides their names and who they are related to. About a decade into it, you discovered a distant cousin also has created a family tree and there is a slight discrepancy concerning the issue of your great-great-grandfather. It’s caused quite the controversy in your family.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "idNDFsZoDh6ZgnHd","flags": {},"type": 0,"text": "…a Drow method of shadow puppetry traditionally practiced in light so dim few creatures can actually see it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "bpJcvBffRS81yWQp","flags": {},"type": 0,"text": "…the ability to draw your sword with flamboyant panache. When using this technique, you are -2 to initiative, but every time you draw your sword (even if from a leather scabbard) there is a mildly satisfying schrrriiinnnggg! Note you can still draw your sword normally, but why would you?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "WCmCmSpKKbOlN0On","flags": {},"type": 0,"text": "…nature critique. The practice of pondering how nature could be more beautiful.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "eKbwhR43TQMwkggO","flags": {},"type": 0,"text": "…arrow fletching. Through the use of cunning feather placement, slightly bent arrow shafts, and tiny holes drilled in the arrowheads, you can create arrows that artfully soar in aesthetically pleasing spirals, curves, and loops. This provides no game benefit (for example, you can’t cause the arrow to hit someone behind cover) as the arrows in question are far too delicate to be used in combat. (Inspired by Goblin Punch)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "Yp30AqndNpMn2H5b","flags": {},"type": 0,"text": "…the ability to move unimpeded by high heels. As a fashion-forward Elf that didn’t want to give up the chance to show off your style 24/7, you relentlessly practiced moving around in high heels. You can fight, balance, and run with high heels just as easily as you could barefoot. Your balance while barefoot has not improved at all, however, and this only ever applies to high-heeled shoes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "NvfnhOAhthqq13vc","flags": {},"type": 0,"text": "…the Human form of stretching/relaxation known as yoga. Not doing it, rather observing and studying it to determine if it has any long-term beneficial effects. You don’t think it does, but more research is required.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "AEWTSM4UlAjPcOo9","flags": {},"type": 0,"text": "…the art of drawing a perfect circle in any medium, as long as the circle is no bigger than your hand. (Note: It’s a really, really good circle, but sometimes you suspect it’s not quite perfect.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "LQQKcNHhduejhmEx","flags": {},"type": 0,"text": "…how to determine whether a perfect circle truly is perfect. You’ve seen some really, really good circles, but you’ve yet to find a perfect one.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "kJRXXYJLYE575ocG","flags": {},"type": 0,"text": "(Non-Drow only, if Drow re-roll) …research into cloud divination. Having tried different mediums, interpreting their predictions in the most broad way possible, over two and a half decades you have utterly disproved cloud watching as a divination method. Note that you have not actually learned cloud watching or any divination of your own, to stay impartial to the study. The cloud diviners predicted you would say this.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "nfdFYNQZxhk520S3","flags": {},"type": 0,"text": "(Non-Druids only, if Druid re-roll) …the art of encouraging growth in one particular species of non-sentient plant through the use of subtle sarcasm, veiled threats, and passive-aggressive attacks cloaked as constructive criticism. (If this plant ever acquire sentience, it will require therapy.) As a result of your efforts, the plant grows 2.4% faster per year than a plant without such attention. If you get this result again, you may either pick a second species, or get 4.8% faster growth in the same species.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "5ELsCboIfcoVxpH9"}
