{"name": "Dark Gifts","description": "One hundred different dark gifts that always come with a price...Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "ff9MNmx6OrimsSr6","flags": {},"type": 0,"text": "The character is given a bonus to their damage roll – at the expense of their teammate’s health.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "gnRzMYuc204fBSO7","flags": {},"type": 0,"text": "Your healing, including spells, class features, and potions you administer, is maximized and always heal for the maximum amount. Any healing you receive, including your own, is minimized.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "ERGwDZmv9rPRVUvF","flags": {},"type": 0,"text": "You can create a potion of healing from your own blood, which deals 1d10 damage to you. A created potion becomes spoiled if removed from you for more than one turn (long enough for you to administer it to someone else), or when this ability recharges, after a Long Rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "qAL0pHNFL8fZMiuL","flags": {},"type": 0,"text": "You can make any weapon you hold or ammunition you shoot to count as magical and silvered for the purpose of bypassing resistance/immunity. Unfortunately, in each encounter there is a 50% chance that one or more rust monsters appear, as if summoned, to hunt you down. If defeated the rust monsters disappear back to where they came from. If the monsters have appeared in an encounter they can’t show up in another encounter until after you take a Long Rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "Z5Zp4lCu0fnPwWEY","flags": {},"type": 0,"text": "A sinister insomnia injects you with nervous energy throughout the day, constantly invigorating you to the point where your body and mind can barely relax. You find that while you gain the benefits of a long rest in half the time it would originally take you to do so, you are unable to gain the benefits of a short rest whenever you take one.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "1G70IExLuCoGOM4Q","flags": {},"type": 0,"text": "Increase Damage Done but the extra damage is also done to one of your allies","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "1w5H0KkOABYTsuCG","flags": {},"type": 0,"text": "You can cast an extra spell slot, at the expense of 1d20 HP.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "pUnbZqkMVhIWuum4","flags": {},"type": 0,"text": "You may increase healing done but to do so gives a point of exhaustion, that may or may not go away with a good night’s rest","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "o4hU55vknZFccV17","flags": {},"type": 0,"text": "Twisted Icon: You are gifted with a twisted lump of metal that can be used to turn undead with advantage. Other people see the symbol as the holy symbol of the god they are most opposed to and believe you to be one of its followers. They are resistant to convincing them otherwise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "Be8INRpA3pbjry1x","flags": {},"type": 0,"text": "The ability to cast spells at a level higher than normal equal to fractions of lifespan (using each race average) automatically poured into the power. For example, casting a third level spell at ninth level takes 6 extra levels x 1/15 (7%) of average lifespan for the PC’s race. So 5ish years per extra level for a human, and 50ish years per extra level for an elf. Could also be turned into a weapon enchant.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "GWfebmAfgaYTlKHJ","flags": {},"type": 0,"text": "You can resurrect a dead person by placing their corpse next to another of similar size. The corpse to be Resurrected is determined randomly with a 50-50 chance. The corpse that is not Resurrected can never be so once this ritual is complete.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "deq7hYd5uxtHPnDm","flags": {},"type": 0,"text": "Snake-tongue Oracle: Once per day, you can ask the GM one simple yes or no question about an upcoming event or challenge. The GM passes you a paper with the truthful answer, but they may also order you to lie about the answer and deceive your fellow players to the best of your abilities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "BSlqOKOP3PdMiIzu","flags": {},"type": 0,"text": "You gain advantage on Sleight of Hand checks and a +1 bonus to one-handed thrown weapon attack rolls. One hour every day, usually around midnight, one of your hands comes unattached and crawls around as a Crawling Claw causing mischief. The hand has its own evil agenda and is a kleptomaniac.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "WnAmQO4bnU1V2MNS","flags": {},"type": 0,"text": "Jinx: You steal the luck of others, passing misfortune on to the nearest person when disaster would have otherwise struck you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "FR4mQFRYuPlTwRTi","flags": {},"type": 0,"text": "Tough Love- Your healing does maximum amounts. At the end of the encounter, anyone healed takes a level of exhaustion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "G5RIDLAEZvaP6BDU","flags": {},"type": 0,"text": "A gift from Granny Pigknuckle- You can snap one of the bones in your hand. Doing so requires a Constitution Check and leaves you at disadvantage on Dexterity checks. If you do, you can take over the bones of one medium or 2 small enemies you can see. This essentially dominates them (a contested check vs. Arcana or Intimidation to act contrary to your whim) and if they are killed, their skeletons tear out of their flesh, animate and loyal to you. This remains until your bone is healed or they are destroyed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "GPdo4GESZQnZUDLQ","flags": {},"type": 0,"text": "With Umberlee as your patron, you point at a target, causing their lungs to fill with seawater. Any time you try to eat or drink, it tastes overwhelmingly salty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "k85iQhxyfwHoNmm3","flags": {},"type": 0,"text": "You can see in in dim light as though it were bright light. Nighttime is now blinding.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "18trqIYeB5QFoUAI","flags": {},"type": 0,"text": "Nocturne’s Theft- Once between long rests, you can immediately gain the benefit of a short rest. At your next long rest, (a random) one of your party members is stricken with insomnia and gains no benefit from the rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "FjxqjFDCKMOBPji0","flags": {},"type": 0,"text": "The Lyre of Longing Beyond: simple fascination, the Lyre of Longing is an instrument, which creates an intense emptiness in its victim when it’s used to compel others. Saving throws to resist enchantments automatically fail on the basis the target simply has neither the will nor desire to fight the one who plays it – they have been robbed of their will by the void. The catch is that the void is a terribly hungry patron. Playing the Lyre of Longing causes all physical stats to ebb. Each use costs a single point of Strength, Dexterity and Constitution that only return at a rate of one per week for one category. Most people who draw on it’s terrible power have drained themselves to ash or simply succumb to common illness after years of careful abuse, weak as kittens and surrounded by mindless followers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "XGLwP9KdereipA6T","flags": {},"type": 0,"text": "False Hope: Gain +2 to Constitution but permanently fail one death saving throw.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "ib3FS5A5JEAEoPx2","flags": {},"type": 0,"text": "Whenever you roll from the Wild Magic table, if you would like to roll for a different effect you may, but you must make a Wisdom saving throw against a DC of 17. On a fail you take, 4d6 psychic damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "8776gO4Di9jj9yUq","flags": {},"type": 0,"text": "Dark Healer – the gifted has an unexplained supernatural ability to transfer health between two creatures of the same size. Two times per week, they may touch two creatures and transfer 2d6 health from one to the other, though it will never steal too much. However, 1d6 rounds later, the gifted takes 1d3 psychic damage, and must make a Wisdom save or it is permanent damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "zdWzYMlPpoSyzUd7","flags": {},"type": 0,"text": "Midas touch – slowly turn all inanimate and nonmetal things you touch into gold. Gold counts as 1/50 of it’s weight value when you lift it. Over 24 hours, your equipment will double in weight and become the equivalent value in gold, and become restrictive, giving you disadvantage on STR and DEX related rolls. You leave gold footprints that make it easier to track you while you are barefoot. This gold effect expands like frost. You develop a hatred of gold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "ILB32ycrdvFrsp7O","flags": {},"type": 0,"text": "A gift for Our Lady of Retribution- Trade Justice for Mercy. For Paladins only. Do an extra 2d8 Holy Smite damage. As a result, after the next long rest, your Lay on Hands pool is halved and the next 3 healing spells are at disadvantage. Anyone using this ability 3 times gains the flaw I find it difficult to differentiate between large sins and small infractions. All are guilty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "BChnZAwABiwr2So1","flags": {},"type": 0,"text": "A gift from Sardit, the Ever Unseen- you may gain advantage on stealth checks for a day in exchange for disadvantage on social skills for 3 days. In addition, you may cast invisibility on yourself 3 times per day; every time you do, however, someone you know forgets your existence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "zroQnEicayZRBGZU","flags": {},"type": 0,"text": "You can cheat Death, ignoring a blow that would bring you to negative hit points. The next time you sleep in a bed, four people sleeping in the same village die in their sleep. Their relatives know you were involved somehow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "RmkXNc3Vi0NAmvGM","flags": {},"type": 0,"text": "A gift from Xerielle, Lady of Venomous Truths – You gain advantage on two deception checks per day, but must tell the absolute truth at a time when it will be most hurtful to another.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "Rfosh2nH0s8JLdbf","flags": {},"type": 0,"text": "When getting hit, you may choose to negate half damage. A friendly humanoid in the vicinity chosen by the DM takes double the damage negated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "qH5VJOEASaT72ALS","flags": {},"type": 0,"text": "The ability to cast Power word kill which resets 7 dawns after cast. When used this kills a random persona, the one casting PWK has met in their life.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "KWgwm1CKAidXpXmF","flags": {},"type": 0,"text": "Drowner’s Boon: You gain water breathing at will and have a swim speed equal to your movement speed. You temporarily lose these abilities and gain one level of exhaustion the next day if you did not drown yourself in a body of water large enough to submerse yourself completely in during the day before. Drowning yourself does not cause you any damage other than psychological. Completing your daily drowning removes the exhaustion and restores your dark gift.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "wIMFkyMCvGSMJU9o","flags": {},"type": 0,"text": "Call your Kin: Once per day, you may summon level appropriate vermin swarms. The number, type of vermin, spawn location, and behavior of these swarms are not under your control. They attack everyone but you indiscriminately, consume the corpses of the dead, and ruin perishable goods around them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "4JLDRof3qLGpMaFQ","flags": {},"type": 0,"text": "Bloodbane- You gain damage resistance 3/- all. However someone who does or will have a grudge against you also becomes your bane- you have vulnerability to their attacks. You do not know who your bane is, and it shifts if you defeat them. The granter of this gift loves to bestow it on the paranoid.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "T7aor7fdbxySBeVE","flags": {},"type": 0,"text": "Not the Body Pillow you were Hoping For: You roll death saving throws with advantage. You must sleep directly beside the corpse of a sentient humanoid the same size class as you to gain the benefits of a long rest. That corpse must in raise-able from dead condition and cannot be an undead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "4lSJPnyHmm0VKurv","flags": {},"type": 0,"text": "A ring that increases constitution by 2. Requires attunement. Cannot be taken off or unattuned from without removing the finger.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "gVfvG0EUEPlNnxlm","flags": {},"type": 0,"text": "You may expend a hit die to heal yourself any time you kill a living thing. You lose the ability to spend hit die during short rests.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "s4jgyVdVsDZHNcPv","flags": {},"type": 0,"text": "Polyhedral Infliction – Up to three times per day, you may touch a player character as a concentration spell. For the next minute they may choose to roll 1d4 and add it to an ability check. (See the Guidance cantrip) The target player must roll the ability check with the dice they believe to be the most unlucky.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "YvQsx0F43yBJJHMt","flags": {},"type": 0,"text": "Taboo Allowance: A small but level appropriate amount of gold appears magically in your pockets after a long rest. Your GM (secretly) chooses a taboo word which you are informed of and may not tell others. If a player or character under their control speaks that word, you immediately lose 5x* the value of your magic pocket change in coinage and equipment of your choice. Your GM then chooses a new taboo word. *The amount lost should be inversely adjusted to the GM’s inherent wickedness.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "gb8oQXvpf8EFTXz7","flags": {},"type": 0,"text": "You can cast Misty Step as a cantrip, but there is a 20% chance you will be Paralyzed for 1hr after you cast it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "7cDE6hzmGDn8iFdJ","flags": {},"type": 0,"text": "You gain Reduction to Non-Magical Slashing, Piercing, or Bludgeoning damage. The damage reduced is instead sent to your next of kin. If you have no next of kin, this power stops working.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "4kNGqDxwp6G9OUg5","flags": {},"type": 0,"text": "You may regenerate 1/hp a round when you are in contact with fresh blood of a sentient creature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "ruCVIHI7jkRLR50H","flags": {},"type": 0,"text": "You are immune to the effects of disease, the sickened condition, the poisoned condition, and the effect of all poisons. However you are still a carrier and the effects radiate out from your for 10 feet, possibly more, spreading that infection around.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "rogbUQkOdmNVut8r","flags": {},"type": 0,"text": "You gain a bonus to your movement. You may not cross running water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "K8apI2tijmbBWvx3","flags": {},"type": 0,"text": "Gain a bonus to an attribute. You may not walk through doorways.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "ZnONqtRvUkNEGgoT","flags": {},"type": 0,"text": "Gain a bonus to your initiative. You may not give help or assistance without receiving payment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "lTt14fZlwjVka3nD","flags": {},"type": 0,"text": "A half-coin that lets you borrow luck from your future. For all intents and purposes, you can turn rolled 1s to 20s… but at any point in the future, the DM can turn your 20s to 1s. Flavor: if the character looks at the coin after they borrow luck, the half-coin becomes the other half.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "6nIEe4fflv9aTUzA","flags": {},"type": 0,"text": "What will be functionally known as a Vampire Ring, or a corrupted Ring of Sustenance: A normal looking rusty-colored iron band. Grows darker red as the wearer grows steadily Hungry, and/or steadily more Fatigued. If the wearer becomes Starved, it magically draws blood from creatures around the wearer, draining 10 HP divided amongst however many creatures are around them to sustain the wearer (even if a party member does not use blood, or if a party member is Holy, blood is still drained and HP is still doled). If the wearer becomes Fatigued, for every hour needed to lose this status is drained from others, causing creatures around the wearer to grow closer to being Fatigued themselves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "AT58QFYKZNJTPcLS","flags": {},"type": 0,"text": "The one bestowed with this dark gift can adapt to any atmosphere/environment (unbreathable, water, restricted air, heat, cold, etc.). When the bestowed accumulates one hour of time accustomed to the associated atmosphere/environment, they permanently retain a feature associated with that environment (e.g. spent underwater, they gain fins; spent in freezing cold, they get covered in fur, etc.).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "YnnuhVJGcBFQwLbX","flags": {},"type": 0,"text": "You receive a unique weapon that is attuned to you. However, you are no longer capable of violence against any living being without feeling all their pain, even as they die (and even if they are given painkillers and don’t feel it themselves).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "ENIje5JqpyTyRmSB","flags": {},"type": 0,"text": "You receive a small token hides your evil nature as long as it is against your skin. However, if any good/neutral magic-user (divine or arcane) sees the token, they instantly recognize what it does.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "raPKBHqvmglTDDhk","flags": {},"type": 0,"text": "Your body and magic are stronger, but every other day, your body operates with a will that’s not your own, and you have no memory of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "4MrtHPLUVPRdcxD5","flags": {},"type": 0,"text": "You are rescued from death, but are given a tumor that slowly transforms you into a zombie.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "VB3ubW7xSykaGSWn","flags": {},"type": 0,"text": "You can detect lies and surface thoughts, but you smell strongly of rotten fish, penalizing both stealth and open social interactions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "jdxh68AJ6HZo1jMY","flags": {},"type": 0,"text": "Your character cannot sleep, but all benefits of sleep can be achieved by drinking the blood of any sapient creature, with one fluid ounce of blood replacing one hour of sleep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "Ry3LQQ48SXjW3RIE","flags": {},"type": 0,"text": "You become impossibly good looking, and you gain proficiency with the persuasion and deception skills, or double proficiency if you have proficiency. But the cost of a pristine exterior is a rotten interior. You loose 2 constitution points.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "kqmocIEGOR8VXnjC","flags": {},"type": 0,"text": "You revive a cursed whetstone. Any weapon sharpened using this will gain +1 to all attacks, and all damage done by this weapon cannot be healed by magical means and takes twice as long to heal during a rest. The weapon will maintain this sharpness for the next day as long as it draws blood. Every day after it doesn’t feed, the wielder must make a dc10+(the number of days since it has fed) wisdom saving throw. On a failure, they attack themselves with the weapon in order to feed it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "koC4iWChxJrYQMGo","flags": {},"type": 0,"text": "You can choose to roll any deception and persuasion roll with advantage but every time you do so you lose more and more of your guilt, remorse, empathy, and emotions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "nNRIYrlBE4qX0hwc","flags": {},"type": 0,"text": "Gain a once a day power to summon a small lightning storm, but the bolts strike indiscriminately.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "C2fK6hP5urKivjh3","flags": {},"type": 0,"text": "You can read and speak Infernal, but you gain an off-putting forked tongue.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "pU0aI0hirpIz6M2z","flags": {},"type": 0,"text": "Your blood becomes acid, and sprays like Acid Splash when you would normally bleed; expect corroded equipment and difficulty patching wounds when it does.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "1cva7qWdZEggmumx","flags": {},"type": 0,"text": "Your unarmed attacks are buffed by venomous claws, dealing extra slashing and poison damage; you are more easily provoked into fighting, can’t equip gauntlets, and suffer -1 to attacks with weapons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "nK3qHySWwXm15zaE","flags": {},"type": 0,"text": "The gifted is healed by the involuntary depletion of their teammates magic item charges.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "F1TYEVZdQ5h6j6nA","flags": {},"type": 0,"text": "The gifted can speak any tongue but can no longer read nonmagical text.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "205L0O3TWd4HTU73","flags": {},"type": 0,"text": "Unwelcome Guest: An invisible, malevolent force lurks silently behind your eyes. You are immune to all mind-affecting magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "V89zbtCJm24oM92F","flags": {},"type": 0,"text": "Enhanced skill (say +2 on body-based checks like attacks or Dex checks) on the days of a new and full moon, but as soon as night falls the PC’s body will exhaust and force an unbreakable sleep. Until dawn, anything the PC dreams may enter the material plane and gain a physical form. I would probably roll on a table d30 or d100 table where 5-10 percent of the results are sweet items, and the other 90-95 percent are monsters or people to have encounters or social interaction with. At dawn the sleeping PC awakes, but whatever was summoned, stays.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "Cv4wrsSQVsJl0GrN","flags": {},"type": 0,"text": "Hooded St. Jude: You are marked with the fallen saint of lost causes. You can create an identical mark on a willing person, who receives a minor miracle (heal a dying child, regain sight, etc.) in exchange for eternal servitude to the fallen saint. The miracle must be selfless.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "zjPXYJl7NTDATmL9","flags": {},"type": 0,"text": "Unfettered: You are estranged from the alignment system, unaffected by any benefits or penalties thereof. Creatures with an inherently good or evil nature mistrust you by instinct.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "nerzFthfhc8jbOkf","flags": {},"type": 0,"text": "Entropist: The world crumbles at your touch. Stone falls to gravel, wood to sawdust, and friends to bleached bones. Gloves and weapons likewise disintegrate in your hands. Other areas of your body (feet, torso, etc.) do not produce the same effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "sZ8eR9JI7LL7HRTU","flags": {},"type": 0,"text": "May once per encounter do 1d10 damage of any element to an enemy, but the more you use it, the more you change into the alchemic creature of life: a chimera.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "GS0ftfUKujTN8WTU","flags": {},"type": 0,"text": "You gain perfect darkvision, regardless of your race, but at the cost of your ability to hear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "PpdYzx9gupRb4Wrb","flags": {},"type": 0,"text": "You can see 30 seconds in the future… But you can’t see what’s actually happening now.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "xJULhxX2FXEa4vEc","flags": {},"type": 0,"text": "You can now communicate telepathically. But every time you do so causes your sanity to degrade.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "xfG15ADOq82sWdYR","flags": {},"type": 0,"text": "You Can Dimension door to any desired location with in 5 miles, however, 1 pint of fresh blood is required as a material.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "J88Jes8qHOEBkCmC","flags": {},"type": 0,"text": "You gain the ability to triple what you normally can in the dark, however, your eyes glow red, and you are feared by humans, halflings, dwarves, and elves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "mgzTR8T6GXJuDoIu","flags": {},"type": 0,"text": "You can become a adult werewolf during the night, however, you lose all intellect while in that state. You also have a 1d6 chance of going on a complete rampage for 1d4 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "Qr6cRnGraJwFqQai","flags": {},"type": 0,"text": "You can cast Darkness, however, after the spell ends, you go temporarily blind yourself for 10 minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "ITrR0KWwmiycvAWN","flags": {},"type": 0,"text": "You gain a strength of 25 for 1 minute. However as soon as that minute is over you gain 2 points of exhaustion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "DkxjtgSFeIpjU7Zt","flags": {},"type": 0,"text": "Every Encounter you have that is with a creature weaker than you, you can cast charm without using up a spell slot. However, on a failed attempt, you take 20 psychic damage + (your current level) d4.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "nBhpbGUAQ3sBmKib","flags": {},"type": 0,"text": "You Learn Fireball as a cantrip, However, Casting it more than 2 times in a 1 day will permanently give you a random curse from D100. Casting it each additional time, will add more curses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "SNKQpg9tQ3WGALko","flags": {},"type": 0,"text": "The Goblet of Borrowed Life: Drink from the rich red waters of the beautiful demonically adorned goblet and you will restore 1d10 health for each full goblet’s worth you consume. The goblet refills to the brim once an hour and never spills. The catch is each time you use this item, a proportional amount of health is lost from you or an ally you share it with on waking from your next rest. Don’t drink yourself to death! Maybe share it with someone you hate though.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "T5lWA5LbXW2K1UCo","flags": {},"type": 0,"text": "Rat’s Bastion: It looks like a standard mirrored great shield, but the middle is bent and people who stand to your side can see the reflection of the enemy. Because of the unique construction of the ornate shield you can redirect blows onto other people within 5 feet of you as a reaction. Naturally you can only do this once per turn. The catch, other than nobody wanting to stand next to you anymore, is a compulsion to avoid being hit at the expense of others. So you not only avoid harm but must actively seek to offer up others into harm’s path. If it’s you or the orphan facing a charging bull, the world will have one less orphan.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "wbcO0nFn1nEVFQ2j","flags": {},"type": 0,"text": "For 24 hours, you gain +2 Charisma, but any clothes you wear become invisible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "vChA9rKh3XYUm1Rb","flags": {},"type": 0,"text": "You gain a Charm of Cursed Wild Shape that has 5 charges. Upon using the charm, roll 1d4. If the result is even, the spell casts normally, lasting for a number of hours equal to the caster’s total level, or until the creature’s hit points are reduced to zero. If the result is odd, the caster is turned into a sheep until their hit points are reduced to zero. Once the charm has run out of charges, it disintegrates in a black and purple smoke.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "ZjSn09Srfv6N4jqM","flags": {},"type": 0,"text": "For 24 hours, you gain +1 to all of your stats. For the following 24 hours, you gain a level of exhaustion. This exhaustion cannot be removed until the second 24 hours has completed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "tw3xPoBbSEQU3IAK","flags": {},"type": 0,"text": "You asked for a silver tongue but weren’t very persuasive, the demon took your mouth instead. Gain advantage on persuasion checks as long as your mouth, or where your mouth used to be, is covered.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "BoZhKzHWDy2mksnQ","flags": {},"type": 0,"text": "Skeleton Key: The flesh on both of your pointer fingers rots and falls off. The leftover bone hardens, reshapes, and becomes a tension wrench and pick. You become proficient in lockpicking if you weren’t already and roll checks with advantage if you already were. You have a difficult time resisting the urge to unlock that which is locked even if you have no desire to thieve.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "UeXQ12Ppo2ipu3Qi","flags": {},"type": 0,"text": "Devil Doctor: You draw power from fallen divines that have been chained in the darkness yet still obsessively yearn to see their work wrought upon the living. You can cast the following healing spells without expending components. A) Cure Wounds: (lvl 1-5: 1/day, lvl6-10: 2/day, lvl11-15: 3/day, lvl16+: 4/day), and B) Lesser Restoration: Once per day, and C) Greater Restoration: Once every three days. You cast at the spell’s base level and bonuses that improve your healing capabilities (such as feats, domains, or class benefits) do not apply as these powers come from a dark place. These spells cannot be cast stealthily; conversely, casting them attracts attention. Your teammates prefer your healing touch even if a more skilled cleric is present. The ill and those caring for them see visions of your coming as a healer with unusual powers. They are drawn to you, demand your attention, and may become violent if you do not help them in some way. You must hide in public to avoid being accosted.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "IlcOk64OQoiR8MyU","flags": {},"type": 0,"text": "Bargain Blessing: Shopkeepers and the like inexplicably offer you (but only you) discounts (10%-50%) when you bargain with them. You feel a strong compulsion to buy more than you need, including items which you and your party cannot use. It’s nearly impossible for you to shop without buying something extra. Even if you shop with a helper to reign in impulse purchases, you still make offers to buy extra while bargaining with the shopkeeper.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "8PoC8UyAMDjvviDf","flags": {},"type": 0,"text": "Uncanny speed. Your speed is doubled and your AC is increased by 3. But you have to move at least half your speed ever turn and there is a 25% chance you will run into any wall you get within 5 feet of if you are not moving parallel to it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "HrxBGaUS9KN0Gfpz","flags": {},"type": 0,"text": "Baby’s Breath- All criticals do max damage, and weapon or offensive magics do an extra 1d10 necrotic damage. Anything killed by you is transformed into its most innocent form (a young child, a cute cub, a hatchling) an instant before the blow falls. This creates both external problems (explaining the dead children used to be bandits can be a hard sell) and internal problems (a wisdom save or some appropriate penalty).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "jzpouqo0Uz2Z2zrU","flags": {},"type": 0,"text": "You gain a keen sense of smell for living flesh, and this allows you to determine how many livings creatures are upwind from you, or in a 100 ft radius if there is no wind. You also gain a hunger for living flesh. Eating live flesh carries no negative effects, but if you eat or drink anything that isn’t still the flesh of a still living creature, it will rot/ spoil in your mouth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "0vYHB6YcmX22rPlc","flags": {},"type": 0,"text": "Wrath Personified- you gain the barbarian’s rage affect permanently (at level 1). You must make a Wisdom saving throw to solve any problem in a nonviolent way. In addition, whenever speaking with someone for the first time, you must roll d20. On a 1 or 2, you develop an instant hatred for that person.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "o3SUFZ3hvdXbIllH","flags": {},"type": 0,"text": "You can sacrifice a small or tiny animal and see what it saw in the last hour it was alive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "k2wnWX7UCKIX1zdf","flags": {},"type": 0,"text": "You gain the ability to choose to crit automatically on your next attack roll, but the next attack roll that would miss you hits instead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "rRjpIpOW0QxdsdYQ","flags": {},"type": 0,"text": "You receive a coin that when presented to any court, will immediately absolve one person of all crimes. However in doing this, another random person is accused of crimes of equal magnitude.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "ENgwU4nejINXMxh1","flags": {},"type": 0,"text": "One of your eyes is replaced by a yellowed, reptillian one. This grants permanent 60′ darkvision or adds 60′ to any existing darkvision, as well as granting a once-a-day use of Detect Magic. However the eye moves of its own free will and will burst if the gift-giver is betrayed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "ofSYCHOhdjAtYQjg","flags": {},"type": 0,"text": "A card that, when used (by reading the magic words on it) will give the player great luck for a hour. Later, however, the player will have really bad luck for an hour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "zC6jIHjLwSqzBxB9","flags": {},"type": 0,"text": "Silver Tongue – You are unusually charismatic. All charisma skills get a +2 and once per day you can cast Charm Person at level 1, but you feel as though you are decaying from the inside over time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "w3AumQXFgPjQpSZu","flags": {},"type": 0,"text": "Your right arm is that of a demon, and anything that It touches can’t use magic, including healing spells that would heal you, but it can be used to disable magical devices or paralyze magical constructed (not make them disappear).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "ihsgAq1Z0Ouboze9","flags": {},"type": 0,"text": "You are given most of the physical and magical resistances of a powerful mummy lord. But you must bear his heart at all times, and suffer his presence in your mind at all times. He is capable of suppressing many of your capabilities at will, only not doing so because doing so may put his heart at risk. You are in a contract with him, and keep these powers and curses until the contract is fulfilled.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "yPSShBycEbXCasSG"}
