{"name": "Fantasy Drugs and Their Effects","description": "One hundred different fantasy drugs that are illegal in most planes of reality.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "OliOG1Q2elfKKyYQ","flags": {},"type": 0,"text": "Slithersoup: a liquid that when consumed in large quantities, makes you feel like your bones are jelly and commonly causes people to writhe on the ground like snakes when taken in higher doses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "L25cjtDHhBCTWTfe","flags": {},"type": 0,"text": "Feydust: A soft white powder that, in the right light, shines with soft blues and red. The powder tastes like burnt ozone, which makes it evident that it needs to be snorted. Use causes bonuses to IQ based tasks but also makes its user seek it out more and more for increasingly trivial tasks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "rXqkIGU7zx3eBo7L","flags": {},"type": 0,"text": "Halfling Weed: Most often dried, chopped, and smoked. Causes extreme emotions to abate and induces near euphoric mellow-ness and, occasionally, a user will experience mild hallucinations. Side effects include increased appetite and red, puffy eyes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "qS0D2JN54ImTHU4D","flags": {},"type": 0,"text": "Blue sand: A substance similar to fine sand found at the beach, only that it’s deep blue colored. Consumed through the nose. One to five doses (depending on Wis or Con modifier) are enough to develop an addiction. Early effects (one to three weeks): Enhanced perception, athletics & acrobatics Following deterioration of body and mind: First (after four weeks of constant consumption): One exhaustion stack per three days without a dose. Second (after six weeks): Negative modifiers (-2) on all attributes and disadvantage on all skills. Third (after 8 weeks): Death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "XQJhTNDg4Tm1SSh7","flags": {},"type": 0,"text": "Dream Flake: Thin slivers of a dried, black fungus. When place between cheek and gum, it induces hallucinations and euphoria. When smoked, the user enters an extremely vivid waking dream, which can last for hours. Extended use blackens the teeth and make ‘bad trips’ more common. Addictive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "FrIhLB0PvCH9k8JT","flags": {},"type": 0,"text": "Wrymwood: looks like a cinnamon stick but smells of fungus. Grind some up and put in a tea. When drunk, it provides a psychedelic trip for 1d4 hours (halved on a DC 15 con ST and doubled when failing by more than 5).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "LTRVlyIWlwXytRH2","flags": {},"type": 0,"text": "Grellsvice: A drug usually administered as an oral capsule made from the spikes at the end of a grell’s tentacles. Effects last for roughly two hours on a regular 200 mg dose, and leave the user with a four-hour hangover of sorts. The main draw to grellsvice is a tingling sense in the muscles and extra-sensitive motor functionality. This comes with a strong euphoric rush whenever a new body part is moved. The drawback is the lack of motor functionality during the hangover and the incredibly dulled sense of touch accompanied with it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "Mfkq13CiVkRDMY1C","flags": {},"type": 0,"text": "Sundrop: a bright yellow/orange liquid, naturally incandescent, as if it was a liquefied ray of sunshine (henceforth the name). Originally used as a magically synthesized antidepressant, Sundrop when consumed tricks the user into believing that they are happy, as it quite literally gives them ‘warm feelings’. Over usage may leave the user feeling withered between uses, as their dependency has rendered them unable to produce dopamine and serotonin. Over time users also commonly begin to build tolerances to Sundrop, requiring greater quantities to be consumed to maintain the effect. Overdosing on Sundrop causes feverish conditions, as the drug radiates through the users veins, ultimately burning them alive from the inside out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "teSgpQ1SOYsfFx7e","flags": {},"type": 0,"text": "Patch: It works similarly to ecstasy, expanding yourself to feel the sensations all around you. It grants the ability to speak with plants and animals for 1d4+1 hours, and the comedown has a DC15 CON save. Failing the save adds one point of exhaustion immediately after waking from the first long rest you take, and lasts until completing the next long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "p07p2Y6jxpjc2dP2","flags": {},"type": 0,"text": "Lakua: ground silvery bark from a type of tree only found deep in swamps. Low dosages are generally taken orally. Heavier users often make a paste to apply to their gums. Addicts may smear it into cuts. It gives an adrenaline rush and time seems to slow down but the duration of the high is short. Death comes from heart failure or self-neglect. Psychologically addictive not physically.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "bkTrb8uwV3oAH6YA","flags": {},"type": 0,"text": "Zooterran: Made from refined Exem plums. Alters one’s sense of direction and causes one to only turn right when faced with a left/right choice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "XA9BREAoSdUUO7sD","flags": {},"type": 0,"text": "Blackroot: This lichen grows on large rocks and boulders found above timberline (the elevation at which trees do not have enough oxygen to grow). When chewed on, it causes the user to have a pleasant, tingling sensation of the lips, tongue, and gums. As well, it can give the user a sense of mental sharpness and alertness. If swallowed, it causes nausea and vomiting if the user fails a DC 13 Constitution check. If used for 1d6 hours continuously, the user must make a DC 15 Constitution check. If failed, they experience nausea, but if passed they gain advantage on Perception checks for the next 1d4 hours. Not inherently addictive, though if used for 1d12 days in a row, the user will feel extremely groggy if they do not use it every morning.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "JilNxgYfNzQzDC6V","flags": {},"type": 0,"text": "Deluge: Packaged in single-dose vials, ingesting this ethereal blue liquid gives subjects temporary access to spell-like abilities of varying degrees; usually cantrips and 1st Level spells, but sometimes more powerful spells depending on the purity of the substance. However, the temporary magic abilities come with a price: each time an individual ingests Deluge they take Constitution damage: 1d4 for average doses, 1d6 and above for purer doses. This is because the magical energy that Deluge is providing is actually taken from their own souls and continued use will cause them to gradually wither away. It’s named Deluge because it feels like a flood of energy and power washes over you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "4TVIyrjw5ATo3BYl","flags": {},"type": 0,"text": "Barb: A thorny stalk from the Cheb barb weed (looks like purple buck thorn). Sold by the branch, you can pull off individual thorns and use them to scrape or pierce the skin. The side effects are similar to pot, but too much can result in paralysis.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "TT92cpb7DpClLRAh","flags": {},"type": 0,"text": "Scurva: a vial filled with an irridesant liquid. When drunk it causes it user to see colors more vibrantly and lights to shimmer and become more liquid like. Also makes its user completely intoxicated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "KFVtWavgB1rkjDo0","flags": {},"type": 0,"text": "Fizz: A bubbly, sweet drink in a glass bottle. It has a red label, which reads ‘Fizz-Cola’. When you drink a Fizz-Cola, you have the urge to drink another. That’s it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "qgEoH48AeDxhb0J4","flags": {},"type": 0,"text": "Espiritu: a drug derived from a certain flower commonly used in holy rituals. When blessed, left to wither for at least three days, and then dehydrated completely and turned into a powder becomes a strange blessing all it’s own. If smoked or snorted, this powder grants a single question answered by a Divine being. It also grants a strong feeling of peace and euphoria, as well as a strong sense of hunger.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "4B80nxIeRBtPFcV6","flags": {},"type": 0,"text": "Devil’s Root: A black root that is ground up and snorted. The user blacks out and sees visions of hell. Sometimes, these visions allow the user to see into the future.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "F0XB3Dz03TIJFcKm","flags": {},"type": 0,"text": "Wandercaps: When you ingest these plain gray mushrooms, you fall into a deep trance. You experience vivid hallucinations, often nonsensical, but sometimes hinting about the events in the near future. The comedown is unpleasant.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "MA5fqLT0hM02vrtn","flags": {},"type": 0,"text": "Ember Berries: These faintly glowing black berries are used in coming-of-age rituals in a certain druidic sect. Drink a tea made from these, and you will become relaxed and calm. After a few minutes, flames begin cloaking your body – as long as you remain focused and calm, they cannot hurt you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "41RXxxYpE3Cbbnr7","flags": {},"type": 0,"text": "Bane: a mix of grinded wild herbs. Primarily consumed by smoking, it calms down the body to a point where you are so apathetic that even your greatest fears won’t shock you anymore. Often used as medicine by insomniacs or lunatics, but also object to drug abuse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "W7tU2D6JLSpJK5eM","flags": {},"type": 0,"text": "Sutara: When applied to the tongue, the user can speak any language they desire, that is, if they can handle the drug. Incorrect dosage or an unprepared system will result in them speaking in absolute gibberish for the duration.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "nyMZJ7jS7xAiU6cn","flags": {},"type": 0,"text": "Sharpsugar: Expensive, indulged in by many performers to give them the boost of energy. Removes one level of exhaustion, gives advantage on perception checks, and adds 5 to your movement speed. User becomes jittery. Either snorted or smoked from a pipe. Made out of a rare plant that grows only on the Southern Coasts. The gangs that import it are incredibly dangerous.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "l3DZiUv6vdXnBegK","flags": {},"type": 0,"text": "Sleepysalt: Similar to sharpsugar, but with different effects. +5 temporary HP and resistance to bludgeoning damage for 1 hour. At the end of the hour, you fall asleep for another hour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "go9s14uJ2t7cwScy","flags": {},"type": 0,"text": "Drakeroot: Concentrated nectar of the mandrake plant. When you drink it, you go into a coma for 2 hours. During this coma, your outer layer of skin becomes more like a cocoon. At the end, you emerge with all health point fully restored and any scars gone. After 24 hours without another dose, you cannot heal using your hit die or over a long rest without using more Drakeroot. This continues until you break the addiction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "aFOI480Za3W7p6Ut","flags": {},"type": 0,"text": "Sannish: A blue liquid distilled from the milk of wolves and a powdered desert plant. Causes euphoria and gives advantage on constitution saving throws. Very cheap, but also quite addictive. After three uses, your lips seem to be stained blue and cannot be washed off without magic like prestidigitation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "krhsn7oXocnT6ZRO","flags": {},"type": 0,"text": "Mordayn Vapor: Also known as Dream Mist. Made from the ground leaves of a rare herb found deep in the jungle. Taken by dipping in hot water and inhaling the vapor from the tea. The raw powder and the tea are both very potent poisons. Inhaling the vapor causes intense hallucinations (albeit happy and beautiful ones). Drinking the tea or eating the powder causes 7d10 poison damage and 2d10 psychic damage. It is very illegal in every region of the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "VYKI2DYweADTSmnR","flags": {},"type": 0,"text": "Cyclops Tear: Taken by eating the powder. Causes your eyes to water a ludicrous amount. The tears produced are the main attraction of this drug. They taste perfect and are guaranteed to be the best thing you have and ever will taste, but the taste varies by the person. It also only tastes that way to the person whose tears it actually is. To everyone else it tastes like tears. Overdose causes one of your eyes to desiccate and fall out. Oddly enough, people with only one eye anyway are immune to this effect, so it is very popular among Cyclopes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "H1nmHngi2WrH76lX","flags": {},"type": 0,"text": "Goji Leaves: Originally created as a weapon of war, Goji Leaves (when taken in just about any form) give you resistance to bludgeoning, piercing, and slashing damage, advantage on all strength checks and saving throws, and rage damage equal to a barbarian of your level. User doesn’t become angry though, instead becoming far more confident than they could have ever been without it, nearly crossing the line into cocky.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "zv8ertxzZPxSM0ay","flags": {},"type": 0,"text": "Zaegoo: Harvested from a breed of gelatinous cube native to the colder regions, it causes a biting cold sensation on the way down, but gives you immunity to cold damage and the ability to withstand cold climates for 3 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "wxSO4VOPiNcam2o9","flags": {},"type": 0,"text": "Terran Brandy: A brandy made out of the essence of dying fey. Gives +2 intelligence and restores 6 spell slots worth of slots (so either 6 1st levels, 1 6th level, etc.). May or may not invoke the wrath of an archfey. Only used by the most rich and powerful (and evil) archmages","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "yd7EJEt7A05CdAZi","flags": {},"type": 0,"text": "Luhix: Made from the powdered stalks of a plant grown in the Abyss by demon lords to give to brainwashed cultists. Applied to an open wound that is then sealed with either bandages or magic. User has intense pain for the first minute, with -1 to all ability scores. Afterwards, user is immune to pain (they still take damage, but it doesn’t bother them) and they have +2 to all ability scores for 10 minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "Dfrxa9CJ7FXTj6F3","flags": {},"type": 0,"text": "Agony: The distilled essence of pain. Mainly used by torturers as a social lubricant, but masochists will sometimes also seek it out. When the thick, reddish-brown liquid is ingested (via mouth), the user is hit by intense pain, making them unable to move for 2 rounds, having disadvantage on all ability checks for 1d6+1 minutes. During this time, target will likely give up any info. After the pain, user feels intense pleasure for 1d4 hours, although this is less an effect of Agony and more of them appreciating their lack of pain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "tjqlwXk3Dsm8oq8t","flags": {},"type": 0,"text": "Yggdrasil Sap: A legendary drug that causes you to see into your future. This future is usually the users own death if they don’t pass the DC 15 Constitution saving throw to not die from it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "6Z0OD0rjOLOKBulk","flags": {},"type": 0,"text": "Weirdling Tea: a tea that shifts in color from orange to blue, when drank the user sees the effect of a roll on the wild magic table. (This is however just a hallucination)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "QMLE6uvN5eGiQE0O","flags": {},"type": 0,"text": "Tasha’s: a powdered form of Tasha’s Hideous Laughter, looks like a great time, but really isn’t.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "o8IdBK9mB9MrWFro","flags": {},"type": 0,"text": "Powdered Power: a glittering substance that almost looks like diamond dust, consumed by snorting. It fills you with a sense of euphoria and you feel like you can do anything, for about an hour. During this time you have advantage on all ability checks and attack rolls. After the hour is up, you must make a DC 5 CON save against addiction, and the DC increases by 5 after every dose. Should you fail this save, you then have disadvantage on all ability checks, saving throws and attack rolls until your next dose. Once addicted you no longer have to make CON saves after each dose. To remove the addiction you can make a DC 20 CON save after going one month without taking a dose.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "l0jm3G8aGF1w5Fr1","flags": {},"type": 0,"text": "Brighteye Venom: This venom has, so far, only been consumable by having the Brighteye Spider inject the user. The bite leaves small, purplish holes and blue lines run up the veins. The user’s eyes will turn purple and blue, as if the cosmos were trapped within them. A creature injected with Brighteye Venom must pass a DC 16 Constitution save. Failure results in the creature being stunned for 1d4 hours and poisoned for 1d4 days. Passing the save allows the creature to cast the scrying spell, with a spell save DC for the target of 20.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "7HUfli0UzUDmJ1sF","flags": {},"type": 0,"text": "Top hat: a small top hat shaped consumable that melts on your tongue, soon enough you begin to see statistics on item weight, size, price, juice content, fuzzability, gloppiness…and perhaps some or all of these are just made up in you mind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "HiBNZ55HLr1oWiYk","flags": {},"type": 0,"text": "Druidic Dream: A mostly benign pill made by druids and sold to whoever wishes to buy some. Its ingredients and manufacture are secrets the druids keep to themselves. When held under the tongue the pill puts the user in a mild state of giddyness similar to being a ‘happy drunk’ for 1d4 hours (DC13 con save for half, 19 to deny), followed by 1d4 hours of sleep with idyllic dreams. Addiction 1, 10%, nature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "XPzx7ypduoSGv9MM","flags": {},"type": 0,"text": "Elendran Pipeweed: Algae that were considered a pest by the Elendran merfolk, until some crazy surfacer decided to set it on fire and noticed his mind was both sharper and duller at the same time. Gives the user -4 intelligence and +2 wisdom while smoking it, though it takes a minute to kick in and a minute to wear off once the user stops. Acquisition: 20gp for 5 minutes worth of weed. Addiction 1, 5%, nature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "vHn7115zOSDOJbd6","flags": {},"type": 0,"text": "Feywillow Fruit: Fruit from a tree in the Feywild. The more the user eats, the more they want to eat. It is not harmful in and of itself, just highly addictive. Heavy users are eventually drawn into the Feywild, leaving their friends and families behind, often without saying a word. Addiction 2, nature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "8t2ls6xKiuA7TaTe","flags": {},"type": 0,"text": "Funpowder: A magic/alchemic powder made by reclusive druids, funpowder changes the user’s biologic gender for 1 hour for every ounce consumed. Usually consumed while diluted in water and/or in combination with a spiked drink.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "oaN9yyvxtAH9LKO9","flags": {},"type": 0,"text": "Mountain Lotus Extract: A rare but enormous mountain lotus is put in a cauldron filled with alcohol and sugar. The cauldron is then heated until the flower dissolves, then left in the fire until most of the alcohol evaporates and a black sludge is left. The sludge is then mixed with Chemis sawdust, at which point it can be either eaten (either by itself or as a spice) or smoked. When used the Extract greatly expands the user’s mind, granting +6 to intelligence, wisdom and charisma for an hour. Once the effect wears off the user must make a DC30 intelligence saving throw or ‘gain’ a permanent -1 to intelligence, wisdom and charisma, as their brain has overexerted itself. This effect can only be removed by a Wish spell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "hpg8zHRRGCFahoVZ","flags": {},"type": 0,"text": "Stardust: This dust is harvested by aliens and eldritch space horrors from dead stars and from the wake of meteors. It is generally consumed by mixing it with water or some other beverage, and it tastes sweeter than sugar. Other than mild dependency, users have a tendency to gradually turn into eldritch horrors with long-term exposition to the drug. Addiction 1, 50%, planar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "Ylpi7K72shjwnWmZ","flags": {},"type": 0,"text": "Purified Stardust: The raw dust is harvested by aliens and eldritch space horrors from dead stars and from the wake of meteors. An archfey then purifies the stardust, keeping its ability to provide visions while lowering the addiction. It is generally consumed by mixing it with water or some other beverage, and it tastes sweeter than sugar. The user sees through illusions and shape shifters, but also hallucinates to the point of being unable to tell truth from reality. Addiction 1, 20%, nature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "samQdbqDxBBmdSP2","flags": {},"type": 0,"text": "Styxroot: A root that grows on the margins of the river Styx in the Seven Hells. Eating it raw or making tea out of it makes the individual unable to remember anything that happens to them for the next 8 hours. A constitution saving throw of 12 lowers it to 6 hours, 15 to 4 hours, 18 to 1 hour, or 20 to completely ignore the effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "9TC1krJsdEB7qhZT","flags": {},"type": 0,"text": "The Flayed Mind: A drink containing some of the Mind Flayer’s mind-numbing powers. Makes the user dumb and slow, much like weed however much stronger. Any mental saving throws made while under its effect automatically fail, making this the preferred tool of enslavers everywhere. Once the effect wears off the user may make a DC20 int save to remember what happened while under the Flayed Mind’s effects. This saving throw can only be made once. Addiction 1, psionic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "hzBO7SXbMOJOf5nl","flags": {},"type": 0,"text": "The Ladies’ Love: Succubus sweat has pheromones meant to make men go crazy in bed. Some alchemists can potentialize this effect, making it stronger and longer lasting. When this paste is applied to the skin it removes all inhibitions from the user, as well as making them more selfish and straightforward. On males it causes them to become aroused and extra horny, while mildly improving their physical skills (+3 to str, dex and con). All effects last an hour. DC 16 charisma save denies. Addiction 1, demonic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "kcZ7gKYZoQJ3NGcf","flags": {},"type": 0,"text": "Underdrink: A strong alcoholic beverage created by the Duergar, Underdrink consists of several poisonous herbs and monster venoms, all mixed and distilled in a ceremonial fashion. Drinking a full cup is often lethal to those without poison resistance (2d8 poison damage, DC18 con save for half), however those who do not die quickly become dependent on the drink. Addiction 3, alchemical.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "LOtjHsc2CIDtxAOk","flags": {},"type": 0,"text": "Vladri: Arguably the strongest drug made in the Material Plane, vladri consists of Underdark mushrooms dissolved in spider venom. It is sold by the Drow. When injected it causes euphoria and visions of eldritch horrors which may or may not be hallucinations. Lasts 1d4-1 (minimum of 1) hours. At the end of the duration, the target has a fulminating heart attack and dies (DC25 con save reduces it to 10d8 necrotic damage). It is used as a lethal injection, in order to cause a (physically) painless death. When drunk in small amounts it merely causes euphoria and hallucinations for 2d6 hours (DC20 con save for half), without putting your mind in direct contact with eldritch horrors or bursting the heart.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "E9zS0GPUJtXKb23n","flags": {},"type": 0,"text": "Angel’s Trumpet: A plant with immeasurable potency. When the plant is burned and inhaled, you see dead relatives, friends, or others that died nearby and converse with them casually without being phased by their presence. This effect lingers within the body and goes in and out of dormancy every 1d12 hours and lasts 1d6 hours. For potency roll 1d10 for the amount of instances. Roll 1d12 after each instance to determine when it returns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "JdphdgOj4z0zLh9s","flags": {},"type": 0,"text": "Mushroom Love: Made from the spoors of Myconids it gives those that inhale its vapors a feeling of connection and is highly addictive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "DLojrgb51WdRSWml","flags": {},"type": 0,"text": "Cave Fisher Blood Ale: Often drank by Dwarven Berserkers from a killed cave fisher, many simply drink the blood straight and use it’s powerful intoxicating abilities to boost battle potency at a price. After drinking, it’s effects last for 1d4 hours. During this time the drinker gains a +5 to melee attack and damage rolls, advantage on Constitution saves, and advantage on saves against being charmed and frightened. However, once the time is up the drinker must succeed a DC 15 Constitution Saving Throw or gain a level of exhaustion. If the save fails by 5 or more, the drinker gains 2 levels. (The advantage on CON saves can’t help on this save because the effect is already over)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "ySNGxAFYZbUpiGAh","flags": {},"type": 0,"text": "Kana Dust: a powder blended from a medical herb and crystalline magic. Gives mages a power boost for their spells. However, side effects increase risk of magic going wild. Reroll 1s on magic damage. Also roll 2d20. Of either are a 1-2 roll on wild magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "Yex8Eu75t13Sx0x9","flags": {},"type": 0,"text": "Gorgon: Mushrooms, which are eaten raw or dried and powdered. Gorgon gives the user paralysis for a couple of hours and gives vivid hallucinations, which are somewhat controlled by the user like a lucid dream. Most of the time the experience is pleasant but people have been known to have some horrible trips. Most people will prepare before taking the drug and lie in bed or in a grassy field, but those with more desperate addictions can often been found collapsed in the streets, stone still except for rapid eye movement.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "Uf47cO2nVD7WwlsD","flags": {},"type": 0,"text": "Dreamer’s Fancy: A dark, shimmering liquid extracted from a rare root. When imbibed, renders the drinker unconscious as it plunges their mind into a black void in which they have full control to shape and create whatever they wish. Those who drink from the same root can participate in this lucid dream together, and their creation can be returned to by drinking from this root again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "A4A3Y1qHSechcrUU","flags": {},"type": 0,"text": "Flash powder: A vial containing pink vapors and dust. Upon lifting the vial to the characters nose and inhaling deeply, the user will be filled with an immense sense of power and will now be able to run, jump, swim, and lift up to 4 times as much as they previously could for 1 hour. In combat they may take an additional action once per battle. After 1 hour of usage, the user will feel sluggish and will have their senses dulled which will result in a disadvantage on perception and most strength based abilities for 4 hours or until completing a short rest. Each usage of flash powder will get weaker (-1 on the multiplier) for every time you inhale it without taking 2 weeks to recover from your body becoming immune to flash powder.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "kIzsBw2gRVsdvvcd","flags": {},"type": 0,"text": "Limit Remover: A highly expensive pill that after 2 hours of ingesting grants the user the ability to cast any number of spells without restrictions for 10 minutes according to the shady vendor. In actuality it is just a mint, a coat button, or something pull shaped that gives no benefit whatsoever.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "HG6XVCqg8pH5mRTw","flags": {},"type": 0,"text": "Faerie Food: There is a longstanding piece of wisdom, which says that you should never eat food offered to you by a faerie. This is absolutely true; in the Feywild, magic is so commonplace that ‘cooking’ is considered it’s own school of magic, a mix of enchantment and illusion. Such food when eaten provides a taste that is far beyond anything a real tastebud could ever feel, and addiction is fast, difficult to resist and often lethal as mere mortal foods are not even considered food to an addict. Addiction is generally permanent, but can be cured slowly by a specialist who slowly drops the quality of food an addict ears until they can handle mortal foods again. Alternatively, if the food was eaten only once, a well-placed Modify Memory spell may cure the mental dependence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "Fp1M6IDv38X3eVsd","flags": {},"type": 0,"text": "Faerie Dust: A very fine, iridescent powder, which is kept in a wax, sealed bottle, it is consumed by unsealing the bottle and very gently wafting the contents towards the nose with a DC 10 dexterity check, with failure resulting in an overdose. When correctly dosed, instills a gentle euphoria as senses sharpen and surroundings appear more vibrant, providing advantage on investigation and perception checks for one minute. When overdosed, the user experiences sensory overload, becoming confused for one minute. Faerie Dust, despite the generic name, is actually the collected breath of a faerie dragon. They find it hilarious that mortals can get high off their breath, and will happily provide the breath attack itself with only gentle coaxing. Some faerie dragons make their home in drug dens, exchanging their breath for a luxurious lifestyle and the opportunity to ply their pranks upon the many citizens of a mortal city. Some particularly daring patrons will pay handsomely for a high ‘straight from the source’, taking the breath attack of the faerie dragonhead on and inhaling deeply. The high provided is incredibly intense, and as a result such services are usually only offered with the recipient strapped down on a specially constructed bench.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "6B0rkcTruNDkFyyz","flags": {},"type": 0,"text": "Shatter: A waxy, pale amber substance that can be smoked or consumed in a tincture. In lower doses it produces a pleasant high, but in higher doses (and for particularly sensitive individuals) it can cause a person to literally split in into multiple versions of themselves. If a PC consumes shatter and fails a saving throw, they are split into several nearly indistinguishable copies of themselves. A roll of 2 + 1d6 gives the number of shards. Okay, now for the catch: the character’s stats must be distributed among the shards with no duplication, so the sum of the shards’ abilities is the same as the original character. Additionally, all of the shards have an aspect or condition representing their intoxicated state. After a period of time at GM’s discretion, the shards will coalesce and merge again into the original character.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "HJWVT2UVLV6UmQcB","flags": {},"type": 0,"text": "Venge: a deep red powder of mineral origin that can be snorted for a euphoric and stimulant effect. If the character consuming it has any Berserker or Jekyll/Hyde like attributes, their Dark Side will come out 2-3 hours after ingestion, or if provoked. Even characters lacking such vulnerability, become belligerent and disagreeable after doing a line of Venge.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "4PyDLqlSD629ZOE3","flags": {},"type": 0,"text": "Mummy Powder: though its true origin is unknown, the one thing that’s certain is that it doesn’t come from a mummy. When a sufficient quantity is consumed mixed with wine, it puts the drinker into a catatonic state for several hours. They experience a sensation of being transported elsewhere, into a vast unlit space. Cold cyclopean stones tile the floor and neither walls nor ceiling can be found. Many experience a presence, a monstrous and unspeakably ancient intellect with only one desire: escape from the dusty emptiness of this prison and into the fullness of the waking world. This being can and will barter various intangible goods: knowledge, memories, skills. However, it only has access to such things as it could previously have acquired from another mummy powder user. Furthermore, it will not give any knowledge directly pertaining to its own nature or the nature of mummy powder. Finally, before making such a transaction, characters are filled with a sense of dread and the knowledge that the being would only have carried out such a bargain if it brought the day of its escape nearer. This can be represented by a will save if the GM wants to emphasize the direness of the act.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "rMkCTKWmEJH8vqag","flags": {},"type": 0,"text": "Forget Me Nots: These flowers grow in the wild, yellow in color. They can commonly be found in bright sunny climates. When consumed they apply a temporary new life. When consumed you believe you have a different life. If a lone wolf Assassin ate one he could very well believe he is a humble lumberjack with a small family in the countryside, at least for a couple of hours (1D4 hours)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "61G77Iiz8024UEg2","flags": {},"type": 0,"text": "Fever Fire: Made from the petals of a translucent flower that grows even in the coldest and most barren environments. Instantly incapacitates the user and raises their internal temperature to 110 F for one minute. Instantly cures frostbite, but the user must make a DC 15 Constitution saving throw at the end or suffer 1 point of exhaustion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "Fbx1JSXR5ZJOtfdC","flags": {},"type": 0,"text": "Crit: A street drug, popular with daredevils and dreadnoughts that will make every roll a 50/50 critical fail or critical success for 1d6 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "8deSfsJZqHpKRoQ7","flags": {},"type": 0,"text": "Beholders Tears: A liquid applied to the eyes with a pipette that grants 30ft truesight for 1d4 hours. But also causes hallucinations (‘Ok, the Ghost has gone down that corridor by the dancing Bugbear troupe… Remember to give them a tip as we go by’). Roll WIS save DC 20 or gain long-term madness extreme paranoia.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "LhaJBabxTDVh50eb","flags": {},"type": 0,"text": "Umber Hulk Brain Brew: A rare thick dark brown drink. After being ingested the user can cast confusion 3 times no spell slots required. But the user also loses their memory of the most recent 1d6 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "sXzIbD9zaU1QmX7v","flags": {},"type": 0,"text": "Reverie Sticks: Thin, hollow sticks similar to those used for incense. When burned, the smoke causes non-hostile creatures to enter a relaxed, dreamlike state. Reverie sticks can also be snapped in half under one’s nose; a sharp inhale of its contents delivers a powerful rush of euphoria. The user has advantage on checks to resist fear and disadvantage on checks to resist being charmed for 1d4 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "jvSt1gliDwaKm7QA","flags": {},"type": 0,"text": "Fate’s Hair: a flowering plant with long sinewy fibers much like hair inside the flower. When consumed you feel intense euphoria, and have a type of clairvoyance leading you to the next noteworthy encounter fate has planned for you- ahead of schedule. But, is it accurate or merely a hallucination?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "tjjNrKMDhDjWuO6F","flags": {},"type": 0,"text": "The Barbarian’s Secret: An ingested dark red liquid that tastes strangely coppery. Requires a CON save DC 20. On a successful save you gain a great sense of confidence verging on recklessness and advantage on Strength checks for the next 10 min. On a failed save you still gain the features of a successful save but your INT score is reduced to 4 for the next 10 min.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "jHXVFuvGQIBiF77w","flags": {},"type": 0,"text": "Stone Brew: A mixture containing what seem to be spiced-up brittle rocks. It hardens the skin of whoever drinks it, increasing their base AC by 1 for 1d6 hours. It is not advised to make this drink if you aren’t familiar with stones, as the wrong kind will scratch your throat and provide you no benefit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "sXcVtKn3oZcTPoqL","flags": {},"type": 0,"text": "Shadow gut: A strange slimy slippery pitch-black gel that needs to be ingested. Once used it will give 3d8 necrotic damage but it will also grant a +5 to stealth checks for the next hour as the user appears to fade into darkness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "dVbAN6vz2R2KArMD","flags": {},"type": 0,"text": "Redthyme: Also known as hate in a bottle or bone-hurting juice. A thoroughly nasty little potion brewed from a strange red weed, the eyes of a cat, thyme, willow sap, drippings from a cow’s liver, and the moss from a human skull. A shot’s worth of this will drove anyone into a psychotic, agonizing fugue where they will attack anyone they see. Survivors have described the experience as ‘pure hell’. The taste is mild but unpleasant, like blood and lemon juice mixed together, but the flavor is easily masked with alcohol. Useful in assassinations, murders, and general evil.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "pCfMrtmd2eQrN3J9","flags": {},"type": 0,"text": "Red Hive: When smoked you can speak with insects, other effects include reddened vision, euphoria, and a crawling on your skin like bees walking on it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "D8hUDlVsGiLpZR3w","flags": {},"type": 0,"text": "Troll Dust: mixture of various troll parts. When smoked, you gain resistance to acid for 6hrs and it acts as a powerful aphrodisiac.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "48IkTvGjsyv0yJ1e","flags": {},"type": 0,"text": "Devil’s Tongue: while high: everything seems so surreal, your body feels numb in a good way, and everything sounds far away. Things outside of ((1D4+2)*10) ft. are a blur of colors and shapes. — Effects are like true sight, but they allow the user to see (into / alongside) other worlds, mainly hellish landscapes mangled into ours. — Either a negative effect or disadvantage on dex checks and hearing based perception checks. Advantage on sight based perception, investigation, and insight checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "b6YYbKdr3dZ1WC4v","flags": {},"type": 0,"text": "Warmroot: A small orange tinted root that on consumption, warms the body, a feeling very similar to being cozy in bed. All senses are slightly dulled. This was initially used for miners who worked in conditions of extreme cold, but was quickly discovered as highly addictive, warping the user into complete dependence on the drug. 3 Doses begins the addiction, with every week following a -1 being applied to all ability checks, stacks to five. They user does not have these effects for 2 hours after consumption.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "sEFCWjzrJjMtkPv3","flags": {},"type": 0,"text": "Drektheth Powder: Commonly referred as ‘Dragon Dust’. A golden powder with the same consistency of flour, the drug is overly bitter. After consumption, it makes the user feel much stronger than before, although no actual physical change takes place. The drug is also known to cause shifts in personality, usually making the user act boastful and haughty while under its effects. Sometimes this change will carry over into soberness as well for 1d8 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "XWgBVSeqzc6w6yLm","flags": {},"type": 0,"text": "Illithidust: A deep purple powder made from residue from the inside of Mind Flayer funerary jars. Once snorted or eaten the powder will temporarily provide limited random psionic powers. Roll 1d4 and the resulting effects lasts 10 minutes. 1. The user can communicate telepathically at a distance of 30ft 2. The user can move objects in a telekinetic fashion as if using mage hand 3. Weapon attacks by the user deal an additional 1d6 psychic damage 4. The user gains resistance to psychic damage after the effects have worn off the user must make a CHA saving throw (DC 18) or take 3 Int score damage until their next long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "TfS00p1QyiFu4a8C","flags": {},"type": 0,"text": "Snakeroot: A root that can be ground into a hallucinogenic powder. One dose (1/4 root) gives you disadvantage on all perception checks for 5 minutes, adding 5 for each dose beyond that.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "PXLSDBYd0SAKlSAn","flags": {},"type": 0,"text": "Unicorn Wax: Burning this wax-like substance that is found under the tongues of certain unicorns and inhaling the smoke will cause the user to experience hallucinations of a magical, bright, and colorful world for 1d12 hours, and increases wisdom by 1 for 1d6 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "Z0sfgebl78w5MU3S","flags": {},"type": 0,"text": "Shadowfell Sage: Chewing the pitch black roots of this plant will grant the user a deep sleep for 8 hours, during which they will appear dead to anyone that fails a DC 16 medicine check. Overuse results in the subject’s heart rate permanently decreases.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "sfoRDwHvHx504aSW","flags": {},"type": 0,"text": "Dwarven fury: When smoked by a dwarf, this sour smelling underground moss renders the dwarf immune to gaining exhaustion for the 2d4 hours, after which they must make a DC 8+(number of hours)+(levels of exhaustion) Constitution saving throw. On a failed save, they gain all levels of exhaustion they would have taken during the period. If a non-dwarf attempts to use it, they must make a DC 16 Constitution saving throw to gain the effects. Otherwise, they are poisoned for the duration instead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "tLrXVMVE4JMg5ivy","flags": {},"type": 0,"text": "Salja: extracted from the hair-thin root endings of certain tundra grasses, Salja is a faintly bitter, dun paste. However, any food eaten shortly after or while also ingesting Salja becomes incredibly, irresistibly delicious. The drug itself is non-addictive. Instead, users become addicted to the taste of the food they ate Salja with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "GwmUrA6d0MH0ifzI","flags": {},"type": 0,"text": "Droon: a potent, dull brown salve absorbed through one’s pores, Droon greatly amplifies all sensations experienced by the body part, including proprioception. It can be an exhilarating or miserable experience, depending on how it’s used- a drooned-up hand marvels at the softness of silk, but might seize up and develop rashes as the temperature fluctuates. The localized enhanced proprioception can be disorienting for new users as well, but the euphoric sensations it grants are well worth it. Droon is rumored to be the refined toxic extract of a particular tall cactus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "uoPjzOxuwhMtTXx4","flags": {},"type": 0,"text": "Ceruminal: a sparkling, faintly greenish wax originally sold as a decorative soap. A typical oral dose (about 12 grams) is enough to send an adult human of average weight into a pleasant mental fugue. They’re incredibly disoriented during this time, often walking in elliptical loops, and when they eventually come down, all they remember is a sense of buoyancy and pleasant warmth. A rare few feel tiny sharp pounding at the top of their head, or dulled pain throughout their entire body. At lower doses, all it does is help clear sinuses. A dose in excess of twice the normal amount per body weight tends to result in worse experiences during the fugue- downing a whole block of Ceruminal soap often makes one feel like their muscles have sloughed off and were then shredded, all while the user can still feel their muscles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "z4yQj3fsJ3Qn4j6N","flags": {},"type": 0,"text": "Pixie’s Fire: A rose golden-coloured powder-like substance that, when inhaled through the nose or mouth causes the user to become immune to being charmed or frightened for an hour, they must make a DC 15 con save at the end of the hour or gain 1 level of exhaustion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "0jjnpuXQDidm9EIY","flags": {},"type": 0,"text": "Ogre’s Breath: A strong smelling drug that was accurately but a little unimaginatively named. Once smoked the user gains plus 4 to strength checks while smoking but must make a DC 20 CON save or their brain and tongue swell giving them -5 to their INT score (Min 4) and an inability to speak clearly and a temper. The effects last while they smoke and 3D6 minutes after.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "Wbm5H8pGr5knmNg2","flags": {},"type": 0,"text": "Watchroot: A simple, unprocessed root commonly used by goblins. You can chew over 3 hours, during which you gain advantage on perception checks, initiative checks, and can’t be surprised. The juices can stain the teeth and lips with repeated use, leading to addicts being easily distinguishable thanks to their blood-red teeth and lips.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "fxRJL8QpBNaGKv0i","flags": {},"type": 0,"text": "Dried Schmetterling Fish: The mummified remains of what once must have been a very colorful fish. Sardine sized, and extremely salty. The drying process moves this little guppy from incredibly poisonous to merely dangerously hallucinogenic. When consumed it allows the eater to see and hear into both the ethereal and astral planes, interact with creatures found there, and see invisible or shape-shifted creatures for what they truly are. It also makes the walls melt and the furniture start talking. You are considered under the effects of the “confusion” spell for the full hour these visions last.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "zrdbbx3HyXLjxqXG","flags": {},"type": 0,"text": "Apius Acrimonium: The foot long stinger and venom sack of the monstrous Furori Vespartum (Rage Wasp) occasionally used by quack doctors and pit fighters. When stabbed into the body, an affected creature takes 1d4 piercing damage and 2d4 poison damage. If the target survives, it then flies into an unstoppable rage for 30 minute. This rage works as though the creature were a first level barbarian, except that they cannot choose to end it. Every turn they must make a DC15 Wis save or immediately attack the nearest living thing until it dies. Every round they manage to not attack something, the DC goes up by 1, resetting upon failure. When the rage subsides, the creature immediately takes two levels of exhaustion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "VoHMePYmKmyztAXz","flags": {},"type": 0,"text": "Star Dust: This substance comes from the dust off of the wings of a particular moth. When snorted, effects include: darkvision, insomnia, compulsion to follow or stare at light (disadvantage on all checks made against an opponent who is holding a torch or near a bright light source), and a feeling of weightlessness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "HXGfmqyyqHeW6Nd1","flags": {},"type": 0,"text": "Smorock: In the transitive planes, objects left behind slowly dissolve from existence. The moment before they are snuffed out, a mote of dust can be captured. That mote is Smorock a powerful hallucinatory Narcotic It can be taken: (orally): for 1 hour the world will become much more vivid. They will have advantage on Perception and investigation checks, but disadvantage on Wisdom and Intelligence saves. (Smoked): Constitution save. If failed the player is suffocating and immediately takes 1 point of exhaustion, they gain the benefits and disadvantages of orally. (Snorted): The player does not get the effects of the drug but has disadvantage on intelligence checks and Charisma checks for 1 hour. (Shelved): the effects are more intense and the player must make a wisdom save at disadvantage. If failed the Player is in a waking dream for 1 hour and must be led by another party member. On a pass the player gains Arcane Sight for 1 hour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "ek6ZIGMktU2zDNxH","flags": {},"type": 0,"text": "Dragon’s Dandruff: A flaky amber salt traditionally used as seasoning by lizard-folk, with it’s signature ‘chilli-high’ making any party memorable. This magical mineral is intensely spicy, with one unnamed individual unused to the taste describing it as akin to chewing on a hot coal. After the initial sizzle (1d2 radiant damage) a teaspoon of the salt gives the consumer a rushing sensation of joy, increasing Charisma by 1 for an hour. After the salt metabolizes, the soul feels overcome by adrenaline, increasing Strength, Stamina, and Dexterity by 2 for an hour, and they are compelled to do physical tasks. Afterwards, they suffer 1 level of exhaustion. All of these effects do no stack. Undead characters take 1d6 radiant damage for every teaspoon consumed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "ILCIQ8erQCi7Dmrb","flags": {},"type": 0,"text": "Raybark: not actually made from bark at all, but by grounding up the thin strips of brightly colored fungus that grow on the northern side of raywood tree trunks. Raybark strongly amplifies ‘strange’ external senses when ingested or snorted- the ability to sense magnetic north, to tell when people are watching you (and where they are), to sense the coming of a storm, to read the health of a plant by the movements of its leaves in the wind, to see ultraviolet light, etc. The range of senses amplified and the intensity of amplification vary between users. However, the user’s sense of their own body is greatly diminished while under the effects of Raybark, so they might trip over their own feet, swing their arms into their sides while running, or fail to properly clench their fists as their fingers miss each other. Produced and used by a convent of hippie-like pacifists who enjoy feeling more connected to the world around them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "n1jrIVHgPFO8lnLn","flags": {},"type": 0,"text": "Spiral: a flammable, forest-green liquid sold in small dropper jars, spiral is a fast-acting and addictive oral drug. A user’s sinuses and sense of balance are thrown out of whack as the drug begins to take hold, making them very dizzy. It simultaneously acts to dull pain and mute powerful sensory stimuli, giving advantage on any rolls that are dependent on resisting pain, blinding light, massive sounds, terrible stenches, etc. The dizzying effect makes rolls to keep one’s feet or dodge harder, however. Spiral can be slowly burnt to produce a relatively large volume of smoke that has a diluted version of its effects. The smoke seems to be lethal to most insects, and those that don’t immediately die drift around aimlessly until they do.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "5JB2znBVnc6vVRPC","flags": {},"type": 0,"text": "Paladin’s Placebo: A drug that when taken will satisfy any craving for any other drug the user is addicted to. Created by a former herbalist drug dealer that was coached by a paladin to quit their habit and change their life around. Ironically, the supply of the drug is tightly controlled by the Paladin order.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "09LW8Qzxr0gnDs5z","flags": {},"type": 0,"text": "Powdered Order: A drug made from a Marut’s metal body this rare and expensive drug is taken when mixed with liquid and drank. The effects last EXACTLY 5 minutes during this time the user must make a CON save DC 20 every time they knowingly attempt an chaotic act (if they don’t know the law then they pass immediately) if they fail they lose the ability to lie and shout their intentions. In the past this drug has been used by lawful evil villains to catch or incriminate their enemies or by lawful good heroes for largely the same reasons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "yCsEtQmqpHsuwdpJ"}
