{"name": "Random Boons","description": "One random random boons for your players/NPCs!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "CFncdiurvtnLSdlL","flags": {},"type": 0,"text": "An invisible nymph sings to you. Gain a d10 Bardic inspiration die.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "bX3xDQ5fMkLnLIcM","flags": {},"type": 0,"text": "The water is warm and invigorating. You regain 1d12 hit points every hour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "Whey43S45QwvRgFR","flags": {},"type": 0,"text": "The water sizzles and is mildly acidic. You are resistant to acid damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "j8MRK9KpBVTiUvJf","flags": {},"type": 0,"text": "The water smells like berries. You are fully fed for the next 24 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "3aut6r6MeE43dUHF","flags": {},"type": 0,"text": "You feel a sinister presence in the water seep into you. You have advantage on intimidation rolls and are immune to fear. Other people will feel a shiver down their spine, if they look you in the eye.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "OHEG9gg875XI4shK","flags": {},"type": 0,"text": "You gain the attention of a denizen of the Feywild. d4 Sprites whom have cast invisibility on themselves follow you around and are friendly towards you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "QjyT9FtDDqqfWENL","flags": {},"type": 0,"text": "The water’s surface is frozen, but feels comfortably warm. You gain resistance to cold damage and you are not negatively effected by cold temperature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "3iqehW38Ob5bZIC6","flags": {},"type": 0,"text": "The water seems murky, but if you dip your head in it, you can see clearly through it. You have Truesight at a range of 60 feet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "gsDKcHsKVLrSOu2d","flags": {},"type": 0,"text": "You hear mumblings in a foreign language coming from under the water. When you bathe in it, you can understand it. You can speak one random language, you didn’t know before.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "dV8svMZHwko1PZ5E","flags": {},"type": 0,"text": "The water eminates a light, warm glow. The glow is transferred to you. Your body eminates dim light in a 15 feet radius.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "HWFX7UbXPtW49lWX","flags": {},"type": 0,"text": "Flower petals are resting on the water’s surface. While near living plants, you gain +5 to Wisdom and Constitution saving throws.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "JuK1Ts7028m6aUiR","flags": {},"type": 0,"text": "The water is red. Your melee attacks deal an additional 1d6 damage, if the target is not at its maximum hit points.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "3BWMolZCU4tMVc9s","flags": {},"type": 0,"text": "The water surface remains completely still, even if you bathe in it. You have advantage on saving throws pertaing to fear and charm effects.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "ZYCWJQwHUxAGmsrE","flags": {},"type": 0,"text": "The water is steaming hot, but it doesn’t hurt to enter. You gain an additional hit die for rests and have resistance to fire damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "b7Pq3RbEpbZw1Caa","flags": {},"type": 0,"text": "The water seems shrouded in shadow. You have advantage on stealth checks, and darkvision 60 ft.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "GU8wLVvV7IRpVRmT","flags": {},"type": 0,"text": "The water has no visible bottom, and if you fall in, you will continue to sink indefinitely, although it takes only a single round’s movement to reach the surface again from any depth. After submerging yourself in the water, the next time you fall from a height of greater than 10 feet you will be under the effect of the Featherfall spell. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "Tk5vjRZA83yNfpg0","flags": {},"type": 0,"text": "The water does not run along a groove in the earth, rather it runs along the surface of the ground while keeping its shape. Drinking some of the water grants advantage on DEX (Acrobatics) checks made to keep balance. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "egTsrOhtXigBEul0","flags": {},"type": 0,"text": "The more you drink, the thirstier you become. Anything you consume over the next 24 hours does not take effect until after the 24 hours are over, at which point you gain the benefits of everything you consumed at once. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "tS3CRxAvnQyN9Ux5","flags": {},"type": 0,"text": "The stream tastes botanical and overly sweet, with a bubbly texture. Until your next long rest, you gain advantage on all WIS (Perception) and STR (Athletics) checks, you have advantage on DEX saves, your move speed increases by 10 feet, and if you use an action to make a melee attack, you can use a bonus action to make another melee attack with disadvantage. However, you do not gain any of the benefits of your next long rest, including taking a level of exhaustion. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "f5wUcBor4IUlVoCy","flags": {},"type": 0,"text": "The spring water tastes of dust and stale air and you find yourself parched after drinking from it. For the next 24 hours you find yourself able to read and understand all languages native to the plane you are in. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "OUSw2pRUqe0d6M9y","flags": {},"type": 0,"text": "The spring feels ice cold although no ice is visible on the surface. Your skin grows completely numb for a short period and after inspection has grown tougher. Your AC is raised by 3 for 24 hours. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "Ant8sa7Rw4ae8odk","flags": {},"type": 0,"text": "The water fills you with a jittery energy and your finger tips and toes tingle constantly for the remainder of the effect. You gain +10 movement speed and require no sleep for the next 24 hours. Although a period of inactivity must be taken to regain rest benefits. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "xGdVWPVD4SXTiIEH","flags": {},"type": 0,"text": "When submerged in the water you gain a vision of your future presented by a hero of times past. It feels as though vision takes hours but to none participants takes only seconds. [May be a vision presented by the DM or a use of the portance spell] ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "WnfqXdWOZuCN39J7","flags": {},"type": 0,"text": "The longer you stare into the water the more distorted your reflection becomes. At first your eyes shift through colours slowly, than your hair, soon every characteristic is changing in a blur. The player at this point can select a complete physical change lasting for the 24 hour period. This is not an illusion but does not effect voice, mannerisms or age. [DMs choice if a minor effect of this is Permanent] ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "0KHfgWn5Pt3Ctdy1","flags": {},"type": 0,"text": "The water looks darker than usual, but feels oddly refreshing. You gain 2d4/2d6 Temporary HP upon drinking it. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "DnADkaPB5UUjzcLE","flags": {},"type": 0,"text": "The water makes you 10 years younger.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "WNxf5fwBrHU1imvS","flags": {},"type": 0,"text": "The water turns you into a Water Elemental for 3 rounds your next fight. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "DaATZdw3vvdH6Dxm","flags": {},"type": 0,"text": "The water makes any pixie fall in love with you. They bring you 1GP each as a present. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "Iiq9z7Xez2Am84SU","flags": {},"type": 0,"text": "Upon drinking the water, it freezes into a 500GP sapphire which you spit out. This can only happen once per day. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "jH8F0WbMBloSyEi0","flags": {},"type": 0,"text": "The water sticks in your mouth and you pull out a scroll of Create or Destroy Water. This can only happen once per day. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "ou2YhRQjVs7z9S2e","flags": {},"type": 0,"text": "The waters ripple in confusing patterns but you can still see the bottom clearly. You can now tell that any illusion is false for the duration. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "5lHWBQQf420BC4qL","flags": {},"type": 0,"text": "The water appears to rush quickly and as you drink or put your head under this water all your hair stands on end and you feel a small electric shock. You become resistant to lightning damage for the duration. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "KTxPh6MKbDqVR4Eo","flags": {},"type": 0,"text": "The water droplets stay in the air for longer than they should when splashed. Your standing and running jumps double for the duration. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "PsabnsjGMzhW4gJy","flags": {},"type": 0,"text": "You can see the reflections of your companions in the water, but not of yourself. Upon contact with the water, anything touched is invisible for the duration. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "kuLlNaHGSlkGdCD4","flags": {},"type": 0,"text": "The water is fizzy and flavorful. Healing potions and healing spells applied to you have their effects doubled. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "DEIW5VxmJejDz6to","flags": {},"type": 0,"text": "The water tastes metallic, and feels weird. You reach into your mouth and pull out 1d6+2 gp. This can only happen once per day. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "Xr0Y9xvIveD52PmF","flags": {},"type": 0,"text": "The water tastes especially refreshing, and your mind feels clearer than ever. You gain 1d6 on initiative rolls. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "QjDBG98Qs5XYdeyc","flags": {},"type": 0,"text": "The water tastes lucky, for lack of a better term. Add a +20 bonus to the result of a single skill check for today. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "yhk32sxmfUSDlR1P","flags": {},"type": 0,"text": "The spring’s water and mist are cleansing and revitalizing. In addition to you being cleaned, any fabric left out within 10 feet of the water’s edge for more than a minute will be cleaned as if by a prestidigitation cantrip and smell faintly of lilac for a day. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "f6D5siG7cYoUz3im","flags": {},"type": 0,"text": "The water is curiously, unpleasantly warm. You don’t need to go to the toilet for the next 24 hours. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "iT5pGrfokPHFbr8V","flags": {},"type": 0,"text": "A cattail plant hits you on the forehead as you pass by. You feel your skin begin to singe and everyone will recognise this as the mark belonging to the god of the local ecosystem. The god will surely curse those who kill you as long as you travel within the same area for the day. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "xJpi5Jc1dXVy6QL2","flags": {},"type": 0,"text": "The spring is surrounded by a thick shrubbery dipped in morning dew blocking your way. Any weapon used to cut it down, absorbs the dew which turns to silver on the weapon’s edge. Your piercing and slashing weapons affected by the dew count as silvered for the next 24 hours. Dipping your hair in the water turns it silver. The hair sells for 15sp per foot. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "lcJi0FOUdzaEOS27","flags": {},"type": 0,"text": "You find a piece of driftwood floating on the water. Upon closer inspection you realise it is a flute. If you play its last cord, it falls apart and all who hear it gain +1 spell-casting proficiency. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "tQVmjFQPtZ91ZCeQ","flags": {},"type": 0,"text": "As you reach out and touch the water, you feel it is hard and smooth. The water around your touch slowly recedes into a pebble forming at your touch. The pebble can be broken to release 75. litres of fresh water. This can only happen once per day. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "xL3eLI9WpZ3u2jyD","flags": {},"type": 0,"text": "A pale, fae spirit rises from the waters holding a violin. You speak a while and it teaches you a few chords. You now have advantage on performance and persuasion checks for 24 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "0ebcEjJ6WyPJhkog","flags": {},"type": 0,"text": "The spirit of the last creature you slew rises from the water and silently follows you. Each foe you face that day must make a DC 12 Wisdom saving throw or become frightened. At the end of the day the shade returns to the afterlife.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "eZkATztMcFvNXekN","flags": {},"type": 0,"text": "The water turns foul and stings your skin. You gain the poison touch ability – anyone you touch must make a DC 12 Con saving throw or suffer 2d6 poison damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "UtMeNsn3PuJKwIZf","flags": {},"type": 0,"text": "As you approach the stream, the water rises, stretches out tendrils of trickling water and embraces you entirely, changing colour and shape, applying itself like a new skin upon you. For the next 24 hours, you are under the effects of the Polymorph spell except restricted to humanoid forms only. [DM’s discretion as to which form, and gender, player takes] ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "iKG75X094QP9u93z","flags": {},"type": 0,"text": "The stream appears to sparkle, like stars of the endless space were within it. For the next 24 hours, all intelligence saves and checks you make are considered a natural 20. The actual intelligence check roll however determines if player suffers a short-term madness (DMG, pg 259), against a DC of 8. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "KterrfFEauIscepN","flags": {},"type": 0,"text": "Walking closer to the stream, your nostrils are filled with the aroma of your favourite food dishes and you feel eager to prepare a meal. For the next 24 hours, you are a masterful magical cook who can prepare any non-living organic material into the tastiest and most fulfilling meals. These meals perish after 1d4+1 days. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "D7LU6EGm2yefrt7f","flags": {},"type": 0,"text": "With each step toward the stream, it seems to react to your presence. Vapors arise from it, ominously at first, but then it solidifies. For the next 24 hours, you gain a Steam Mephit (MM, pg 217) as your familiar as if under the Find Familiar spell. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "TVDc5ISngelLwebN","flags": {},"type": 0,"text": "A mute, spectral dove rests on the edge of the water. It flies through anyone bathing in the water and fills them with a longing for peace. You have +8 bonus on persuasion skill checks unless you attack a creature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "9PgQqt5GQFjyxyfR","flags": {},"type": 0,"text": "The waters noises sound faintly like a rich orchestra playing. Any player drinking this water is convinced they are in a musical, and have an irresistible urge to join in with the melody (which changes with the topic of conversation, sad conversation = tragic music, making a plan = montage music) which gains them advantage on any charisma skill checks. Any character who tries to ignore this becomes distracted through not syncing with the music, and takes disadvantage on all charisma skill checks. DM’s discretion as to whether any of the other characters hear the overtures. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "TbGmazB3WF6v3lzE","flags": {},"type": 0,"text": "The water tastes perfumed, drinking it gains advantage on any charisma checks against female characters. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "79m9mPXQsxeKsh8L","flags": {},"type": 0,"text": "The water smells slightly of musk, drinking it gains advantage on any charisma checks against male characters. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "xLYR5MoSD5FmF7bw","flags": {},"type": 0,"text": "Upon contact with the water, any creature immediately falls unconscious for 6d6 hours. The creature cannot be woken up except by magical means. Once the creature naturally wakes up, they feel more awake than they have in ages. They do not require sleep for the next 1d4 days and during that period all short rests count as long rests. If woken up prematurely, they do not gain any of the benefits, but all levels of exhaustion will be removed. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "fB3Im1yZ7eAKAg3g","flags": {},"type": 0,"text": "The water tastes slightly of celery, feels cold to your teeth and can be felt as it works the way through your digestive track. You start to feel hungry. for the next day you can eat and digest any plant or plant material (even wood) as you would normal food. Eating any food of this nature caries no negative effect that would normally apply (such as poison). The taste is completely unchanged. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "dMUptJ3RgduLP0PV","flags": {},"type": 0,"text": "The water tastes saline and stings your throat as you drink it. You find yourself gasping for air for a few moments, but as you stabilize, you feel something protruding from your neck. You have grown gills and your feet/toes are now webbed. You can breathe underwater and gain a 30 ft swimming speed for 1d6 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "d2g3BRXszOJJ0dJB","flags": {},"type": 0,"text": "All of a creature’s hair changes color on contact with the water. Roll on this table to determine the color: 1: White 2: Blond 3: Light Brown 4: Dark Brown 5: Red 6: Black","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "vsrhXaSWO933tzRh","flags": {},"type": 0,"text": "The water has a few electric sparks coming out of it, and something emitting a golden glow in it. If you try to investigate, you will find a golden egg, that immediately hatches into an adult friendly platypus that follows you around for 24 hours, and has a weak electric breath attack. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "ya69NiFHFPFj1Iwi","flags": {},"type": 0,"text": "The water is hot like a fire but doesn’t burn creatures, it burns any curses away as if a Greater Restoraion spell has been cast on you. This can only happen once a day per character.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "ySaqcjOWMbSrVQPV","flags": {},"type": 0,"text": "If drunk, the water sizzles on your tongue and a minty fresh steam escapes your mouth. You are granted Keen Smell (you have advantage on Wisdom (Perception) checks that rely on your sense of smell).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "K9XGngVj574jkqz9","flags": {},"type": 0,"text": "You hear a faint chirping. Any bird in a 60 feet radius will act friendly towards you and feel compelled to follow you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "uk6wXtsQsWWWSmpp","flags": {},"type": 0,"text": "Small talking berries float along the stream. You can talk to fruits. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "LHp78M8HcqKYOQ77","flags": {},"type": 0,"text": "Clear bubbles slowly rise from the water. You can blow bubbles that when popped, whisper a small pleasantry.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "3yW0AzZ3zdPeeLtF","flags": {},"type": 0,"text": "As you dip your hand in the water, it seems to guide your fingers’ movement. You have advantage on all skill checks pertaining to the use of tools.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "ZrhmE78E7CsSGJGM","flags": {},"type": 0,"text": "The water seems unnaturally heavy if lifted. Enemies have disadvantage on attempts to grapple or knock you prone and you are immune to Telekinesis and Reverse Gravity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "frAasJLjSNKyTZgn","flags": {},"type": 0,"text": "The water rushes at an incredible speed. Your movement speed is increased by 15 ft.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "fkTUl8Y02iNOdif2","flags": {},"type": 0,"text": "The water faintly glows in all the rainbow’s colors. You can cast Color Spray at level 1 as a cantrip.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "R513VKSujo3oNw8o","flags": {},"type": 0,"text": "Though the water appears 10 feet shallow, you can not feel the bottom. Submerging yourself in the water requires you to tread water. The rocky bottom feels liquid to you! You can Earth Glide as if you were an Earth Elemental.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "829bu7MmMnIC1WWV","flags": {},"type": 0,"text": "The water swirls in a circular pattern and seems to pulse with some unearthly power. If bathed in, the water stops swirling and the one who bathed in it gets +6 to one stat (str,dex,con…) determined randomly for the next 24 hours. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "fRcKuZBs5W558i5i","flags": {},"type": 0,"text": "As you drink the water, you feel your eyes tear up and you cry uncontrollably. After a minute the crying ends and your eyes feel clear. For 24 hours your irises/pupils are replaced with a small disk of gold. While this lasts, You gain proficiency with the perception skill if you don’t already have proficiency. If you do have proficiency, your proficiency bonus is doubled. Any creature that you are speaking with and are making eye contact with cannot lie. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "lNGkivZ7QdGR31HJ","flags": {},"type": 0,"text": "The water makes your entire mouth feel numb and you can noticeably feel your heartbeat slow. You feel a wave of tranquility sweep over your mind. for the next 1d8 hours you cannot be charmed, frightened or intimidated, and gain resistance to physic damage. Using Barbarian Rage cancles this effect. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "cH7l4WDoRMw8n5sC","flags": {},"type": 0,"text": "Drinking the water causes you to imediately fall over and dirt to rise up around your hands. You learn a ranger cantrip of your choice for 24 hours and can now cast a ranger spell of first level of the DM’s choosing for free once. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "Jo57dFc2tVSlNPQZ","flags": {},"type": 0,"text": "The water is extremly cold to the touch. Trying to drink the water causes you to choke profusely until you throw up a massive cloud of freezing mist. For the next 24 hours you gain a breath attack that deals 1d8 cold damage in a 15 foot cone. If you are a dragonborn that already has a cold breath ability, the damage is doubled. Drinking anything hot or eating anything spicy ends this ability. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "DmWN4Dk6leoe3Dv4","flags": {},"type": 0,"text": "The water burns your throat as you drink it. You feel your blood rush through your limbs. The next melee attack you make that hits deals max damage. This effect ends if you take a rest or are incapacitated before your attack. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "OJokciJpLCO4wXDx","flags": {},"type": 0,"text": "The water is slightly repulsed by objects as if a magnetic field controls it. The water is attracted to any ranged weapon nearing it. Any ranged attack you make will deal 1d6 extra force damage and push back enemies 5 feet if they fail a DC 15 strength check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "SJQW4BI4eQnSpJHr","flags": {},"type": 0,"text": "The water flow is unnaturally slow. Your ranged attacks slow enemies by 10 feet for 1 round.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "J6soCD8UKbXUDPCd","flags": {},"type": 0,"text": "The water feels unbearably hot, but at the same time, strangely inviting. A character that bathes in the water for a minute feels this heat through their entire body. After this point, they will continue to steam for 2d8 hours after leaving the water, and their skin will be as hot as a red hot iron. During this period, any creature that performs a melee attack against the character within 5 feet takes 1d4 fire damage. All unarmed attacks by the character deal an additional 1d4 fire damage. Drinking or eating anything cold cancels this effect. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "A600riV7pSL0Bpj7","flags": {},"type": 0,"text": "The spring has gold coins at its bottom. The gold coins burst into harmless flames and disappear upon leaving the water. Bathing in the water gives you advantage on perception, investigation and survival checks pertaining to dragons or treasure hoarded by dragons. You also gain +10 on persuasion checks against dragons unless they suceed a DC 20 Insight check to notice the effect of the spring on you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "P0CAJyZFeKg6ZjlZ","flags": {},"type": 0,"text": "Upon contact with the water you feel oddly tenacious. Every oppressive thought, negative emotion and unhealthy anxiety that was plagueing you disappears as your mind fills with confidence and calm. You gain 2 legendary resistances (for this day only).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "pq731PdaYvnc1vzY","flags": {},"type": 0,"text": "The water’s reflection acts like a window to another place. Upon contact with the water, you gain the ability to freely scry on a random location (DM’s discretion) on this plane of existence or another.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "doAqbyjPhDfZnBPh","flags": {},"type": 0,"text": "The water is crystal clear and unnaturally refreshing. Drinking it gives you one extra hit die to use at short rests and makes you notice small crevaces and details around you, that you didn’t see before. You gain advantage on perception checks and always know the armor class, weaknesses and resistances of a creature you’ve studied for over 30 seconds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "VGnx3xE9ua4xpvSf","flags": {},"type": 0,"text": "You can hear very faint, angelic singing under the surface. You have resistance to all damage dealt to you by undead and fiends. You can also read and speak celestial.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "HPcldNJ4dDFRBrWb","flags": {},"type": 0,"text": "The water’s surface shimmers and sparkles in a mesmerizing pattern. You can’t shake the feeling, that someone is prying into your mind. You gain the ability to summon a flumph as an action. The flumph lasts for a number of minutes equal to your level (doubled if your alignment is lawful good). After that, the flumph poofs out of existence. The flumph is not under your control unless your alignment is lawful good, and it will act friendly towards anyone with a good alignment. You can only summon a flumph this way 3 times per short rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "cXE1WPo91bNG9to0","flags": {},"type": 0,"text": "Sparkling lights slowly rise from the water. You gain 1d6 random skill proficiences.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "iiaWsc1dI0Q6EJqt","flags": {},"type": 0,"text": "The water tastes foul and stale, but it invigorates you. All poison damage you take now heals you for that amount instead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "DDkMvKJJSHeqUaKD","flags": {},"type": 0,"text": "Tiny spectral boats float on the surface of the water. Your traveling speed on a mount or vehicle is doubled and you gain advantage on skill checks while you’re traveling on sea.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "ZUD0v5LK7LBOD2nB","flags": {},"type": 0,"text": "The water is lagoon green and smells like tea. Drinking it makes you accutely aware of your surroundings. You gain advantage on dexterity saving throws and +5 to intelligence checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "Bp6r38BQRPM77zs5","flags": {},"type": 0,"text": "The your reflection in the water is not of you, but of one of your family members. You can cast sending 5 times per short rest to that person.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "OBaBi7QMhesCdbz1","flags": {},"type": 0,"text": "Drinking from the water fills you with a cozy, sleepy sensation. You can kiss a willing creature on the mouth to put them to sleep for 8 hours. The creature will wake up from anything that would normally wake it up from its sleep (except being well rested). The creature does not have to be aware of the effect, but it has to be willing to kiss.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "za6CpruX0KLma2u6","flags": {},"type": 0,"text": "The water sticks on you like mucus. Whenever you are healed above your maximum hit points, you gain temporary hit points equal to the amount healed. This amount can not exceed 3 times your level.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "PWloC4jlBClo6Zot","flags": {},"type": 0,"text": "Drinking the water numbs you to the world, and you fall to the ground. After a few seconds, you can get up on your feet again with renewed strength. Whenever you are affected by a condition that would make you incapacitated, you can as a reaction choose to be knocked prone instead. You can however only use this reaction if you’re not knocked prone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "L8LWnMUzp1VKwirM","flags": {},"type": 0,"text": "Memories of the past seeps into you, if you bathe in or drink the water. You gain advantage on history checks and +1 to all your base attributes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "x1B3xvYcnbwIWX8E","flags": {},"type": 0,"text": "You can hear a heartbeat coming from the spring. You have advantage on death saving throws.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "wvNTWS6oOLqgKi1Y","flags": {},"type": 0,"text": "The water creates small whirlpools in different colors. After you take damage from a spell, you gain resistance to that type of damage until you take damage from a spell again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "0AchYjrTExCNJqgE","flags": {},"type": 0,"text": "The water tastes bitter and vaguely of banana and chocolate. You gain +5 to your strength and advantage on skill checks pertaining to arm wrestling.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "evWKkiCYn7SMPIbP","flags": {},"type": 0,"text": "A snake made of water crawls out of the spring and nods at you, before it disperses into a puddle. For d4 days, you gain the ability to summon this snake from any source of water. It has the stats of a poisonous snake, is under your control and can sqeeze through any opening, that water would be able to travel through. It can disperse into a puddle of water, that will disappear in 10 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "J8gFRu4Szouy4Lpl","flags": {},"type": 0,"text": "Through the splashes in the water, you can faintly hear echoes of the sounds you make yourself, as if captured in the water. You gain the ability to copy any sound you’ve heard, so long as it hasn’t been more than an hour since you heard it last (this includes your own copy of that sound).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "yZpBl3SmxskvNrEv","flags": {},"type": 0,"text": "Drinking the water fills you with immense power, that tears through your body. Drinking one sip gives you +1 to all your base attributes, but decreases your maximum hit points by 10% (rounded up). You can only be brought back to life with True Ressurection or a Wish spell, if you die by drinking 10 sips of this. After 24 hours, you will gain points of exhaustion dependening on how many sips you took. Additional effects occur on higher amounts of sips. The effects are listed on the below table.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "Len6cKIzPaPAnwuJ"}
