{"name": "Magical Items with Sentimental Origins","description": "One hundred magic items that have a meaningful background.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "uxSx2BvKiz2MCccP","flags": {},"type": 0,"text": "A frying pan and lid that materializes one fully cooked breakfast platter for one once per day when exposed to flame. Someone’s mother had it enchanted as a gift for their child who was leaving home so that they could always have a home cooked breakfast.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "mOoni5KQVF8IE45y","flags": {},"type": 0,"text": "A pair of green rimmed spectacles that translates elvish text into common while wearing them. An elf made them so that he and his adopted daughter could read some elvish adventure tomes that he brought home together.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "pQwaQ7ulrMdp6X4u","flags": {},"type": 0,"text": "A levitating quill that writes out whatever the last person who touched it wants, given that it has enough ink and parchment. Someone’s son had it commissioned after his novelist father lost feeling in both of his hands after a wall collapsed on him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "Yr9wNxvEgvSNeQSB","flags": {},"type": 0,"text": "A hooded cloak made of various patches of leather that has a belt fasten to the front. It generates heat on the wearer if blown upon by wind. It was made as gift for a lover so that they could travel the mountain ranges without worry of freezing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "bzvWVWrP0tEoqxbk","flags": {},"type": 0,"text": "A pair of small blank scrolls with matching handles. Whatever you write/draw on one scroll (in ink) appears on the other within 3 minutes. 24 hours after ink touches the blank page, everything written on it melts away permanently. Made by two young Divination apprentices who wanted to keep in touch with each other.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "f8s0rpgsYDJTcsSM","flags": {},"type": 0,"text": "A small leather vest enchanted to magically float when exposed to water. Commissioned by a noble after his daughter almost drowned in the estate fish pond.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "f4bOpuzHyRKrrdNZ","flags": {},"type": 0,"text": "Two rings with a small ruby set in each. When pressed, the emerald makes the other ring warm up slightly. Crafted by a travelling jeweler so she could communicate to her lover when she was thinking of him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "VLWhqPgwZwkNYaDm","flags": {},"type": 0,"text": "A leather collar with a small metal emblem of a star on it. A matched bracelet with the same emblem. A person wearing the bracelet can make a small light hover 50 feet above the collar. A wife commissioned this collar after her husband, a retired soldier with significant PTSD, lost the dog that he had bonded with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "AMKZwi4rziiisEci","flags": {},"type": 0,"text": "A soft, well made blanket that can, once per long rest, emit a soft glow, maintained by concentration. The blanket was crafted by an enchanter after his young son confided he was afraid of the dark to help his son get to sleep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "83FhqBEdUyRvkA0A","flags": {},"type": 0,"text": "A hand knitted hat that will keep the wearer cool when it’s hot and warm when it’s cold. Commissioned for a man who had no hair by his sister.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "lR98W7dtSLRyNhdH","flags": {},"type": 0,"text": "A music box pendant, that, when wound and played, emits a somber, soothing song, like one sung by a long-dead but much-loved parent to their child. While the song plays, other sound around the wearer is muffled, and the user cannot be frightened.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "NqqcUlWUyPQp79R1","flags": {},"type": 0,"text": "A small brass claw, meant to be set on a desk and have a gemstone inserted into its top. It gives a small, hologram-like view of an elemental plane, changing which plane is displayed by changing the gemstone. It seems to have been a gift from a noble to his child, as such craftsmanship would be quite expensive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "qc0WyEbgXJLNw6E9","flags": {},"type": 0,"text": "A medallion that, when focused on, always displays a faint blue line, curving around trees or arching over rocks. It will always show the fastest way home, but not the easiest, a flawed enchantment made by a well-meaning wife for her husband, so that he could always find his way back to her.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "1ae68MfKvUbzSN9b","flags": {},"type": 0,"text": "An enchanted censer that was made by a daughter for her father, who was suffering from PTSD following the battle that robbed him of his arm. No matter what incense is burned in the censer, it gives advantage on wisdom saving throws.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "9MlIdaWJyImCsy4q","flags": {},"type": 0,"text": "A set of bracelets that when one is broken the other immediately breaks as well. When one is mended, the other mends itself. Created by a brother who was going off to war, for his younger brother staying home. This was so the older brother would know if things got bad at home. If the bracelet snapped, he promised to come home no matter what.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "o7yQfDWHo21aRo3J","flags": {},"type": 0,"text": "A simple wooden cup that warms and cools liquids to make them taste better. Water is pleasantly cool, ale is near freezing, coffee and tea are heated to the user’s preference. Created by a travelling wizard for a young woman in a small village who he had fallen for, when he overheard her mention her disappointment that her tea had gotten cold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "vDsWJI5oIONNDxwl","flags": {},"type": 0,"text": "A small wood carving knife that loses it’s edge as long as the blade touches the wielder’s skin. Does not need to be sharpened. Made for a craftsman’s son who had a tendency to nick himself while whitiling.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "66HvxDNTjQgom2JF","flags": {},"type": 0,"text": "A pair of overalls that have a mild levitation charm imbued into them, will float off like a balloon if left unabated. Made for a retired soldier by his superior officer to alleviate pain to his knees whenever he put weight on them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "VsDFfdWRLYiSmwEl","flags": {},"type": 0,"text": "A bedroll that creates a mild water repellent barrier around it as long as someone is laying on it. A gift made for a traveling merchant so that he wouldn’t worry about sleeping in the rain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "J7rJHaXNOChquhgk","flags": {},"type": 0,"text": "A copper horn that allows the user have advantage to perception rolls based on hearing when used. Made for an aging grandmother so that she could hear her grand kids better.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "CoojjKvOkAcTBjww","flags": {},"type": 0,"text": "An ornamental birdcage containing an exceptionally realistic stuffed bird. While uncovered, the “bird” softly twitters beautiful melodies. Created by a bird-loving artificer for a family of wealthy aristocrats. Though the birdcage has been in the family for over a generation, none of the family members have noticed that the bird itself is fake.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "R6tPvtivbffp8UvE","flags": {},"type": 0,"text": "A brass spoon that neutralizes any harmful toxin within a liquid one spoonful at a time. Made for a Duke’s son after he received a death threat via mail.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "9XhW5X9Wfuwr57dv","flags": {},"type": 0,"text": "A pair of gloves that softly hums different notes based on the type of metal they touch (mostly used for coins). Made for a merchant that went blind so that he wouldn’t be swindled.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "nA5vHg8zOZmnQK2x","flags": {},"type": 0,"text": "A brass gauntlet that glows a different color depending on what time of day it is (Blue for night, yellow for day, Green for dawn, Purple for dusk). Made for a coal miner by his boss so that he would when he could go home.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "PEcbT7VqNW1H4Xpc","flags": {},"type": 0,"text": "A red scarf sewn with silver beads into the fabric, magically filters air that is sucked through it when worn as a face wrap. Made as a gift for an obsidian miner to avoid complications with volcano fumes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "die6t0wNrxe77Spu","flags": {},"type": 0,"text": "A small hammer that will drive in any nail strait in. Commissioned for a carpenter by his children when his hands started shaking in old age.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "8bYoFKclqtAdyiIQ","flags": {},"type": 0,"text": "A small rubber ball that would roll to the nearest dog or wolf within 50ft of it. Made for a man whose dog went blind and wanted to continue to play with it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "wyhyTODoZExEqpOM","flags": {},"type": 0,"text": "A fishing pole with a bobber that looks like a human eye. When using the pole one can look through the bobber and watch the hook and bait to see when the fish bites. Given to an old soldier as a retirement gift.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "hNSWC90wczBhbUst","flags": {},"type": 0,"text": "A fashionable and large hat that cloaks the user in shadow. Made as a wedding gift to a drow bride moving to the surface.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "mSW0Pjy9Jt4vyFpC","flags": {},"type": 0,"text": "A feathered cap whose feather is a quill that can write 5 pages of notes. The feather disappears after an hour and a new feather grows from the cap. Made by a wizard for his forgetful apprentice who would always lose or forget his pen.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "DwTG2fy4PHhYomS3","flags": {},"type": 0,"text": "A comb that when combed through hair braids it into an fashionable design. Commissioned for a dwarf who wanted his beard to look stylish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "VA2Yx4Am8e7bYhrS","flags": {},"type": 0,"text": "A small silver cat bell that, once night falls, causes the death of 2d6 vermin in the house the bell is kept in. Manifested itself after the well loved cat of a farm died. Every now and then, the bell will softly chime and manifest a haunt such as; the feeling of fur rubbing on your leg, a cat’s tongue licking your fingers, the sound of contented purring filling everyone’s ears and the occasional decoration knocked off it’s shelf.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "ChKmv1sM2jg7j1HQ","flags": {},"type": 0,"text": "Sun-filled mirror-catch box, it has enough sunlight to fill a room with bright light. Built by a retired adventuring dwarf and filled by passing adventurers. Not every denizen of the underdark has the means or bravery to leave the underground but they still hold curiosity over the sun and it’s light, some come from miles underground to view this dwarf’s curio.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "vxKnnQpUcTy3LlgZ","flags": {},"type": 0,"text": "A large conch shell that, when put to the ear, makes the wielder hear the sounds of the ocean. If you close your eyes while doing so, you’ll see visions of infinite horizons and calming ocean waves. A gift from a pirate lord to his estranged, landlocked son to give him at least a glance as to why he left.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "jy7StTfQcQv0Tjel","flags": {},"type": 0,"text": "A small mobile showing a scene of sheep hopping over a fence that, when hung, all around it will find it easier to enter restful sleep and ignore less dangerous interruptions. The first successful craft by an apprentice Artificer for his insomniac mentor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "W9qoml9f8Cu534QE","flags": {},"type": 0,"text": "A leather Tabard made of orc skin that allows those who wear it to be able to use rage once per day. Legends tell of the friendship between an elf ranger and an orc barbarian, whose tribe had strange funerary rites. When the orc was struck down, with his final words, he requested that he’d be turned into a tabard so he could protect his friend once more.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "T0bJDNFEFL4YHdXW","flags": {},"type": 0,"text": "3 shot glasses with markings on the side, when all the glasses are empty, any alcohol poured into one glass fills the other two as well. The markings on the glass move to indicator the level of the other two glasses. A creation of an artificer dwarf for his two brothers as the sought out life beyond the mines. Funny enough, doesn’t work when [insert hated alcohol] is poured in it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "XxY3m7cxi8k1kUn4","flags": {},"type": 0,"text": "A pair of ornate chessboards with pieces made of ivory. The pieces are enchanted to move via vocal commands and any move on one board is mirrored on the other. The possession of a prince and princess of two opposite, warring states.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "A2fvDfNjAD84qx06","flags": {},"type": 0,"text": "A frilly parasol that emits a small cone of magical darkness when opened. The gift of a nobleman for his vampire wife.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "VDDu4M7oVnQ7Xczd","flags": {},"type": 0,"text": "A yarn doll that has an embedded communication spell. Made by a wizard father for his daughter so that he could talk to her while he traveled. The companion object is a locket with a cut of hair and a portrait in it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "qj5LzPq8mryEKexW","flags": {},"type": 0,"text": "A finely crafted handheld mirror made out of ivory, glass, and silver. Small runes are inscribed into the back, and words in a forgotten tongue glow softly around the handle. Whoever looks into the mirror will see themselves reflected, but in the background will be what the individual knows in his/her/its mind as home. In the presence of the mirror, all illusions fade, and all invisible creatures are revealed by glowing outlines. It was originally made by a wanderer who had recently returned home from a long journey to a strange land.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "f4iTQizwDzLp3Udh","flags": {},"type": 0,"text": "A leather lined steel helmet with a pair of matching elvish insignia on either side of it. When someone puts both hands on the insignias and speak into the helm, it will magically record what was said and play it back for whoever is wearing it when they touch one of the insignia. Given to a soldier who tended to forget his orders on long trips.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "kpX9HuwNgZZY62Ij","flags": {},"type": 0,"text": "A fishing net that will repair itself of any tears 12 hours after they happen. Commissioned as a retirement gift for a small town politician.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "SKC25bTjEv2w0wkP","flags": {},"type": 0,"text": "A custom made sand paper block that has a dial on the back that adjusts the grain size of the paper without having to physically change it out. Commissioned by a wood worker as a gift to his son and his up and coming buisness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "JjN7dH0mcdczguXV","flags": {},"type": 0,"text": "Tall leather boots that are highly resistant to piercing damage. Made for a hunter who tended to forget where he laid his bear traps.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "2NbxyMFzp0XP93xC","flags": {},"type": 0,"text": "A knife and fork set made from Mithril with small runes embed in the handles. When the fork is inserted into food (non-living material) it allows the knife to cut through it with little to no resistance. Made as a gift from a wife to her husband so that he wouldn’t waste time sawing through her cooking like a log.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "9UZWMy05mlyZZcP1","flags": {},"type": 0,"text": "A sand timer that takes vocal commands and can makes various chime noises. Made for a weapons smith to better keep track of how long something is in the kiln.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "qTzzHBLQyfzvtept","flags": {},"type": 0,"text": "A wooden top that will keep spinning as long as someone is looking at it. Made to teach concentration to a young boy who had problems focusing on one thing at a time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "zo3h65rEwzBg2uXg","flags": {},"type": 0,"text": "A stein that removes the alcoholic content of any drink poured into it without affecting the taste. Made by a cleric to help drunkards quit the drink.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "lNL3kahozgvKJrIu","flags": {},"type": 0,"text": "A wide leather belt that can project the illusion that the wearer is much fatter than they actually are. Commissioned by a couple of draft dodging neer-do-wells who thought they could avoid the service by looking as unhealthy as possible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "XLXmnFPpw3LhC9HN","flags": {},"type": 0,"text": "An earring that telepathically describes whatever is visible in front of the wearer. Made by a child prodigy for their blind mother who worked tirelessly in order to pay for their magical education.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "lyVEcyIqnHvWlDxr","flags": {},"type": 0,"text": "A long, satin coat that blows air throughout in the inner lining whenever the wearer puts both hands on the collar allowing it to dry out rather quickly when wet. Made for a seamstress that lived a particularly rainy part of the continent by her mother.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "GQMks5l4RWO3lWcr","flags": {},"type": 0,"text": "A wax stamp that changes insignia depending on the proximity of the nearest royal blooded individual. Made for a government worker as a promotion gift.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "Ni6GfKJxkuAfo2Vb","flags": {},"type": 0,"text": "A metal wind chime a traveler carried with him that catch the faint sounds of home no matter how far he went. Distinct voices can be heard but not clearly enough to make out more than mumbled words and laughter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "MFG0YwZpdkeWKFAd","flags": {},"type": 0,"text": "A dark red cloak with an extra long flap in the back that will bend and stiffen into a functional chair when the wearer tries to sit down. Made for a wizard that had difficulty walking across town without breaks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "NMr8qQO9C0HfvkGz","flags": {},"type": 0,"text": "A silver necklace with circular blue stone hanging on the front, makes the wearer speak much louder with no extra effort. Made for a former doctor who enjoyed his piped too often.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "Tf8mzuFD1a5DC7rQ","flags": {},"type": 0,"text": "A Copper ring that lightly squeezes the wearers finger when they forget something. Made for a forgetfully librarian.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "mU8J712BVNlFiIgS","flags": {},"type": 0,"text": "A deck of cards that shuffles itself when tapped twice. Made for a tavern owner so that customers wouldn’t claim cheating from each other.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "FdXg4yCFQsckKhTe","flags": {},"type": 0,"text": "A small puzzle box that resets itself after being solved. Made for an elderly gnome to keep his mind sharp.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "1sFmlCqHYVpypfV1","flags": {},"type": 0,"text": "A toy top that shoots out multicolored sparks when spun. Made and a gift for a young girl.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "IXFjxlvf6lHtBu1k","flags": {},"type": 0,"text": "A water color paint brush that changes color when dipped in different water sources. Made for a warforged who wanted to express itself artistically.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "GNyFei9ItEAwRpq7","flags": {},"type": 0,"text": "A tin monocle that lets the wearer see a great distance. Made by an artificer that could no longer view the beautiful landscape around his home as he aged.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "7tEtIgsD8dCsXKqn","flags": {},"type": 0,"text": "A neck tie that soothes the throat and allows the wearer to sing/ speak for a long time without injuring themselves. Made for the apprentice of an operatic singer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "U9nUPaWzkmfGdRY4","flags": {},"type": 0,"text": "A green blanket that contorts to the body as though it were being embraced by a loved one. Anonymously donated to a young half orc at a nearby orphanage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "eyXsK8OCTh1NcqWf","flags": {},"type": 0,"text": "An alabaster quiver that makes simple wooden arrows when fed raw wood. Commissioned by a hunter to save time whittling practice arrows for his son. He later realized that he missed making arrows with his son so he sold it to buy him a proper short bow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "oWqb7FC8gLIp7zkr","flags": {},"type": 0,"text": "A sparkling set of needles that sew on their own after given a pattern to follow. Made by an elderly druid who wanted to streamline their winter gift making.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "uQ2xAStxZS38h0Wa","flags": {},"type": 0,"text": "Brick colored gloves that are extremely resistant to crushing forces when worn. Made for a wall builder that was paranoid about losing a finger.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "LF58f7HJuOKGBfQG","flags": {},"type": 0,"text": "A small harp that plays the last song it heard when activated. Was ordered to be made by a king so that his sick could be serenaded whenever she wanted.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "G6cyEGh40CeWN8X7","flags": {},"type": 0,"text": "A small dented chalice that produces a minty slurry on command once per day. A community of dwarves came to together and commissioned it. It’s engraved with the phrase “To Gutter Mouth Rodhim, For the love of the Lord use this once in a while -Everyone”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "cnm3GNdhIyTDqhCz","flags": {},"type": 0,"text": "An emerald ring that gives the wearer an abnormally strong sense of balance. Made for a diplomat by her husband so that when she went on long sea voyages she wouldn’t get sea sick.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "6hSEDzYDT8vw37DJ","flags": {},"type": 0,"text": "A long feline tooth that naturally repels small, wild mammals. Made by an Elf with a phobia of rats.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "2cfXbateTDdzutml","flags": {},"type": 0,"text": "A 5″ by 5″ wooden cube that, when properly closed, creates a small pocket dimension inside where time doesn’t flow at all. Made by a lich who used it to keep his beloved pet hamster alive over hundreds of years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "luXq7p3NkpB516IT","flags": {},"type": 0,"text": "A large copper orb that, when allowed to sit in a stagnant body of water, purifies and separates harmful pathogens from the water. Made as a tool for humanitarian efforts run by a brain damaged bugbear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "1QP0n96xOq1sMhOG","flags": {},"type": 0,"text": "A pair of self lacing shoes. Made by an artificer for his wife who had bad back problems.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "JLh4Asbc46qtGBAO","flags": {},"type": 0,"text": "A sentient mouse trap that hunts and eats mice. Made for a tavern owner after their beloved cat died.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "WM9UQkZiUlJdtZp0","flags": {},"type": 0,"text": "A copper studded head band that soothes head pain when worn. Made for an elf who suffered from chronic migraines.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "SC82C7WofMO6CVCA","flags": {},"type": 0,"text": "A purple amethyst stone that projects soft purple light when the sun goes down. Made for an orphan who was afraid of the dark.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "tsJf6VZdcBco9XhI","flags": {},"type": 0,"text": "A glass teapot with hand shaped handles that bring water to a rolling boil almost instantly. Made for a waitress to alleviate her workload.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "slphzkk7P9ZrpFDi","flags": {},"type": 0,"text": "A gorilla jawbone necklace that helps your hair grow back. Made for a balding human as an anniversary gift.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "uGkXE31EjgysRjMG","flags": {},"type": 0,"text": "A pair of leather sandals that allow the wearer to walk on shallow water. Made for a delivery woman who got tired of stepping in puddles on her routes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "HRWGLjd54OWOtQ2F","flags": {},"type": 0,"text": "An oval wicker basket with a tall handle that keeps the items placed in it secure regardless of turbulence. Made for a clumsy mailman.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "eEmWLSRgZmzgDdtY","flags": {},"type": 0,"text": "A broom with a hickory handle that sweeps an area of 30 ft x 30 ft to the best of it’s ability. Made for a tavern owner after his spouse died.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "llXoweHs2qExzqZy","flags": {},"type": 0,"text": "A tin crown that increases the confidence and self image of those who wear it. Made for a shy human boy who had trouble talking to people.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "7FXL8bala39mIpma","flags": {},"type": 0,"text": "A bracelet with a single misshaped pearl that makes the wearer smell like an ocean breeze. Made for a Teifilng dancer as a birthday gift.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "bs5FT3RqfeiwZ99V","flags": {},"type": 0,"text": "An armband that flickers color (White to red) every time the wearer’s heart beats. Made for a cleric to help keep track of an injured colleagues’ condition.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "BM6tqQjJz8RtDqWS","flags": {},"type": 0,"text": "A reflective steel circle about the size of a coin that makes it so the owner doesn’t get burned from exposure. Make for a cartographer that was trying to map out a desert.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "2RJbUYJ8NW0410Yu","flags": {},"type": 0,"text": "A fist sized snail shell that magically produces table salt when shook. Made for a gardener to keep out pests.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "bnW2XmZVXgtTmte0","flags": {},"type": 0,"text": "An iron lantern that dims in correlation with how awake the nearest person is. Made for a young half-Orc who liked camping outside his house.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "WXiI7VyVcr6gYk3Z","flags": {},"type": 0,"text": "An ornate paper fan that creates sweet scents whenever it’s waved. Made for an aristocratic Goliath as a birthday gift.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "fOdQDL5VeyEVXTWO","flags": {},"type": 0,"text": "A satin robe that gives a full body massage to the wearer when the waist rope is knotted. Made for a popular pit fighter for post fight treatments.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "BB18tlQyHZsMLky7","flags": {},"type": 0,"text": "A patch of treated leather with studded edges that removes tattoos off of skin if pressed up against them for 10 minutes. Made for an apprentice tattoo artist that made more than one mistake.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "gyfC4R9NGxp3Ca91","flags": {},"type": 0,"text": "A metal collar that keeps the wearers’ airway clear. Made for a gnoll that had bad allergies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "g3TSZh38qeCsjFDw","flags": {},"type": 0,"text": "A bronze bird medallion that gives off the sound of gentle bird whistling. Made for a Gnome after his forest home was torn torn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "CIbGdZKnTG7Pg5h2","flags": {},"type": 0,"text": "A smooth stone made of obelisk that alleviates the pains of small burns when held. Made for a druid who was injured in a forest fire.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "Lsd5oDoH8cn8DOHh","flags": {},"type": 0,"text": "A small coin purse that cleans any jewelry put into it magically. Made for a pawn broker with not enough time on their hands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "MQg0S9eGMO7EXsZ3","flags": {},"type": 0,"text": "A paper crane that, when unfolded, will inscribe any words within ear shot onto itself. The words on it will remain for 5 hours or until it is folded back into a crane. Made for a deaf child so that she could better converse with her friends.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "0C7XIYu0nU8tmcjJ","flags": {},"type": 0,"text": "A small pebble made of slate that, when pressed into someone’s palm, creates a small illusion of a young child. Made by a grieving sorcerer who had lost a son.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "764VQJBrwdhsW90b","flags": {},"type": 0,"text": "A gold colored hand bell that makes those within earshot recall the last time they were charitable. Made by a paladin so that she could more easily collect donations for charity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "r9QczQRbc8FKDsNK","flags": {},"type": 0,"text": "A leather bound tome that writes out motivational quips whenever it is opened. Made for a laborer with low self esteem.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "zdDcGTwv1GzcxBgM","flags": {},"type": 0,"text": "A backpack that magically sorts everything in it to fit in as much stuff as possible. Made for a traveling merchant who was bad at packing the essentials.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "tuk32jxLOr0njHP3"}
