{"name": "Colorful Hosts","description": "One hundred colorful hosts, from warm to begrudging and innocent to suspicious.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "5kSSxKJYjpGgcZiu","flags": {},"type": 0,"text": "A large family of gnomes. They are quite welcoming to guests, and serve dishes upon dishes of rich, steaming food at their meals, often accompanied by the father and the older sons singing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "xisPiVKBOARY6zb1","flags": {},"type": 0,"text": "A young tiefling loner who’s willing to share his small, spartan flat. A starving-artist type (well, not quite starving, he does pretty well) who specializes in portraits. He doesn’t bother the guests if they don’t bother him. Keeps his work depicting who he remembers as his mother (an Erinyes) in a safe in his room.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "QjZKbyERpi3JMRLY","flags": {},"type": 0,"text": "A soft-spoken Half-orc librarian and his wife, an Elvish herbalist. She isn’t as welcoming as him, but is alright with guests as long as they stay out of the workshop. They both do some of the cooking, so the meals are…unique.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "U0Lc4pCNyTEEAQCO","flags": {},"type": 0,"text": "A Kobold matriarch. While her children have all moved out, their children are dropped off at Grandma’s house quite frequently, and she teaches them all she knows. She also runs a small shrine to Bahamut in the cellar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "Dnl9xqBufNkcZJWG","flags": {},"type": 0,"text": "A hot-headed, wealthy heiress and her more rational lady-in-waiting.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "3vQtRQxDofTxO6in","flags": {},"type": 0,"text": "The prince of a corroding noble line, of late taken to dressing in black, composing gloomy poems, and brooding on the battlements of his manor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "7GxEAlMSqDQSqnHc","flags": {},"type": 0,"text": "A dwarvish professor with a magnificent walrus mustache, as well as his warm, old-fashioned wife (a dressmaker) and their daughter, who’s visiting for a month or so from her apprenticeship.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "J2pLSJm696vvoBBI","flags": {},"type": 0,"text": "The quiet Mother of a hostel run by the temple of the god of the poor. The tragedy and despair of many of her visitors has rubbed off on her a little. The food is outstanding.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "Po803ym0tShMbj7f","flags": {},"type": 0,"text": "A not-quite-right young man with ambitions to become a psychologist. Asks far too many personal questions, then goes off on rants about what he thinks shaped his guests to the people they are today. Total quack psychologist, doesn’t know what he’s saying at all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "MDzrk2M5aqbJjmlp","flags": {},"type": 0,"text": "An Eladrin who’s spending a few centuries ‘indulging in kindness’. There’s a too-good-to-be-true air to the stay. Breakfast in bed, indoor training arena, a small dungeon built underneath the manor and stocked with inexpensive monsters, a wizard’s study, everything they could possibly want. And the host is always smiling.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "o4JrRkTpMV9uvWpl","flags": {},"type": 0,"text": "A jovial Goliath with an Australian accent who spends most of his time wrestling with various dangerous forms of wildlife. Owns a large merchant company, spends most of his time doing push-ups or lifting weights or wrestling yetis.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "CFgKcaFGjNXkM6Q5","flags": {},"type": 0,"text": "A shriveled, wrinkled, hobbling old Bullywug whose sentences are out of order, and seems to speak in riddles. He wears a slightly threadbare robe and carries a walking stick.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "LZIjMxrlWK6tGxAn","flags": {},"type": 0,"text": "A stern Halfing dance instructor. She’s quite sprightly, humming waltz tunes as she works. She corrects people’s postures out of force of habit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "7da6Q5ji8wWEHFQG","flags": {},"type": 0,"text": "An old Dragonborn mercenary who frequently lapses into a thousand-yard-stare. While not tormented by nightmares, he’s a good-humored guy with quite a few tips on adventuring.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "Zzj7auQDd0slJc6y","flags": {},"type": 0,"text": "A water genasi weaver whose skill isn’t quite unmatched, but it’s up there. Naturally, the curtains and carpets of his house are expertly made and quite flamboyant.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "beO9ehoRsviGVdAE","flags": {},"type": 0,"text": "A cackling, bitter old woman. Actually a Green Hag, and her curse is the reason the couple next door (whom she finds insufferable) have been trying for a child for years without success. Serves stew or porridge for every meal from a huge, battered-looking black cauldron.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "CHNxPRi1XnHXl24a","flags": {},"type": 0,"text": "A hard-as-nails half-elf rancher. Owns stables upon stables of pure-bred racing horses. Despises city-slickers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "JVIYzS2VNdtzvJfF","flags": {},"type": 0,"text": "An old Minotaur noble. He wears huge suits, custom-made for him, and has a staff of Animated Objects who sing, dance, and make dinner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "4VHz3Eqn5v060uze","flags": {},"type": 0,"text": "A slightly suspicious young woman. Knows far too much about weapons, disappears for long periods of time, and locks the basement door very heavily. She’s an assassin for a local gang of racketeers, and will skip town if she’s found out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "L0oaDFebIKJV3TqF","flags": {},"type": 0,"text": "An Animated Armor that speaks like the Discworld golems (That Is, She Talks Like This) and moves very jerkily. She (well, it’s built for a female humanoid) used to work for an evil artificer before a band of adventurers gave her full free will. Knows a thing or sixty-four about dungeoneering, and considers herself indebted to all adventurers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "EnZ53L7eYWvO8l81","flags": {},"type": 0,"text": "A goblin horse-jockey who loves nothing more than the thrill of a race. Talks a mile a minute, usually boasting about his races, and his house is full of trophies that he polishes devoutly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "g0fjYXBSlp1cXxCq","flags": {},"type": 0,"text": "A human card-sharp who won his entire house in a game of Triple Ogres. He’s married to the shrewd but not very welcoming owner of a local tavern. She brings home the latest gossip each night.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "2DliLo0HzHgEwNCx","flags": {},"type": 0,"text": "A kobold artificer who’s trying to turn his species’ natural affinity for mechanisms to the good. Owns all sorts of fascinating contraptions, like an automatic pencil-sharpener or a tiny construct that writes down any good ideas he has mid-conversation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "XRzVnRraw7bFSVeF","flags": {},"type": 0,"text": "A merry old smuggler, although he’s put his pirating days behind him aside from the odd chorus of Dead Man’s Chest. His house is adorned with model ships and sketches of exotic shores. Drinks strong home-brewed grog.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "i2k4Xse3V1rHySr7","flags": {},"type": 0,"text": "The town doctor. There’s something odd about her of late. She stays up past midnight, tends to skip meals, and always seems to be tearing up some piece of paper and tossing it in the trash. (She’s smitten with the blacksmith’s apprentice, but can’t bring herself to tell him.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "KR5yrhxuHfF7c1wn","flags": {},"type": 0,"text": "A rough-and-ready frontier-dwelling female Dwarf, who lives in a quaint cottage. She’s older than most of the village, and knows all the skills of the hinterlands: medicine, hunting, cooking, the lot.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "Fj7zsdbl1qsbuRT1","flags": {},"type": 0,"text": "An old man who can’t seem to look you in the eye. He has one craft, and one craft only: he’s a knife maker. Assassins from every syndicate, court or gang come to him for their daggers. Even the odd Drow comes in the dead of the night to buy an honest-to-Lolth Master Work dagger.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "2lOmB4EHqXml3yIC","flags": {},"type": 0,"text": "A scheming duke who tries to see if the party thinks his power-plays would work without hinting too obviously at his massive ambitions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "LLYw5XEGYJLKsBSb","flags": {},"type": 0,"text": "A satyr couple who are, well, typical satyrs. They love wine, music, food, the usual revel stuff. Enjoy having guests, of course, but can’t stand ‘sticks in the mud’, ‘killjoys’ or ‘introverts’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "mLLcHkTlVcXjtjKy","flags": {},"type": 0,"text": "A female Drow who left the Underdark because she’s claustrophobic. Polite, in a regal sort of way. Her house doesn’t have hallways so much as long, broad halls, with bookcases or coffee tables or armchairs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "siBxIrJm7yu5Xo89","flags": {},"type": 0,"text": "A newer vampire who is having a little bit of an identity crisis. He gets the ‘nocturnal’ part, yes, he gets that, but isn’t the whole ‘domination’ thing a little unethical? and similar conversation. Keeps forgetting that garlic tastes disgusting to him now.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "riZivgV0nCeXWvcn","flags": {},"type": 0,"text": "The best Dwarvish pastry-chef that has ever walked the earth. And she knows it. Quite boastful.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "AUDCvKJTJDeEZA6Z","flags": {},"type": 0,"text": "The keeper of a local shrine to the fire god. He’ll just sit by the fireplace, staring into it for hours on end. Has a very large and overly friendly golden retriever.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "tEao6I5oNmjJ0OXm","flags": {},"type": 0,"text": "The local ‘crazy cat lady’. An Air Genasi whose hair is always blowing in a gentle breeze. This confuses her cats to no end. She has forty-three of them, and one Mimic who enjoys it’s current lifestyle and has decided to stay shaped like a cat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "Uzo0dwlHBMiUmXlm","flags": {},"type": 0,"text": "A Tabaxi game-warden. His wolfhound isn’t part wolf, it’s part Displacer Beast, which means people often think he has two dogs. Pleasant but fairly quiet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "hanjj04cj1F0740l","flags": {},"type": 0,"text": "A grizzled old human war veteran. Wears an eyepatch. Has a suit of plate-armor stained with horrific, otherworldly humors in his front hall. Retired after ridding his ancestral estate of some kind of great beast he refuses to describe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "lZj09fFJZqeWZG3N","flags": {},"type": 0,"text": "A gnomish scientist who studies modrons. He’s utterly fascinated by them, and can go on for hours with horrifically dull facts and factoids about them. His house is littered with mounted modrons, dissected modrons, everything modron-related you could imagine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "HpPu4KRPsowDK7Gb","flags": {},"type": 0,"text": "A time-wizard who messes with his personal time for kicks. Making himself twelve years old, being in four places at once. He thinks it’s a riot. His house is full of books of temporal magic, or at least it was, twelve minutes before you try to open one of them. Opening one book makes them all vanish to the past. It’s his security system.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "RVAJcGO4aViEEFVK","flags": {},"type": 0,"text": "A noble Knight Lord who lives in a small castle and commands an order of chivalrous Knights. A former adventurer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "ysEWO3IWey5ljMyL","flags": {},"type": 0,"text": "A wise Grand Wizard who lives in a magic tower and commands a guild of powerful Wizards. A former adventurer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "sVjaqlg1LFQIQp7R","flags": {},"type": 0,"text": "A clever Spymaster who lives in a heavily-secured manor and commands a guild of Spies. A former adventurer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "9RAkGe4SQmR2BQI4","flags": {},"type": 0,"text": "A pious High Priest of Light who lives in a modest house attached to a glorious Temple. A former adventurer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "PiSDHki1M1BrpSpi","flags": {},"type": 0,"text": "A homely man with balding white hair, a small beard and eyeglasses. Meets with friends often, talking for hours in the cellar. Are they…acting? Playing some sort of dice-game? It’s not quite clear. Says he hails from the realm of Greyhawk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "18DXY198SUXTjty5","flags": {},"type": 0,"text": "An elvish professor of languages who, despite having fought in several wars, is a honorable, straight-laced, old-fashioned gentleman. He’s writing a rather long book. Apparently it’s about halflings and some kind of Ring?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "jzNjfTjnQxR8H30q","flags": {},"type": 0,"text": "A razor-witted Dwarvish comedian who does standup at local taverns, dishing out the side-clutchers and knee-slappers galore. Willing to share a few jokes with the party, too. His ‘why did the cockatrice cross the road?’ always gets ’em.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "C56a1PjmxQWzJe9p","flags": {},"type": 0,"text": "A Bugbear leg-breaker for the local mob is trying way too hard to be polite and gracious. His apartment’s nice, of course, but he seems to think that the entire party are some sort of sting operation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "4Z6WSTG6V8Ybl2Y3","flags": {},"type": 0,"text": "A former Underdark delver, this calm but dispassionate female Tiefling is married to a far more bubbly and cheery Wood Elf. They bicker regularly about what ‘acceptable decorations’ are, stuffed Troglodyte heads or singing roses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "yvDQUYA0FwjsY9gg","flags": {},"type": 0,"text": "A brawny whiskey-maker who meets over a nice, old keg with rogues and grave-robbers every night, it seems. His house is above his tavern.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "LLRCIiQGfJjV4lSd","flags": {},"type": 0,"text": "An Eladrin woodcarver who has recently taken up trying to enchant things. She’s terribly confident it’ll work out eventually, but for now you’ll have to put up with wooden busts that hurl abuse or curse words and cutlery that work together to spell out rather rude slang.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "4werhj0nypkzO9R7","flags": {},"type": 0,"text": "A Halfling balloonist with a terrible case of wanderlust. Half of his things haven’t been unpacked yet, half of them are already ready to go.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "NMk2NVb0r6x2WssQ","flags": {},"type": 0,"text": "A master wizard who crafts Golems. Has some shady deals with dungeon overlords, but is still a good man. Might cut the Evil Overlords off from his business if approached; he’s a man of principles, just needs a push of sorts to get him to stand his ground for them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "4PfxwcvUblVlqE1M","flags": {},"type": 0,"text": "An Aasimar teamster who’s moving into the song business. He’s got quite the voice, and a few songs already written: All Shook Up, 500 Miles, and he’s working on a few more.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "mjvHLuFXiuJZLJ5H","flags": {},"type": 0,"text": "A slightly edgy Tiefling who wants to be both friendly and intimidating. Budding metalhead. His apartment is nearly plastered with band posters and song lyrics.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "ksSPkqEuVTqPe0yy","flags": {},"type": 0,"text": "A genteel, aristocratic Red Dragon who lives in an enormous castle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "mFoYX3D5eY6XdHUC","flags": {},"type": 0,"text": "A curious young man enamored by the sea. Despite his youth, his hair is receding. He never seems to blink, either. His house is full of weird idols and jewelry of ancient civilizations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "JKzkC790PD8MRkhN","flags": {},"type": 0,"text": "A charlatan ‘wizard’ who’s really just a chemist. Tries to keep her lab hidden. Nearly has a breakdown if she’s confronted about her fraud.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "J3EEsqWfN3d60Ec7","flags": {},"type": 0,"text": "A Goliath strongman of the local circus. His quarters are rather large, because he’s rather large. They’re right next to the acrobats’ and the lion tamer’s.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "oj6mP8zcFkH4sHfv","flags": {},"type": 0,"text": "A vain elvish wizard who spends most of her time in front of her magic mirror, and the rest of it complaining about upload schedules and dislike mobs and ad revenue.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "Gw8QCcCc7TuRDp8N","flags": {},"type": 0,"text": "A dwarvish butcher. His wife is an author. Both of his daughters are in preschool. He himself is vegetarian, but does eat fish. Spends his evenings playing pool in the cellar with his friends, or going on walks with his daughters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "UkawYkedkFJsqkI6","flags": {},"type": 0,"text": "A professional court-jester of the local duke or lord. Not as cheery off the job; gripes to anyone who’ll listen about his poor wages and difficult job. His house is a small cottage within the bailey of the castle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "hjecy9NeXv5IHjdU","flags": {},"type": 0,"text": "A tight-lipped priest who seems to have a shrine to every god in his tiny house. The hallways are crammed with altars and icons, and the whole place smells like incense 24/7.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "tuusfVFwDa3JCKbi","flags": {},"type": 0,"text": "An unintentionally insufferable Aasimar ballerina. Lets the guests have the run of the kitchen; she’s too busy practicing for her next performance in the studio downstairs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "Pdn2pI3N2U8zqEKp","flags": {},"type": 0,"text": "A young bachelor Mountain Dwarf, who’s bitter about getting turned down by the local army or militia. He’s drinking a little more than is good for him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "YYhzkvTo6aXOl5i6","flags": {},"type": 0,"text": "A gnomish jeweler, his wife and three children. They have a pretty large townhouse. The husband is a little busy with an important order: a new crown for an anonymous nobleman.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "rhRyV4sC5084wpNh","flags": {},"type": 0,"text": "A halfling priest of various gods of knowledge and nature. He’s a part-time biologist, running a few experiments in the lab in his basement. He’d love to meet a Druid or Ranger with more hands-on experience than himself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "qY00sLvJ7GAQJIgZ","flags": {},"type": 0,"text": "A Fey who lives in a checkers-themed tower. May kick the guests out if they mention chess or use chess analogies. Most of the food is circular (pie, pancakes, etc.), the tablecloths and bedsheets all have checkered patterns. Writes long letters to a bitter rival.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "gcQwGSEngcy26Uhp","flags": {},"type": 0,"text": "A Fey who lives in a chess-themed tower. Gets rather testy if people mention checkers. The staff are construct automatons that only move like particular chess pieces. Complains about a completely irrational rival who sends him storms of nonsense letters every day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "LHLpG37CCsORYed9","flags": {},"type": 0,"text": "A professional human trick-shot-archer. She goes on tour with the circus now and then. Her favorite one is nailing a playing card out of someone’s hand from one hundred paces.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "qwkR7x0rXNRgB1no","flags": {},"type": 0,"text": "A stout Dwarf who’s a master cook. He puts his heart and soul into every slab of beef, taking hours just to prepare them for barbecuing. Doesn’t spend much time with the guests.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "paWjwKa1KRP9uO7G","flags": {},"type": 0,"text": "A human former doctor (she’s still got the beak-mask hung up on the wall in an airtight case, and she warns the party that it’s quite contaminated) who retired after fighting some sort of otherworldly entity beneath her ancestral estate. Recently took up horse-riding.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "58XAx7XfROuOB4pB","flags": {},"type": 0,"text": "A human comedian whose jokes tend to be at his own expense. Unmarried but pretty well-off, for a comedian. He tends to leave in the evening and come back close to midnight after his show.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "DM4AmxgVXWhpjO2j","flags": {},"type": 0,"text": "An eladrin priest of Tymora. Closer to his fey ancestry than most Eladrin. He’s scheming with a local gang to spring some of their hooligans from prison- after all, the whims of chance are unpredictable, or so he’ll say if the party threatens to inform the authorities. Then he will try and bribe them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "npwT9EuEKPmaX05z","flags": {},"type": 0,"text": "A calm Oriental-looking man who works as a janitor during the day. His apartment isn’t exactly barren, but it’s certainly unextravagant. He’s teaching a local child the various martial arts he mastered in his time as a Monk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "8wd45K6hMlteRfnb","flags": {},"type": 0,"text": "A simple Halfling herb-farmer. She has a small plot of land behind her house, where she grows things like spices and vegetables. Patient, because as she says, you can’t hurry peppers. Spends most of her time reading novels.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "K62PgH1qIoAE03fx","flags": {},"type": 0,"text": "A dragonborn tale-weaver. No, not an author, she’s quite firm. A tale-weaver, the kind that don’t get written down so much as passed along. Though she doesn’t exactly have it in writing, she’s very familiar with the wording and themes that make a riveting tale.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "xYIb41S7eTxSaooq","flags": {},"type": 0,"text": "A solemn, gods-fearing Dwarvish carpenter. They call him the Pious Benchmaker, which baffles him. His wife is of somewhat better cheer, but tolerates no nonsense in her house. The furniture is first-rate. You could hit it with a battle-hammer and it wouldn’t dent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "3LAWQmLHXSZ4wH4z","flags": {},"type": 0,"text": "An Aasimar mattress-maker. Laments his own misfortune: his mattresses are so good, he either sleeps on them and can’t get himself out of bed, or he sleeps on a couch or armchair and doesn’t sleep well. It’s a DC X Strength save to get off his guest-beds (the best ones, for he’s quite hospitable), where X is 10 plus the number of days since the sleeper has been in a normal bed instead of a bedroll or cot.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "mPcbmm6AxIdHQUuD","flags": {},"type": 0,"text": "A slightly unhinged half-orc scholar. He’s studying all sorts of bizarre phenomena at once, and keeps a wall covered in notes, sketches, and pieces of twine connecting them. The statistical anomalies of coin flips, the way the planet is tilted, all those sorts of things. Frequently becomes so engrossed in his studies he forgets to eat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "1w6js2vUmJZY0SCb","flags": {},"type": 0,"text": "A ratcatcher who is quite ferocious in his task. He’s got mousetraps all over the place, and hundreds of rat skulls nailed to his wall. Grim, adamant, and talks at length about what utter vermin rodents are.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "1MZ7WbS3QVF0RDQE","flags": {},"type": 0,"text": "A friendly, jocular doppelganger illusionist and it’s tame mimic pets. The house appears to have a large staff of servants and much finely-made furniture…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "H6OeijtoDsgAa0rf","flags": {},"type": 0,"text": "A gnomish Expert Clown. He doesn’t just study mere tossing and tumbling, mind you. He studies the psychology of clowning. What makes a pie to the face so funny? Or what is the thrill-inducing factor of juggling eggs? He can tell you. He can tell you for several hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "0iwzsgKY8RNdIMc1","flags": {},"type": 0,"text": "A human stone-carver and his teenage son. The son’s a little worried about his father, as the latter seems to be losing interest in the craft. Their house is full of half-finished works.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "GwcVsu1kjkPdWIqi","flags": {},"type": 0,"text": "A high elf mask-maker. It’s a delicate craft, she’ll tell you. Fey come to call every so often, picking up their masks but also staying to chat with her a bit. So do some actors. And one or two assassins.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "jSxFcsjEeOoW5nJ0","flags": {},"type": 0,"text": "A scruffy human gravedigger. He isn’t exactly a philosopher, but tends to make incisive remarks about mortality and time. Doesn’t like elves, because they don’t give him business.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "U0dHUUqUQVsNf4GW","flags": {},"type": 0,"text": "An old man with a bald head and gleaming eyes. If asked, he only gives his profession as ‘chemist’, and spends a lot of time in his lab. He’s less harmless than he seems; he’s the master poison-brewer for a local assassin’s guild. If he’s found out, he calls in his allies on whoever discovered his true identity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "elrxwHS8Lznnwq1c","flags": {},"type": 0,"text": "A young couple of a Tiefling and an Aasimar. Their ancestors didn’t like the marriage much, and it couldn’t exactly get officiated by a priest (but the local marriage law did allow for a Fey to do the job). They’re getting along fine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "HGIGH6CtUG4y4Rpr","flags": {},"type": 0,"text": "A pious couple who are gravely concerned about their young daughter. She claims to see ‘shadowy people’ in the cellar, and apparently brought the family dog back to life. They’re both nearly nervous wrecks, and priests of every Good god have been coming and going all week to try and exorcise the child.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "iTLO5jo8CiHT8zDv","flags": {},"type": 0,"text": "A white-haired old man and his shrill wife, both the village healers, although the Mr. recently got fired by the prince whose father he used to work for.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "yPnGmNF4O6C90i7t","flags": {},"type": 0,"text": "A playwright who is outraged at his rivals trying to spread the rumor that his work was ghostwritten for him. Insists on reading off sonnets and scenes to the guests to prove that he’s genuine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "sEqla6YTzi9VBAQf","flags": {},"type": 0,"text": "A grizzled, scarred town guard. He’s only in during the day, usually asleep, and spends the nights walking the streets and smoking very particular cheap cigars. Moody but not hostile.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "mPfnAOPDYGlk1G5Q","flags": {},"type": 0,"text": "A ‘professional quest-giver’ who pampers the heroes with everything he can. He’s in kahoots with a local dungeon-lord, and gets a share of the armor, weapons and loot of the heroes killed in the dungeon he directs them towards. He’ll take to the hills if he’s found out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "5FOIS0AWJarGoFJ0","flags": {},"type": 0,"text": "A young priestess of a god of the wilds. Her house is on the very outskirts of town, and has a terrible case of rats, which she doesn’t mind as long as they don’t bother the guests. Rats that do bother the guests get speared. She doesn’t take nonsense, but has some sense of humor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "O0A051ioaE7JsUld","flags": {},"type": 0,"text": "A Kenku minstrel who rents a room above the tavern he performs in. It’s covered in posters from his ‘glory-days’- although a keen eye (DC 15 Investigation) will note that they’re actually other bards’ posters, with the minstrel’s name altered into them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "UZIJznF7a0JVKEBv","flags": {},"type": 0,"text": "An apprentice baker and his wife, a schoolteacher. Their house was a cheap deal, and is a little run-down but still serviceable. Gets a little drafty, though.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "0t4OVWDkZYuTvy67","flags": {},"type": 0,"text": "A Kobold who claims to be an architect and interior designer. Actually, she’s a dungeon planner who designs catacombs, lairs and castles galore. Highly sought-after by evil overlords, and frantically tries to direct them away while the guests are there. If she’s found out, she’ll flee to the safety of one of her closer creations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "EY5NCH98qli5e2ZK","flags": {},"type": 0,"text": "A Swordsmith who has been at it for years. He keeps a display case of splintered, shattered or blunted swords recovered from various dungeons and battlefields, each with the tale of a fallen hero attached to it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "cI5SVecgber3RmNv","flags": {},"type": 0,"text": "A halfling gourmand with an affinity for candies. He’s a longstanding foe of witches who use his creations, or mockeries thereof, to lure children into their cook-pots.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "7ZSrOMG6gvhMWXvM","flags": {},"type": 0,"text": "A Dwarvish family of four- father, mother, son, daughter -who are rather new in town. Hospitable, but the house is still full of moving crates. The father is a lumberjack, the mother is a stay-at-home parent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "LG8Ne7YfrLIOjDNQ","flags": {},"type": 0,"text": "The High Priest of a local shrine of the god of travelers and messengers. He’s an unmatched source of information, references and road maps, and will greet anybody with a smile so long as they return the favor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "5TCJEXsn6td5WxN4","flags": {},"type": 0,"text": "An old Elvish couple. The husband spends most of his time golfing or whittling, the wife is busy giving advice to her newly-married daughter. They live in a nice old house, although there’s a ghost in the attic. Don’t worry, it’s very polite during the day, and it can’t leave the attic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "Cmh5NwtZ5n1CxGz0"}
