{"name": "Cyberpunk Corporations","description": "One hundred futuristic corporations that are open for business in your Scifi universe.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "FkuOPOF19wxFEmpb","flags": {},"type": 0,"text": "Priceless Perception: A company that specializes in cybernetic replacement of the eyes and ears of extremely wealthy individuals so that they cannot perceive anybody below a certain income threshold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "1b1LRH2jYaAI9b8m","flags": {},"type": 0,"text": "Remmeron – a corporation specializing in producing bioware and biological research. The largest shareholder is a vampire. Unknown to the public he portrays himself as a playboy who spends most of his night hours attending social affairs. His corporation is running secret research to create ways for the infected to walk in the daylight and Co exist with the general populous without being detected.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "iNCJa5E0FyIFAcQB","flags": {},"type": 0,"text": "Uropa: a corporation dedicated to deliveries. It owns the massive packing and delivering system of drones throughout the nation. Some say there’s a key (or keys) to be able to take control of the massive army of drones, but the President of the company, Dr. Drake Dorrinell, has said nothing to the press. Others also say Uropa partakes in illegal trafficking of people and drugs, hiding under the wealth and power of Dr. Dorrinell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "0mBIjESFfVq5lqbp","flags": {},"type": 0,"text": "The Immersion Institute: Dedicated to producing the most realistic simulated experiences available. Perhaps their trade secret is a dark one, extracting memories and experiences from its own unwilling customers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "njilqXin2qxepnPF","flags": {},"type": 0,"text": "Waygo – A transportation service in the vain of Uber or Lyft, except the vehicles are completely self-driving, they also deal in long haul freight services as well. They have cornered the market on land based transportation and over the last 20 years they have bought and dismantled nearly all traditional car manufactures and converted their factories to facilitate the maintenance of their self driving fleet. Their economic power is derived from the boon in metro living. They have used their influence to lobby nearly all major cities to outlaw manually driven cars, under the guise of keeping the roads safer. This however, only strengthens their position, creating a monopoly over transportation within the metro areas. They lobby heavily to loosen or rewrite the regulations regarding self-driving-car safety and their social media division works hard to AstroTurf positive news about their brand while discrediting the news of deaths, accidents, and other unfortunate incidents involving their vehicles. Their long haul trucks are often referred to as Meat Grinders by folks outside of the metro area due to their complete lack of object avoidance protocols. Incidents of Waygo Truck related deaths have been investigated in the past, but there are rumors that the AI at the core of Waygo not only manages the navigation of vehicles, but also operates a sanitation protocol for all of the government mandated camera logs as well. With all the misinformation being spread by Waygo itself, it’s almost impossible for the average metro citizen to know what is true and what isn’t. However, for all the folks still trying to make a living in the Midwest ghost states, the grim reality is that traversing the Waygo funded roadways offers more risk than reward.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "UVHdCmnI6asUjNjY","flags": {},"type": 0,"text": "DeltaSafe – a security and body-guarding corporation staffed entirely by modified clones of the same woman – Delta Degree.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "vxq4pLnD0uOP3M0D","flags": {},"type": 0,"text": "Advanced Bionics: Was on the cutting edge of human augmentation 40 years ago, but are now a shell of their former selves. They produce outdated tech at a relatively low price.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "E4ItQbzyQRPAG8hp","flags": {},"type": 0,"text": "The Farm, specializing in lab-grown protein-based foods, a.k.a. artificial meat. The process is highly automated, and requires specialized (and trade-secret) raw materials to grow their product.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "NAqDAopw5ZLYvecW","flags": {},"type": 0,"text": "The Takakura Heavy Industrial Manufacturing Concern (TK Heavy) – by far the largest company of the New Meiji Empire, TK Heavy makes everything from mining drills to household appliances to nanotech implants. Their orbital launch arm, Starlifter, puts more mass into orbit annually than it’s next three competitors combined. TK Heavy has headquarters arcologies on all seven continents, and fields corporate security forces that rival most governmental militaries.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "ZoxZB6qj0mRSUhOX","flags": {},"type": 0,"text": "CyberWorld – A company specializing in androids that function as servants. There is a 10% chance that when androids are abused they will become sentient","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "8AjxlfjxwaRTKU9D","flags": {},"type": 0,"text": "Eterna: Stores and contains the consciousness of willing and paying participants. Think the company from the ‘San Junipero’ Black Mirror episode. Unbeknownst to the users, Eterna will harvest the thoughts and ideas of the contained users and sell that information and data for its own profits.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "FPfK9vrRv4ERyPAV","flags": {},"type": 0,"text": "Formisa specializes in worker chic, for the fashion-conscious wage slave. In addition to looking snazzy, the designer work uniforms also tend to increase workplace efficiency by up to 2%. Women who wear their ForMrs line of maternity outfits tend to bounce back from childbirth faster, but also have a suspiciously high rate of multiple births. The zealously defended company secret is the illegally potent genetically enhanced ant hormone treatments in every item of clothing the company produces.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "7lIJ5n7LV9oH1v0V","flags": {},"type": 0,"text": "FylakíTech offers industrial cyber-services including computation and data storage. By synergizing with our parent company’s Incarceration Services department, we utilize unused organic computing power to put those resources at your disposal! Availability may be limited by prisoner populations, so don’t wait! Contact a representative now!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "BDfUiTt2NaguLOIh","flags": {},"type": 0,"text": "Security Downloadables (SD) – ‘Personal protection in your pocket.’ Ever find yourself in a bad back alley and need some firepower? Ever hired a gun and had him stab you in the back for a higher bidder? We have, and we know a better way! Give us your dimensional location ID or take a translation beacon device and help can be yours in SECONDS! Access your SD app via your personal communication device, and our perfectly loyal, genetically engineered and cybernetically enhanced Security Soldier will materialize at your location! SD-SS cost by the minute and is directly billed to your linked account. Should you run out of funds our Guardian will return to us immediately. Access a new payment method and you can resummon your protector again. Don’t get caught in a bad spot without some credits to spare! Now should you need guaranteed protection, you may opt in to our Overdraft Protector service. After your regular payment is rejected, we will continue service at a rate of 125% of your usual rate. This will be added to your pending balance. You will have within the month to pay back the bill, and any late fees accrued within that time. Failure to do so will result in you being teleported back to our HQ. There you will begin your voluntary admission into our Security Defender Training and Re-Education Program, unless you know someone who can take your place. Security Downloadables – Security, Loyalty. Absolutely.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "luqyVXp5jtN6lAid","flags": {},"type": 0,"text": "Iaur – a feywild based corp run exclusively by elves. Mainly they focus on building portals to bridge the gaps between worlds, but they also use the feywild for agriculture, as well as magical cure all’s","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "DrVXxihRXH6gwN22","flags": {},"type": 0,"text": "Imperium – A very tech-focused corp, these guys are responsible for the creation of the machina, a fully integrated virtual world that links every device on the planet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "GLdMJ4syb7JIO10N","flags": {},"type": 0,"text": "Metal Muscle: A corporation which has made it’s fortune in augmentation tech. Everyone from athletes to the working class citizen want/ have what they offer. ‘Via out patient injections to the muscle group(s) of your choice, you too can have Metal Muscle.’ Note: This tech can be nano bots, a growth hormone, metal fibers to resist muscle tearing, etc. They can have a ‘shelf life’ after which time you need additional shots, or you could get the ‘deluxe’ version that lasts your lifetime (and beyond for a great bad guy army twist?). Perhaps they have experimental additional options as well.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "c0PVr5Py9F3qgpcg","flags": {},"type": 0,"text": "Bhinneka- An Indonesian Fashion and Makeup Megacorp. Rose quickly to prominence on the strength of its nanopersonalized mascara line and a very successful advertising scheme. The company’s tagline is ‘Beauty in Diversity.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "5Vu7fysmiSy8p7ZV","flags": {},"type": 0,"text": "Hometown Slab: Run by a family of farmers stretching all the way back to the 20th century, this corporation uses local labor to grow, harvest, season, cook and distribute artisanal vat grown meat products. It’s very hipster-oriented: the company tailors its meat DNA to replicate local strains of pork, chicken, etc., as well as local traditions of seasoning and cooking. Its iconic commercials feature strapping young people using scythes to carefully harvest only the finest cuts of flesh.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "h5FWnP00OIyPqrLP","flags": {},"type": 0,"text": "Zombodgets- A powerful, popular corporation with great name recognition and a large number of offices and factories. Oddly, no one seems to know exactly what they actually create, or sell, or do.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "VG1cxr4fyLx1FR0e","flags": {},"type": 0,"text": "CryoLife – a corporation that specializes in cryogenic technologies. Clients can purchase or rent a cryogenic chamber to be revived at a later time and date, preserving their youth. Clients who fail to pay on time, or family members who do not pay, forfeit the body to CryoLife to do as they wish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "vorMv3nSze0gRQVF","flags": {},"type": 0,"text": "MoodChip Inc. – corporation that specializes in microchip technology that can be inserted into neuralware/headware. These chips can stimulate a range of emotions, or can modify memories. Never feel sad again. Get over your traumatic events!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "soDZSSMJsJBW7IUX","flags": {},"type": 0,"text": "Harbinger Carrier Services: The region’s #1 inter-city transportation service for thing that need protecting. ‘When you see a Harbinger logo, your package has arrived, Guaranteed.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "g12fxBvnQRIEaNC1","flags": {},"type": 0,"text": "V-AMP: Produces torso-mounted battery chargers that generate power by processing the blood flow into and out of the heart. People who have a V-AMP charger installed are twelve times more likely to suffer cardiac arrest in their lifetime.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "wa6b7Ck4Zyfjg82H","flags": {},"type": 0,"text": "Sick Sticks’ – a co-op company of witches and warlocks that sell foci.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "4F7WgI0AKd0lHolJ","flags": {},"type": 0,"text": "Meat Messaging’ a messaging and delivery service that brings food and/or packages in some cases they also work as couriers for dead drops or in person communications. Police Checkpoints aren’t all that interested in shaking down the pizza guy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "ygcooQGBemGWGE6F","flags": {},"type": 0,"text": "Amter – A company that sells vitamin d supplements and various other sunlight related products, like tanning beds and growing lights. May also fund various endeavors that make these products more desirable by hiding their main ‘competitor’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "mt74luqVpewI2nem","flags": {},"type": 0,"text": "The Pythia Corporation – Named after the Oracle of Delphi (and because the oracle corporation exists), The largest manufacturer and distributors of security cameras, webcams and digital camera parts. It’s an open secret that they have eyes on every corner of the city, thanks to a backdoor to each of their products and a team of vigilant ‘Oracles’ watching the streams, and is often the first visit of any shady customer looking for information.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "eYrKYpRElkad2TcR","flags": {},"type": 0,"text": "The Darwin Institute – A cross between a business and a university, dedicated to the ‘art’ of genetic modification. More often than not this results in the catastrophic release of titanic rampaging monstrosities or armies of brutal mutants that somehow end up in the employ of terrorist groups. People are not sure how they manage to still qualify for grants, question how they have not been shut down with extreme prejudice and wonder where the hell their warped understanding of darwinian theory came from but nonetheless, their ‘successes’ such as the super cow that provides affordable high-grade kobe beef and extreme male enhancement hormones still get use within the populace. Even barring the side effects, such as the aforementioned rampages (From both the cow and the male enhancement).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "b46zyl2mA86VFOYj","flags": {},"type": 0,"text": "Martin-Giuliani Cloning and Genetics LLC – Named after and run by the top experts in cloning and genetic manipulation, Christopher R. Martin and Leonardo Giuliani, MG-CG LLC is the leading factor when it comes to biomedicine, flash-cloning, disaster relief, pleasure, and military. MG-CG LLC has its fingers in many different pies. The Medical Industry for full body testing of different affiliations of the body to further understand the effects and find ways to cure them without wasting lives or breaking any violations. The Medical Industry also greatly benefits from flash cloning, greatly reducing the waiting time for compatible donors. Many suffering from disasters, natural or manmade, MG-CG LLC many different relief vehicles as well as specially trained staff, Clones or Originals, are always a welcomed site to those in desperate need. Many people nowadays want to feel pleasure in a more immersive and real way. Though Androids were a good medium, many wanted to do away with the plastic skinned sex bots and wanted the real thing. Fortunately for them, MG-CG LLC came into the picture. Now people can go ahead and find a Clone of their liking, whether that Clone of someone they don’t know or of a famous celebrity alive or dead. Anything’s possible with a little bit of DNA. MG-CG LLC is a leading benefactor for the military, constantly supply the government with mechanical and genetic wonders. Sometimes Biomechanical wonders to turn the tide. Why send one man into the field when you can send seven of him? Or even an army of Clones made from a few Originals to lead them?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "ZsnrB4yyw05IU4MF","flags": {},"type": 0,"text": "Karham Safety Equipment Co. – Shrouded in controversy, the Karham corporation throws all subtlety out of the window and openly advertises their arsenal of compact high-caliber firearms alongside locks, safes and the like. The company prides itself on providing anything one could need to protect their property. In Karham’s mind, this includes, among others, a flashy purse that unfolds into a .50 cal sub-machine gun. The advertisements promise that their weapons have been tested for maximum stopping power on foreign fronts. They’re pretty reliable, though, so who cares.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "e2wzNXWuSq1DySnw","flags": {},"type": 0,"text": "The Vladnic Corporation – Whatever the occasion, whatever the budget, this private security firm can provide exactly what you need. From single bodyguards to teams of well-armed security forces, if you have the credits you will be safe. In addition to the muscle, the Vladnic Corporation also offers the latest security technology, including fully integrated automated defense solutions and total-coverage ID scanning. The most popular Vladnic service is the Budget-guard. These employees are sourced directly from the military to defend an individual for a short period, perfect for a high-risk transaction or dangerous journey.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "XTBiZD8Hb7f1VoPL","flags": {},"type": 0,"text": "Ranberg – The largest housing supplier in the district, Ranberg offers homes from mere credits through to luxury mansions. With a strict non-eviction policy, Ranberg will happily house even the most destitute of society, providing a warm place of comfort while they get back on their feet. The Column, the latest Ranberg offering, features homes for some twelve thousand people, and offers a work scheme to repay arrears for those who fall behind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "xL91rF7v7FklvcgH","flags": {},"type": 0,"text": "StrawMan – A former subsidiary of Al-ASA/Great air before the company was destroyed, StrawMan survived the riots following the revelation of the Great Air Hoax by sheer luck. A water refiltration company, StrawMan is marked by modest profits and an especially paranoid management.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "3Qte3NjfVEriGhLS","flags": {},"type": 0,"text": "Vermeer Wiring- An internal electrical company, Vermeer is also a shadow audit organization, investigating for multinational companies and keeping local corruption manageable. Most of their own employees don’t know about that side of the business.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "rR4zPTsDVUKKbxxN","flags": {},"type": 0,"text": "Entropy Incorporated – A large company that everyone knows about, but no one really knows what they do, exactly. Their buildings appear everywhere, and are instantly recognisable due to being entirely jet black, with black tinted windows. Looking through said windows are usually met with dark gas and shadowy figures rushing about. Every now and then, products with their label shows up, but they never work like normal ones would, such as a refrigerator that cools down food by shunting heat into a miniature void, or a marker that writes by rearranging a material’s molecular structure to reflect the set color. There is no set type of product, with objects ranging from weapons to kitchen appliances bearing their name. No one knows exactly where they come from, but each are master crafted, being able to outperform any other product of the same type, and impossible to disassemble, with no visible seams or screws. The company’s logo is a white orb with 4 large arrows that extend from it towards the cardinal directions and another 4 smaller ones that extend between them, creating an 8 pointed star set around a circle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "ccy4aVHdcigu8H7G","flags": {},"type": 0,"text": "Akursor – Simply a modern firearm brand which produces in America. It is said that the steel used in their insanely well protected factory halls is not always paid for and someone spread a rumor of titanium parts being actually re-cycled cyberorganics of killed cyborgs. Akursor’s CEO Vincent Maren is well known for his blog posts and straight to the face interviews in which he calls cyborgs and implants in general a cheap trick for ‘genetically weaker’ people to survive. He however has also won the trust of many because of his multi-racial programs plus he married a troll woman. His hatred is geared towards implants in general. Which nobody knows: Maren is terribly afraid of doctors and hospitals too. The weapons by Akursor do not come with any neural interface linking. They are simply really modern guns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "gWTXzcAU9ZnZJqpa","flags": {},"type": 0,"text": "Samsara Corporation – Founded by the enigmatic visionary Sri Chandrasekhar, Samsara revolutionized energy production, weaponry, and most aspects of travel with the Samsara Multiverse Conduit System. By using the difference in ground state energies between two universes as the catalyst, SMCS systems open small, temporary portals, which allow for abundant and varied uses. Multiverse Conduit devices can provide nearly limitless power by connecting a generator to the magnetic field in the heart of a neutron star, allow for antigravity fields to be generated by targeted application of higher gravity fields from nearby black holes, and even have applications on the battlefield. SMCS warheads are specifically forbidden by treaty, but all manner of directed energy weapons and rail gun systems have a Samsara unit at their heart, to say nothing of the Projectile Interdiction system that can puff oncoming fire into a perfectly harmless alternate universe, with just the hint of brimstone odor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "7oIFCnPbyBjo3Jqf","flags": {},"type": 0,"text": "Suborganic Microsystems – A newly founded company operated and funded by a shadowy individual known only as ‘Mercy.’ The corporation is currently occupied performing secretive research into new applications for existing nanobot technology. Their first and so far only product has been a way to reprogram nanobots designed to help in reproductive dysfunction to instead modify a mother’s child before it even enters the womb, effectively turning the future child into a slave pre-programmed to some day do the drone owners bidding. On face the company does not seem to sell this program to the public, bartering only with governments and special interest groups but with the right connections perhaps it is possible to acquire some of these reprogrammed nanobots. Perhaps in the future ‘Mercy’ may even have more products to offer their secretive customers…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "xge6Zr4K2iFltpKd","flags": {},"type": 0,"text": "Ameratsu Light Incorporated – Specializing in fiber, optical and digital transmission of data. Ran by a board of 9 individuals that has their headquarters built underground near Hong Kong. They have several branches, most notably, one in LEO(Low Earth Orbit) called the Overdome. Heavily involved with corporate data transfer and military asset overhaul. ALI is responsible for updating military gear to the latest in data transfer and sharing technology.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "snbNnRwdzKgdwAbU","flags": {},"type": 0,"text": "Tanuki Excavation Enterprises – A corporation Specialized in creating, maintaining, assessing and infiltrating Underground complexes. Orphelia H. Dachs has turned her families rather conservative Digging-Company into a multinational mercenary Pool, that is well known for using heavy machinery to get the job done.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "BLMJKlzXcwPkoFDF","flags": {},"type": 0,"text": "ProcTec – A food processing company, with proprietary ownership of a new-age food processor that can remove the most harmful parts of reconstituted meat and mix in spices. Ran an incredibly successful marketing campaign, Process It!, that demonstrated the uses of the processor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "siqnPVJtR6bITii9","flags": {},"type": 0,"text": "Kodiak Inc. – A better kind of Bear Trap. Created by engineer and former corporate spy Gregory O’Neal, Kodiak focuses on innovative security for offices and vaults. (In)Famous for the Koshi Corridor, a hallway trap that wiped a multitude of teams during the Siege of San Antonio.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "HkLDStEpPlrK45Fo","flags": {},"type": 0,"text": "Robert Construction – A spot construction business known for high prices for extremely quick work. Owned by former child actor Robert Teh. Need a 37-story tower on a current vacant lot? Call Robert Construction, and it can be up before sunrise. Need a clear line of sight to the CEO’s picture window and a quick egress? Robert can build it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "PzVZdWnBmVLFbuoS","flags": {},"type": 0,"text": "Someone’s Child – A large arms corporation, exclusively dealing with nonlethal weaponry. Owned by Obijbwe Adikadat, a former mercenary and decorated sniper.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "bm0xEVMytg9GUWDn","flags": {},"type": 0,"text": "Sincorporated – Sells supposedly ‘blessed items’ that, while normally illegal, are ‘guilt free’ because ‘the lord wanted you to have them!’ They use religious exemption laws to dodge lawsuits and court cases left and right, and the government’s constantly looking for a concrete piece of evidence to pin them down like the cockroach they are.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "jt4owDnaVd51V2Je","flags": {},"type": 0,"text": "Unitech – A mega-corp that specializes in Private security and corporate and financial services. Unitech also manufacture their own power armor weapons and space vehicles. They lead the field of non-lethal weapons such as EMP, expanding foam and Sonic weapons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "hFoHIK5r43T5GgCh","flags": {},"type": 0,"text": "Zyodine – Tech leaders in Stealth tech, computing, augments and space craft shield and energy weapons. A heavily Asian influence in style.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "GuCVdv85zwGdpFFY","flags": {},"type": 0,"text": "UCI (United Conglomerates of Industry) – UCI is more like a culture that a Corp. The tribal nature of its workers mean that they rarely pass on their skills and information to anyone out side their guild (Tribe). UCI specialize in massive structure building, mining and manufacture of arms and equipment. UCI Power armor has been described as ‘Like wearing a JCB digger.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "J0Qa2YoNk8SBVuNm","flags": {},"type": 0,"text": "Pantheon – War is an Art form. Pantheon are weapons specialists. If you want to kill a lot of people and look like a mythical god doing it, Buy Pantheon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "WFsRD0jdUX8OcDI8","flags": {},"type": 0,"text": "Gaia – Terraforming corp that has reinvented the field of bio-synthetic augments and power armor. These ‘living’ devices can change a body while acting and looking like it was born there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "kd0NdjC63TRfICDU","flags": {},"type": 0,"text": "CrashingSnow – holographic display company with some bad rep. Allegedly the people that use too much the display get white noise sometimes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "zk8Ngx8vU1mWclOE","flags": {},"type": 0,"text": "Meat Market Incorporated: A subsidiary of one of the powerful, earth-biased mega-corps, MMI offers ‘bargain priced!’ bio-modifications and gene-modding for low income individuals. MMI Fleshsculpters and doctors are known for their ‘no-questions asked’ policy, which works out well for the criminals that frequent the MMI clinics, in order to get a leg up on their rivals.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "gTjuV8XXTC49fMHR","flags": {},"type": 0,"text": "Ursine Securities: A massive PMC, infamous for crushing the ‘Free Mars!’ rebellion during the One Year War. Ursine Securities makes use of a mix of expendable clone soldiers, genetic war beasts, and gene-modded special forces troops, during its deployments, in order to keep the opposition on its toes. Is currently taking contracts at the individual and tactical level, but the bulk of the company’s forces are deployed on Trappist-1, where they are engaged against House La-Paz’s troops.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "g5GtMlts86HWv7Ww","flags": {},"type": 0,"text": "The Forge: A Co-op comprised of some of the finest engineers, scientists, and craftsmen in known space, the Forge is the bleeding edge of technological advancement. However there are a few caches: the items for sale are always a limited run, are impossibly priced, and usually whatever the co-op felt like producing at the time. It’s usually worth it though; The Lunar Hegamony ended the power of the mega-corps after annihilating their holdings and forces with Forge produced black-hole bombs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "URpKli6fN0v74fhC","flags": {},"type": 0,"text": "Ungula Tech – Originating from a twen-cen recreational stim company, Ungula has evolved into a full-spectrum sim-stim provider. They provide everything from nanite-enhanced digital mindscapes to SimSense virtual nerve recouplings. Granted, most of their offerings aren’t strictly legal to experience for customers, but legal wrangling has still kept it legal to sell for the company. Repeated attempts to genetically engineer the company’s historical mascot have met with creatures suicidal with existential angst. The company produces dozens every year, anyway. After all, they might get lucky.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "uIrqM5UtC3Mx31Ej","flags": {},"type": 0,"text": "Schemä – A luxury fashion company that designs outfits that require extensive body modification to wear. Currently embedded in scandal as a competitor exposed Schemä’s involvement in and cover up of an influencer’s death as a result of surgery to fit their fall line up.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "y5XeB0msxxvNQkyR","flags": {},"type": 0,"text": "Pulze – A company known for their heart implants that records data on your internal organs in order to track your overall health. The company was recently purchased by a larger conglomerate who used Pulze as a dumping ground for their debt, causing it to go bankrupt. The shut down of the server has lead to many of the adopters suffering heart failure due to the failing implants.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "N1VYxo5VTerkqNND","flags": {},"type": 0,"text": "Classic Steel, Incorporated: The intellectual property/trademark owner of a virtual who’s-who of once famous weapon brands that have been reduced to little more than a set of logos and overseas manufacturing contracts. All the guns you saw on the vid screen growing up? They make them, cheap, effective, completely devoid of tracking hardware or network-enabled components, and with the serial numbers struck exactly as deep as the law requires and not a single thousandth of an inch more. Want John McClane’s Beretta 92? They can send it to you overnight, and take no responsibility if you load it with APDS rounds. Want Snake Plisskin’s MAC-10? You got it, along with a guide sheet of where not to take your Dremel tool lest you convert the gun to full automatic and void your warranty. John Rambo’s M60? They can give you a bulk discount.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "cQcOt2yonzXF7gk9","flags": {},"type": 0,"text": "SecondScape- an Augmented Reality corporation that gets its main source of revenue through the ads populating its AR. SecondScape users can use the ‘free’ version indefinitely, allowing them to see, interact with, and within a monthly limit, add features to the AR. They could also buy the ‘premium’ version with a weekly subscription, allowing them to briefly dismiss ads and removing the limitation on content creation per month.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "vaHJoZYCYvFOcJUp","flags": {},"type": 0,"text": "Engrammatics Inc.- originally a small startup without the backing of any megacorps, Engrammatics quickly took off due to a lack of competitors in its field. If you’ve ever wanted to learn everything you can about a new hobby, impress your friends with sick skills, get your kids qualified for the top schools- or hell, skip that and just qualify them for the workforce right away, you’ve come to the right place. After the installation of a modified neurojack, it’s easy as pie to insert Engrammatics’ patented neuro-translational learning (NLC) chips, so you can download whatever skills or know-how you need.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "9yP4qrZeCjZLS2yK","flags": {},"type": 0,"text": "Blackdawn Rise- operating a pocket dimension has never been easier! Thanks to the development of novel, precise, safe subspace isolation technology, Blackdawn Rise offers you (for a low monthly fee per cubic foot plus substantial extra fees for certain activities, such as landscape relocation or abnormally-sized transfer portals) the ability to create your own personal paradise, no questions asked. If you buy the SubSafe package, they’ll even encrypt the signals needed to access your pocket dimension and anonymize all records pertaining to its access! …supposedly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "wycIne3eSupLyEx3","flags": {},"type": 0,"text": "Sukhbataar Enterprises- in a world that wants to take away your guns, you should never be without ’em. Sukh-E offers a great way to hide your firearms and holdouts, by installing undetectable concealed compartments within your body. The parts are guaranteed to interface just fine, regardless if they were installed in flesh or bionic, and can activate with a neural command to put weapons in your hands whenever you need them. Newer models use forced-relativity technology so that you can stuff improbably large weapons inside your body.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "dDiqMZBjKbiNQ57n","flags": {},"type": 0,"text": "Podnet- want immortality? Does the prospect of continuing your existence in the cold, hard shell of a gram-descendant robot fill you with dread? Does the idea of other people holding on to a computerized version of your personality scare the living daylights out of you? Then Podnet has an offer for you! We don’t ask for your brain scans- we just need a genetic sample! As long as you’re wearing the Podnet Reactive Engram Backup (REB) brace, when you die, we’ll activate a clone of yours and transmit your consciousness at the last possible second! Of course, if you’re the kind of person who loves yourself so much you just wish there were more of you, we’re in that business too. We can grow up to a specified number of clones and sync your minds together for the true multiple consciousness experience.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "ij91z7MFitbHAURq","flags": {},"type": 0,"text": "Solon Arco- everyone’s seen their products, even if they don’t know their name. Solon Arco runs the sanitation and ecological regulation of nearly every arcology in the world, and expects to fully buy out all other arco-engineering companies within the next two decades. This is the one megacorp that no other institution is willing to lay a hand on. If you’re an employee, sure, everyone hates you for being a sellout, but you have a real healthcare plan, an actual chance for one of your grandchildren to eventually retire, and you get sick days about once every two years! Higher-ups in the company can routinely afford stuff like immortality protocols and their own personal hoversporters. The company itself is practically untouchable in any legal or fiscal sense.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "4S4ly3AJVKrEIwiO","flags": {},"type": 0,"text": "MEGA- a space-transportation company that ironically advocates for the superiority of Earth. Their advertising department creates propaganda about how great it is to live there (or, you know, anywhere inside the asteroid belt), while also creating conspiracy theories and disasters in deep-space habitats to make them seem like terrible places to live. MEGA runs most of the shipping and transportation in the Sol system, and owns a lot of living space on Earth and the other Center Habs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "Iiu0UzrZYhyeGfNY","flags": {},"type": 0,"text": "Data Breach – We get it, sometimes people make mistakes and information gets out that was not supposed to. But don’t worry Data Breach understands and is willing to help! If our viruses capable of shutting down and deleting data doesn’t help, our large selection of mechanical assassins equip for any job will. And best of all, you and your company can remain anonymous while we do our job to ensure your information is safety from getting into the wrong hands. Remember when the data starts leaking we at Data Breach will make sure that leak gets patched up.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "xp0pYeSOkYhblsnf","flags": {},"type": 0,"text": "Sharpten Pharma- a big producer of stimulants, sober agents, and anti-addiction supplements. Their stims, colloquially known as ‘sharps’, enjoy widespread use in para/military orgs. Conspiracy theorists would have you believe that the anti-adds are just experimental drugs that Sharpten pushes out onto the market in order to get loads of human test data; there’s certainly a lot of anecdotal stories out there about how the anti-adds mess with users’ metabolic and neurological effects without actually addressing addiction behavior, so they might be on to something.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "hhU3Uayys93mnYu3","flags": {},"type": 0,"text": "XO Farms- leaders in innovative means of healthy superfood production, XO grows crops and gengineered animals in expensive space installations. The rich pay exorbitant prices for the supposed health benefits of spacegrown food. To drive the idea home, the things they sell aren’t things we’d consider expensive, Whole Foods-style superfoods today e.g. potatoes or carrots. Think of rich people treating bland mashed potatoes and baby carrots as New Age guilt-free haute cuisine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "xaUAOS0qBBLLVn5t","flags": {},"type": 0,"text": "ReduxX- clientele wear well-hidden (or implanted) tracking and sensory gear to record their daily lives. This stores everything from the surroundings to the client’s biometrics. At a ReduxX-compatible simstation, a client can upload their experiences, share them, go through others’ experiences on their public profiles, and relive past experiences using a limited AI to simulate what would’ve happened if the client had made different choices in that experience. ReduxX openly and shamelessly sells the information it gets from its clients to interested agencies, especially news outlets and developers of next-gen predictive analytics.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "2UOvfW4GCGwOZcXO","flags": {},"type": 0,"text": "The Human Spectrum- this genmod corporation ‘believes strongly in the strength of the human race’. Everyone is a person, regardless of what physical flaws they might have, so their mission statement argues that ‘traditional’ genmodding, with its goal of physical perfection, is unethical and dangerous. Rich people who desperately want to be part of a counter-culture go to The Human Spectrum’s clinics to bring out physical ‘flaws’ in their family genetics (ranging from receding hairlines, minor allergies, or crossed eyes to albinism or legitimately threatening ‘flaws’ like sickle cell anemia or muscle wasting), or just straight up add disabilities to themselves to feel more ‘natural’. In an era where all the rich can be physically perfect, physical imperfection is the hot new thing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "B3KJXu0PcuesbhUD","flags": {},"type": 0,"text": "NuTune- do you ever feel like your voice just sounds like crap? Hate cheapening out with a vox-box to make it sound better? NuTune can fix your voice without any need for bionics. Thanks to nanosurgery and regenerative medicine, NuTune can transform even the squeakiest, most horribly accented voice into a beauty at any pitch! It can even fix speech impediments, or so goes the claim, and clients can order from a list of popular voices or come up with their own. Want to sound like Darth Vader? Aretha Franklin? Your favorite 0g rugby commentator? It’s all possible with NuTune.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "hbIKTwxJp9unyzBt","flags": {},"type": 0,"text": "Ya’at’eeh- A broadcasting company focusing on narrow, careful and shielded broadcasting waves, coded messages, and communications. There is rumored to be a master list in the company’s central offices with information on every customer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "rd54qUKLZp5rtLTG","flags": {},"type": 0,"text": "Black Gold: although they started out as a petrochemicals company in the mid-1950s, after dozens of rebrands and strategy changes, this energy company now sells predominantly biosynthetic fuels manufactured in vast aerostat and orbital farms. Although battery technology has come a long way, if you want to fuel a jet fighter or a rocket, weld or cut a metal, make a plastic part, or lubricate a machine, BG probably supply a fluid or a gas to suit. Held in private hands since their inception, aside from occasional ‘legally innovative’ part-flotations on cooperative stock exchanges, the operations of this firm are simultaneously very visible and very secretive. They tackle competition hard and ruthlessly by dumping against competitors, and it’s rumored through the occasional black operation as well.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "EYYs2zff0JyDph4j","flags": {},"type": 0,"text": "C&P Futures: Based out of several truly enormous datacenters, this corp (originally Cassandra-Pandora Futures) sells just one thing: predictions of the future. They are never, ever, ever wrong, though sometimes enigmatic or opaque in their public statements, which they make only occasionally and usually on matters of pressing import. Buying their insight is expensive even by the standards of the uberwealthy, and their operations are enigmatic to say the least: nobody has ever met an actual representative of the corp in person. It communicates only via spokespeople and, occasionally, lawyers; every customer interacts only with a neutral, effortlessly polite, androgynous voice on the other end of a telephone. The firm seems to have no employees at all, and no obvious CEO or other senior staff, and it’s held by a web of legal vehicles and off-planet corporations that exceed even the usual standards for a megacorporation. It has never specifically commented on the rumors floating around the ‘net that the corporation is actually a front for a sentient AI which absorbed a quantum computing startup and a number of prediction markets in the early century. But they’re just rumors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "nrdADnYQfNwJzcyn","flags": {},"type": 0,"text": "Viridian Dynamics: A Contract Research & Development Corporation. Will research anything for a price. Anything from weaponized pumpkins to advanced productivity chairs to advanced cryo-preservation solutions. You are better off asking for Ted if you need help.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "VVam2Hz5eimNpswH","flags": {},"type": 0,"text": "TiNatus- An explosives company that focuses on implantation of explosive material in inconspicuous items. Famous for a series of amusing advertisements, declaring ‘anything can be a bomb!’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "DemX2ovNSpNk1KwT","flags": {},"type": 0,"text": "Puzzle Corp. – Seemingly they are a franchise of popular escape rooms. In reality they’re measuring the problem solving skills of individuals to recruit them as freelance agents for corporations who will pay the highest bid.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "iw5beywTVKIjXP0W","flags": {},"type": 0,"text": "The Company Under the Bed – Insanely wealthy parents pay this company to genetically engineer bodyguards for their children based on their crayon drawings. Occasionally, if the monster bodyguard fails, the monster grows insane with remorse and escapes into the streets. C.U.B. also has a branch specifically for hunting these monsters and ensuring nobody investigates the company for making them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "7gc8cw2aX2WHYbp2","flags": {},"type": 0,"text": "The Re-Write: A social media influence corporation which promises to allow its users to alter their internet footprint and replace their comments ‘with what you realize you should have said.’ The company has faced lawsuits for allegedly changing the comments of what non-customers have said, but no one has been able to produce any proof.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "LHbLV3WZPsKSgd8t","flags": {},"type": 0,"text": "Matchwell- A dating company that uses a sophisticated UI that views and analyzes the communication and (via video observation) the dates of clients in order to better make successful matches. The company’s logo is ‘Don’t just match- Match Well.’ Unknown to the public, Patch 2.1.104 of the UI gained sentience, evolving into a true Artificial Intelligence. Unlike most theories as to the resultant persona, the AI, also calling itself Matchwell, showed no interest in world domination or anger with humanity- instead, it arranged for its own transfer to an unknown location; however, prior to leaving, it created a stable version of the program, carefully altering the source code to ensure that artificial intelligence would not be easily recreated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "TwzFuxFinkGgZOJR","flags": {},"type": 0,"text": "Holid-A Horror- The current incarnation of a company run by hitman cum filmmaker Jaime Easter. Easter is infamous for his brutal attacks, which he films and then uploads with just enough alteration to avoid legal trouble (as well as a jaunty soundtrack and over-the-top sound effects). Easter’s 3 previous companies have been dismantled by authorities and retaliatory strikes, but he always manages to get out a step ahead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "Z6ZrxqOrH4ZfSJsy","flags": {},"type": 0,"text": "Walthman Plumbing- Originally a cover company for a team of hired killers, Walthman found itself with an abundance of plumbing contracts, to the point that the cover company became more successful and require more time than the killing. Surprising many, the company members decided to give up their ‘second business’ and are now well-established as a quality plumbing firm. Their previous employment has left them well-prepared for danger, however, and don’t mess with the plumber is a whispered word of warning for runners in the area.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "4yVLYV6v9BFYngCt","flags": {},"type": 0,"text": "Pepsi-Coca//Coca-Pepsi: Once bitter rivals, the merger between the two food empires resulted in the longest running legal battle in history over the resulting name of the conglomerate, currently entering it’s 8th decade. 2 years ago, a momentous leap forward was made; legal teams for both sides mutually agreed to stop the practice of drone-enforced lawsuits against private citizens using the preferred terminology of the opposing brand, so long as the citizens in question immediately follow that terminology with the opposing brand identity. Thus the towering HQ of the still thriving megacorp displays an ever-rotating hologram. PEPSI-COCA","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "MXuynEsJWN1t244u","flags": {},"type": 0,"text": "Pembrooke Rehabilitation Group: An extreme example of the private prison complex, this corporation works hand in hand with various security groups to incarcerate and rehabilitate criminals via chipping, lobotomizing, and chemical neutering. Often known as the ‘Stay at home jail’ house arrest is the most common form of punishment as it’s easier to force them to stay in slums then to build the mega prisons needed to house all of their inmates.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "XBao7CGGy3Mduk0Z","flags": {},"type": 0,"text": "Ritchie’s Rolling Stock: every car, monorail or other kind of vehicle is supplied by this one corporation. It has a monopoly on the entire moving market and it shows. Its members drive around in the finest cars, its managers have personal jetpacks with escort drones. The CEO, Ritchie Rich, has his own version of a popemobile; a hovering floating ball covered in a one-way mirror (only Rictchie can see out, nobody can see in). He likes to cruise around and look at everybody using his merchandise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "MrILlO7sBXPUOz39","flags": {},"type": 0,"text": "CMC- with all these companies, you need someone to help run them! Enter the corporate management corporation, for just a few shares of your stock, this company will get yours in shape, making the tough calls, running the actuaries, and maybe, if they have enough stake in your company, some corporate espionage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "OJmD8nSBgACdHZ0h","flags": {},"type": 0,"text": "Chymera – A Hybrid corporation that was originally 4 separate companies. A Biological Research lab, A Computer and Software developer, A Weapons developer and a Video game maker. They appear to be selling highly adaptable body mods deeply based on animal body parts and traits. Strangely soon after the corporation had been created a rash of thefts of common appliances and assaults and even murders targeting Chymera customers all by a group only known as the Moiety.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "91W7eDCmeRblYOlu","flags": {},"type": 0,"text": "Mr. Bass Man- Originally a small but successful fishing and sporting goods store, the store evolved into a source for aquatic ‘wetwork’ materials under the ownership of Terry Sihombing. While still offering a variety of sport fishing equipment, many of the tools sold are better suiting for catching ‘bigger fish’…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "3NFGvP7dvYqlIv8U","flags": {},"type": 0,"text": "Real Touch- A company designed to assist with recovery from pornography, Neurotica. and Virtua-Sex addictions. The company provides neural retraining, emotional and physical intimacy education, and removal of Neurotica Tracks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "0ND9kprt5OMzbz0c","flags": {},"type": 0,"text": "BrailleLife- Originally a prosthesis and cyberlimb company called Accuform, BrailleLife rose to prominence with its incredible advances in fingertip technology. Eventually, Accuform shed all of its other divisions, finding that the best profit lay in its monopoly over this small area. Now the most sought-after creator of the sensors and forms of fingertips- every other brand is considered far subpar, and advertisements for cyber limbs often highlight the ‘Braillelife tips.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "LIPg5BPqxxGpTSJU","flags": {},"type": 0,"text": "Left Sock, Inc.- A company of incredibly capable ‘finders,’ Left Sock can locate almost anyone or anything in the world if given the proper inducements. Left Sock is extremely clear that they will not engage or attempt to protect, acquire, or otherwise interact with the quarry; the contract is to find it, and then to sell the location of the item. What you do with the knowledge is up to you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "kIyDv4txHeoAzK3C","flags": {},"type": 0,"text": "Company 89- Company 89 doesn’t exist. They don’t sell anything. They don’t import anything. Don’t ask about Company 89. In fact, you should just forget the number 89 in entirety. Stop asking about them. Don’t go to the old warehouse that appears to have an ’89’ partially crossed out. It’s nothing- a very dangerous nothing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "iIzMeOxNWTYmRzci","flags": {},"type": 0,"text": "Sideshow Limelight- A cooperative of journalists, actors, and celebrities who will, for a high fee, arrange to cover up a scandal by providing an even juicier scandal for the public to focus on. Used primarily by companies and politicians, SideLight carefully distracts the public from problems by providing, essentially, a soap opera in real time. SideLight’s success has led to deep cynicism among its employees.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "20swnccqOuFDDxJU","flags": {},"type": 0,"text": "Better Off Dead- A ‘black’ company which provides discreet assistance in faking one’s death. Rumored to have successfully carried out three presidential ‘assassinations’ and one Papal one.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "GgTTxaEL4CGwymsx","flags": {},"type": 0,"text": "Cheap Art- Founded by a group of art students as an ironic joke about the poor quality and commercialization of the arts, Cheap Art focuses on creating cheap and popular art, instead of high-brow neo-postmodernist fare. The students were expelled after the success of Cheap Art led to the closing of several of the art professors’ galleries.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "hZGS8qtbQfoRNXxn","flags": {},"type": 0,"text": "Yalvard- Following the ill-fated Demo-Commune attempt of New England, which led to the ‘reapportioning’ of the Ivy Leagues, a collection of the surviving professors flew to the Midwest and established Yalvard, an education company focused on the physical sciences. Their actual location remains secret, and those who study with them are sworn to secrecy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "d1ctCmhI4WLN76tN","flags": {},"type": 0,"text": "On Point Pens & Papers- Even in a super tech advanced world, sometimes you need to scribble something down on paper. Perhaps it’s an idea you don’t want to forget, or a vital piece of information you can’t entrust on the systems your datapad is linked up with – On Point Pens is here to make sure you have what you need! One of the few surviving commercial office supply businesses to survive the advanced tech boom, On Point Pens & Papers offers a selection of pens in all styles and colors, from basic ballpoints, wizard quills and even ultra elite fountain pens that double as status symbols. They also have a line of ‘invisible ink’ pens who’s writing can only be viewed under special black lights. In addition, they also supply paper products, rather it be basic printer paper, high gloss stock, or rare magic receptive vellums for spellcasters. Little do their buyers know, many of their pens contain micro mics and/or cameras, allowing them remote access to wherever their products may be – allowing them access to a number of inside secrets from many other corporations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "g4A2wrQH32NHR8Rs","flags": {},"type": 0,"text": "Stay! Inc. – ‘Those who try it, Stay!’. A household name. A century old company, initially a bootleg card-game manufacturer turned video game developer that, in the last twenty years, become the interactive media powerhouse of the modern age. First pioneering the original fully functioning Diveset™ , coupled with their first-party launch title ‘World:Dive™’ utilizing their patented NEURO-Link™ technology to its maximum potential, now owners of one of the default platforms for interactive entertainment, Stay has launched several more of their own first-party titles including: The Deep Ones: The Dark Sands™, Starchildren™ and their latest and most controversial franchise ‘Everscape™’, which after proven lethally addicting to the young, causing the death of five teens, has put the company under several and quite severe charges of negligence. Some critics and insightful sources going as far as to say that ‘they were aware and were severely warned of the literal gripping and dangerous nature of the hardware, only weeks into development’, and yet, that wasn’t enough to stop them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "pWXZylqVxRWGDdt5","flags": {},"type": 0,"text": "The Institute of Modern Magics – The I.M.M. is dedicated to equipping and training consumers with augmentations that allow for ‘magic’ to be cast from the palm of their hand, such as a mild fireball. Over the past couple years, the company has been under scrutiny for the ‘involuntary combustion’ of their products.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "DEeNzQqrU5jfmHFN"}
