{"name": "Angels and Their Descriptions","description": "One hundred different Angels and Saints that can join your players in the fight against evil.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "woQEzi3AXpPNmzuN","flags": {},"type": 0,"text": "Grandmother Sophis – An elegant angel with silvery hair and a twisted silver cane. She can with a touch of her cane take the years from someone, returning them to youth, childhood, or even infancy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "vM9jDDR4dPlpNy3A","flags": {},"type": 0,"text": "Yason – A simple healer for a higher deity, often depicted in common clothes. Rumored to not be an angel at all, just a gifted and devoted healer for the people. He is depicted throughout history, his most noteworthy description being his angelic eyes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "cTa8qCxo6JOSnF4r","flags": {},"type": 0,"text": "Calvus – The bald healer. He heals those who are gravely ill and often leaves them bald as a result of being saved. He is depicted as a bald man often wearing a mask covering his nose and mouth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "GCVLfdwH68gU2vu2","flags": {},"type": 0,"text": "Matityahu – Defender of the innocent. Those that prey upon innocent children live in fear of Matityahu. As far as vengeful angels go, he is one of the more “creative” when it comes to his punishments.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "sLuI1au42huu7ZAq","flags": {},"type": 0,"text": "Amarylyth of the Golden Webs – Keeper of Celestial Spiders, she rides a giant white Tarantula. She cares for creeping things throughout the planes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "njEHZLnzYjH9FBFx","flags": {},"type": 0,"text": "Oswald, Keeper of the Celestial Inn – A plump, smiling Angel with a balding head and a scruff of beard. Oswald appears to good people caught outside at night and brings them to a comfortable shelter. In the morning, the shelter is gone, but their wounds are healed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "vd8zL1q33tKTH7Di","flags": {},"type": 0,"text": "Gideonhi the Great – Man, this angel is cool. No one knows exactly WHAT he does, but everyone knows he is awesome. Women want him, men and monsters want to be him. Devils are risen by his shadow falling across them. He, among other things, has invented sunglasses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "kovou5cHfC4XHhCn","flags": {},"type": 0,"text": "Nephijah the Leveller – An angel with a powerful voice that commands the earth, shaping mountains and valleys according to his will.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "oODRouGTkgfOOfxH","flags": {},"type": 0,"text": "Lysso – seeker in the darkness. His lamp literally lights the way to heaven.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "eF4DkmOdLDav00Ld","flags": {},"type": 0,"text": "Tooriel the Blind- A tall, beautiful angel with an eyemask of pure gold. She speaks only in whispers, but spreads hope to all who hear her.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "NloRNFGpg4kqs3Iu","flags": {},"type": 0,"text": "Loriel – an angel that take specific interest in helping collectors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "GmBzOQrHAvZvx5et","flags": {},"type": 0,"text": "Danuevel the Innocent – An angel in the form of a very young girl with giant blue eyes. She comes to protect those who are about to lose belief in goodness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "aH3JAl5cRmRAC8V9","flags": {},"type": 0,"text": "Sanet the Rainmaker – Ender of droughts and other natural calamities. A soft rain follows wherever she goes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "j5Dya3EFf4ct4OvR","flags": {},"type": 0,"text": "Thayban – This elderly but exuberant being watches over those who are old of age but will not pass on due to a sense of duty or unfinshed business. He sometimes appears to those he watches over in times of need to give encouragement or aid. His appearance is that of a decrepit and hunched old human with a long white beard and a few wisps of hair left on his spotted scalp but wearing shinning and new ornate armor that one might see on a rich, young, battle mage with a long sword in one hand and a mysterious sheet of cloth in the other.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "xN5WWSj5WP23GadX","flags": {},"type": 0,"text": "Aulonauvimariousunetarom – A lonely and infrequently contacted angel who can be summoned by speaking his name–but only if pronounced perfectly the first time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "Ibmd8M1j35uvm8wX","flags": {},"type": 0,"text": "Insidiis – The angel of secrets and spying. Hears all whispers, no matter how covert. Willing to sell the information for servitude and favors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "E6PWbtazoGk9fut7","flags": {},"type": 0,"text": "Vinnas, Angel of Foresight – 5’4″ with short dark hair and a small round face, glasses, disgustingly well muscled, huge shoulders, no neck. Short man syndrome in full effect. Will talk seriously and purposefully about subject at hand, but will 100% fight you if you make cracks about his height. You don’t even know, seriously bro, he’ll mess you up, he’s crazy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "omcGbsg4DBM9YABm","flags": {},"type": 0,"text": "Gorry the Portraiter – A slim and quiet angel who visits artists and muses. Anyone who has been in his presence has truesight for a week; in addition, they see people as they are inside (their emotions and character).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "sGbRKfJoTlyIWpcL","flags": {},"type": 0,"text": "The Kaon – An angelic judge who hunts for the souls of the damned on Earth, The Kaon appears as a shadowy, winged figure with piercing golden eyes. It remains silent while ‘on the hunt’ and speaks in a dull whisper when it must.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "c0jELhaclEAf0Idj","flags": {},"type": 0,"text": "Audelfais – Audelfais is an angel who wanders the earth providing a helping hand to those souls on the cusp of turning to darkness- It uses whatever form would work best to turn back the tide- a childhood friend, a wise mentor, a helpful stranger. In it’s natural form Audelfais is a glowing, amber-colored angel with an owl’s wings.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "qL2o8C2AGavkZm8q","flags": {},"type": 0,"text": "Esephan – A proud angel-warrior with a long list of deeds, Esephan guards sacred sites from infernal or abyssal intrusions- Esephan relishes fighting devils and demons, but has never raised his blade against a mortal, and has made an oath to protect all mortals from harm. Esephan appears as a gold-armored humanoid with pale blue skin, with no wings.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "BiNxap6V15ax9FYw","flags": {},"type": 0,"text": "Aziraphale – the Guardian of the Eastern Gate who failed at his task. Now he’s a bookish nerd.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "koNWB0oOxF38QEIA","flags": {},"type": 0,"text": "Prevalet of the Harvest – Wherever she steps, wheat and corn stalks, grapevines, and blueberry brambles spring up. She wears a cloak the color of November and carries a cornucopia.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "6Oo05SFkHWHug1mi","flags": {},"type": 0,"text": "Harold – A very awkward angel who’s not exactly good at battle. He was cast down to the Material Plane when a prophecy was revealed that he will one day destroy the world. He is Harold of the End Times, and he has decided to fulfill his destiny.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "hq20WKsY5sOZuty4","flags": {},"type": 0,"text": "Haldrin – An angel with a strong bent on removing any type of demonic kind or demonic touched places. Tieflings are frequently targeted by him, as well as anyone who even speaks with demons and devils.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "kEEP3Cjrd8LFYCDy","flags": {},"type": 0,"text": "Goriel – The Angel of Combat, who is always willing to challenge worthy opponents and try to encourage them to aid the cause of good by bringing out their fighting spirit; AKA “He Who Finds Friends In Defeat”.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "nRoO9R8YGXfyNIH4","flags": {},"type": 0,"text": "Triel – An angel with three heads; the left one watches for evil, the right one listens for evil, and the center one warns people of evil. Can appear as triplets, or as a man with a hawk on one shoulder and a bat on the other.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "GEhIXdeAYmxEB524","flags": {},"type": 0,"text": "Fluteias – The Angel of Joyous Celebration, who uplifts the people spirits in the darkest of times.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "Ybtl9CNcPNoF2Wnk","flags": {},"type": 0,"text": "Remias – The Angel of Cooking. Is often at odds with demons/devils that invoke gluttony in people.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "sS6ZYrXSwa8jJWZ9","flags": {},"type": 0,"text": "Crandor – The Angel of Sarcasm. Really.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "xGwFBnhZ2koBt8c3","flags": {},"type": 0,"text": "Loquitor – Not a name, but a title; the Speaker For the Accused. An angel in this role appears dressed all in white robes, with a golden hood and mask. The Loquitor appears when courts in good-aligned cities, or angels themselves, seek wrongfully to punish an innocent either by accident or out of misplaced devotion. A Loquitor’s appearance is not guaranteed, but such a manifestation is usually enough for immediate acquittal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "hhEfMizwYVD1oedU","flags": {},"type": 0,"text": "Kairm Alluveia – Angel of the Peaceful Sunrise. Appears as a humble shepherd and assists early morning travellers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "QEshFyuneWExV3lG","flags": {},"type": 0,"text": "Sassanah – Angel of Midwives. An older, kindly angel with a permanent stoop, except when someone threatens a child in her presence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "7x20h6teaWtECm7u","flags": {},"type": 0,"text": "Asfradon the Risen – A Redeemed Devil, Asfradon’s otherwise blemishless countenance is scarred by a deep burn on one cheek. He seeks to bring redemptive light to lost souls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "ozYKPIcGXpXrLrbP","flags": {},"type": 0,"text": "Direaea of the Battle Hymn – A martial angel who strides into battle with a joyous song on her lips. She seeks glorious war.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "cEMk9Hb9jcvK29eG","flags": {},"type": 0,"text": "Kindlefret – Gnomish name for Angel of Warmth, who lights winter days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "0toqH2WRYs3w3x7F","flags": {},"type": 0,"text": "Eska, Angel of Lost Time – her kiss can un-petrify a subject but her true power is being able to transfer the curse to another person and sending people back in time. Her shield has a gorgon head emblazoned on it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "DFymkjMxLACB0kYN","flags": {},"type": 0,"text": "Ryllith, Angel of Hell’s Laughter – her full plate armor stained black and red. Trails of smoke and red lightning match her fury. If it’s demonic she will not stop until she sends it back herself. Her wards and holy fire are the equivalent of an atom bomb down below and are feared for good reason. Sworn to silence, her sword does the talking for her.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "a8epmJgvKm9A5ZFL","flags": {},"type": 0,"text": "Kel, Angel of Bindings – she’s a legendary healer, but she’s also renowned for trapping some of Hell’s finest warriors. She is the only known smith of angelic soulstones. Her voice has a hypnotic and soothing quality to it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "tcovxCgeRpbDP1VZ","flags": {},"type": 0,"text": "Mordellico, the Taker: He visits battlefields, plague stricken cities, and areas of mass death. He searches for those who show great bravery in the face of their suffering and guides them to his realm. The reason why he takes these souls are as varied as those he chooses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "B374zUBVJf3hOWIY","flags": {},"type": 0,"text": "Draisrael, The Ever-Watcher – The protector of the weak, the voice of the silent. Will be compelled to act when he sees an act of great injustice or undeserved suffering. Appears as extremely tall man with striking ice blue eyes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "GBqtHxcdSDzIIybT","flags": {},"type": 0,"text": "Cendareil, The Witness – A female angel who represents truth and justice. Courts in some lands are built in her name, however she will appear to help only those in the greatest need. Can only speak the truth, no matter how it will affect the situation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "JMjyoVthcFa3kwaF","flags": {},"type": 0,"text": "Aurelia – an angel with bright red hair, slender musculous body clad in gilded armor, using a silver encrusted two handed freatsword she is a deity from another plane where the whole world is a big city, where she is the war leader of one of the factions there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "I5JC3aLcLBF5yoN0","flags": {},"type": 0,"text": "Alita – an angel from another plane of existence. Her body was destroyed by evil so her “father” has made a mechanical one for her. Shes a cyborg now and out for vengeance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "o4NI4mojWk4P8KLo","flags": {},"type": 0,"text": "Hephalia – an angel so beautiful and lovely, most mistaken her for a goddess at first. She is the bringer of love and fertility, with a harp of pure gold and a voice where even the hearts of demons can be melted.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "TIVTcGcyg5jgzqYT","flags": {},"type": 0,"text": "Ellandria – an angel with red tipped feathers on her wings, carrying a white staff made from the Horn of a high ranking demon, she is called upon when higher demons wreck havoc on planes of the mortals.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "DFknrfsCfZXWSzvT","flags": {},"type": 0,"text": "Rashgana – The great armorer of Heaven. An expert enchanter and forge master, his art is unmatched. Some armor is known even to heal itself and it’s owner over time. His great hammer never ceases.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "j6RbfycidEtfZwiH","flags": {},"type": 0,"text": "Xadriana – A beautiful muse, she inspires all creation in her own subtle way. However, she is very shy and slow to anger. Her bare knuckles can crack a mountain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "xWo9Z5BVlD44AXHO","flags": {},"type": 0,"text": "Jorada: Angel of the Storms – always helping mortals in the ocean, he can usually be found leading ships through a hurricane or nursing an injured kraken. Capricious as the sea herself he fights with nets and twin tridents.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "XnxJFB3vpdajy8Cg","flags": {},"type": 0,"text": "Trumdilium, Angel of Humor and Humility – Self deprecating, funny and sweet. Often hums to himself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "6DaQG4LIh8P0sGbS","flags": {},"type": 0,"text": "Delephian the Rainbow Walker – A great Angel of Creation who makes colors more vibrant by being near them. She is the muse of many great artists.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "Eq48M0i65p4q0ZEG","flags": {},"type": 0,"text": "Gatomen – Angel of Marriage and Joyous Intimacy – Believes that all can be brought to realize there is more joy in good than evil. Hates brothels and must be constrained from attacking them on sight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "ifovp32HEPfZUVC9","flags": {},"type": 0,"text": "Acedius: Angel of Stoicism – Appears to those in need of a reason to set aside their emotions and focus on the task at hand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "GvOIEtX2oCb5EVql","flags": {},"type": 0,"text": "Deici: Angel of Indecision – Appears to those who are brash in their decision-making, in order to show them it is virtuous to think things through.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "SLa5OSLYfrk8biMI","flags": {},"type": 0,"text": "Xalus: Angel of Silence and Serenity – Appears to those who need to keep it down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "1EPwyc5WXf9a9r2K","flags": {},"type": 0,"text": "Rakdeus, Tabaxi angel of cats, large and small. He is on a mission to teach all the joys of simple pleasures, such as lying in the sun.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "N559QvLlGf91fpEb","flags": {},"type": 0,"text": "Latia the Washer – She visits the clearest of waters cleaning the undesirables of the world. Her cleaning ends addictions, can heal the mentally afflicted, and loft curses. She never speaks and never turns anyone away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "UFO6XptUWRD8in1F","flags": {},"type": 0,"text": "Supratmi, Angel of Blades – Metal-winged Lady of Knives and Swords.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "lHEle12VhOK35sP8","flags": {},"type": 0,"text": "Hustifan, Caller of Warning – Angel with a clarion, who comes to spread the alarm when enemies threaten.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "6SSVGvLUnFbIWeIb","flags": {},"type": 0,"text": "Satchmigal, Declarer of Kings – Angel with a herald trumpet, who comes to mark auspicious events and divine signs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "y6wW4B0DXDi1DPnN","flags": {},"type": 0,"text": "Bonidor, Sounder of the Rally – Angel with large war horn, who comes to change the tide of battle and restore hope. If Hustifan, Satchmigal and Bonidor appear together, their horns in unison can flatten cities, level mountains, and put whole armies to flight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "VWnImAhFkxeE2u9p","flags": {},"type": 0,"text": "Behevel, Lady of Regret – Angel who helps those who seek to right long-remembered sins.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "mcFSHRQkQMDx9ObQ","flags": {},"type": 0,"text": "Swon Tealtearer – Angel who seeks constantly to prevent the rise of Blue Dragon-Green Dragon offspring.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "yqRMHgJzu5VxLykh","flags": {},"type": 0,"text": "Nichtenghall – Angel of lost paths. Appears in areas where will o’ the wisps gather, puts them to flight, and guides lost travellers to safe ground.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "tVmTg8VneVGBZjSQ","flags": {},"type": 0,"text": "Hyanos, The Dreamer – This Angel aids those who suffer from Night Terrors/Nightmares and grants them a peaceful rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "g8Aa7AqxbBnx65JT","flags": {},"type": 0,"text": "Errah, Angel of the Dawn – An Angel who heralds the rising sun, often associated with roosters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "DZRRZv3cg1iZjy8p","flags": {},"type": 0,"text": "Maletayah, Angel of Stings – An Angel who protects and heals those afflicted with poison.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "TOQt8OZgmkqyylHe","flags": {},"type": 0,"text": "Aratia, The Nurturing – An angel who tends to orphaned children. She is fiercely protective of them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "vf3gNDHOiD7tOcyD","flags": {},"type": 0,"text": "Ragask, The Sealed – An Angel who had been sealed inside a stained glass window for centuries due to a curse from a demon. It is said that he’d eventually find a way to free himself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "tsHTrwgxIz5Siwiz","flags": {},"type": 0,"text": "Xibala, The Playful – An Angel of activeness and fun. Free spirited and Boisterous, she often spends time disguised as a human child to play with others.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "eBONqkHPrF7U314C","flags": {},"type": 0,"text": "Charmiel, The Elusive – An Angel who can create powerful illusions to confuse and mislead those he deems as wicked.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "hilU7C6o7AEJ5FTC","flags": {},"type": 0,"text": "Shepard Sigmus – Bathed in light he is a beacon for lost children. Guiding them to safety with his soft hymn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "xDBg8rE6xVqnpsmB","flags": {},"type": 0,"text": "Usterets, the Exemplar – Angel who assists those who stay with their parties to keep them from evil.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "UE5Fbx5QGvdMzguz","flags": {},"type": 0,"text": "Fokksoughl – The angel of deathbed repentance, he who gives the last clear chance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "sxKr7dqL8pECFPNA","flags": {},"type": 0,"text": "Limennora – The guardian of children and protector of innocence. From the night beast to the drunken father, she defends children from all threats they shouldn’t have to face.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "zPVbCNEWAAiGiu5x","flags": {},"type": 0,"text": "Gabriella – An ascended paladin who eternally watches over the prison of her once-mortal companion, a storm sorcerer who was consumed from within and became a terrible primordial of destruction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "AFJonRzPOW13qu63","flags": {},"type": 0,"text": "L’Araine – Angel of self-attainment and ambition. She aids those who seek to help themselves, encouraging them to choose a path that does not hurt others. Appears as a tall woman with a lion’s-head shield.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "FyMEUDiMWXIMQjQj","flags": {},"type": 0,"text": "Gunther the Hindsight – Angel of reminiscence and repentance. His domain is that of the mind, as he is able to replay a person’s memories for them with full detail and accuracy. Appears as an old, wizened man with this head turned backwards on his neck.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "Ze9jZJsqxgw3X1Z6","flags": {},"type": 0,"text": "Ethel the Kind – Angel of lost loved ones, both animate and inanimate. She aids those that call her by finding things that have been lost in the past 72 hours, whether it’s a child, a household pet, or a family heirloom. She appears as a thin old woman with comically large spectacles and partridge wings.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "sp1z525vxl01PlHE","flags": {},"type": 0,"text": "Allestia – Angel of Fertility, Pregnancy and Motherhood. Will sometimes appear during a difficult delivery to offer aid and ease the pain. Many midwives wear her sigil and ask for her guidance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "Cs17pbXbUwG0X6vb","flags": {},"type": 0,"text": "Rukgeuse, Angel of Brutal Smiting – A raging angelic barbarian with four arms and two great axes the size of angel’s wings. Usually a battlefield fighter who helps warriors, Rukgeuse has been assigned the secondary duty of watching over those in customer-facing service industries. Rukgeuse provides inspiration when the customer is wrong and deserves it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "EteiuEQ5aVCqfl3c","flags": {},"type": 0,"text": "Alomom the Herald – A monstrous-looking celestial whose glory is nearly impossible to behold without going blind, whose many mouths constantly sings praises to its overlord, whose many eyes never turn down towards the wriggling, rotten earth. It delivers messages from on high. Doesn’t like leaving the celestial presence, so don’t expect it to stick around and explain anything.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "HZMH2yvjVrsll5Ni","flags": {},"type": 0,"text": "Iklila – Appears as a spinning clawed box surrounded by three glorious halos. Its glory silences all in its presence, but it can hold many psionic conversations simultaneously. It’s voice is like a cello. Leaves crumbles of myrrh in its wake. (Optional: The good aligned can make a charisma force-of-inner-strength throw to attempt to approach Iklila. Giving Iklila thirty pieces of silver causes Iklila to vend a useful item. Other coins or non-exact change cause it to vend various bizarre celestial-themed drinks, foods, and candies.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "AyJWsqUuJJUKFNWv","flags": {},"type": 0,"text": "Hekaphina, Missioner to the Undead – Appears as a figure on a throne nested within a 30-foot ball of interlinked featureless humanoid bodies who hold opalescent palm fronds that resemble wings. The figure on the throne never speaks, instead each of the humanoid bodies takes a turn in a different voice. Hekaphina oversees the penance of those who were good but committed atrocities while undead. Invoked by sane undead who defied their fate and hope to keep their reason and goodness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "VQbynBmhQBzMaIFC","flags": {},"type": 0,"text": "Zubnasl, Shepherd of Mankind – A ring of three maidens facing inward who are conjoined at the feet and hold hands or each other’s arms. The angel constantly twirls as though it is playing ring-around-the-Rosie. One maiden has a basket of fresh eggs on her wrist, one supports a young goat in the crook of her arm, and final maiden carries a pail of water. (Optional: Those who dally or stray from divine missions may be greeted by Zubnasl’s encouragement and a gentle push. When push comes to shove, the pail’s water becomes impassible obstacles, the eggs a swarm of harrying monsters, and the goat a raging 16 horse carriage that moves at impossible speeds over any terrain no matter how ridiculous.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "bmtS5HNquMlFE1tq","flags": {},"type": 0,"text": "Asedrasa the Fate Averted – Appears as a hovering grand shield wearing a flowing hooded cape. Makes a prompt appearance when the worthy pray for salvation from a surely deadly attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "fe6iOA96ZixqXjmm","flags": {},"type": 0,"text": "Malfuhaut – A wheel of orcas with lion heads mounted on a great chrome wheel. It can assemble into a celestial chariot when with like kind. Its multiple heartbeats sound an energetic baseline to accompany its speech. Denounces false prophets and lists their sins. Has a sense of humor, but suppresses it when on the job.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "1iurVM9uV7nIGKaa","flags": {},"type": 0,"text": "Amaryllis – The Angel of Persistence. Silently comes to those who wish to learn tasks through repetition and helps them continue on.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "b2UEO8tLypioAvbR","flags": {},"type": 0,"text": "Venatorius- The Black Pursuer, a metal armored angel of celestial steel and black trim on the edges. Has huge black crow wings and wields a huge black glaive called The Hastam Venari. Never speaks, only communicates telepathically","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "XnAwL2O6io30UAoe","flags": {},"type": 0,"text": "Luali – A short, frail angel with butterfly wings. Works better as a secretary of sorts, prefers not to fight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "9582f585zyG1fWHs","flags": {},"type": 0,"text": "Huyka – A massive collection of snow white dove wings springing out from some unknown center. Makes no noise at all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "qPle7P2CRWLmIFVX","flags": {},"type": 0,"text": "Juiel, The Saved – A kindhearted street urchin in his past life, Juiel ascended to angelhood after giving his life for a god disguised as a mortal man. Juiel is skinny and lanky, cloaked in a cloud of dust. His wings are that of a buzzard. He is known to bring rest and nourishment to those who need it most.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "jxbtNAaFPPZryp9z","flags": {},"type": 0,"text": "Hali – An angel that seems to be made of glass. Rarely moves, instead standing as a statue. Whenever she spreads her holy influence, the receiver will notice a small, transparent figure in the distance. She shines beams and wards of light, protecting the worthy and smiting the wicked.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "67orvWNqNrr6E6Eo","flags": {},"type": 0,"text": "Leomund, Patron of The Arts – An elderly man who appears mostly normal, save for hands being constantly caked in paint and wings resembling pages of music notes. He helps those in artist’s block with inspiration and relaxation, letting them finish their masterpiece.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "EbmActPeP18qtezT","flags": {},"type": 0,"text": "Basiline, The Impossible – Appears as a snake constantly eating its own tail. They only stop when an paradox is acted out in reality, consuming the perpetrator and their work. Preserves the fundamental order of the universe itself, usually going unnoticed until they stop working. Then things break.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "4O9uSst2gg9fHLT6","flags": {},"type": 0,"text": "I (pronounced Ei) – Quite simply, a giant ball of light. They have no true name, no location, and no bias. Anyone who is able to contact them will be told one truth. It could be huge, like the fate of the Gods themselves, or something mundane, like what grandma had for dinner last night. Regardless, the truth is always something new to the questioner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "gYECDWS5mMUP1mv4","flags": {},"type": 0,"text": "Torcian – Appears as a giant steam train in the sky. Works for the good of mechanists and technological progress. To hear Torcian’s whistle is to be said be an omen of good fortune to creators of all kinds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "Ntkb0YkiW2lTYrM9","flags": {},"type": 0,"text": "Lucien – Was a demon who was banished from every realm of Hell. Appears as a snow white devil with a bird’s wings, claws, and head. Works as a messenger between planes, delivering messages and souls alike to where they belong. Never speaks, instead cocking its head and cooing, like a bird would.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "TpccKregVszD6cVK","flags": {},"type": 0,"text": "Okeanos, Angel of the Deep – A vaguely humanoid mass of corals and tangled seaweed. A zealous lawman, he punishes those who sin at sea by dragging them to the bottom of the ocean to drown.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "MzTLJNpRmSuXlzL6","flags": {},"type": 0,"text": "Ejubila the Gentle Slumber – Their weight cannot be felt and they cannot be seen by normal means. They rest upon the chest of those they keep safe, protecting them from anything that would interfere with their sleep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "x99ugQ6Yzq8khw13"}
