{"name": "Murder Mystery Plot Hooks","description": "One hundred plot hooks to help you run your own whodunits.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "aOXKbQsJBTXZKAAC","flags": {},"type": 0,"text": "The town elder was brutally killed in his home on the full moon. Large claw marks lead to a local tavern.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "8bEKXdi2h0VbvTZq","flags": {},"type": 0,"text": "Local blacksmith knows a little too much about the local killings. All the victims were killed by a well-crafted blade.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "mKQltF6cHY276b0g","flags": {},"type": 0,"text": "A young maiden husband just died. Funny enough she is about to get married to her new husband next week. That’s the third husband that has died on her in two months.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "8oL2fnC2J7d0qiF0","flags": {},"type": 0,"text": "One of the party members wakes up to find his weapons are wet with blood. Later that day, someone turns up dead… with markings similar to the PC’s weapons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "Sqzdn3T8OrS4sUZy","flags": {},"type": 0,"text": "A local official is dead. An ambassador from a rival kingdom/tribe/race/etc. happened to be in town that night, and members of the local military are ready to put him to death without further evidence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "KPkTKn6x3O3Fxo4b","flags": {},"type": 0,"text": "A woman is desperately seeking help. Every night, her family is brutally murdered. But they always wake up fine the next morning.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "JwgeG7Jrel0p8syF","flags": {},"type": 0,"text": "An impoverished tween girl with a real force of personality begs you to help you sort out who’s stealing her chickens. She’s so poor she only has the chicken coop, and she sleeps in there; but there’s another chicken missing every day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "a74cv1DrDa4WrjpV","flags": {},"type": 0,"text": "A tavern maiden appeared dead with what seems signs of an already known beast in the area, further investigation show that the beast died long ago.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "dYkYr9aN3o5sXR1H","flags": {},"type": 0,"text": "A local politician hung him/herself, leaving a suicide note. The surviving family insists a mind-control spell was used and that the letter is a forgery.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "faXK6bFTOMsFEBaC","flags": {},"type": 0,"text": "The ne’er-do-well third child of a local noble family was found dead, encased in a ten-foot cube of ice floating down the local river.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "CGT5rG9JLIZ5qYgi","flags": {},"type": 0,"text": "The local priest went missing. One anonymous tip later, and the body was found in a crypt that hasn’t been entered in over 10 years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "RQYaszucB6gyGsCR","flags": {},"type": 0,"text": "The king/leader of the region was killed by masked assassins during a speech at a town fair.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "7XQNeOke9oLn27O7","flags": {},"type": 0,"text": "The party is invited to a mansion in the countryside along with a bunch of NPCs and receive a secret message from the host before they arrive. The host is terminally ill/cursed/bored of this whole ‘living’ thing and their life insurance doesn’t cover natural death/insert other option here, but wants to go out with STYLE, and essentially writes the party into the will/policy/etc. if they stage a murder-mystery. Alternatively, the contractor is a murder mystery novel writer looking for a publicity stunt or something. Feel free to have either go sideways.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "56lFfpzI4YdTaxXU","flags": {},"type": 0,"text": "Last week, a local wizard’s apprentice turned him/herself into the local jail after confessing to killing their master in a laboratory accident. Investigators did a cursory inspection and found evidence of the accident, but no body. The supposedly dead wizard turns up alive within the week, claims a miraculous escape to another plane that took a week to return from, but refuses any sort of investigation. The apprentice dies in mysterious circumstances in jail overnight. (Wizard is secretly a lich.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "vNxAOMSpOART9gop","flags": {},"type": 0,"text": "An entire family of hemophiliacs were slaughtered in their house. Some suspect an over-zealous monster hunter who mistook them for vampires, but is the truth darker than that?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "36rBZrT7xDWIMlJB","flags": {},"type": 0,"text": "An elder red dragon takes the entire capital city hostage until someone can solve the mystery of the murder of its mate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "qaFkq2HpQmFZ81FI","flags": {},"type": 0,"text": "The reed of a famously kind elven bard was poisoned, and she died playing in the local tavern the party was staying at. Who would target such a kind elf?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "UxVqQYUoMWrGSvFr","flags": {},"type": 0,"text": "Bdeocles, a devilish imp and former familiar of fifty years has been accused of the murder of his/her master. The imp is a wicked tempter and a natural liar, but seemingly very earnest about not murdering the one long-time trustworthy friend the imp had on the prime plane.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "DW63y5e9m2Rrlfwy","flags": {},"type": 0,"text": "Your party is attacked by two-dozen high-level mind flayer warriors and hauled off to their deep city. The mind flayers’ high priest and the highest-ranked drow diplomat in their city were murdered. A war with the drow will likely break out unless the perpetrator is brought to justice. They also discovered they have all been infected with a memetic suggestion that prevents them from looking at the case objectively. Even the elder brain is affected. The brain came to the conclusion surface dwellers were needed to sort the mess out. Solve the case or have your brains eaten.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "PmriZD1QZRodzgGJ","flags": {},"type": 0,"text": "In a locked basement, in an abandoned house, a skeleton/corpse is found starved to death. In their own words, carved into the walls they wrote who their killer is, but time has worn it away. Finding out would depend on finding the identity of the prisoner and discovering their history in the town.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "ieurLk3rDwn75CAz","flags": {},"type": 0,"text": "A particularly hairy man is discovered near the woods with a silvered knife in his back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "eZQXvqVWmrdXBkKH","flags": {},"type": 0,"text": "A local villager was recently killed by some kind of creature while out hunting. His body was returned for burial by his fellow hunting party. Yesterday, before the burial ceremony, his body has gone missing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "OLAtRJMgsenirngV","flags": {},"type": 0,"text": "Several patrons and a local lord running for governor died shortly after drinking his favorite spiced wine from a tavern. Funny enough, that spiced wine was a gift to the tavern from a rival lord running for governor, however, he claims innocence. Suddenly, the tavern owner joins the political race, shouting in the square about the brutality of the local lords and how they need to be replaced.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "n1y5Hezi8srSrSRN","flags": {},"type": 0,"text": "A group of children went to a lake that supposedly can supposedly show the true form of whatever enters the lake. While skipping stones, the rocks appear to transform into numerous corpses. What psychopath has been killing villagers and how has no one noticed them missing?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "o8191Ji1t9PzcA5e","flags": {},"type": 0,"text": "Victims in a small town are dying of blood loss overnight. The only problem? There are no wounds to show it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "54WY0JehEBCE1YFf","flags": {},"type": 0,"text": "A group of elderly men, who are or were very prominent in the town (councilors, wealthy merchants, guild leaders etc.) start dying, one by one. At first it seems to be accidents, but soon it escalates to blatant murder. One of the numbers had died of natural causes sometime before, and his body was exhumed, mutilated, and his skull left in the house of one of the others. After the third death, two and two was put together and rumors begin to flow – this is exactly the group of men that were accused of the gang rape of a beautiful young teen girl, many years ago. They are now closing ranks again and have been seen visiting each other’s houses to confer. At the time, the power of these men led to the girl’s family abandoning her and accusing her of lying. She then disappeared, apparently fled to lead a life of her own.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "In58R5mGCR2UgLMc","flags": {},"type": 0,"text": "The town’s woodworker was found murdered in his shop, lying over his workbench, a wood axe in his back. On the workbench are carving tools and shavings of a very expensive type of wood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "TUJCUWJ62eKTaBLb","flags": {},"type": 0,"text": "A man was found on the street, seemingly died from a fall, but there are strange runic markings all over the victim’s body.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "bIVpGyGJVH1Wbm4v","flags": {},"type": 0,"text": "A man is found dead, drained of blood. However, he holds a large holy symbol in his outstretched hand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "fPd1yofQ08CmdmCF","flags": {},"type": 0,"text": "An entire batch of home-brewed beverages sold in the market square were poisoned – 20 people are dead. Is it the work of a serial killer, or is the mass poisoning a cover for a specific slaying?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "9HeZQX8MUMLuhJon","flags": {},"type": 0,"text": "A pair of twins are found dead by strangulation on opposite sides of the town; both seem to be killed at the same time. Each was found holding a small glass marble.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "YgIk83Vp3VN1NdNV","flags": {},"type": 0,"text": "A man is found slumped in his creaking rocking chair on the porch of his shack, congealed wax trailing from his head and encrusting his clothes. His bloody eyes, mouth and ears are each stuffed with a thick candle, wicks shouldering in the light breeze.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "cgjsbk8sbgGH6d0N","flags": {},"type": 0,"text": "The Lord was found murdered in the wine cellar; his body completely drained of blood. There were no marks of violence to his corpse. His son has ascended to his position, and despite the young man’s previous know-nothing attitude, he’s proven to be oddly adept at managing local affairs. Many have said he takes after his father to an uncanny degree.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "Q0TSD2ksZ8L6i7Uq","flags": {},"type": 0,"text": "The party comes to a new town and stays the night at an inn. Everything seems normal, but when they go downstairs the next morning, they find the innkeeper and all the patrons from the previous night have been brutally slain. (Optional: the rest of the town has absolutely no reaction to this.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "AAnce0HxklfwW5kF","flags": {},"type": 0,"text": "A special item is going to be shipped in secret to his future owner across the sea. The crew has a heated disagreement at the port tavern for some reason (between them, or with a local or the captain finds his daughter with one of them). The captain spends the night prior to the departure at a private lodging, after some business. In the morning of the departure, the captain is nowhere to be seen on the ship, the already stowed away item is missing, and a boy is screaming bloody murder on a back alley. It’s the captain with a bludgeoned head and pierced heart. A chip of a half-orc tooth is found nearby, as well as a delicate earing inside the captain’s pocket.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "GYLaqw48XZ5c3DZO","flags": {},"type": 0,"text": "You, the party, awake in the morning to find you are dead. You’ve been murdered in your sleep, and now as spirits flirting between the ethereal and material plane you must solve your murder and find some way back into your cold bodies, lest you be really dead, like, forever.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "8kOt8lNIHsNEVrCL","flags": {},"type": 0,"text": "You are in an inn and you hear a commotion you run towards it and enter the room the only person in the room is dead and has no pants. Upon further inspection the pants are nowhere to be found.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "MOYV8DyIeVYC2Ho9","flags": {},"type": 0,"text": "A powerful magic inducer is brought to town (think transformers’ allspark). A scholar at the nearby museum dies during the night as if he was being chased by some weird monster (pixies, orc, you choose). A new painting has been delivered the week prior and might shed some answers to the death. The inducer created a night at the museum scenario and some paintings from a specific wizardly artist gained life and roamed during the night. The scholar wasn’t particularly amicable but had great knowledge and might have had relevant information for the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "2G7oy0L8YhJcJdQ3","flags": {},"type": 0,"text": "The PCs are asked to investigate a local mining company that is producing over three, sometimes four, times the usual amount of processed ores than expected, with the miners having no memories of working their shifts in the newest, deepest shaft. The smelting workers claim that the ore was never processed by them and show proof that it uses an older, now-banned technique.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "tpNuSCXmxln5fRe1","flags": {},"type": 0,"text": "Your adoptive Mother, who took care of you and your brothers in childhood on orphanage was found dead in the woods with an amulet from one your brothers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "oofnTHOOZv9739B3","flags": {},"type": 0,"text": "A Cranium Rat approaches the party and asks for their help. Someone in town has been killing Cranium Rats to the exclusion of killing other forms of rodent pests and somehow, the psychic connection between the Cranium Rats breaks before death, denying the Hive from knowing their killer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "4FGIdaHnlme0Zik9","flags": {},"type": 0,"text": "An apprentice to the community’s wizard is in jail for killing his master. It seems a Clay Golem they were building tore the head off the wizard and then ran into the woods. The only people who could have given orders to the Golem were the wizard and his apprentice so it’s obvious the apprentice did it, yet he claims he is innocent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "VLQffr0t9IDe1kdR","flags": {},"type": 0,"text": "Two powerful wizards have been feuding for years, but until today it was always fairly civil: written letters, disputations published in scholarly circles, and the occasional annoying and irritating curse (May your nose hair grow ten feet!). Today one of the wizards was found dead in his/her lab with the other wizard’s dagger in his/her back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "KvGXsAjEUYeCnOCl","flags": {},"type": 0,"text": "The Local Lord’s poison taster fell grievously ill during a dinner party and everyone panicked. The Chef and all of her staff were arrested on grounds of attempted murder, the Alchemist was seen in the kitchens and so he too was arrested, and the King’s cup bearer is under suspicion as well. On top of it all, the neighboring Lord is riding about the border ‘hunting bandits’ and sending patrols into the local county…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "Tammwkvt4HNDxgao","flags": {},"type": 0,"text": "A serial killer is loose on town! The fourth body has been discovered and all share a shocking trait: each one is a dwarf, recently come to town to work the nearby mines. Is someone targeting dwarves or is there another link between them? And why now?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "YdKyMPhgqchj6v1d","flags": {},"type": 0,"text": "A prominent businessman in the timber industry goes missing. His body can be found with a tree growing from his chest in the forest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "Cw7bBYU3kkXDqp0T","flags": {},"type": 0,"text": "A righteous, or perhaps not so righteous warband/military unit, was completely slaughtered overnight in their fort. There are signs of a massive battle, but all the carnage is within the walls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "B7E7T2LnRswlDiyh","flags": {},"type": 0,"text": "First it was random children of peasants that had gone missing. When the city watch began investigating, the children of watchmen started disappearing! Can the PCs, who have been selected because they have no family, determine the cause of the child abductions? Without endangering any other children?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "z2hnbwLrpa7O1iu9","flags": {},"type": 0,"text": "The entirety of a town gets invited to the noble‘s annual dinner party at his colossal mansion. Shortly after all the guests have arrived the noble has seemed to have disappeared, but his body was found later with a dagger in his back. Then the lower-class guests start disappearing and dying in various different ways. The killings seem to be gradually going up the social ladder.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "8XpQLv0HmZON7FR4","flags": {},"type": 0,"text": "An adventurer asks you to solve their own murder. They and their party were exploring a dungeon, but got separated, then the adventurer was killed instantly, but the body was later found and resurrected. The only people that should have been in the dungeon were their own party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "x56tXbXuum8aUJ6n","flags": {},"type": 0,"text": "In the evening a bard gives a song in gruesome detail of a brutal murder. The next day a body is discovered that is multiple days old but matches the description of the bard.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "php9h3fxfQD8kieK","flags": {},"type": 0,"text": "In the middle of a stunning performance, the band’s lead singer and bard were murdered! The culprit was covered by the mist and fog created by the band’s crew as special effects, who could have killed them on stage in the middle of all this chaos?!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "m62pRf3lp8vMLjF9","flags": {},"type": 0,"text": "A little boy is found slain inside a locked room; his throat slit. A doll, his favorite, of a small woodcutter is found on the floor next to him. In its tiny hands is a tiny knife.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "YW8MlKWExdhPLncp","flags": {},"type": 0,"text": "A man is found dead in his home, his body completely drained of blood. All 1.5 gallons of his blood have been neatly stored in glass jars around the corpse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "hyOdJJRGS6PZ5chU","flags": {},"type": 0,"text": "Corpses have been showing up near the town. They all have the odd quirk of the victims seemingly asleep, if it weren’t for the total lack of all organs and the corpses randomly being cut into pieces with near surgical precision. Also, the town’s medics are all clerics, with nobody having the sort of precision tools or skills to cut super finely through bone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "7eTduTNgL3NUdMET","flags": {},"type": 0,"text": "The party receives a letter from a noble, calling them forth to his court. Soon, he reveals that a threat of murder is afoot. A devil walks among them, and the party must route them out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "Yk75oSj7MCcjwWJt","flags": {},"type": 0,"text": "A family moved away from the village further into unsettled territory. It has been almost a month since anyone has heard from them, and it appears that after some madness and violent ends, the surviving family fled to a lighthouse owned by a relative.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "UWcI8bqopl2bis9O","flags": {},"type": 0,"text": "Tasked to retrieve an item from an old castle and village, the party, contractor, and an extra crew make their way there to loot the location. However, as storm sets in and a crew member is found dead, something foul is afoot.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "vyQnAmuPV9EoMNjF","flags": {},"type": 0,"text": "Seemingly out of nowhere, a screaming body comes plummeting towards the ground. It appears to have maybe been aimed at someone…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "p3aKEsODdX8HmRpm","flags": {},"type": 0,"text": "A few days after the party where the local woodworker was drunkenly bragging to a PC about how he has a shipment of rare wood used for detailing and instruments, he was found dead, murdered with his own wood axe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "tv4Mo6fG0cffkfmW","flags": {},"type": 0,"text": "The party arrives at a port city and finds tensions running high. The local nobility, guild masters, working class and underworld are in a four-way standoff over expected payments, quality of products and working conditions: negotiations were already tense and then the first body showed up. So far, the victims have been the children of working-class leaders, but now the daughter of a prominent and universally respected guild master (thought to be the best chance at a peaceful resolution) has vanished. The cities ruling family has been silent on the matter, mercenaries are pouring into the city and maritime trade has dropped sharply…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "D5Pztl54aMtMhtAG","flags": {},"type": 0,"text": "The party wakes up in the crypts of a large town or city, with no recollection of their deaths and each carrying an invitation to a formal event, dated two days ago. Investigating the event’s location reveals that it is currently locked up by the city guard to investigate a mass killing, the victims being the party members themselves!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "rkayn85y60UNUk7m","flags": {},"type": 0,"text": "Tragedy erupts in the quiet hamlet of Miramide, as the morning patrol finds the body of the woodworker, murdered in the night. All apparent evidence points to the murder being the work of Illid, a golem created for the express purpose of protecting Miramide.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "LEzD5J8teOm5Ds1B","flags": {},"type": 0,"text": "A room at the local brothel was found covered in blood with drag marks leading to the nearby river.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "4qYUvfezvxoesqGB","flags": {},"type": 0,"text": "A series of brutal killings are going on, every month a new victim is found torn to shreds by a wild animal. At first the town suspected Mr. Lazuli as he got bitten by a werewolf last spring and the local priest hasn’t come to remove the curse. Only these killings take place on a New Moon, while Mr. Lazuli transforms on a full moon …","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "00hjQfvcLtCEgW8A","flags": {},"type": 0,"text": "The city has a serial killer on its hands! Maybe? There’s a new death every few weeks, but always killed in a new way, cut, shot, impaled, tortured. The strange thing is the victims look identical, not like anyone the police recognize. But the bodies are all the same man. Dying with a grin on his face …","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "kUKnOKIBki3MUwuq","flags": {},"type": 0,"text": "A lich wants you to solve his own murder. He insists on coming along with you to play “good cop, bad cop”.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "QDVMj3OU8H1IUPuY","flags": {},"type": 0,"text": "A mysterious man in red has been killing violent criminals and corrupt officials throughout the city. The mayor was positively gleeful at first, but ever since his cousin’s ties to a crime ring have been made public, he’s been pressing the guards and bounty hunters to find and capture the man in red under the mantra; “Vengeance is not justice!”.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "030bsVqGpv2bvKEz","flags": {},"type": 0,"text": "The man in red, a vigilante who’s been killing violent criminals and corrupt politicians in the city, has been found dead. The city guard aren’t touching this case because the man in red had powerful enemies, and it looks like one of them had him killed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "w1aT0eW7nkBLUg1j","flags": {},"type": 0,"text": "A person explodes in a gout of fire. Then 2 more nearby. A creature is possessing these victims before they ignite. Then the creature turns on the players! It could be that the victims (or at least one of them) are connected somehow. Are there more victims throughout the city? It’s clear that the heroes must find this out before it happens again! Chasing the clues might reveal that the creature was summoned and specifically targeted (at least one of) the victims! What do the players do when they find out that original summoner is attacked? Did the victim(s) deserve it? Is the threat resolved? Does the creature make another attack?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "HJV3Y1mm9jCGuGay","flags": {},"type": 0,"text": "Household ‘Otto-Servant’ warforged automatons have recently become a trend among the well to do. The inventor sends a message to the players asking for help using an unassuming middleman as cutout. It seems the inventor fears for their life. Then the inventor is attacked by one their inventions! Rumors of the devices spread like wildfire, and copycat attacks seem to be happening! Can the players protect the life of the inventor, and prove that the automaton WASNT the source of the attack? Has the inventor died by the clamps of their own creation? Perhaps there is a competing product being used to ruin the inventor’s reputation! Maybe the inventor stole the idea, and the original creator is getting revenge?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "GFXO3s4zTrZVjDVf","flags": {},"type": 0,"text": "No Body at all. Victim of a disintegrate spell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "tMavhW3QzWprMlMV","flags": {},"type": 0,"text": "A body is found with no visible injuries on the outside, but an autopsy reveals the internal organs have been burned and melted together. (Heat metal on a surgical implant.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "xVFzNDt3BCfzgks6","flags": {},"type": 0,"text": "A man was seen crying in the middle of the street. When someone tried to pull him out, he screamed and collapsed dead. Autopsy reveals heart attack. (Mental Prison).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "VdAwIUSnZdhMPfS1","flags": {},"type": 0,"text": "A large number of people have seemingly contracted a dancing sickness. They keep dancing no matter what. Ones without anyone to feed/water them die of thirst. (9th level mass suggestion, which lasts ‘a year and a day’)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "7Sg23SHKnqJMba8S","flags": {},"type": 0,"text": "A wealthy brewer was found dead of extreme dehydration. (Blight)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "oslStXAGjxXDVb0D","flags": {},"type": 0,"text": "A body is found with what appears to be a plant growing out of its mouth. (The victim consumed some seeds and a Druid caused them to rapidly grow inside the victim’s body.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "vzVDQ3lJB1cPe2tp","flags": {},"type": 0,"text": "A man mysteriously dropped dead during a heated argument. It appears to be a freak accident but a detect magic spell reveals he was killed with psychic damage. (The other person in the argument killed him with vicious mockery.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "YnOFTyRA9DdYtsFR","flags": {},"type": 0,"text": "A town guard is found dead having been cooked alive, but his armor is fine. Upon close examination the armor is slightly warped from extreme heat. (Heat Metal)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "w91d7aazNAb3iy2m","flags": {},"type": 0,"text": "Victim has several holes blown through their body; autopsy shows signs of acute blunt force trauma. (Magic Missile)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "gypjWCZ3tXqwDbFp","flags": {},"type": 0,"text": "Victim dropped dead for no apparent reason, autopsy showed that all vital organs seized up at once and their heart had completely decayed. (Power word: Kill)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "3qyLvpxa5wmhdCss","flags": {},"type": 0,"text": "Victim found foaming at mouth and showing signs of a Seizure, Autopsy found that their brain had boiled in their own skull (Synaptic Static/Mind Spike)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "QFPsOBiv9jVN5GVw","flags": {},"type": 0,"text": "Victim’s lower half found but other half has not been located, cut appears completely clean having gone through their armor with little apparent resistance (A creative use of Gateway/Astral Gate)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "VtIYkqrEL6gO6nGH","flags": {},"type": 0,"text": "A house was destroyed and all inside were killed. Strangely, half of the house exploded outward in an incredible fireball, the embers of which are still too hot to approach. While the other half was encased in a sheet of ice so cold that touching it with a body part requires the skin to be pulled off to let go. If you pass a high arcana check you realize that the murder was most likely caused by someone using the demon Maxwell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "3mtKrn0KeZvXYOYu","flags": {},"type": 0,"text": "Body frozen solid, found in an environment not cold enough to freeze it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "rEvRnjVYCi1umXQ6","flags": {},"type": 0,"text": "Body melted into goo. Only identifiable by the clothing, equipment & jewelry, that the victim had on them at the time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "FEPVoOhnH0BWfncC","flags": {},"type": 0,"text": "Body partially phased through a wall or other solid object.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "9RIAlOZmAHk3Zifk","flags": {},"type": 0,"text": "Body transformed into sand. Only identifiable by the clothing, equipment, & jewelry, that the victim had on them at the time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "NaLD9cvApUiJnUfL","flags": {},"type": 0,"text": "Skeletal remains of someone who was alive just a day ago. Identified by clothing, equipment, and bone injuries that the victim suffered during life.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "mnqlaKkGnPku7oSp","flags": {},"type": 0,"text": "Witnesses say the victim was struck by lightning, while inside a building.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "Jmhk6OosyvR5Ibtt","flags": {},"type": 0,"text": "Body found in an alley behind a well-known tavern that is frequented by high societal patrons who don’t want to know or seen visiting with specific types of people. (Thieves, murderers for hire, drug dealers. Dealers of other material that is not quite common to keep around.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "juQ49GSuSZYaCOcz","flags": {},"type": 0,"text": "A body apparently exploded into large chunks, a significant amount of mess on the floor but no blood on the walls. (Flesh to stone, topple the statue, dispel).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "AzZk7Un2CJB9U6C0","flags": {},"type": 0,"text": "In the city’s main temple, a well-known noble is found dead in the inner sanctum. It is known there is only one way in or out, and it is by being accompanied by a member of the temple’s high court. Upon investigation, the cause of death appears to hanging (broken neck and rope burn around the neck) but there is no rope to be found and nowhere in the sanctum to be hung from. (Rope Trick).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "0VlH3zNyXxdyeauh","flags": {},"type": 0,"text": "A roughly circular area in the slums of the city contains an emaciated corpse, several dead rats, and a good number of dead insects. (Circle of Death).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "W3nQodA542WEMME6","flags": {},"type": 0,"text": "A body that clearly feel from the sky in the middle of town with no trees or real buildings around.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "rArLorllUrlTxCpv","flags": {},"type": 0,"text": "An archeological dig at an ancient tomb has been going on for weeks. But the crew are no fools. They’ve brought in experts and priests to avoid traps and curses the place has on it, as well as hiring the party to take out any other threats that lurk in the depths. It’s good pay for several days of killing bulettes, cloakers, umber hulks, and the occasional mummy that may arise, etc. There are protests by the locals of disturbing a sacred site, vocal but nothing violent. The head archeologists are very secretive however, and seem to be searching for something specific, dismissive of other treasures. Then, one night, the main team is found dead in their study area, lungs filled with sand, clutching at their latest notes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "QINodMhEHuomr640","flags": {},"type": 0,"text": "The dock-master has gone missing for several days, and the harbor is in disarray, wondering where he went. That is, until a group of children find his body tied up and beaten to death in their secret cove hideout that they thought only they knew about. The bruises look like they were made by a fist wearing rings on each finger. In the dock-master’s inside coat pocket is a letter blackmailing him with instructions to find and come to this cove.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "vRK8aAQnYTI4zHsD","flags": {},"type": 0,"text": "A hermit witch is both feared and revered by the locals for her seemingly dark powers but also the magical potions and tonics she sells to the village to fix various mundane problems like hair loss or love interests. Last night, a horrible, blood-curdling scream was heard throughout the entire village, coming from the remote hut. Upon investigation, the witch is nowhere to be found, except with a message scrawled on blood on the floor: ‘THE BLASPHEMOUS AND HER FLOCK SHALL BE PUNISHED’. The villagers are begging you to find the culprit and save them from whatever is coming.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "pDefLMNm1ZwaSoed","flags": {},"type": 0,"text": "A collection of incredibly realistic sculptures are found in the courtyard of a local noble’s home, delivered with a single letter signed ‘W’. Each statue depicts a different member of his family in the exact garbs they were wearing the night before, when they had coincidentally been at a dinner party. They had returned much later than expected…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "iOovQV2ooc5BFF4T","flags": {},"type": 0,"text": "An experienced herbalist is found dead in their ransacked store. There is no sign of struggle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "G6ykLObAJCqnL06d"}
