{"name": "Beach Encounters","description": "One hundred different interesting encounters that can take place on the beach.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "LnRC4uUdbESppHcd","flags": {},"type": 0,"text": "A bearded and rag-draped man scrabbles in the sand. He’s looking for something he lost there. His mind, he says. It would be very bad for the world if he ever found it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "w0NDNthoptCecJwG","flags": {},"type": 0,"text": "Some inhuman sailors and their half-living vessel, washed into this world by aberrant winds. Will barter for supplies with esoteric navigational instruments and the locations of magical anomalies they’ve found here while searching for their route home.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "uzGxVS9mR5MkkKnp","flags": {},"type": 0,"text": "A furrow has been dragged into the sand, leading down the mouth of a cave eroded into a low cliff. The furrow’s sides are stained with blood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "mg5ygID9zMBiMdj7","flags": {},"type": 0,"text": "A derelict ship picked clean by scavengers human and otherwise. Might still be good for firewood, or shelter lurking vermin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "m3u6x1N4RKaIjSwz","flags": {},"type": 0,"text": "Two tiny armies form ranks in the sand and march into battle: one of red crabs climbing from the sea, another of white crabs from the dunegrass up inland. Even a few crabs are no threat to a human, but enough of them might be. If you ignore them they’ll go about their violent business and eventually one side will emerge victorious. If you aid one side against the other, the victors will reward you with cached spoils. Mostly tide-washed junk, but a handful of lost treasures as well. If you attack both sides they’ll band together to fight you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "iENK92Th1k3xvBy3","flags": {},"type": 0,"text": "Mud slurries obscenely here. A water elemental and an earth elemental in a forbidden tryst. They’ll offer a modest bribe to get you to forget what you’ve seen, but plot sudden, stalking violence if you try to haggle or refuse. Don’t trust sand or saltwater after you’ve provoked them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "yFcjKrexf9c1b2G8","flags": {},"type": 0,"text": "A black-clad widow kneels in the surf and weeps for the love she lost at sea. She’ll pay dearly for word that they may yet live, or a smaller but still respectable amount for gossip and alcohol.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "d6bkLwXh3VCcqizh","flags": {},"type": 0,"text": "A gang of urchins pick at the driftwood for anything that could be sold. They’ll work for a pittance and rob you blind in a blink if the opportunity arrives.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "fOLnoUFU7f6aeHOo","flags": {},"type": 0,"text": "Some patches of sand here are sunken and pitted with bubbles. Giant, carnivorous clams lurk beneath these. Watch your step, or you might lose a foot to their clamping shells.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "aIQUX4rbZ7jST0nX","flags": {},"type": 0,"text": "A whale, wide-eyed with terror, beaches itself before you. It won’t be long now til it dies. The whale’s pursuer waits in the shallows offshore, waves beating at its fins and spines. If the whale is not returned to the water, it will drag its glistening bulk ashore to retrieve it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "6xjJKYC7mGtfOKA1","flags": {},"type": 0,"text": "A mass of imperishable plastic waste from a gone and forgotten civilization. Maybe worth something to a collector of curiousities or an alchemist.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "iH6Ngu1TdPlZO1Kg","flags": {},"type": 0,"text": "A patch of reeds. The sand around it seems recently disturbed. Underneath, a squad of blue-skinned goblins waits for a chance ambush. Their rattling breaths can be heard from the reeds just over the sound of the breeze.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "2yYHFXTsawBXNEVJ","flags": {},"type": 0,"text": "A galley and its crew, resting ashore. They’re looking for slaves to replace the ones who died at sea. They’ll pay for prisoners, as well as tips about vulnerable populations, but may try to capture you if you give an impression of weakness. If released the slaves on the galley will split evenly between those who flee and those who try to kill the crew.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "jEqVzUaNU8aa6hZj","flags": {},"type": 0,"text": "A marooned man with salt-cracked lips, escaped from exile on a ramshackle raft. He’s near death and deserved worse than marooning for what he did, but he also knows secrets you’ll want.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "aTaqPR46LcfL3TSK","flags": {},"type": 0,"text": "An explorer from a distant land. She’s curious about the region and will report anything you tell her as truth back to her emperor, and in some months time when the full expeditionary fleet arrives they’ll act off that information.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "Pif4OU8hSRa5tMxU","flags": {},"type": 0,"text": "The severed tentacle of a sea monster, still grasping on the dying reactions of its ganglionic brain. It will flop after the closest thing generating vibrations (besides the waves), such as by stepping on the sand, and try to crush it. Hard to take on in a straight fight, easy to trick.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "MGmuQZfUR6YriaTj","flags": {},"type": 0,"text": "Someone’s made an elaborate mandala in the sand. If you can step within it without disturbing its lines, you’ll be blessed with peace of mind and rapid healing while they stay there. The mandala will be wiped away when the tide comes in.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "eaPVuzNwph93Tkp8","flags": {},"type": 0,"text": "Off in the distance you can see an approaching black cloud, a buzzing noise rising as it nears. A swarm of sandflies in ravenous frenzy. Too many to fight. Flee, find shelter, or suffer a death of a million little bites.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "BnH8sQ1ljNBGC3rF","flags": {},"type": 0,"text": "A flock of sirens competing in a singing contest. Passers-by will be pressed into judging the winner. Losers will be furious.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "iJ9jnj0Ns45lfTo6","flags": {},"type": 0,"text": "You spot something shiny ahead: the handle of a sword jutting up from the sand. There’s not much left beneath that hasn’t rusted to powder. Inscribed on the blade is part of a poem in a language only scholars still speak, florid in its dedication of the sword to a young prince by their father, the king. The sword’s enchantment is as broken as its blade. Where once its cut carried golden light that ate away at wounds, it now inflicts a contagious, blistering radiance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "2fIlOh1nJQ5kR6rQ","flags": {},"type": 0,"text": "Assorted fish, bloated with eggs, pulled onto land by the parasites which have now grown larger than the fish’s mouths which once held them. The parasites are here to nest, and will protect their broods with maternal ferocity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "uMz2BsYm5OeBX6V9","flags": {},"type": 0,"text": "Some grumpy merfolk lounge a ways offshore. When they spot you they’ll throw insults and rocks, but will disperse if the situation is escalated beyond that or if you can dish out a better insult than theirs’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "kIMA0HXqfec8NmMA","flags": {},"type": 0,"text": "Several serrated teeth scattered near a bleached, broken jaw. If thrown on the ground these teeth will sprout into fully-grown humanoid remora warriors loyal to whoever threw the teeth. They’ll quickly suffocate on land.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "cy2EkQQ3mFYrrw5W","flags": {},"type": 0,"text": "A woman overturns rocks in a panic. In the distance angry shouts can be heard. She’s a selkie fleeing a wealthy merchant husband who forbid her from returning to the ocean, unable to find her skin. The husband has roused a mob to drag her back to their house and children. Not much time’s left before the mob arrives.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "8L339TrwPirSLALW","flags": {},"type": 0,"text": "The sand here is a riot of many hues, stained by wild magic. Magic cast while standing on this sand works chaotically. Sleeping on it brings prophetic nightmares. Eating it is mutagenic. All of these properties are preserved even if the sand’s removed from the beach.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "P3BsFH75jX3fBC5k","flags": {},"type": 0,"text": "A boot sunk in to its ankle. It’s within a wide patch of hard-to-distinguish quicksand blocking the path. The boot is of high quality, but otherwise unremarkable.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "nSlHN7E0pQU6kp9q","flags": {},"type": 0,"text": "A lighthouse, the light of which is an uncanny green. Its keeper is more than a little mad, and spends all day gathering fireflies and their grubs. At dusk the keeper places his daily catch in a fine-mesh cage at the lighthouse’s top. Each night the fireflies feed on each other, becoming larger, brighter, and crueler. This will not end happily.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "BR2laUYaMcg5UHQj","flags": {},"type": 0,"text": "A Mexican stand-off between three pirates, a recently-unburied chest full of booty in the middle of them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "76RYP5yx3Yl6zXUk","flags": {},"type": 0,"text": "A worn-away wisp of a dryad, clinging to the driftwood which was once her tree. Will try to commit suicide-by-adventurer by convincing them she’s more dangerous than she is to end her agony. If her bluff is called and she’s shuffled gently off this mortal coil, the dryad’s driftwood splits open to reveal a magic seed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "Fx1PTuhEIMUJ3n9d","flags": {},"type": 0,"text": "A smuggler in a heavy cloak and a rowboat that seems too rotten to float. Direct light will reveal the smuggler’s true, skeletal face. She discovered a treacherous route out of the underworld then decided to continue the profession she followed in life. The dead smuggler offers goods not found among the living, and attempts to rope you into her schemes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "gurYJ6FIOh1VP1lL","flags": {},"type": 0,"text": "The sand in this section of beach is greyish-red, iron-like, magnetically anomalous. Carrying ferrous metal through it can kick up obscuring clouds and rasping sandstorms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "FIDXPBstHrLNDxLp","flags": {},"type": 0,"text": "A man in a suit of armour sitting on a stone. Not really a man at all, but a knight-crab (like a hermit crab, but bigger, more dangerous, and uses armour instead of shells to house its vulnerable parts) grown a bit too large for its current home and looking to upgrade. Will mimic human behaviour as well as a clever animal can to lure prey closer before it attacks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "xkqD63RnNVDkzvUA","flags": {},"type": 0,"text": "An idol of verdigrised bronze half-buried in the sand. Time and water have worn away its features to the point that you can’t tell whether it was supposed to look angelic or demonic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "jdju0jjbM1MbRYOy","flags": {},"type": 0,"text": "Goblins racing wheels and wagons down the slope of the waterline. They won’t let you pass unless you beat them at their own race. Materials for a vehicle will be provided, including: old planks, nails, an inflated pig skin, and very hard melons. Sabotage of other racers is not only allowed, it’s encouraged.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "r7yUjMylmlHI2U7T","flags": {},"type": 0,"text": "A sea-hag crouches in the water, combing tangles from her hair. She’s self-serving, always hungry, and morbidly humourous, but willing to barter fresh flesh and magical objects for her services and charms. The hag will die if her hair ever dries out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "TDAhfvBZOGq4Tarh","flags": {},"type": 0,"text": "A worn leather case containing a smeared and mildewed scroll bobs in the waves. The scroll contains a random spell, but the damage to the scroll will mess with its activation. Maybe it’ll fizzle out, or affect a different target, or even become more powerful.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "i0VJdNGrUz1uStUe","flags": {},"type": 0,"text": "A rusted machine. Its gears turn so slowly that the movement is nearly imperceptible, its ticking seeming perhaps to be your imagination. It will finally wind down in a matter of hours, and when it does it will explode. With tools (or fingers you don’t mind getting pinched off) the gears can be manually re- or unwound. Immersing the machine in water will delay its detonation indefinitely.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "A7LHdudSz5wuNATq","flags": {},"type": 0,"text": "A shark-man brute leaps from the water, positioning itself so that dazzling, blinding light shines off the surface at its back and into your face. Tries to intimidate its way to a toll of wealth and rations, fights reluctantly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "COlEhcMp7c68TLGP","flags": {},"type": 0,"text": "An unhinged wizard rants and raves against the ocean. He seeks allies against it, and will attack anyone who seems to be in league with it (e.g. by sailing upon it, eating its fish, etc.).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "iTWkuOK5OoFjrrdm","flags": {},"type": 0,"text": "Hungry beachworms tunnelling below, bulging the sand above their passage. They can’t dig through solid rock, but are fast enough to overtake a running person. The sand above softens any blows against them except for when they lunge or watch periscope-like for prey.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "R38sv8nmodIYbU3h","flags": {},"type": 0,"text": "Galumphing kelp-freits wielding enormous shell-and-bone scissors. They work to separate the abominable in-betweens of land and sea: amphibians, sailors, seagulls, and so on, with the edge of their scissors if necessary (it’s most often necessary). The kelp-freits try to set up flanks between themselves, so they can combine their scissors to gruesome amputative effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "esghHlHb17rAlFQU","flags": {},"type": 0,"text": "A drunken giant building an equally giant sandcastle. It’s dangerously oblivious in its scooping and molding, and if pestered will demand you act out its imaginings of what life in a castle is like with the frightened prisoners the giant’s already captured.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "xeSg201jWv2Nt2en","flags": {},"type": 0,"text": "A big, stoic sandstone face carved into the side of a hill. It will open its mouth to the treasure stashed within only for the person it was carved to resemble. The enchantment on it is rather crude, so a mask painted to look like it, its reflection in a mirror, and the like would all be sufficient to fool the face into opening. Dynamite will also open the face, but risks damaging the treasure within.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "tmbNFyvssJ66Lb6k","flags": {},"type": 0,"text": "A discarded coffer full of cursed silver coins. If carried they’ll tarnish any other precious metals you touch, and will return to your possession the night after you spend them. They’ll appear in your mouth if you’ve got no bags or pockets for them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "wCtRcDJVnp8NJWTi","flags": {},"type": 0,"text": "A group of young nobles play polo as their bodyguards watch on. They’re growing bored with their game and eager for new amusements. They nobles unfamiliar with the possibility of their actions having negative consequences. Together their horses and jewelry are worth a small fortune to a discreet buyer who wouldn’t sell you out to the nobles’ parents.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "kvmClslLWRIxYbv9","flags": {},"type": 0,"text": "A decrepit yacht drifting down the shore. Its undead passengers believe themselves to still be alive and at an upscale party, dancing and drinking from dusty glasses. They’ll get violent if anything disturbs this illusion, and start off assuming any unfamiliar faces are servants. Some durable valuables are still onboard.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "c44Pks6j8cZDCmGC","flags": {},"type": 0,"text": "A storm tears through the area, coming and going in maelstromous moments. Soon after the storm passes, a party of fairies riding albatrosses swoop down and ask which direction their quarry went. If told honestly you’ll wake up some days later with a bottle of lightning by your head. If they’re lied to you’ll find yourself caught in a deluge every time you try to sleep outside for the next month.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "zKn625wNpJ6azgTw","flags": {},"type": 0,"text": "A spattering of holes and the goblins digging them. They’ve got a waterlogged treasure map, the ink too smudged to read clearly, and are digging all over the approximate area of where “X” marked the spot.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "vFiVL0M5dXsX5CSg","flags": {},"type": 0,"text": "A collection of jars, some shattered, some whole, all caught in some muck. Within them is some goo. Drinking the goo inflicts a piscine mutation: gills, bulging eyes, legs fused into fins, skin turned to scales, and so on. Each jar’s goo inflicts a single mutation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "52TnA9iJAFMVnZl9","flags": {},"type": 0,"text": "An estuary where crocodiles lurk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "BWw0MfW7jZkkFVua","flags": {},"type": 0,"text": "A basket bobbing in the sea foam. Within is a wailing baby, several items of golden jewelry, and a note. The note explains that the baby is the youngest son of a king, sent downriver to escape the murderous attention of the crown prince. It further implores its reader to raise the baby well, take the jewelry as payment (though leaving one piece as a keepsake), and some day tell them of their royal heritage and duty to overthrow their tyrannous sibling.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "Lkog0b2JpSB0cT2X","flags": {},"type": 0,"text": "An impromptu bazaar halfway in the water. Merchants from land and sea have gathered here to trade goods only found in their respective environs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "QA8CpliKs7XWmZd4","flags": {},"type": 0,"text": "A holy oil spill shimmering on top of the water. It’ll still be potent if bottled. In the center of the spill a ghoul shivers atop a raft and cries for help.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "c33ilHeFxJlxLoVE","flags": {},"type": 0,"text": "A crate of wax-sealed amphora full of wine that’s soured to vinegar. One of the amphora, painted with sharks instead of dolphins, is packed with cocaine or something similar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "PFQiXeMhEZOQtbsz","flags": {},"type": 0,"text": "The way down the beach here is craggy, with rough waters slamming rougher rocks hemming in one side and a sheer cliff the other. The crags ahead are home to giant barnacles, glued in place but able to lash out at intruders with their tremendous penises.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "GnEuK71jL7Me2rtD","flags": {},"type": 0,"text": "Some fishermen gambling around a barbecue pit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "9BRJciKn7gMj0rgL","flags": {},"type": 0,"text": "The sand here is full of sharp shards of rock and glass, cutting feet like caltrops if walked on. Goblins on stilts with bows and pikes are patrolling the area.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "Y5SaTViVTNJr3LJT","flags": {},"type": 0,"text": "Coral mounds dot this place and strange fish swim through the air. This is the ghost of an ancient reef now on land by the long movement of geology, lost in the memory of life. The ghostly animals behave as they would while alive, including attacking when hungry or provoked.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "5CJlIeO5Pj7JIVaN","flags": {},"type": 0,"text": "Someone’s drowning, caught in a riptide. If rescued they’ll be grateful, but don’t have much to offer besides their service.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "fhAOoHoIaIn4W5a3","flags": {},"type": 0,"text": "A friendly horse trots up the beach to you. It’s a kelpie in disguise. If touched you’ll stick to it and it’ll gallop into the water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "0JNuVrA9djYT75RK","flags": {},"type": 0,"text": "A floating dock that trails out to a prime fishing spot.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "5cxq0HQLC2KNhJUI","flags": {},"type": 0,"text": "A fresh shipwreck. There’s a three-way argument between some human scavengers, goblins, and fish-men as to how to split the spoils. They haven’t come to blows yet, but they’re close.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "uaq68fIYLzHYxd4n","flags": {},"type": 0,"text": "A desiccated ocean chimera (eel for a tail, heads from a turtle, a pufferfish, and a seahorse, body like all four mashed together, breathes gouts of inky venom) placed above the high tide line. Contact with water will restore it instantly to lively hostility.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "tWps8NIa8DVapMqN","flags": {},"type": 0,"text": "A dire cormorant snacking on a splatter of dead fish washed ashore by a swell. Protective of its food but otherwise placid. Tameable.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "N5U1aHt78zOFSTKb","flags": {},"type": 0,"text": "A party of adventurers like yourself, all naked and quite deranged from sun exposure and drinking seawater. If kept calm will tell confusing fragments of how they arrived at their current state.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "kWgEIgANCEjNsIkL","flags": {},"type": 0,"text": "Colourful, frilly seaslug-men crowd around you and probe with soft appendages, babbling all the while. They’re tourists from the undersea realms. Curious about you, but unable to speak your language, and assume their gesticulations are more comprehensible than they are. At the first sign of violence they’ll vomit their guts out and crawl over each other to get back in the ocean.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "6H8IgTeuAm3vZ4Bl","flags": {},"type": 0,"text": "A sea stack engraved with abstract images. On moonless nights a coven of witches convenes to dance atop it with an octopoid demon, the master they’re sworn to.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "wHhTKLQbvUhEkx34","flags": {},"type": 0,"text": "A salt evaporation pond. People from a nearby village sing work songs as they dredge the salt.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "ghtDZXxkxclIFYWp","flags": {},"type": 0,"text": "An abandoned, algae-encrusted net. Entangled in it is a fish-bitten revenant on a quest to avenge its own murder, stymied by the fact that its hands and tongue have been eaten off.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "MSIIaxaMJbecrhdQ","flags": {},"type": 0,"text": "Gems ground to dust have been mixed into the sand here, glittering in ruby and sapphire hues. It’d be valuable but time consuming to sift it out here, but this risks attracting the attention of wandering monsters. The mixed sand could be packed up to be sifted elsewhere, but the ratio of sand-to-gem-dust could make it prohibitively heavy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "KdUaHFMIcoZrQD0S","flags": {},"type": 0,"text": "A lifelike, gently smiling statue carved from salt, up to its knees in the sand. Those within the statue’s field of view (if its eyes could see) receive a penalty to their ability to resist outside influences on their mind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "AwIBq6mnmNAEADAU","flags": {},"type": 0,"text": "A fishing ogre with waves lapping at its shins. The ogre is currently distracted wrestling with a shark that’s bitten its line.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "f3jWACVJ659S2Wd2","flags": {},"type": 0,"text": "A lightly sleeping lion-naga basking on the sun-warmed sand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "CiSm8J3P11ISIsXE","flags": {},"type": 0,"text": "Something golden glints in shallow water. It’s treasure, being used as a lure by fish-men. They’ll attack if you blunder into their environment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "XZmHh0wGgoBZAuYd","flags": {},"type": 0,"text": "A lone mermaid, swimming down the beach from the opposite direction as you. Gives a wave, then goes on her way.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "cj7tnJJpGsFpOZBA","flags": {},"type": 0,"text": "The sea foam’s piled ashore here over your head, and widely enough that you can’t easily walk around it. Easy enough to push through it, but you can’t see in it past your nose. Something’s hiding in the foam, waiting for prey to wander in.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "VISbaO9ocXTPm9dB","flags": {},"type": 0,"text": "A shrine to a maritime deity, shells and ribbons laid at its idol’s feet. A tired, old, snappy priestess and her bored apprentice live in a shack nearby and maintain the shrine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "EGgASEFibtMcbDsn","flags": {},"type": 0,"text": "Goblins training gulls to shit in peoples’ eyes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "a8DGlr6lU3mLDVuG","flags": {},"type": 0,"text": "A red tide laps at the shore. It’s infested with vampiric, symbiotic algae. A gaggle of infested people (evident by their crimson eyes and veins) are bathing in the stuff. They try to ply you with drugs and good company to offer up some blood (any sort will do), and become increasingly agitated if you do not. Their preferred mode of attack is to spike the dose of whatever they can get you to take with a sedative and drain you while you’re passed out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "Udwn2OqYbhrZVbKf","flags": {},"type": 0,"text": "A sea turtle nesting site. You’ve arrived at just the right time to see the mass hatching. Predators will be gathering soon to pick off the baby turtles before they reach the water. Maybe you’ll be joining them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "4LC2Qm0liayRqNIi","flags": {},"type": 0,"text": "A sudden fog rolls in. Vague lights can be seen through it. Lanterns? Will-o’-wisps? Lures? Perhaps it’s better to avoid them than investigate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "LSDGKMVOJ57gWuNU","flags": {},"type": 0,"text": "A burial at sea. Mourners place treasures on the boat of their chief, then set it ablaze. It’ll sink some distance out. Polite observers will be invited to join the festivities to follow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "wApVF7ryYZ49sPgg","flags": {},"type": 0,"text": "An execution. The offender is being buried up to their head below the high tide line. Someone in the gathered crowd is being held back, screaming that the one being buried has been falsely charged. By law they’ve got until the tide comes in to prove it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "RI9IoZ5K6WT0D1XA","flags": {},"type": 0,"text": "A retreat of mystics contemplating the mysteries of the ocean.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "GZRvCtrkgGpWElBc","flags": {},"type": 0,"text": "The tower of a heretical astrologer attempting to capture the moon and stars in their reflection off the water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "e2IzNyygwQTOY6Cs","flags": {},"type": 0,"text": "A floating hull overcome with lead-grey fungus, its crew dead by a saprophytic plague they picked up on distant shores. Some immature sprouting stalks already release thin streams of spores. If not burned or otherwise disposed of the hulk might fully fruit and infest the whole region.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "g1OQ2gYi4FyHJZal","flags": {},"type": 0,"text": "The sand here is spongy, grey, mercury-infused. The fumes rising off it can induce delusions. Some goblins who think themselves human are already here huffing the stuff.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "wdzktJBvKwBCqA0K","flags": {},"type": 0,"text": "A tide pool with a sheepishly dying merman stuck in it. Needs some convincing that surviving is worth the embarrassment of his situation, but will vouch for you to other his underwater allies if rescued.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "WZoTsJOyv4LwzkLN","flags": {},"type": 0,"text": "A nuckalavee charges from the surf. A tireless pursuer, but can’t cross freshwater.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "iZiuzEh6Ds2vH14a","flags": {},"type": 0,"text": "A resplendent coconut palm held sacred by local people. They know, but don’t speak openly of, a ritual by which you can remove an evil presence from someone’s mind (possession, madness, domination, enchantment, etc.) by trepanning them, drilling to the core of a coconut from the sacred palm, and placing the holes together to draw the evil presence from their head and into the coconut. Trees grown from coconuts used in the ritual are twisted things, bearing the mark of the evil they contained.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "MkBK3kT50dQrohXT","flags": {},"type": 0,"text": "A group clad in immaculate white robes, browbeating some reluctant few members into following them willingly into the ocean. Apparently a suicide cult. Non-members are proselytized to, and asked not to interfere.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "gkmlnE0ogpflFkI3","flags": {},"type": 0,"text": "A dwindling iceberg-fortress run aground too far south by unfavourable currents. Its garrison of snow elves are paranoid towards outsiders but desperate for direction to a colder place. It’s a toss-up as to which sentiment will win out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "jeiwwG19Fgb3MYdJ","flags": {},"type": 0,"text": "A self-crewed golem-ship in need of a captain. Willing to kidnap someone to serve the role.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "pcxNgNOwNPmNvw8j","flags": {},"type": 0,"text": "The secret dockyards of a nearby nation, where they’re developing experimental ships. Its guards will be aware of your perimeter breach (though not your exact position) and on high alert.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "xnsVzZQ8lbGXIfnH","flags": {},"type": 0,"text": "A fisher-monk stands posed upon a rock in impossible stillness, wielding a barbed harpoon. He waits for the vanishingly rare rainbow-urchin to pass by, a creature with spines of light of every hue and shade. When he spots it he’ll strike with unerring precision. If interrupted before then the monk will be incomprehensibly salty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "cfbjv7pjJtWItGBg","flags": {},"type": 0,"text": "Sargasso spreads before you, from the beach to the distant horizon. Everything you’ve ever lost beckons from its green tangles. This is a portal to the Sargassium, a world where all things can be found again, or where you too might be lost forever.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "ADIj0NqnAHP7rZHG","flags": {},"type": 0,"text": "The water withdraws, the horizon swells. A tidal wave is coming.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "MRD4QXhg8DFwvOY3","flags": {},"type": 0,"text": "A fish-man flags you down, says they were supposed to meet with a representative from a nearby village to discuss trade agreements, tribute, and breeding rights. As that representative is late, the fish-man explains, you will have to do. Some time in to the negotiation (or fighting, or whatever else) the representative will arrive and react to you based on how you’ve argued for the village’s interests.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "G5ZGc1nY2vcOjYu5","flags": {},"type": 0,"text": "You glimpse a howling whirlpool and waltzing waterspouts a long way from the shore. The visible surface signs of the weapons of an underwater war.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "HfHz4etbPqi6idM6","flags": {},"type": 0,"text": "While walking along on the sand, you suddenly look down and see a turtle crawling toward you. You reach down and flip it over onto its back. The turtle lies there, its belly baking in the hot sun, beating its flippers, trying to turn itself over, but it cannot do so without your help. You are not helping. Why?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "bFwQBnGFtx3rbwbY"}
