{"name": "Bard Songs","description": "One hundred songs that your bard knows how to play!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "Da1VqlCU3cqzJBvR","flags": {},"type": 0,"text": "‘Snuffed The Magic Dragon’ – A song about slaying a dragon that has terrorized the countryside. This song has a part two called ‘Stuffing The Magic Dragon’ in which the party has the dragon stuffed and brought to their castle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "pWnOUUM6U9UDeAdw","flags": {},"type": 0,"text": "‘The Deep One’s Sea Shanty’ – To anyone who can’t speak Aquan this sound sounds like an upbeat sea shanty sung in another language. To those who do speak Aquan it tells the story of ‘The One who causes the waves’ and how he fought the gods themselves to reclaim the sea as his own.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "0fXDS9ylgqli2INY","flags": {},"type": 0,"text": "‘Lycan Virgin’ – Famous wenching song punctuated by wolf howls. Werewolves struggle to resist joining in during these parts, as does anyone else who has had a few…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "XTNY889LaJr8t7hO","flags": {},"type": 0,"text": "‘Crossbow’ – A song about a Ranger who rides into town to collect a bounty, alive or dead, against the Barbarian Reckless Redd. ‘No one dared to ask his business, no one dared to make a slip, ‘cus the Ranger there among them had a crossbow at his hip.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "DCEviTMf7FExPd10","flags": {},"type": 0,"text": "‘The Wizard and the Wren’ – A children’s song about a wizard who built a wooden town taller than any in the land that was undone by a wren who needed twigs to build its nest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "aKFHk0Zbul7tdcrx","flags": {},"type": 0,"text": "‘The Crown on the Head and the Crown on the Heart’ – An epic poem describing a king who was usurped and his journey of growth on his return to the throne.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "mWmNIOwthzIkwV48","flags": {},"type": 0,"text": "‘Ashkeeper’ – A slow and somber dwarven chant about the history of one of their oldest and deepest fortresses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "sFtFUVGFc28NGsIi","flags": {},"type": 0,"text": "‘Our Son Arsen’s Arsine Arson and Parson Carson’s Incarceration Assertion’ – This bar song is known for being a dangerous tongue twister, and requires a DC 20 perform or linguistics check to sing without a serious mouth injury. Failing the check results in being unable to sing or speak for 1d6 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "YJxTiim8dIC1VXzc","flags": {},"type": 0,"text": "‘My Shortest Love’ – a song about the love between an elf and a halfling (hence “shortest”).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "iRnCHgSimAGNMM7D","flags": {},"type": 0,"text": "‘The Seven Dwarves’ – song about how seven dwarves help to rescue a human maiden poisoned by a female wizard.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "ubTMx41gD4yBcARX","flags": {},"type": 0,"text": "‘Blasphemy Song’ – a rhyming song where every verse is an insult to a god. It is usual sung at a speedy pace. Worshipers say any bard who sings the song will face divine retribution, but for most bards, this wasn’t their last song.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "CnekeZSEwVVFx7cy","flags": {},"type": 0,"text": "‘The Seven Screw-ups That Saved the World’ – A song about an adventuring party in which the members kept dying but still managed to stop the apocalypse. Each verse is how they helped the party, and how they died is in the chorus: ‘There were Seven Screw-ups in the party in all, One sang with the banshee in the hall and then there were Six Screw-ups in the party in all’ Popularly altered to sing the praises of other unfortunate adventuring groups.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "F8D8jvRb5AHYSv9c","flags": {},"type": 0,"text": "‘Rocking Chair’ – A calm ballad about an old elven lady remembering the times when she was young and fierce.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "J3TeT45hITBaz2vw","flags": {},"type": 0,"text": "‘Cold Blows the Wind’ – The love ballad of a budding necromancer and the lover she lost to the sea.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "aTU6QpMaJmDnmMK4","flags": {},"type": 0,"text": "‘Letters in the Sky’ – A tragic tale about a prince exiled to the sun and a princess exiled to the moon, and how they can only express their love for each other by arranging the stars into messages. Usually, it ends with the performer gazing skyward on the final chorus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "pbJv9guei42wbl2Z","flags": {},"type": 0,"text": "‘Pahoot’ – A children’s song (best played on the flute or piccolo) that parents roll their eyes at while their children giggle. It features verses about the exploits of Pahoot, the flatulent goblin, who somehow always gets the last laugh whenever he’s ostracized for his odor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "4kTdIgF36zTsvWyu","flags": {},"type": 0,"text": "‘Where You’ve Been’ – A song about a ranger who searches for his lost love, using his tracking skills, but he’s delayed by his memories of the locations he visits. At the end of the song, he finds his love waiting for him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "h85tVtcAkLMENhkz","flags": {},"type": 0,"text": "‘Behind Blue Scales’ – song by a blue dragonborn who wants to break free from chromatic influence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "ZVLzlX3418sTItBJ","flags": {},"type": 0,"text": "‘What’s In A Bottle Of Elfish Wine’ – A popular song among taverns owners and their patrons. This fast paced song is widely known and adapted by everyone who sings it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "ieGeiv608KBBuXcv","flags": {},"type": 0,"text": "‘The Night Groomer’ – a tragic story about a night time barber who was killed by a customer that transformed into a werewolf.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "Nl4fLjN693uyikSL","flags": {},"type": 0,"text": "‘The Lonely Golem’ – A song about a statue coming to life and starting a quest to find friends, forgetting that its job was to protect an ancient weapon built to destroy nations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "TvRIBxIKtJonJjoO","flags": {},"type": 0,"text": "‘The Shortening of Meradian Finn’ – A Dwarven drinking song with thirty-eight official verses (and countless unofficial ones), the song recounts the punishment meted out against an Elven noble who stole from a Dwarven treasury. The chorus ends with a rousing slamming of glasses and a ‘in the end, he never did again!’ It is considered poor taste by many elves, which helps account in part for its popularity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "OzDBwV7UEliDXsNW","flags": {},"type": 0,"text": "‘The Bawdy Body of Biddy Badee’ – A raucous account of an old woman accidentally restored to youth and beauty. The song makes liberal use of alliteration and plays on words: ‘her newly charmed charms were enchanting enchantment; passing by barracks led to guardsman advancement…’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "knrzm5hR0rkjQe28","flags": {},"type": 0,"text": "‘The Cruel Changeling’ – A mournful ballad of a wandering bard falling for a woman at a fair, only to discover that she is wearing another’s face.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "dvGICMxnEflVuVjI","flags": {},"type": 0,"text": "‘And All for a Turnip’ – A song best sung as a round. It tells the story of a hungry halfling and his incredible exploits finding a snack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "FTsPViurS3reuqUl","flags": {},"type": 0,"text": "‘I Eldalië Nairii (sometimes translated as The People Mourn)’ – An Elven Dirge describing the loss of Cyrindes Flestivel, a beautiful and kind mage, to a spreading plague, along with many of her people. A melancholy ode to loss, some have taken it as a representation of the Elves’ sense of mourning for the loss of their brighter world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "7dkPX7yef8OF6meJ","flags": {},"type": 0,"text": "‘I Eldalië Snuiiiiii (The last word is used to sound like snoring or deep breathing)’ – A parody of the Elven Dirge ‘I Eldalië Nairii’, the song is of unknown source; it tells of an Elven bard singing the dirge, while the listeners fall asleep from boredom. A sure way to insult the singer of such a dirge, it is best sung with as much false pomposity as possible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "fOTsImh1oaOwCMpq","flags": {},"type": 0,"text": "‘But the Gnome Was Never Seen’ – A children’s song, used to remind Gnomish youths about the importance of caution and care.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "v8Yby4bQxpPKXbvi","flags": {},"type": 0,"text": "‘Adam the Easygoing’ – A relaxed song telling the tale of the titular Adam, a large, pudgy human paladin with an odd knack for befriending those he defeated in combat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "SB1AhwkyDeHsRNIV","flags": {},"type": 0,"text": "‘I Write the Spells’ – A catchy if somewhat easily grating little song of unknown origin. If sung, it makes certain wizards go absolutely berserk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "rXcDw4S5BaXUIGyW","flags": {},"type": 0,"text": "‘Nyarna Nwalcamun’ – The Saga of the Hero Grefedd and his journey to destroy the sentient cursed sword Nwalcamun. Traditionally, the climactic final battle scene is punctuated by the beat of a hammer on an anvil, representing Grefedd’s smashing of Nwalcamun while under attack by a drow army.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "S114Lz2kKVQTlAeH","flags": {},"type": 0,"text": "‘The Green Eyes of Mallistari’ – The wooing song of a human woodsman for a half-elven maiden ‘met in a shady glade.’ The song is notable for a memorable bridge, often used when teaching the lute.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "mTNmEkQUbXnOG706","flags": {},"type": 0,"text": "‘Ga-Grosh For-Thaash’ – A song adapted from an Orcish marching anthem, useful for learning the rudiments of Orcish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "iKkoWtz1dX6ua09M","flags": {},"type": 0,"text": "‘The Oysters of Miss Marchelle’ – A sea shanty, recounting the joys of stopping in port at an establishment called ‘Harbor Belle.’ The song declares that ‘no sailor can resist the delight of the oysters of Miss Marchelle.’ The shanty, unlike many such songs, is not clearly innuendo, although it certainly may be (and many sailors sing it as such).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "gMnDuchSkakF5StP","flags": {},"type": 0,"text": "‘Arnash Quadmatter’ – A song mocking the quintessential absent-minded wizard, referring to the foibles caused by having ‘his nose in a book, a book, a book…’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "3t4gWhCZ1w3sfGRX","flags": {},"type": 0,"text": "‘The Missing Child’ – A mournful Elven song about a mother looking for her lost child, eventually going mad with grief and drowning herself, only to rise again as a banshee.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "X26lSRH3PrEZPUvi","flags": {},"type": 0,"text": "‘Grandma Got Eaten By An Owlbear’ – A Popular song in winter months reminding people that they shouldent allow their elderly ex adventuring grandmother to attempt to wrestle monstrosities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "LNTrtxgjJo3l8kdb","flags": {},"type": 0,"text": "‘You Can Just Call Me The Gnome’ – A fast-paced, silly song telling the increasing exploits of Hamish McTamish, a fictional gnome adventurer. Each time the chorus is sung, Hamish’s name is lengthened with more titles (the last chorus includes as many silly titles as the singer can think of and can sing in a single breath) followed by ‘but you can just call me the Gnome!’ Although believed to be human in origin, gnomes love the song, and an informal competition has sprung up as to the longest final chorus. The current record belongs to Sprigvill Gaudynack, who (via both her own talent and magical augmentation) kept the last chorus going for three and a half minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "WNnWTUk5hLbibWBX","flags": {},"type": 0,"text": "‘Callaud’s Pre-funeral Dance’ – A sprightly instrumental air for country dances. If played with a performance check DC 18 or higher, it functions like ‘Otto’s Irresistible Dance’ for anyone not in combat or threatened (i.e. it will make listening townsfolk break out into dance, but not if you are in the midst of robbing their homes).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "1xYjTPQl0mzTgcAK","flags": {},"type": 0,"text": "‘Long, Gone Galangal’ – A love story told through Gamelan music about an adventurous Chef seeking a rare root in the forest. Instead of finding it, they find the love of their life. The song is quite long, requires a large number of musicians to play properly, and has a happy ending.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "0FcqbrTO0vIuZoc0","flags": {},"type": 0,"text": "‘Untranslateable Orcish Proverb’ – A morality tale operatically told through Carved Masks, Huge Percussion Instruments (Taiko style Drumming), Slapstick Pantomime, and Throat Singing techniques. A classic of High Orcish culture, now practically lost to time and the collapse of High-Orcish society. The choregraphy is quite energetic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "hpwMHvPXRcoVrHWL","flags": {},"type": 0,"text": "‘Great-Grandmother Will Enjoy Eating Your Flesh An Orchestral Eladrin Morality Tale from the Far Fey Realms’ – A bold hero cheats and fails to respect the ancestral Mother-spirit. The mother spirit holds the hero to his deal and devours him for his crimes. The tale is told non-verbally, through colorful illusion and intepretive dance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "SE3RjcyXe9PvfUua","flags": {},"type": 0,"text": "‘My Lord, Come-a-Leaping’ – A bawdy Halfling tale about a Randy Prince who is turned into Frog when he comes on too strong to a powerful and beautiful Halfling Sorceress, and discovers he likes being a Frog more than a Ruler.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "VpzmQ1scFa3DKeW6","flags": {},"type": 0,"text": "‘The Farmer’s Corn’ – A bawdy tale about a comely farmer’s daughter who mishears something someone said, and spreads gossip around the village.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "qSjYWY6JwsOCowdH","flags": {},"type": 0,"text": "‘The Three Spinners’ – A children’s Tale retold through a tongue twisting call and response song. It is about three unmarried magical Farm-women who challenge that they can out-spin (thread) better than anyone. They challenge a devil, who curses one with a swollen foot, one with an infected finger, and one with an infected lip. The woman with the infected lip’s line is supposed to be sung while holding one’s tongue. In the end, the women win, the devil is defeated, and each one wins more gold than they know what to do with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "LxFB8kpnZUl9Bgqw","flags": {},"type": 0,"text": "‘The Town with No Name’ – ‘I came across a pokey town. Not much going on and curtains all down. I came across a smokey tavern. Not much going on in that pokey town.’ A slow sad song about a old woman that lost her way and found a town not on any maps they brought and only too late discovered it to be a ghost town. (Actual ghost town not just one that was abandoned).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "rSh0tdaL08Uzm2L4","flags": {},"type": 0,"text": "‘Beware A Human Bard’ – A pseudo-cautionary song about the lascivious characteristics of human bards; the song begins with an Elvish mother warning her daughter, and proceeds through all the more common races into more and more ridiculous warnings (‘Mama Golem warns that he’ll say he likes your rocks, but what he’s really thinking of…’)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "DVTJRhnv4K98FJZW","flags": {},"type": 0,"text": "‘The Fall of the Sun’ – A mournful Aarakocra ballad, said to have been written by the first to travel from the Elemental Plane of Air and see a sunset.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "urClPz0dLpkuUPT2","flags": {},"type": 0,"text": "‘The Cheese Song’ – ‘Cheese Cheese Cheese Cheese Cheese Cheese Cheese Cheese Cheese Cheese’ A song used by Kenku bards who create melodies out of the different voices and accents they have heard the word in the songs they sing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "jwMW4U2H1uyDBGfq","flags": {},"type": 0,"text": "‘Glida’s Wedding’ – A traditional halfling travel song, describing the setup for a halfling wedding, ‘held in the shadow of the wagons on a Summer Sunday.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "QlDxZxrJGlVWPAYG","flags": {},"type": 0,"text": "‘The Flute & Lute’ – A ‘dueling instruments’ style song featuring the eponymous instruments. While some bards have added words to the lute portion, it is usually simply instrumental.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "4UeOjgMu5tyMYeyr","flags": {},"type": 0,"text": "‘Bear Bride’ – A song about a human maid, enchanted by a fair traveler into leaving her home, who meets a sad end when she discovers the traveler is a dangerous druid. Likely originating in legends warning of associating with strangers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "tzzPdCzvI5TIVfvs","flags": {},"type": 0,"text": "‘Rocks Fall’ – A cautionary song about travelers who did not heed the warnings of the gods and met a sudden and tragic end in an avalanche.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "8lGpMCxr4IxnIuPY","flags": {},"type": 0,"text": "‘Green Fields, Grey Fields (The Old Woman and Young Girl)’ – A song about an old woman walking with her great-granddaughter. The song is both nostalgic and melancholy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "4EBCcerUbLEuQtTu","flags": {},"type": 0,"text": "‘The Solemn Judge’ – A song about an irascible old magistrate, his beautiful daughter, and the blacksmith’s son who falls for her. The last verse tells of the judge marrying the happy couple.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "2rz0VaSRNdZpWLen","flags": {},"type": 0,"text": "‘Fleshy Pinklings’ – An Orcish Festival song, championing the power of the Orcish races and declaring their superiority over the rest of the world, and their destiny as conquerors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "jO6vRUuwOMNQMfEV","flags": {},"type": 0,"text": "‘Cloth in the Street’ – A protest song, originally written in Malthcumband, calling for weavers to rise up against an unjust leader. Banned in many evil-aligned areas, the song calls for the people to rise up and take back the city. Ironically, one of the governments to ban the song is the tyrannical Communal Autocracy of Malthcumband, formed by many of the same weavers the song was first written for.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "9g8SwzmyWgxTAy4y","flags": {},"type": 0,"text": "‘The Colors Of Death’ – A colorful tale of how an adventuring party was brutally murdered by all the chromatic dragons at once.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "De0HuPpoxBEiCXh3","flags": {},"type": 0,"text": "‘Well Well Well’ – A song relating how several people did mischief and subsequently fell into a hole in the ground. The chorus starts with: ‘Well Well Well, look who fell here!’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "WMp4kgyrVMmc8TpG","flags": {},"type": 0,"text": "‘To The Death’ – A marching song about a young soldier who plans on dying bravely to defend their homeland, and asks their leader to write a letter home for them to their one true love. It was quite popular long ago, but is now considered cloying and outdated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "60aljTszW9eFffoF","flags": {},"type": 0,"text": "‘Ale for the Victorious’ – A popular drinking song sung by soldiers while off-duty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "6ic4Clrugkyp2gAd","flags": {},"type": 0,"text": "‘To My Lover’s Lover’s Love’ – A downer of a song, this tear-jerker is a letter dictated, postmortem, by a forlorn lover telling all the sordid and dirty deeds of their former lover, now in the arms of another.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "aVyxVJrFGEfQPYE1","flags": {},"type": 0,"text": "‘Sir Dalloway the Duelist’ – A song from a hundred years ago, poking fun at nobles and fragile honor. It was once considered unlawful to sing it in polite company, but it is now a popular folk ballad that is quite catchy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "dDwsb3ltLaGsAvcJ","flags": {},"type": 0,"text": "‘Rhetting the Flax’ – A work song about how many bales of flax a young and ambitious villager promises to grow, harvest, prepare, spin, weave, and sell, so they can have enough fabric and gold for a huge wedding, if only their lover would return their affection. The song is a thinly veiled sexual innuendo.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "pKF0Thp6ZZGYsqYS","flags": {},"type": 0,"text": "‘The Horrible Haggis of Hampstead Heath’ – A rhyming cumulative song about a mimic that swallows an farmer’s old, rotten haggis, gains magical powers, and then goes on a rampage. It devours an entire town, where every occupant, their occupation, their children, and the name of their family pets are listed. At first no-one stops it because they are too self-centered. In the end, the town’s guards and even the mayor are devoured. The song has a happy ending as the unlikely hero lets themselves get devoured and then slices open the mimic from the inside, releasing everybody safe and sound. The best bards are able to keep the crowd going for an entire hour, and then recite in reverse order the entire population of the village.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "orJdQxTge438DtGS","flags": {},"type": 0,"text": "‘Ogre-Melon Crawl’ – A catchy ditty which is a comedic precautionary tale about walking and not riding a horse if you have been drinking Ogre-Melon wine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "jB5CUTNQs3oQFksy","flags": {},"type": 0,"text": "‘Two Hundred and Seventeen Heartbeats’ – a controversial Elven composition. The singer takes a breath, then measures their pulse in silence for the duration that the title implies, while the audience is meant to slowly embrace the many natural sounds taking place during that time as a song of their own. It has been hailed by some musicians as a deep, thoughtful reflection on natural sounds, but criticized by others as a bad joke.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "iJFyXgho7uf6Mmmf","flags": {},"type": 0,"text": "‘Dwavers Wumblerubs’ – A halfling nonsense song, meant to sound like, but not actually be, Dwarvish. Sung with mock solemnity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "NxZeHWwQ1B0oA0KP","flags": {},"type": 0,"text": "‘Slashworthy’ – A sea shanty about a cutlass that never went dull, until the captain of the ship used it to shave his back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "aSYd9Z9aR51311bk","flags": {},"type": 0,"text": "‘The Old Dun Cow’ – The dedicated patrons of a tavern take refuge in the cellar while the building burns down around them, and take advantage of the taverner’s stores while waiting to be rescued.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "d6tjY8lPgbehTfxQ","flags": {},"type": 0,"text": "‘The Hollowed One’ – A tale about a man who gave his mind, will, and voice to be able to house a disgraced god to protect his people. Any who hear it are inclined to feel a deep lament for this person.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "HFOQ0dWwfnvs9iE5","flags": {},"type": 0,"text": "‘The Snarl’ – A frightening song about gnoll attacks, with reference to the sounds they make beforehand. Sure to give a frisson to listeners.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "fPw8LsJP3dHRWoGI","flags": {},"type": 0,"text": "‘Duplicitous Dannalor’ – A song about a half-elf man who is having simultaneous affairs with an elven woman and a human woman.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "UEHudMGuhgP4T6Br","flags": {},"type": 0,"text": "‘Dreaming of an Inn’ – A ballad of an adventurer in the wilderness, missing civilization and bemoaning the uncouth surroundings and travelling companions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "eTQaB7813bOQW5Dc","flags": {},"type": 0,"text": "‘Gandavous Thunke’ – Oh, Gandavous Thunke was a dangerous drunk with chaos instilled in his soul, And when faced with sellswords, or rampaging Orc Hordes, Or an angry cantankerous Troll, Old Gandy would growl and fix them with a scowl and unleash the magic inside, Calling forth lightning, or- equally frightening- A fireball, leaving them fried. Now, though it seems tragic, the use of the magic has had an effect on his hue; So if you’re foolhardy and meet him at a party, you can call him Old Gandy the Blue.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "xnkxlgMUVoNHB0eJ","flags": {},"type": 0,"text": "‘This Moment of Magic’ – A love song about a wizard’s apprentice falling for his classmate as they cooperate in the creation of a summoning circle. ‘Though I open a gate to the Plane of Air, and float through unending skies, I would never find night that was dark as your hair, nor a view as blue as your eyes.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "QmzRqJ5MGsQvfyzi","flags": {},"type": 0,"text": "‘Robin Redbreast’ – A song about a bird hopping through the forest. Although unknown by many, including some of its singers, there is a second message contained in thieves’ cant within the song, describing the guard patterns of the Royal Summer Palace of Keann.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "CU5EB9icVXZTpsCt","flags": {},"type": 0,"text": "‘The Future Journey’ – A Dwarven song about the afterlife ‘dug down below.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "lodUhZfElwPyPXs1","flags": {},"type": 0,"text": "‘Tenting on the Old Campground’ – a ballad of a soldier honoring and remembering those they’ve lost and wishing for an end of the war they are fighting.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "p4wpHHBGqXXvToQp","flags": {},"type": 0,"text": "‘My Hedgehog Son’ – A catchy, nonsense, drinking song about a magical, talking hedgehog that gets adopted by a childless farmer, the hedgehog rides a rooster like a knight on a horse, and makes the farmer rich. The song is filled with tongue twisters. Bards occasionally challenge each other to invent and repeat new verses, each more difficult and hilarious than the last, while taking a drink after every flubbed line.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "mttbWSsfDoEzUIIG","flags": {},"type": 0,"text": "‘The Silken Meadow’ – Who knew ancient Eladrin epic poetry turned thousand year old ballad could be so raunchy?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "ZDDDHTOqFNP1UyMz","flags": {},"type": 0,"text": "‘Llolth’s Lullaby’ – An adventuring bard somewhere made it all the way down to the underdark, and heard one or two of the teaching songs sung by the Creche Matrons who give young Drow infants the education they need to survive the rigors of life; the song is in a deep dialect of undercommon that is almost never spoken anymore, but it is filled with all sorts of ‘Learning Magic’, mnemonics, and cultural references that makes it a sort of memetic hazard (you NEVER forget the words if sung by a powerful enough teacher), but the effect is less so when you don’t understand the language. That adventurous bard made it back to the surface, but not understanding the dialect of the deep, transposed the lullaby into a few other chords and added an improvisational lick of their own. That was a thousand years ago, and people have been humming and playing the tune up here ever since then, 50 generations later.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "Z3QFETCt9Uo60xUR","flags": {},"type": 0,"text": "‘Health Potion #9’ – A song about a long-suffering herbalist companion to a luckless knight and the scrapes the two of them get into. In the end, they end happily- the knight marries a guard captain who arrests him, while the herbalist falls for a local fortune teller.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "ihoqNkJAbo4yMEQv","flags": {},"type": 0,"text": "‘Ghouls in the Graveyard’ – A song about running through a graveyard seeking to avoid the attack of undead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "WvrCnnxxJDIY3B7t","flags": {},"type": 0,"text": "‘A Red Ribbon’ – A murder-ballad. A lover is given a red ribbon, the lover cheats while wearing the ribbon. The lover is strangled with said ribbon. The song is sung from the perspective of the lover wearing the red ribbon and ends abruptly, mid verse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "jNFns92alSoS9P2n","flags": {},"type": 0,"text": "‘She’s Won the Crusade’ – A song about the exploits of a halfling bard, celebrating her exploits in the Great Crusade of Nevis with increasingly impossible descriptions of her victories.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "QEsqtek6gWfxN8Cz","flags": {},"type": 0,"text": "‘Last breath’ – A song about the recent death of a loved one, party member, and loss, the song goes through the 5 stages of grief as well.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "Ah0HxBBiVMySswYf","flags": {},"type": 0,"text": "‘Hurry Up and Die’ – A song about a necromancer seeking a zombie companion, but surrounded only by living creatures.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "8WvS3mpAnUSgvf3Z","flags": {},"type": 0,"text": "‘Run Through The Jungle’ – A saga of adventurers who managed to successfully get through the Haunted Temple of Khymann’roe and obtain the Crystal of Nor’Vesh without ever entering combat- simply by running away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "z98RyRjDDEVAgzIm","flags": {},"type": 0,"text": "‘No Rest For The Wicked’ – This song tells the tale of Caela of the Mammoth, a paladin of vengeance from a barbarian tribe, on her quest to hunt down the travelers who robbed and killed her father.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "tHe4ONkiWzhgXaBn","flags": {},"type": 0,"text": "‘The Stew’ – a Farcical portrayal of an foolish adventurer getting news that their loved one has decided that they are probably dead and has moved on. The distraught adventurer falls in love with the attractive savage, promising they’d ‘Jump in the Stew for You’. It has become a popular saying amongst foolish young lovers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "4SMPXfG6Ok8gb4fK","flags": {},"type": 0,"text": "‘There Is No Mountain’ – A chant developed in the monastery of Gar-Yin. The chant is used to focus the speaker away from the material realm, and declares the non-existence of the mountain, valley, and river visible from the monastery’s meditation area.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "Wnubt6KkcQl5cbl2","flags": {},"type": 0,"text": "‘The Scornful Beauty’ – A human traveler falls for a Dwarven gemsmith’s daughter, but she rebuffs his advances. The song calls on her to turn her head and consider his suit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "5m0sJuZhlUXovKlF","flags": {},"type": 0,"text": "‘Dihen-Nin (Forgive Me)’ – A mournful plea by an Elven soldier to his fallen comrades, begging their forgiveness for his survival ‘when your songs have been ended.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "41P2TElvodJNVpby","flags": {},"type": 0,"text": "‘Captain Hennion’s Wife’ – A decidedly ribald army song about the wife of a commanding officer; it is common to adapt a verse to be about the wife (or daughter) of a current army leader. Singing this song can be a good way to end up in the stocks; nevertheless, it is very popular in camp.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "2JL6bWdAHyKOHu3l","flags": {},"type": 0,"text": "‘And Another Tree Falls’ – A mournful tale of a dryad, trying unsuccessfully to protect her grove from the incursion of a growing human city. This song is abnormally famous for starting bar fights, especially if there are urban and wild elements in the tavern.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "XAh0xe9xQKRMydXi","flags": {},"type": 0,"text": "‘Clotted Soil’ – A recounting of the betrayal of King Bhoulthekk Bramfisted and his army by the Elven nation of Alv’dirae when the Dwarven army stood to defend Alv’dirae’s borders from attacks by the Ghowldresh Empire. One of the often-quoted verses from the saga includes the line ‘And may I trust a broken axe before an elf again.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "HrDSfmozGFGbaAIU","flags": {},"type": 0,"text": "‘The Old Fisherman’ – A shanty about a mysterious old Dwarven fisherman, encountered in the middle of the ocean on a little skiff. According to legend, if the fisherman is disturbed by a ship and not treated with respect, he kills every guilty soul on the ship with his gaff and leaves them hanging from the yardarms like a fish market.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "raXfOpTMUu0czgGB","flags": {},"type": 0,"text": "‘Simon McGurk’ – A shanty about a brilliant but lazy pirate. ‘Oh Simon McGurk, scared stiff of work, sailing all over the sea…’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "7jb7fP3Pzt0Yyy1P","flags": {},"type": 0,"text": "‘Greed’s Foul End’ – A movement from a morality play featuring a single musician and a vocalist. The piece is about the dangers of greed and the benefits of charity. Poignant, but difficult to pull off; often a touchstone work for performers of an ecclesiastical bent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "4m3ntBEGQlieAinQ"}
