{"name": "Ridiculous Famous Legends","description": "One hundred legends and fables that all the locals will be happy to share with you!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "QYrTQUxTzXYGyyTF","flags": {},"type": 0,"text": "I once saw Gornak the Brave pick up the tavern and spin it around on the tip of his finger! When he set it back down and walked inside, he hadn’t even spilled his beer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "ccqq9esl0kHgGouG","flags": {},"type": 0,"text": "You ever heard of the man named miryks? He was the only man to have ever bedded a dragon, and then he bedded three more!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "k4zETqRLytft8bXq","flags": {},"type": 0,"text": "you ever hear of Ogrub the ogre? It’s said that a magical artifact gave him a moral compass and he helped save a whole village, kept them all from drowning during the dam break, then he settled down as a farmer there for awhile. No one knows what happened to him after that.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "TOVxUYBAArb8pJbF","flags": {},"type": 0,"text": "You ever heard of Fizziks the wealthiest goblin to ever live? It’s said that he made his fortune following adventurers around and sneaking into the dungeons after they come back out, claiming anything valuable left behind. He supposedly has a knack for finding hidden doors and picking locks, and would find all kind of stuff stashed away that was missed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "inNPPwDr5NNHg8fq","flags": {},"type": 0,"text": "Ever heard about the dwarf-eating forest? I heard that the dwarves cut and chopped some roots under that region, not realizing it was still a live tree, and now any dwarf who happens in that forest is never seen again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "PgX58RoDdkzuPNx7","flags": {},"type": 0,"text": "They say Marcol Giantsteppe built the mountains out of dragon bones to protect our little town.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "NehSE4WqLgvAoUC5","flags": {},"type": 0,"text": "The Legend(s) of Kiven, Stupidest Man in All the Land. Once walked out of an inn and was unable to find his way back… Even from within sight of the inn itself. He drank an entire bottle of ink and promptly vomited. Did it again the next day. Learned the Shocking Grasp cantrip… and tested it on himself. He stole a Sending Stone from a fellow adventurer, and tried to sell it back to him. He frequently confuses cats for dogs, and vice versa.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "hlX47KRNf06Bc0Mi","flags": {},"type": 0,"text": "Have you heard the tail of Uthall Twice-Orphaned Thunukalathi? He was a Goliath who beat a storm giant in a wrestling match, and then proceeded to beat an empyrean in a body building contest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "t963Egv6hFGr4aVp","flags": {},"type": 0,"text": "A long time ago, there was a gnoll woman named Cisathaka. She rejected her demonic heritage and entered an halfling beauty pageant, and won. She donated all the prize money to a struggling orphanage in (insert city name from the setting here).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "avUPFkQXBkRGXAQh","flags": {},"type": 0,"text": "Ever heard of grüngle the filthy? He stunk so much that he once caused a rust monster to dissolve with a single breath.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "IFoFYacbL68CHu9j","flags": {},"type": 0,"text": "Just read the book “Praise the Great Beholder!”. It’s about Chezdrur the beholder, a flawless character who ends up easily killing the tarrasque in a great battle. It was written by a cult who worships Chezdrur, who is real but hasn’t even seen the tarrasque from afar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "WdsGew60dbiNgqMR","flags": {},"type": 0,"text": "One winter it was so cold that the dawn froze solid. The sun normally rose between two mountains, but the ice had built up so much that it stuck firmly in place. The first sunbeams of the day had frozen up like golden icicles. A ranger named Dav Oket was coming home from a successful night hunting with a fresh owlbear. Seeing the sun frozen in place, and being a smart man, Dav knew he had to do something quickly or the world would plunge into chaos. He swiftly sprinted up the frozen sunbeams and used the heat of the owlbear carcass to melt the ice. Dav gave the sun a kick to dislodge it, lit his pipe on the sun, and slid down the sunbeams with the owlbear right to his front door. He even kept a bit of the sunrise in his pocket to remember the occasion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "YbvwDFveRImxu03i","flags": {},"type": 0,"text": "If you travel to Owlbear Lake on a quiet day, you might just catch a glimpse of The Monster. It looks like a great brown snake 90 feet long, with two huge ears coming out the sides of its head and jaws large enough to swallow a man in one gulp! Some say it has hundreds of small legs that make it kind of skitter across the ground, but it can swim faster than a horse can gallop. Sometimes it sneaks up on swimmers, and if it’s not hungry it just pulls them under and lets them go. Of course old Dav Oket heard about this monster and bet his friends that he could take it on. After days of stalking, Dav finally had a shot with his bow. He was a crack shot, but not an arrow found its mark. The Monster scuttled forward and ate Dav’s bow! So the ranger wrapped his arms around the beast and wrestled with it. The fight was so great, so colossal, that it stirred up a storm over the lake. Finally, Dav threw the Monster over his shoulder, and it sailed right over the mountain. To this day, you can cross the lake in safety if you call out, ‘Old Dav’s a-coming!’ and the Monster swims away to the bottom of the lake.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "m93XcO07PlWIDxZm","flags": {},"type": 0,"text": "Lady of Pain! The lady who had so many piercings and self inflicted curses she rattled and smoked with every movement.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "L7DeM3G6d4ugFiBs","flags": {},"type": 0,"text": "Have you heard the story of the great blind sorcerer? Prince of an elven kingdom, he killed three gods as a child and that was before he learned magic!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "XsWTMfHpb1rzfqqB","flags": {},"type": 0,"text": "You haven’t heard of Kim the Great and his stories? It is said that at the age of 9 he had slain a dragon alone to protect the people of his land, with his bare hands, using no magic. Out Great Leader Kim truly is a gift from the gods","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "3KYHJ7qWnkN2krHQ","flags": {},"type": 0,"text": "Ebrius ‘the drunk’ once drank the entire ocean after his ale fell in it. Impressed by his resolution the gods proclaimed him the ‘Lord of the drunkards’. It’s true, you can ask him yourself, he’s probably in the tavern right now. (Just has a godlike bluff, advantage if the person he’s talking to is drunk too).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "tZGUCGFWFngVDhHs","flags": {},"type": 0,"text": "Centuries ago, there was a dark mage, Daffy, the Implacable. He summoned another moon, and named it Majorus. It was going to fall on the world, and destroy all of it, but it turned out the ‘moon’ was just too close, making it seem big. So, a group of adventurers threw fireballs at it, and Majorus burned down. Daffy was never seen again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "bXzOn3sqH3ujNB6a","flags": {},"type": 0,"text": "There once was a boy, called Brightus. It’s said he made a heavier-than-air machine, that could fly without magic. He rode what was called ‘The Airplane’ out of a cliff, as a crowd watched him fly it into the unknown. Legend says Brightus will one day return, giving flying machines to everyone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "Qbjo0rMKzMg8OVu5","flags": {},"type": 0,"text": "It’s said the Great King (intentionaly vague) had a younger brother, who wanted to take the crown at all costs. So, he made deals with several demons, and got enough power to kill everyone but his brother in the kingdom, replace them with minions, and get rid of all the evidence. Legend has it the original King was magically paralysed and made invisible before all that happened, and had to watch as his brother destroyed everything and took his identity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "tU3gK3gH6TKM3LlH","flags": {},"type": 0,"text": "There once was a deaf woman with a ridiculous name. So ridiculous, in fact, that whoever heard it laughed to death. She caused death everywhere he went, and eventually got her hearing defficiency cured by an also deaf cleric. So, she heard her name, and laughed to death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "p0x1k8WaUbVjaJyQ","flags": {},"type": 0,"text": "Ever hear the tale of Rutmod the Sunderer? Legend says Rutmod won two dozen rounds of gladitorial combat, and severed the arms of every single combatant that fought that day. The strangest part is, he started with his own!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "d0MQlVFhScw3GOHz","flags": {},"type": 0,"text": "Legend tells of a man by the name of Throckmorton, who would only traverse the land on a board with several small wheels attached to it. He would flip this board around in a dizzying display of finesse, and could propel himself faster than any sprinter. No man or beast could touch him. One day, Throckmorton grew bored of this plane, and propelled off of a ramp upwards into the heavens themselves, where he performs his tricks to this day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "JpzuKhS5SGimOn38","flags": {},"type": 0,"text": "Before the ancients took hold in the land there was a legend that defied the rules of logic. Its said that in The Ethereal Highlands there lived a young lady named Megaera. Rumor has it that she was raised by clan of giants who had never seen a human before. One day, Megaera wondered too far away from the giants encampment, and entered the dark forest. Megaera sent several days lost in the woods afraid and starving. There was dragon larking in the shadows then suddenly it flow out of the darkness penning Megaera to the ground. Hopelessness dawned on Megaera as the dragon opened its jaws ready for a fest. The dragon’s piercing teeth bit into Megaera as she was eaten alive, screams began to go numb the fur down she went into its stomach. Death was assured for Megaera. Then something happened, the dragon began to roar violently in pain. Megeare was more than a mer mortal, she was the offspring of t Eztia, Goddess Of Destiny. Megaera short ripped the dragon a part from the inside out, however, she left the wings intacted so she could meld with them in order to fly into the heavens.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "0EGLPR2WijEekwmU","flags": {},"type": 0,"text": "Have you heard the tale of Nublig the goblin chronomancer? Long story short he was his own grandfather.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "oUJymE2BtmcfZRU0","flags": {},"type": 0,"text": "Long ago there was an Elf and a Dwarf who competed at everything to see who was better. One day they asked a Druid to turn them both into trees to see who was the better tree and the Druid obliged. The Elf became a tall elegant oak and the Dwarf became a tiny fir tree, however, since neither could speak to request to be changed back they became stuck that way. They propagated and now there are short sturdy pine trees all over the Dwarf mountains and tall oaks throughout the Elven kingdoms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "XIYU7QZoVKgZlyqU","flags": {},"type": 0,"text": "The first globe map was created when a Beholder flew up enough to see the entire world and then lost his eye on the way down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "OtwKq1OGtNQGiClW","flags": {},"type": 0,"text": "There was once a love so strong between two people that if you stood between them one side of you would feel ice, and the other straight fire.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "q45hK62mu2eAQ9OV","flags": {},"type": 0,"text": "The giant threw the rock with such strength that the rock made a roundabout and hit him in the back killing him. When his friend came to see what left a big hole in the giants head, he too got a stone blowing his head up.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "2GyaS2yKsY0dly6f","flags": {},"type": 0,"text": "The tribes of kzechem sacrifice their people at the same spot. This has been a tradition for thousands of years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "qUmqjqIyXnFYnF4R","flags": {},"type": 0,"text": "Tarrasques are so big that their white blood cells fell of and became coconuts. Their red blood cells then became strawberries.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "fxPCSnt9jlYjtOzc","flags": {},"type": 0,"text": "Thrain was so strong already at birth that when a deadly plague came to kill him and his family, he tore apart the evil spirit with his little baby hands. Saving his kingdom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "o7hbaOKoMVJ7Yvr1","flags": {},"type": 0,"text": "And then the Goliath swung his great sword at the king’s head. He cleaved with such a fierce blow the head went flying. It flew for miles, falling into a rabbit hole. That’s we came up with golf.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "CBGDKD0F0CuyQgXU","flags": {},"type": 0,"text": "According to eyewitnesses the king of the elves was seen on a shield, going downwards on a slope filled with dead bodies, He then turned with his beautiful archery skills the hill/mountain into a bloodied one. That’s why this is called blood slope/blood mountain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "huvqXVtc1mHmMmPU","flags": {},"type": 0,"text": "(Here lies) Karrugan the Conqueror, born a slave, freed his people and conquered all the savage land, killing all the slaver regents and let every slave free, and formed an invincible nomad order made of free slaves. Then he set sail to conquer our land, with an invincible fleet. He was then killed by the first arrow shot in the conflict by mistake by a local farmer conscripted in the first meat shield army to give time to the other armies to regroup. One weeks later all the surviving men and women from the Karrugan Army, were made slave again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "AGgB8q17khIWoz1t","flags": {},"type": 0,"text": "Have you heard of Billy Punchyface, the ratfolk who once knocked out an orc twice his size? Granted, that wasn’t a very big orc, but still!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "15mQ9XVtrdB7doZb","flags": {},"type": 0,"text": "Ever heard of captain goldline? This pirate had such an incredible voice that he could attract mermaids. He sailed the seas and used his gift to gather mermaids. The mermaids attracked other sailors and he raided them. He build the biggest fortune under all pirates ever and controlled the seas with his fleet. However he sickend a rare sexual disease. They call it the mermaids revenge. As a result he grew gills and choked to death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "q0Cd93iukLjdRuCk","flags": {},"type": 0,"text": "Ever heard of archmage Woopios? He faced the greatest and biggest orc warrior in history in the great war. Well this old guy messed up some words and instead of shrinking the orc he grew multiple times is size. Well, guess how that ended for him and the human army. I can tell you that: It wasnt pretty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "uLCaQXHiYlbgQsZj","flags": {},"type": 0,"text": "Ever heard of Father jack? Well this handsome dude used to get every girl into bed he wanted since his beard startet to grow. You maybe ask why they call him Father? Better pose that question to his 122 sons and 99 daughters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "XYz5uDrGlnG1USrM","flags": {},"type": 0,"text": "Ever heard of Sebastian Blowa? His guy searched for the magical unicorn all his life. As everyone knows if you find it, the unicorn will grant you a wish. He wanted to become king of the realm and unite all kingdoms. He finally found the unicorn after 80 years of search. The senile old Sebastian then said out of relief: ‘ i wish you would be easier to find..’. Well wish grated. Next guy became king the next day causing the biggest war in history.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "OahYb7i3ytpIvISW","flags": {},"type": 0,"text": "Ever heard of the head of Froja? Well there once was a wizard called Froja who got sentenced to death for using black magic. He managed to break free and sneak into the library of the mage academy. He found a spell in the forbidden books which grants eternal life. After he casted the spell he went back to the Major of the city and demanded his freedom. They refused. Put him in jail and chopped of his head next day. Well, he’s still alive today. They keep his head in the Academy as a training object for young students.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "jzLMJGbbRC1rAKlA","flags": {},"type": 0,"text": "Ever heard of Groolp the kuo toa that actually saw Blibdoolpoolp with his very eyes? He told me so himself!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "PNmBVOZvTt0edOAv","flags": {},"type": 0,"text": "Haven’t you heard about Dwaine the stone giant that grew so strong that he won in a fight against 10,000 manes, 10 maralith, 5 balor, and Orcus himself?!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "FtHluDkv6EMo2MhY","flags": {},"type": 0,"text": "There once was a great city where all of the world’s strongest and most fantastic mages gathered to perform amazing works of magic. One day, a dark wizard came and attempted to seize the city for his own. The wards around the city activated, trying to drive him out, but their magics conflicted and the entire city turned into the great forest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "0f04lIZCrnWNtzJe","flags": {},"type": 0,"text": "Have you heard of the Legendary Hero Chef? It goes that this youth left his island home and fought not to slay monsters, but to taste them. Goblin stew, kobold fricasee, ooze puddings, you name it, he tasted it. He was last seen venturing into the Forbidden Peaks, seeking to have his last meal: Dragon Tail Roast.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "MYJIIPlF4EhkcvNd","flags": {},"type": 0,"text": "They say there’s this… ‘Diner in the Middle of Nowhere’. A solitary door pops up, out of thin air, in front of weary travelers. Those who enter find themselves in this dining hall where strangely dressed people sit on metal stools and leather seats, served by a woman gliding on wheeled shoes. They serve ‘panned cakes’ and ‘burg-hers’. When you finally exit the establishment, you end up leagues away from where you first entered it!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "kxaahrFQRaZNwxBp","flags": {},"type": 0,"text": "There used to be a wizard so skilled in divination magic that she never bothered having a conversation, because she already knew how it was going to end.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "RgdN9KXt51X9rlv4","flags": {},"type": 0,"text": "There once was a transmutation wizard so prolific that eventually any gold coming from this kingdom was treated as scrap metal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "xlFQFLDCbSP0Q35s","flags": {},"type": 0,"text": "There once was a druid who loved nature so much that all the trees in all the forests of the world banded together to issue a restraining order.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "gpmN8VwXOHon1Pje","flags": {},"type": 0,"text": "Tales tell of an illusion wizard so powerful that when a rival kingdom sent an army to attack his homeland, he disguised the stars they used to navigate so that they ended up destroying their own capital.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "ORmk1s4NZ9P412iG","flags": {},"type": 0,"text": "Have you heard of a hunter named Caspar the unlucky? First he lost his hand to a wolf, came home bleeding only to find his wife bedding his cousin. He supposedly drew his dagger and challenged his cousin to a duel, where he slipped on his own blood and plunged into his own dagger. But wait, there is even more. His cousin and the wife pittied him and nursed him back to health, just to run away together. The now lonely unfortunate hunter grew tired of the gods, testing his faith like that and started to curse at them non stop. A wandering priest heard his slandering tirade and warned Caspar not to take the gods lightly. Caspar didnt want to hear and the same night during a storm, his house caught on fire. Caspar, in a furious rage, ran out and drew his dagger, pointed it towards the heavens and shouted blasphemous curses at the gods who had forsaken him, only to get hit by a bolt of lightning. Barely alive, he then crawled to a neighbours house and collapsed. As he woke up and told the neighbour his tale of missfortune and started to swear at the gods again. The neighbour brought him some stew, again warning him not to slander the gods, and left him to cool down while fetching some firewood. When the neighbour returned, he saw Caspar slumped over his chair, head down in the stew, dead. He had choked on a piece of meat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "zCbPnb0HSGofPf9B","flags": {},"type": 0,"text": "They say there’s a cult of thespians who meet in secrecy to perform the million year play. It is said they wear golden robes and the script is in an ancient, forgotten tongue spoken by the first gods. Any who watch the play become a part of it forever, and some believe that if the play reaches its conclusion, the world will end.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "SrfESEoN4gMGCCyR","flags": {},"type": 0,"text": "The old drunk who sits on the docks claims a crab the size of a mountain tore the earth from the bottom of the ocean, and now the city rests on its back. He says that’s why no foreign ships reach these shores, and why those earthquakes keep happening.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "7zGVMBdjQBlEFU2a","flags": {},"type": 0,"text": "Somewhere out in the sea there is an ancient ship of the first captain, whose vessel is made of bone and whose hulls are filled with the treasured gifts of a hundred sea gods. Men who explore every shore will meet him on their journeys, and become members of his crew. That’s why sometimes great admirals and pirates disappear at sea.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "rH8GSzUaxq10V3mm","flags": {},"type": 0,"text": "If you lose a fight to gnome you become one. There was just one in the beginning but he was a scrappy little guy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "lpsOvlpQcTrt9BWv","flags": {},"type": 0,"text": "Have you guys heard of the lady of the lake? Campers beware! Every night, a lady, very slowly, so delicately, raises herself out of (local swampland), in fact, she takes so much care that the water is entirely undisturbed from it’s nightly slumber, the ethereal being proceeds to torment the dreams of the living, hunting the dreamers within their own minds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "U8yFJgK1ieoNMFQ2","flags": {},"type": 0,"text": "I heard that a eccentric pottery maker from the south would hide jewels in each pot he made so he could smuggle them out of the country and collect them later. So you gotta break any you can find, perhaps your fortune be waiting inside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "bJutoLWlDDDFcss8","flags": {},"type": 0,"text": "The first elven king was so powerful and grew to be so old that his first name alone had 20 apostrophes in it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "zLQMh0Te14b6tn9h","flags": {},"type": 0,"text": "There was once an undead that went by the name Super Grave Osborn and he would tight rope walk great canyons, launch himself off of bridges, and one time he even fired himself from a trebuchet. He was dead so it didn’t really hurt, but it was impressive to watch none the less.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "IA1NFOYl03INGAmJ","flags": {},"type": 0,"text": "It is said that the king who rules this land was murdered by his son who was possessed by a demon. When the king shows himself in public, they say it’s just a shapeshifter. The authorities still deny anything ever happened to this day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "XX0VQPhVXFCK2Ry4","flags": {},"type": 0,"text": "Out side of town, deep in the woods, there is a great stone statue of a man in full armor and weaponry. ‘Twas built centuries ago in honor of the first King of the land, who died fighting the great heathen armies from the north at that very spot. Though he died, he slew many of the horde, forcing them back from out lands. So great was his victory that the barbarians never dared return in all the last hundred years. It is said that if they do return, that statue will come to life and lead our armies to victory again. Course the new King doesn’t like that story, he says that he will lead the armies to victory and won’t give no stone monster his crown, but that’s a matter between kings, stone or not.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "W77dqDmSxcwWpUfy","flags": {},"type": 0,"text": "There is a gnarled tree, deep in the woods, that looks almost like a person, and is said to be a person cursed long ago.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "U4QGQpI4xybtlKuV","flags": {},"type": 0,"text": "The biggest house I ever saw was in a snail’s shell. There was an enchantment made by a drunken fairy on the shell, so that it could contain his hopes and dreams, and when you looked into the shell you could see a house that made a complete ring around a valley, all of the surrounding peaks had parts of this house built over them. And I swear it wasn’t snail venom making me hallucinate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "VIQfZcbMCnNvvB0b","flags": {},"type": 0,"text": "You see that frail old man over there? Last year, he used to look just like you. That was, until he abused the spell Disguise Self! He cast it so flippantly, using it to deceive everyone in town until one day, it stuck! Now he walks around town all day, trying to avoid mirrors and shiny objects that would remind him of his terrible mistake.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "eSRiTeGZlwXC7Qj1","flags": {},"type": 0,"text": "Make sure you don’t hurt or kill a mockingbird in this area! The wood elves of the land so love the sound of the mockingbird that they all learn druidic magic and become mockingbirds for much of the day, so be careful what you say around them!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "FuO72AGLsoDIJfVR","flags": {},"type": 0,"text": "Tieflings don’t really have demon blood at all- they all come from a farmer’s daughter who was so amorous she took to her father’s goats!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "pMAPwG1T7S2pj8rB","flags": {},"type": 0,"text": "The old woman in that house is really a well-made flesh golem! She is always collecting parts to fix herself, so don’t go near her house alone!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "ccHuuL24FVIDxHPW","flags": {},"type": 0,"text": "You see the old ruins of a castle over there? It’s actually the Baron’s castle, brought by terrible magic from the future! If you make changes to the Baron’s castle, it changes the ruins too!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "A7JNeWZ3mpwGE6KW","flags": {},"type": 0,"text": "It isn’t just mice eating the grain in the silos. Those halflings in the caravan outside the city? They have a city of tiny people in one of the wagons, each person no taller than my palm. These people have trained the mice like horses and can open any lock!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "VV7sf6GMfTx9ZcTX","flags": {},"type": 0,"text": "You see that tower over there? Well, there are seven sisters, princesses, locked in eternal sleep at the top of the tower. If a man fights his way to them using only his fists, he can wake them up and then he’d have his pick of ’em!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "Rn3ZQBKZdFX52EuE","flags": {},"type": 0,"text": "You know how them wizards cast spells? They say it’s book learning, but it ain’t- knowing or not, they are making a pact with devils, and it’s their families that pay the price. Ain’t no wizards with happy families.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "MyXnb1fghCnEFKM3","flags": {},"type": 0,"text": "You know why the wind wails through the canyon there? No? It’s because some of those Air Jenasee folk were trapped by a wizard in them stones. They are the wind’s children, and the wind is looking for them. If someone were to end the wizard’s spell, the wind would help them their whole lives.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "JXfmGyn0RkRs8Uzm","flags": {},"type": 0,"text": "Goblins and gnomes- they are really the same race. Gnomes don’t want you to know it, but goblins are just dirty, angry gnomes. If you could clean up a goblin and get it to look you in the eye, you can turn it back into a gnome by making it sneeze three times.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "qIW2l1j2DJqESpEE","flags": {},"type": 0,"text": "The Queen doesn’t really love the King. They are always smiling at each other, right? Well, the King is actually a powerful enchanter who is making her love him. It is why he’s so popular- but you didn’t hear it from me!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "ZCQXm1FfOOAcVHKz","flags": {},"type": 0,"text": "Beware of the Merminotaurs! They will sink ships without warning and eat their captives. Some folk will tell thee there’s no such beast, but I’ve seen ’em! Half-shark, Half Minotaur, they are, and terribly deadly!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "n5kJNH2dUVvKjOnm","flags": {},"type": 0,"text": "The local smokeweed- monsters hate it. Hate the smell of it. Buy a bunch and throw it on your campfire at night and you’ll sleep safe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "wPz4zAaoxjpM1rW1","flags": {},"type": 0,"text": "Elves aren’t actually people- they are really intelligent plants. If you cut one it bleeds sap, not blood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "Kghb9ARINPJpASNK","flags": {},"type": 0,"text": "Necromancy isn’t just what magicians do. There’s a terrible curse on this land from one of the gods, and it makes it so every body that isn’t blessed with the proper last rites rises sooner or later. Some of them don’t know they are dead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "OtoK8rraL5u9bUZ7","flags": {},"type": 0,"text": "If you meet a beautiful blonde woman on the road, take care- she is likely a cow maiden who will steal your soul.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "i5cca4PrRMyJGdVz","flags": {},"type": 0,"text": "If kenku can steal enough, they can trade their treasures and regain their wings.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "D6J4k9s9RVeFLgHY","flags": {},"type": 0,"text": "Orcs don’t reproduce the way we do- they are like worms, and if you cut one in half it’ll slowly grow into 2 new orcs. Cutting their hearts out or burning the bodies is the only way to stop it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "KnAIaTmCHKaQ7ppi","flags": {},"type": 0,"text": "You know why Dwarves have such funny last names? It’s because their true clan names was stolen by a powerful wizard and hidden deep underground somewheres. That is what they are looking for down there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "vfn6u9wRqfBCvnBl","flags": {},"type": 0,"text": "Most dwarves have no toes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "60ZMRFvzfm9pTuhW","flags": {},"type": 0,"text": "Don’t ever sleep in the same room as a Warlock! Their dark patrons come at night, and anyone else they see is considered a sacrifice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "tPdjThV6lh6aDM6D","flags": {},"type": 0,"text": "There is a powerful stone called the Wishing Stone lost somewhere by the river. It looks like a normal stone, but if you grab it and hold it tight, you’ll get whatever you wish for.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "kd5xKe2YHbyXeha0","flags": {},"type": 0,"text": "You can tell if someone is secretly a doppleganger by holding a glowing coal to their lips and making them repeat a divine chant.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "FF0hjQG9u8vvaMsR","flags": {},"type": 0,"text": "Stirges – nasty creatures. They have psychic powers, you know, and if you bleed in a cave, they’ll develop a taste for you. There ain’t nowhere safe to hide from them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "sAQfSAkHrOO0uOMQ","flags": {},"type": 0,"text": "There’s an old woman who wanders these roads who’s a fairy queen in disguise. She’ll ask you for something, and if you don’t give it or you are rude to her, she’ll turn you and your whole household into living objects!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "NzB5yAxfea4anYp5","flags": {},"type": 0,"text": "If you outdrink a dwarf in a drink-for-drink contest, they will have to serve you for as many days as drinks you finish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "HLm6c4Og99iGbf5t","flags": {},"type": 0,"text": "There was a red dragon that was raised by gnomes, they say he tried to stay with them as long as he could, but then he grew too big. Some say he still lives in the mountains, helping lost travellers and doing good deeds like he was taught. Some say that he turned to his inner greed and burned the gnome village down, and that’s why there’s no gnomes in our village.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "n0uYhvoTrTnN5gpc","flags": {},"type": 0,"text": "Have you ever heard of Glenn of the Glen? An elf who was the smartest attorney there ever was! He was so good at contracts that he outsmarted Asmodeus Himself with a 10,000 page contract, and he now owns a piece of each of the Nine Hells. He is in Arcadia now, but he keeps up his control in Hades as a waystation for lost souls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "kPDEWH0H6g0zWwHq","flags": {},"type": 0,"text": "Have you ever seen a half-dwarf? No? Didn’t think so. That’s because they are born with shapeshifting powers and can pass as anyone, or go invisible just like that. You may have passed one on the street today, but you’d never know.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "0pzgjtWxfLC5DtCS","flags": {},"type": 0,"text": "Ever heard the legend of the invisledge? I haven’t either but I know it’s out there somewhere and one day I will be able to tell it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "U9BBBSvd4H6ck2RE","flags": {},"type": 0,"text": "Have you ever heard of the astral giants of Sun, Moon, and Star? They’re said to be the direct sons of Annam the All-Father, himself, each wielding a third of his power.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "v8hoQ8JQKhPuUVQM","flags": {},"type": 0,"text": "Have you heard how trolltooth mountain came to be? It’s literally made out of the teeth that Erinkek The Invincible lost in battle, but they always grew back ye see, because he was a troll.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "7SQS374ilL3tAD0o","flags": {},"type": 0,"text": "Have I told you the tale of the strongest elf who ever lived? No one could best her in battle, she only ever died because she tried to climb trolltooth mountain and froze to death due to the cold winds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "hdjqMJjBOiO7AWyz","flags": {},"type": 0,"text": "There once lived a woman who on the first Dawn following a fool moon would transform into magical bird of fire. She would fly up to Sun and recharge it with her fiery passion to fight back the creeping power of night. Because of that the following night the Moon would begin to shrink again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "Hb8HckU18ouG8Wlx","flags": {},"type": 0,"text": "You ever seen that town very yonder hill? Folks say it appeared over night one morn filled with people, the seem nice enough but when the sea fog floods in the town smells….. fishy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "VnD4FrGV6hHTwwXw","flags": {},"type": 0,"text": "Once a traveler came upon a frog who claimed to be a powerful princess,who had been turned into a frog and that if he would only kiss her she could return to her kingdom and they would live together as king and queen. Well he did, and that frog was a princess, but a Bullywug princess. But a vow is a vow and now this human is king of an entire swamp of Bullywugs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "2oi5beCvCXyvBLFE","flags": {},"type": 0,"text": "A vile barbarian once killed a merchant over a slight. He went to jail peacefully, but he peed the whole way there, and it wasn’t close by! We had to close the street, the smell was horrible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "L0qinyPfvK2BCKXc"}
