{"name": "Tarrasque Characters","description": "One hundred different NPCs that have SOMETHING to do with the most feared beast in DnD.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "R6ze2w82oRst4WmH","flags": {},"type": 0,"text": "Terry the Tarrasque, a children’s entertainer bard who wears a Tarrasque mascot suit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "Coi3A8UASg8e8pyB","flags": {},"type": 0,"text": "A human barbarian who was formerly the Tarrasque, now cursed into human form and given sentience for the first time. They also now have the body of the dead hero who cursed them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "qEX8uw553EHJShkb","flags": {},"type": 0,"text": "A ranger who finds a fledgling Tarrasque and raises it as their animal companion. Eventually it becomes big enough to ride into battle with some barding and spikes on that bad boy! (Cue death metal music.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "2PHIszpSgYD6Yder","flags": {},"type": 0,"text": "A braggart who is accredited with killing the Tarrasque….while they alone know they didn’t do it and in truth it was another hero who died shortly after. The braggart now revels in the fame, even as they are haunted by the ghost of the real hero.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "4pyltoeUYbMQEzpu","flags": {},"type": 0,"text": "A Tarrasque acolyte in a world where the Tarrasque doesn’t exist….or does it? (It doesn’t.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "tociI52DtFMsUQkX","flags": {},"type": 0,"text": "A big game hunter who wants to become skilled enough to be able to solo the Tarrasque as the ultimate test of a hunter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "I1EaL6pF2eY0HOgU","flags": {},"type": 0,"text": "A wizard intern who was tasked with watching over an Iron Flask containing the Tarrasque but now lost is and is FREAKING OUT as they desperately try to find it somewhere in the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "8SH68XiU9BWOP2cE","flags": {},"type": 0,"text": "An artificer who’s trying to study the Tarrasque in order to make a mechanical duplicate to combat the real Tarrasque (MECHA-TARRASQUE!)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "KofL4VxC8xTE79nD","flags": {},"type": 0,"text": "A warlock who made a pact with the other half of the Tarrasque – the side that represents its rationale, intelligent side. This being charges the warlock to find a way to destroy or lock away its bestial side.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "Z9DZtl0eWnufVBS6","flags": {},"type": 0,"text": "A cleric-alchemist hunting down Tarrasque parts to replicate its regenerative properties so they can save their country from an incurable disease.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "D4NCqNQ8hWgidrlW","flags": {},"type": 0,"text": "A necromancer trying to find and harvest Tarrasque parts, discovering undead made from the creature are stronger than the average undead of their kind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "2NhU9JMdphEFXpNB","flags": {},"type": 0,"text": "A Tarrasque-esque intelligent humanoid that hops the dimensions to prepare worlds for the coming of the Tarrasque (a la herald of Galactus). Whether this is to help or sabotage is known only to them…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "5REnWrf50GkPs26U","flags": {},"type": 0,"text": "Were-Tarrasque. ‘Nuff said.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "ytok1IpDHsUhqKoc","flags": {},"type": 0,"text": "A mad scientist trying to create a number of Tarrasque variants (Plant Tarrasque, Elemental Tarrasque, Multi-headed Tarrasque, etc).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "vXwXWU3FwYuNuLuZ","flags": {},"type": 0,"text": "A monk whose temple was dedicated to protecting the seals that kept the Tarrasque locked away. When their fellow monks were slain, they escaped…all the while unaware they are the last seal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "9NLFcjpGcrsLKukH","flags": {},"type": 0,"text": "An adventurer who ate a piece of the Tarrasque, granting them an innate power to cast magic. But while the power is incredible, it is slowly turning the adventurer more and more into a Tarrasque-like monster.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "j3oRRKhzkgftJcSF","flags": {},"type": 0,"text": "The grandchild of the hero who slayed the Tarrasque who’s trying to become a hero themselves and live up to the family legacy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "xl8Vqwg39tPNh3S5","flags": {},"type": 0,"text": "An adventurer carrying a Tarrasque egg trying to return it to its family before they awaken and rampage throughout the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "iRZ6wX2kJcqkQxuW","flags": {},"type": 0,"text": "A thief who stole the Tarrasque’s egg and is trying to outrun the Tarrasque’s path of destruction in order to sell the egg to a mysterious and wealthy buyer..","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "RzXXWNoGw6JjkGvp","flags": {},"type": 0,"text": "A wizard who not only wants to learn how to become a lich but who also wants to learn how to make the Tarrasque their phylactery.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "QxztlfTIFiYdXyg4","flags": {},"type": 0,"text": "A bard who claims to know the language of the Tarrasque and a lullaby that will put it to sleep when it’s awoken. How they came by this knowledge is a mystery…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "e2iIGldtUmMm0O15","flags": {},"type": 0,"text": "An adventurer who wears an amulet they claim contains the Tarrasque, which will be released upon command or in the event of their death. Uses this in bartering, making threats and at nearly every opportunity (though no one really wants to challenge them on whether it’s true or not).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "YUr1hKWKdN0UpLpv","flags": {},"type": 0,"text": "An old adventurer who recently escaped from the Tarrasque’s stomach where they somehow survived inside for the last 40 years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "L1KFuvItmX7AVkQB","flags": {},"type": 0,"text": "A sentient, humanoid Tarrasque raised by dragonborns and told all their life they were just a deformed dragonborn. They have only recently learned they were adopted and so now they’re setting out to discover their origin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "XuRgbRN45ACwus8X","flags": {},"type": 0,"text": "A warforged whose plates are made from the scales of a severed Tarrasque arm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "z0KvWLcVzdzIiLvh","flags": {},"type": 0,"text": "An adventurer outlaw who uses a disguise of the Tarrasque and Tarrasque-related gear to fight the oppressive regime and protect the innocent. Na na na na na na na na na Tarrasque-man!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "n3rNMlL1pUcapWHg","flags": {},"type": 0,"text": "A stranded refugee from the planet Falx, a planet populated by hundreds of massive Tarrasque-like creatures. They’re now trying to build a ship to continue their journey and put as much distance between them and Falx.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "FzQfRFVkV6X3lSEy","flags": {},"type": 0,"text": "A bard who’s in love with the Tarrasque, who constantly sings its praises and who is trying to learn of a way of making the Tarrasque sentient so they can be together.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "l5stI1uRqwKxRATZ","flags": {},"type": 0,"text": "A terminally ill adventurer trying to convince people that the Tarrasque is real because they alone know the magic keeping the beast asleep only works if people think it’s real.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "kvD2lGSzq7GfxZAh","flags": {},"type": 0,"text": "An adventurer on a mission to delve into the belly of the sleeping Tarrasque to recover a priceless family heirloom that the creature swallowed generations ago. They’re also aided by the ghost of the ancestor who lost the heirloom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "Px5qP8vxuwFUPzd7","flags": {},"type": 0,"text": "A blackguard who’s spreading a disease that turns people into Tarrasque-like beings. Hated and hunted, the blackguard is only doing this because they know a bigger threat is coming and world full of Tarrasque-people would be harder to conquer than one that wasn’t…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "ZE9GJXQDlkyEd3J5","flags": {},"type": 0,"text": "A monk of the Temple of the Tarrasque, who modeled their martial arts style after the ferocity and destructive power of the Tarrasque.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "evzyuot21s14mFq5","flags": {},"type": 0,"text": "A chef adventurer who once was able to cook and eat a piece of the Tarrasque, discovering it to be the most delectable dish imaginable. Now they’re on a hunt for more, all the while their hunger grows more and more ravenous…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "29B1mQdMtPy1IyCW","flags": {},"type": 0,"text": "An adventurer whose whole life has been dedicated to trying to slay the Tarrasque. They wear armor of a Tarrasque motif as their obsession is all consuming.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "iQx37mVUdBr7uuEc","flags": {},"type": 0,"text": "An adventurer who’s lover (or loved one) was cursed into becoming the Tarrasque so they are trying to search for a way to end the curse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "JaMiSxcar2RnEbbP","flags": {},"type": 0,"text": "A warrior who wields a mighty weapon – a Tarrasque! The Tarrasque has been changed into a physical weapon that yields incredible power in the hands of the wielder. However while it is powerful, the warrior must fight the influence of the weapon’s bestial urges.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "WwneT4LQVQikvonV","flags": {},"type": 0,"text": "A crazed adventurer who’s deluded themselves into thinking they’re actually the Tarrasque. They act as savage as the creature, eat ravenously and try to claw buildings down with their bare ‘claws.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "3I1YIS2hWvLCpSV6","flags": {},"type": 0,"text": "An adventurer whose soul is linked to the Tarrasque so that if one perishes, so does the other (Dragonheart style). Now the adventurer is on the run from people who want to kill them just to end the Tarrasque once and for all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "0ThLIr4iL7v1qpST","flags": {},"type": 0,"text": "To win the heart of their love, an adventurer is challenged to return with the heart of another: the Tarrasque’s!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "MizGrVKOGQtmX7hX","flags": {},"type": 0,"text": "A barbarian with a magical tattoo of the Tarrasque which when activated, grants them a tremendous boost in strength and ferocity. Likes to loudly brag how the Tarrasque is their ‘spirit animal.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "TCqcy6oTtgmMhK1N","flags": {},"type": 0,"text": "A druidic shaman whose totem is the Tarrasque, wears a ceremonial Tarrasque mask and uses the creature in their metaphors, stories and as a teaching tool.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "sc2UGc4u909Puc8T","flags": {},"type": 0,"text": "A smooth, fast talking adventurer who likes to use the fear of the Tarrasque to swindle people out of money. They like to sell ‘Tarrasque insurance,’ take down payments for guaranteed ‘Tarrasque shelters’ and even sells a ‘Tarrasque whistle’ that’s supposed to ward off the creature. All fake.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "aUJZ6bQIWm5jHUvG","flags": {},"type": 0,"text": "A strange masked performer who owns a marionette puppet of the Tarrasque, claiming it has the power to control the creature should it ever draw near.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "0NadLSjsVViCFPTb","flags": {},"type": 0,"text": "A former pirate who became phobic of the sea when they saw what they swear was an aquatic Tarrasque. Now they won’t go near any large body of water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "cvFDpLbzwyg0HuRL","flags": {},"type": 0,"text": "A warlock forced into a pact with the Tarrasque by a powerful lich and whose contract is only relinquished upon the creature’s demise. Why the lich wants the Tarrasque dead the warlock does not yet know…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "CDp85IE9HJHIeznS","flags": {},"type": 0,"text": "An adventurer who sees an astral projection of the Tarrasque where ever they go, seemingly following them everywhere. Whether this is real or not, they’re not sure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "VzFa3dHbRpvX8UA7","flags": {},"type": 0,"text": "A toymaker who makes and hands out toys of ‘the Tarrasque,’ a creature of their own imagination. But then rumors begin to surface of such a creature devastating the countryside…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "AGCIXYN759TiYrwD","flags": {},"type": 0,"text": "An adventurer who comes from a family who for generations held the secret location of a weapon that could supposedly kill the Tarrasque should it ever awaken. Now the beast has awakened and the adventurer is the last surviving family member, making it their sole duty to retrieve the weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "NFPA6xGM5JXW6meP","flags": {},"type": 0,"text": "A noble knight with an irremovable curse bestowed upon him by an evil wizard. This curse forces them to have to kill a certain number of innocent people within a certain amount of time or the Tarrasque will awaken and devastate the land.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "IC5bkNrLzxCHZ9Np","flags": {},"type": 0,"text": "A drunken monk who drinks to forget the fact that they are the sole survivor of an adventuring party that tried to kill the Tarrasque but failed and caused it to begin a path of destruction all over the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "rFAfMPLGdllB53ak","flags": {},"type": 0,"text": "A prankster mage who tricked a cult of the Tarrasque out of the artifact needed to complete their ritual which would turn them all into Tarrasques. The mage is now pursued by said cultists.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "kj0zw6gUu9P4LIDJ","flags": {},"type": 0,"text": "An adventurer sent back to the present from a potential future where the Tarrasque has destroyed most of the world and society has devolved into nomadic delvers. The adventurer is now trying to prevent this future from coming to pass, however possible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "RTJn9F5p3ExwYNcU","flags": {},"type": 0,"text": "A reluctant pacifist with a terrible curse: the more people they directly kill the more Tarrasque-like they become. If they kill too many people, they will lose themselves and the monster will take over completely.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "QSrqT2lPTl2F8Ugu","flags": {},"type": 0,"text": "An angel turned mortal who voluntarily fell to spare the world from the gods releasing the Tarrasque. The gods told the angel that if they could find 12 pure and goodly mortals that warranted the earth being spared, then the gods would not destroy the world in order to start anew.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "nptplb6YwYxhLepO","flags": {},"type": 0,"text": "An archaeologist attempting to locate Tarrasque bones deep in the earth to confirm their theory about a prehistoric species of Tarrasques.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "FYLR5le2L3aU3V9B","flags": {},"type": 0,"text": "A Tarrasque acolyte trying to find and locate the six medallions required to summon the Tarrasque in order to save their world from an oncoming interdimensional world-eater (‘You can’t destroy the world, only I get to destroy the world!’).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "Kgq4xBXQvD7xtlGa","flags": {},"type": 0,"text": "A wizard searching for the ‘Wand of the Tarrasque,’ which is a legendary artifact capable of causing random Tarrasque related magical effects, ranging from granting Tarrasque-like strength to summoning the creature itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "mPq3h7lt4LUVQ98B","flags": {},"type": 0,"text": "An artificer who specializes in city defense installations against Tarrasque attacks. This became their trade after they lost their family in such an attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "1SMjqDb0CmXLlBXj","flags": {},"type": 0,"text": "A sentient Tarrasque trying (and failing) to masquerade as a regular person with a thinly veiled disguise. Except it works because nobody is brave enough to point out to it that it’s clearly the Tarrasque in disguise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "pxLT21iRU3yjVJP4","flags": {},"type": 0,"text": "A knight searching for Tarrasque scales to craft a set of armor that will make them impervious to all harm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "406vHCRhNnIiV1O0","flags": {},"type": 0,"text": "A kobold who likes to pretend to be the Tarrasque and even has Tarrasque props, masks and outfits.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "eABqQ8otUPE4MOBG","flags": {},"type": 0,"text": "A little child looking for their lost ‘dog.’ What everyone doesn’t know is that the dog isn’t an actual dog, it’s the Tarrasque.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "Qs54TZhkVrdECnqf","flags": {},"type": 0,"text": "A former king whose kingdom, wealth and lands were destroyed by the Tarrasque and who’s now searching for a new purpose in life as they adjust to no longer being nobility.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "zME46qU0P7dKO5cV","flags": {},"type": 0,"text": "A warlock with a dragon patron who wants their warlock to dick with the Tarrasque because it and the dragon are in a petty feud.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "X9PFrvCGRStqWsSa","flags": {},"type": 0,"text": "An evil alchemist who’s learned to concoct a potion from pieces of the Tarrasque that when ingested causes those who drink it to grow a tiny Tarrasque in their body. After a gestation period this Tarrasque bursts from their bodies, killing the host. This alchemist likes to extort cities for money or he’ll poison their water supply.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "IAGR75JTfKm9xj5P","flags": {},"type": 0,"text": "A bardic Tarrasque denier on a campaign to disprove its existence, despite the very clear and solid evidence that it exists.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "vS3wnZq7Gj1vLhx4","flags": {},"type": 0,"text": "An adventurer with a mental Tarrasque in their minds which forces them to have nightmares about it every night and affects those near them, from giving them the same nightmares to driving them as savage as the Tarrasque.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "cDI065UmuQUpVpbG","flags": {},"type": 0,"text": "An adventurer trying to find the Tarrasque so they can save it from a creature that eats and absorbs Tarrasques from different universes, becoming more powerful every time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "9wD0qfLYANaUeLFx","flags": {},"type": 0,"text": "A bard who used to be a tour guide for a fake ‘Tarrasque Hunt,’ which they were inspired to make after the bard read some old scrolls about the creature. Only now the Tarrasque is awake and the bard is seemingly (and accidentally) the only one who knows anything about the creature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "9el07BJGKU2Gssu2","flags": {},"type": 0,"text": "An ancient warrior who was suspended in time in order to combat the Tarrasque when it is fated to awaken from its thousand year slumber. The only problem is the warrior was awoken too soon (or the Tarrasque has long been dead).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "koDBoFnq5I90N5P3","flags": {},"type": 0,"text": "Tara Sque, an adventurer that people are magically compelled to think is the actual Tarrasque. Tara desperately wants this magic undone…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "pwz8HQMmComf9wKH","flags": {},"type": 0,"text": "A ventriloquist bard who’s working through some stuff and as a result only speaks through a Tarrasque dummy, who has a wild and abrasive attitude.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "77v715OVyn8Avih2","flags": {},"type": 0,"text": "A sentient skeleton who was once a normal person eaten by the Tarrasque but was then ‘expelled’ from the creature, turning them into the undead they are today. How they survived is a mystery.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "5AObFmXjeHKWtn78","flags": {},"type": 0,"text": "An adventurer who keeps getting killed and eaten by the Tarrasque, only to be continuously resurrected somewhere else in the world. How this happens and how the Tarrasque always manages to find them is unknown to the adventurer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "1F5FOIc7LefKT7wj","flags": {},"type": 0,"text": "A heavily scarred adventurer recovering from the trauma of surviving a Tarrasque attack and who now has a nervous tick whenever the name of the creature is mentioned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "cNslo7P1eezVnRhs","flags": {},"type": 0,"text": "A normal person who, for no apparent reason, is followed by a docile Tarrasque. It even listens to their suggestions sometimes (except for it to leave them alone).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "FQ5cJTbk7YBf6D1o","flags": {},"type": 0,"text": "A wizard who discovers that the Tarrasque is the source of all magic and who is the progenitor of all magical creatures. Now they’re seeking the creature to learn what other mysteries it might hold…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "6ynXvmzOkmOg9Wpr","flags": {},"type": 0,"text": "A mage who managed to seal the Tarrasque within their own body to protect the world from its wrath. However now they learn it’s slowly killing them so they are trying to find a cure while keeping the beast inside them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "OoshQfdektruB2Qy","flags": {},"type": 0,"text": "An adventurer who receives dreams from the Tarrasque, learning that it’s not the dangerous creature the world knows it to be but is instead a tortured creature forcibly bound by the local king. Whether these dreams are true are a different matter all together.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "cT90AmBegrTzuz6W","flags": {},"type": 0,"text": "An adventurer with a Tarrasque-like arm which while is incredibly powerful sometimes has a mind of its own, lashing out wildly in destructive power.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "wAPL1FWzbweYnWo7","flags": {},"type": 0,"text": "An adventurer with multiple personalities, one of which is the Tarrasque. Whenever they assume its personality, they become a wild savage but gain incredible strength and durability.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "yPNxVSSelX17fD39","flags": {},"type": 0,"text": "A paladin who follows the ‘Oath of the Great Beast,’ which reveres the Tarrasque as an equalizing force in the world. They seek to destroy cities and institutions who have grown too large or too powerful, returning the world to balance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "kS2pE33TSpwrz5SD","flags": {},"type": 0,"text": "A sorcerer who learns their magical abilities come from being descended from the Tarrasque, who was once turned human and sired children with the sorcerer’s ancestor. So yeah they’ve got to learn how to process that information.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "moUbXzW9WyDfAroC","flags": {},"type": 0,"text": "An adventurer who is linked to the Tarrasque so that when one is awake, the other is asleep. They continue to have dreams about the creature as it draws nearer and nearer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "X58df38kyyn3gSIt","flags": {},"type": 0,"text": "A barbarian warlord who, upon stumbling upon the carcass of the Tarrasque, ate its heart and bathed in its blood. This made the warlord more bestial and hot-tempered but also made them nigh invulnerable, giving them the edge to take power in the land. They now guard the secret of the Tarrasque so that others don’t learn how to gain similar powers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "FJrCyJzGuLpLu0mr","flags": {},"type": 0,"text": "An adventurer whose stomach is actually an interdimensional portal to the Tarrasque’s stomach.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "V12bMMWgqbiNdMUT","flags": {},"type": 0,"text": "A pack rat adventurer whose prized possession is a tiny Tarrasque in a jar, which was given to them by a god who minimized the creature to the size of a lizard after it pissed the god off.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "LMxx3qDA0ObZykIh","flags": {},"type": 0,"text": "In a world where monster parts are incredibly valuable, an adventurer seeks to make their fortune by acquiring the most sought-after monster part of all: the heart of the Tarrasque.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "xAxgkgWObg7W58h4","flags": {},"type": 0,"text": "A sky captain whose flying ship runs on the Tarrasque running on a treadmill. No joke.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "qk7qpnX1yK7gyWJh","flags": {},"type": 0,"text": "A conspiracy theorist who always thinks the Tarrasque is the source of every problem, one way or another (‘Bring me more pictures of Tarrasque-man!’).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "0iK5N3KbxcHhfPTA","flags": {},"type": 0,"text": "A warrior from a long line of warriors, all of whom have tried (and failed) to kill the Tarrasque. Now the warrior leaves their own family behind to try their hand at killing the monster. They are also aided (or cursed) by the spirits of all their ancestors who failed to kill the Tarrasque.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "DrEolGKCnsDEo8Uk","flags": {},"type": 0,"text": "A master locksmith who was tricked by a mysterious employer to unlock a seemingly unlockable vault, only to discover (OH NO!) it held the Tarrasque and now it’s loose.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "HwYzOgZpcQHTk3HU","flags": {},"type": 0,"text": "A Tarrasque acolyte whose biggest wish is to be eaten by the Tarrasque. Bummed every day this doesn’t happen.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "xyimnxFfSl6UZ9Qm","flags": {},"type": 0,"text": "A barbarian who wants to get so big and strong that they can wrestle the Tarrasque mano y mano. Won’t shut up about it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "TpXaPdt2i1JuCvRI","flags": {},"type": 0,"text": "A druid sent by Gaia to stop the forces that would disturb the Tarrasque – the massive beast of burden that carries the world on its back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "9OHU6aqd5UAdlzuj","flags": {},"type": 0,"text": "A tour guide who offers a tour of the inside of a sleeping Tarrasque for those brave (or foolish) enough.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "OnFWZBybYcCbiTzY","flags": {},"type": 0,"text": "A remorseful scientist who was the one to create the Tarrasque but now that the monster is loose, they want to find a way to stop it before their reputation is ruined.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "CWv0NUNNaQ1HAzCl","flags": {},"type": 0,"text": "A vindictive adventurer angry with the gods and made a wish to see them die, resulting in the Tarrasque spawning into the world. Now an epic war has begun as the gods fight the Tarrasque which is destroying the world, forcing the adventurer to find a way to undo their wish or have the world break apart.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "5J3U6WXQhNpLNCNQ","flags": {},"type": 0,"text": "A brilliant artificer who created a ‘Tarrasque Bomb,’ a device capable of summoning and dismissing the Tarrasque where ever the artificer chooses. They now use this as a nuclear deterrent to keep the nations of the world in peace.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "ERDuYxaOLGsVpPAt","flags": {},"type": 0,"text": "A sorcerer whose magical power grows the more destruction the Tarrasque causes in the world. They’re now obsessed with provoking the creature into destroying as much as possible to become the most powerful mage in the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "1noZEfb4XZIYOURx"}
