{"name": "Masks","description": "One hundred rare and mysterious masks with extraordinary powers.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "Bak5T59x60bJwN7w","flags": {},"type": 0,"text": "Barn Owl Mask: grants advantage on perception checks that rely on hearing and sight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "5BXvaZv55zwhaoiU","flags": {},"type": 0,"text": "Oni Mask: grants advantage on intimidation checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "xybyRRR4lR0sVwqC","flags": {},"type": 0,"text": "Cracked-clay Jester Mask: holds 5 charges of friends and one charge of charm person. Once all charges have been used the mask crumbles to dust.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "0QVe7r3WvsIRg6h3","flags": {},"type": 0,"text": "Luchador Masks: take advantage on grapple and acrobatics checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "YAPHL5r7fzmxAg35","flags": {},"type": 0,"text": "Mask of Many Faces: This mask gives you advantage on deception checks to pretend to be someone else.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "AhFZHGwZWn2oE0Sl","flags": {},"type": 0,"text": "Mask of Othersight: This mask begins blank, but can be re-sculpted to resemble the face of another person. The name can also be carved in. While worn, the wearer cannot see in front/around themselves, but does see essentially through the eyes of the person represented by the mask. Depending on how powerful the person represented by the mask is while the mask is worn, that person may or may not be aware of the fact.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "b7n0QXdWFQzJf41w","flags": {},"type": 0,"text": "Spider Mask: While wearing the mask you ignore movement restrictions caused by webbing, Once per long rest you can use the mask to cast the spider climb spell as an action.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "WdbdhcbvrpR1tRP0","flags": {},"type": 0,"text": "Wolf Mask: Grants advantage on Wisdom (Perception) checks that rely on hearing or smell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "tqWHYnD4OOLbnrvu","flags": {},"type": 0,"text": "Winter Wolf Mask: Grants advantage on Wisdom (Perception) checks that rely on hearing or smell, as well as advantage on Dexterity (Stealth) checks made to hide in snowy terrain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "zeJraH7BAKwtennT","flags": {},"type": 0,"text": "Mask of Silence: Anyone who sees the wearer of this mask will forget seeing them as soon as they look away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "4lPCuw0D3STMw3Lt","flags": {},"type": 0,"text": "Mask of Mediocrity: penalty to remembering the wearer. Could also take effect when trying to follow them in a crowd.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "L3dxUv7NwEr39bTQ","flags": {},"type": 0,"text": "Deathmask of the Whiteface: +2 rounds of Raging if barbarian otherwise taking damage can (wearer’s choice, free action) trigger the spell Uncontrollable Rage for 2 rounds, forcing the wearer to attack the source of the damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "T33RsGZSeVAZZAZM","flags": {},"type": 0,"text": "Mask of the (pick an animal): At the beginning of their turn the user can shapeshift (as the wildshape druid ability) into the matching animal lasting until the end of their next turn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "1sHrrF73dNhSgoyA","flags": {},"type": 0,"text": "Mask of the Dragon: wearer has a breath weapon that can be used once per short rest corresponding to the color of the mask, 30ft. Line 4d6 damage. Curse: the wearer cannot the remove the mask without making a DC 18 Wisdom save made only once per day. While wearing the mask they gain the flaw: ‘I sometimes forget that I’m not the beast this mask resembles.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "TWKZ3XENKe4vqOuD","flags": {},"type": 0,"text": "Mask of Mechanus: An uncomfortable piece made mostly of metal and clockwork. While wearing this mask a creature rerolls every 1 and 20. They must take the second roll.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "RhRUHQwWhrd3vyAi","flags": {},"type": 0,"text": "Mask of Juiblex: Not so much a solid piece as an ooze that is rubbed over the face and head and remains there. While wearing this mask, a creature can move through a space as narrow as one inch wide without squeeze. A creature wearing this mask must eat a full meal every hour or suffer 2d12 acid damage as it begins to consume itself. Curse: A creature must succeed on a DC 15 Charisma saving throw to remove this mask. A creature can only attempt this saving throw once it has finished eating.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "QFYrYn9ORoEUUCp9","flags": {},"type": 0,"text": "Mask of Mystery: A creature wearing this mask is proficient in Charisma (Deception) checks. If the creature already proficient, it doubles its proficiency. In addition, a creature can cast Alter Self once a day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "0DkBaIQxpORYOzxP","flags": {},"type": 0,"text": "The Iron Mask: requires attunement by a monk. While attuned to and wearing this mask, a creature rolls an additional die for each unarmed strike.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "vkfELyCDUdOEvPVO","flags": {},"type": 0,"text": "Mask of the Fey: This beautiful mask was created in the feywild by a fey creature of great power. A creature attuned to and wearing this mask is always under the effects of the spell Glibness. A creature wearing this mask during a long rest has a ten percent chance of being plane shifted into the court of the mask’s creator. Curse: This mask can only be removed by its creator.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "SvQ3psHil540Tbw2","flags": {},"type": 0,"text": "Mask of the Monarch: Advantage on persuasion checks for buying/selling items.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "bsNGGoMXSZlEgBMM","flags": {},"type": 0,"text": "Aku Aku Mask: This wooden tribal mask has feathers across the forehead and glowing yellow eyes. A sentient and good hearted shaman spirit lives within. the wearer has a +1 bonus to AC and may cast Arcane Lock once per day. The wearer gains Nature proficiency, but disadvantage on Intimidation. The wearer LOVES FRUITS. If a wearer of the Uka Uka mask is met, they shall each compare their wares. Whoever has a greater total gold value of GEMS gains 3 health and 5 speed PERMANENTLY.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "2qeQLNnDbBuLHIdk","flags": {},"type": 0,"text": "Uka Uka Mask: This wooden tribal mask has sharp teeth, glowing yellow eyes and a beard of leaves. A sentient and evil shaman spirit lives within this mask. this mask is CURSED and cannot be removed without harming the face. It grants a +1 bonus to AC. The wearer may cast Knock once per day. You gain poison and necrotic resistance, but Silvered vulnerability. You gain Intimidation advantage, but disadvantage with all other CHA checks. If a wearer of the Aku Aku mask is met, they shall each compare their wares. Whoever has a greater total gold value of GEMS gains 3 health and 5 speed PERMANENTLY. OPTIONAL: The wearer may spend 1 day crafting 1 stick of dynamite which requires a Dex, Int, and Wis check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "SidL5CR3q4cqVb2g","flags": {},"type": 0,"text": "Mask of Angels: This porcelain mask features a beautiful womanly face with closed eyes. The porcelain has a slight golden hue and gleam to it. Healing spells the wearer casts can critically strike (double healing). The mask sheds dim light and the wearer can cast Light at will. Once per day the wearer can choose to re roll a dice theyve used to determine a healing total (from a spell they cast).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "LW9cfb4gTg3sUAfF","flags": {},"type": 0,"text": "Mask of the Fallen Angel: Looks identical to the Mask of Angels, but has a slight black hue to it. This mask is CURSED and it dims the light around it. It grants the Chill Touch cantrip and necrotic damage resistance. All standard healing damages you, and instead you may use Chill Touch to heal yourself, undead, or any evil character (1d8 + modifier of YOUR CHOICE). If you are hit with a healing spell, or radiant damage you can choose to double the damage you take. When you do so the eyes of the mask open wide and the mask lets out a horrifying Banshee Screech. All creatures that hear the screech must make a con save. If they fail they lose Half of their total health and are deafened for 1 turn, if they succeed they take 3d6 psychic damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "L5l5JZZXgQNTAXLb","flags": {},"type": 0,"text": "The Grand Jester’s Smirk: This porcelain mask features a laughing face and a wide open mouth, and has all manner of colours and inlays on it. Inside the open mouth is just a black void, but if it is inspected a Jack-In-The-Box pops out. The mouth is in fact a 2×2 foot bag of holding. The wearer may cast Tasha’s Hideous Laughter 2 times per day, however they may also choose to do so telepathically by succeeding a Charisma check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "CFNkqrOzK1SRTEdi","flags": {},"type": 0,"text": "Sludgy Ooze Mask of Goop: This disgusting mask is dripping with ooze. It may be any colour. While this mask has eye sockets and a mouth, they are mostly obscured by the ooze constantly emanating from it. The wearer has resistance to physical damage. The wearer can cast Sludgeous Form once day, which is like gaseous form but they cannot fly and look like sludge. 10 feet movement speed and climbing speed in this form. this mask is not cursed but requires a strength check to remove.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "ZSO798KsMscVPULw","flags": {},"type": 0,"text": "Scarecrow Mask: This mask is CURSED and cannot be removed unless it is ripped from the face. Once the wearer is cursed, they walk in a bowlegged manner and their movement speed is reduced by 5. This mask is made from burlap, and has a half sown half shredded mouth. This mask grants immunity to the frightened condition. The wearer may cast Cause Fear 3 times, and Fear once per day. All critical hits (including intimidation) cause the frightened status effect. Once per day the wearer may (as a bonus or reaction) cause a frightened target to become incapacitated and scream for another turn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "we1YokdH9KcVUpJS","flags": {},"type": 0,"text": "Bandaged Mask: A mask of bandage wrappings, that has some strands loosely hanging off and others stained with dried blood. This mask is CURSED. This mask has a slight smell of flesh putrefaction. It grants 1d10 health regeneration per turn. General injuries heal within minutes, and a major injury (like a broken bone) can be healed in a matter of days. If the body is healthy, the mask compels it to begin to grow cancerous tumours in different places. The only way to stop this is to have to body become injured so that the cancer is not the focus of the regeneration. If the cancer is left to grow the wearer will eventually turn into a gibbering mouther.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "wXLGQ8WUvQvwpmDe","flags": {},"type": 0,"text": "Broken Porcelain Mask: This porcelain mask features cracks across it. The bottom right of the mask, from the jawline to the cheekbone to the chin is broken off. You can just make out the expression of terror carved into the remaining features of the mask. The wearer has 120 feet of tremorsense, and can cast earth tremor at 4th level once per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "QylZShEVHop02B7I","flags": {},"type": 0,"text": "Scorched Dryad Mask: This wooden mask features a head crest of branches. The entirety of the mask is scorched wood and it smells like charcoal. The wearer may roll a d20 if they are hit by fire damage. If they roll 11 or higher, they are healed instead. Being on fire gives the wearer inspiration that scales up to a d12 for being on fire each turn. They may designate one of their weapons to adopt the Flametongue trait and may cast Aganazzar’s Scorcher from the weapon once per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "NtHjQD7VFL09J66H","flags": {},"type": 0,"text": "Sabretooth Skull Mask: This mask is part of the skull of a sabretoothed tiger, without the bottom jaw. The eyes sockets are large, and the top jaw features 2 massive fangs that extend downward. The fangs can be removed and used as daggers. The wearer can cast Locate Creature once per day and has advantage on the first strike against it. The Located Creature has disadvantage on perception checks against the wearer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "h8v5kWnUjq9tOKit","flags": {},"type": 0,"text": "Plague Doctor Raven Mask: Smells of pleasant incense (replace each week). Grants you advantage on madness conditions + ALL crits (spells, melee attacks, but also intimidation, persuasion, deception) force your targets to make a save for a short term madness condition. Roll a d100 for the result of the effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "7mbfRVXjQGjLjkyH","flags": {},"type": 0,"text": "Mask of Anubis: Coloured black and gold, this mask gives you advantage on death saving throws and gives your targets disadvantage on saving throws if you brought them to 0 HP. Those you slay may be interacted with as ghosts for a short time before they are sent to the afterlife (1 hour).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "7GzhSXw1h1wz9qpe","flags": {},"type": 0,"text": "Jack of Blades Mask: If you die, your soul is magically transported into the mask where it may remain until you choose to move on to the afterlife. Anyone who puts on the mask can hear and speak to your soul. Until they take off the mask, you can keep talking to them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "3mzWVVCzbztKdoQp","flags": {},"type": 0,"text": "Mask of Drought: This red clay mask is cracked all over, resembling soil that has been drained off all water and cracked. This mask grants fire resistance, and Con save advantage from heat exhaustion, and grants the ranger’s Natural Explorer trait for DESERTS.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "gontSQa4iZ7HRiXD","flags": {},"type": 0,"text": "Triceratops Mask: a large bone or wood mask with lots of potential for war paint. This mask grants the triceratops gore+trampling charge attack once per long rest. Damage is 1d8+5 at level 1 and scales with level. Only the target takes damage but every unit passed through must make a strength saving throw of decreasing difficulty (simulates momentum loss) or be knocked prone. This mask ALSO grants a +1 to AC when attacked from the front (90 degree).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "k6yu8G0TlMbE2Gep","flags": {},"type": 0,"text": "Dragonturtle Mask: This mask is turtle coloured and features the dragonturtle’s menacing hooked beak. This mask grants the dragonturtle’s steam breath ability once per long rest: 2d6+2 at level 1 and scales up. It ALSO grants +1 bonus AC when attacked from behind. Hidden ability: gain inspiration if you roleplay as a TMNT.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "bhfkwyHv3acVEK7y","flags": {},"type": 0,"text": "Cthulhu Mask: Roll for colour. Straight up immunity to madness. Once per long rest you may cause ALL intelligent creatures in a 30 foot cone to make an INT saving throw. If they fail they spend the turn incapacitated and screaming. If they succeed they each gain 2 WIS for the duration of combat. If this is abused for WIS gains, you can summon Cthulhu to annihilate the PC.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "WdMnL5n0NqbFniTM","flags": {},"type": 0,"text": "Dwarven Runebeard Mask: This mask has a beautifully carved runic beard. You gain the effects of Belt of Dwarvenkind. You can also mine significantly faster and you have a strange affinity to pickaxes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "YXQofudTlYrKekam","flags": {},"type": 0,"text": "Mask of the Faceless: This mask causes your face to appear completely indiscernible and have all of its features obscured by a churning shadow. Your intentions, alignment, goodness/evilness are completely obscured. Insight does not work on you and you cannot be charmed. In fact, being charmed gives YOU inspiration. Spooky.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "uqewiZLew0GEqYjR","flags": {},"type": 0,"text": "Leshen mask: The wearer can phase through trees. This costs half your movement. The more its abused, the more prone the wearer is to exhaustion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "Y5VEw525jtHpfubu","flags": {},"type": 0,"text": "Guy Fawkes Mask: This mask grants proficiency in CHA saves. Once per day, it may be activated with a command word to grant advantage on charisma checks for 1 hour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "nZGb9Phwty8DyMbe","flags": {},"type": 0,"text": "Gladiator Maximus Mask: Specifically grants the Gladiator’s By Popular Demand feature from the character backgrounds (Entertainer Variant). Adorning this mask gives the wearer opportunities to gain inspiration. This effect is triggered on all combat crits and killing blows. For such an event the wearer can choose to perform it with some ‘pizazz’: choose to make a performance, athletics, or acrobatics check. If successful, gain inspiration.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "rRmOuUVi6AtreVHP","flags": {},"type": 0,"text": "Mosquito Mask: Huge eyes, antennae, proboscis. Once per long rest, you can spend 10 minutes siphoning the blood of a fresh victim. This heals half of your total health and grants 2d10 temporary Hit Points. Try not to get aids.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "6DCoMJZjMEUALmCb","flags": {},"type": 0,"text": "Bunny Mask: Cute or creepy, your choice. Your speed is increased by 10 feet. You can cast Jump 3 times per day without expending spell slots. Once per day you can also choose to force an opportunity attack to miss you if the hit lands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "MHc0uPcYG86xYROr","flags": {},"type": 0,"text": "Berserker Mask: This mask reminds you of skyrim. It grants Rage Beyond Death. In combat, if you drop to 0 hitpoints, you can choose to go unconscious or not. You still make death saving throws. You immediately go unconscious if combat ends after using this effect, and you wake up with one level of exhaustion. 1 use per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "K94Ppk4VhLvup6uA","flags": {},"type": 0,"text": "Valkyrie Mask: This mask resembles a beautiful womanly face. It has wings on either side. It allows the wearer to cast Compelled Duel once per day. Whenever entering combat, if you are not surprised you can also choose to yell a morale boosting battle cry that acts as a weaker version of the Bless spell (does not grant a persistent d4 bonus, only a 1 time use d4 inspiration to 3 characters of the wearer’s choice).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "Ipl8u63hL9z0mlLG","flags": {},"type": 0,"text": "Predator mask: This wide mask has ornamented dread-locks, and large alien eyes. The wearer may cast Invisibility once per day. However, during this cast they may choose to ‘target’ a particular creature. A red dot appears on the targetted creature. The targetted creature has disadvantage one perceiving the predator. If the targetted creature is attacked, it always hits (you only need to roll if you crit or not). If you crit, you deal max damage. This mask also grants 120 feet of darkvision.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "DasER4myuuRE1CRR","flags": {},"type": 0,"text": "Mask of Seduction: This mask resembles a succubus/incubus, though the wearer can choose for it to be hidden or not. If hidden, your eyes merely change colour to red. It lets the wearer speak and understand Infernal and abyssal. Once per day the wearer may cast the Succubus’s Draining Kiss ability. This mask also grants advantage on performance and persuasion checks that deal with flirting, charming, being sexy, and sexing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "Rqufgp3Y6o3Is2Ds","flags": {},"type": 0,"text": "Mask of Mimicry: This mask may resemble a feathery Raven, or any bird of paradise. The wearer is granted the Mimicry ability, that it can perform at will.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "0UVyi8VuDsy3EeNQ","flags": {},"type": 0,"text": "Beholder Mask: This mask is merely a large eye. Its pupil may be reptilian or cat like or human or anything really. Roll for colour of the eye. The wearer may activate the Beholder’s Antimagic Cone ability once per day. 120 foot cone of anti-magic that lasts 2 turns. At the end of the 2nd turn the wearer shoots an eye laser out of it. Roll for which laser is shot obviously. The laser must be shot unless an INT save is made. If it is failed, the wearer takes significant psychic damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "AXr4k6Ksp5GpZaie","flags": {},"type": 0,"text": "Blood Mage Mask: this porcelain mask is smooth and beautiful, except for the tears of blood coming from the eye sockets. The blood and the mask itself can be any combination of colour, but would most likely be found as a white mask with red or black blood. This mask gives the user a brand new spell: Shape Blood, which may be cast 2 times per day. This spell is exactly like Shape Water but is exclusive to blood. Damage is up to the discretion of the DM but my implementation is that it deals Magical physical damage (like silvered weapons).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "G7YAxOjRJtX0IFyk","flags": {},"type": 0,"text": "Blood Knight Mask: This porcelain mask resembles a skull with its mouth sowed shut. Your melee attacks deal magical damage. Whenever you strike an enemy they must make a con save. each time they fail they suffer a bleed d.o.t. that increases per failed save. It scales as 1d4, 1d6, 1d8, 1d10, 1d12, 2d12, 3d12, 4d12 etc. The bleed stops after 2 turns if its effect is not refreshed. Blood doesnt heal you, but you do enjoy a glass with your dinner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "tvLM5R4q4aEZBbFx","flags": {},"type": 0,"text": "Patron’s Overwhelming Favour Mask: This porcelain mask is not particularly menacing, for it is very intricately made with many bright colours. Gold flairs and pseudo embroidery. Paisley shapes and the like. The wearer may add their Charisma modifier to all attack rolls. When you reduce a hostile creature to zero hit points, you gain temporary health equal to your level + Charisma modifier. You can hold your breathe indefinitely and you do not require any sustenance or sleep (you must sleep only to remove physical exhaustion). You gain 30 feet of Devil’s sight AND you cannot be charmed. Once attuned, this mask CANNOT be removed unless the wearer wishes to rip their own face off. Donning this mask binds your physical body, metaphysical body, and entirety of your soul to a particular patron, no matter what class you are (even if you choose to rip off the mask).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "HP24tO3Uk7LfVmKh","flags": {},"type": 0,"text": "The Trickster God’s Blessing: This porcelain jester mask is simple, and merely has an unsettling smile carved in. The eyes show the same glee that a child shows as they burn ants with a piece of glass, not fully grasping the value of life. This mask compels to wearer to tell jokes and play tricks. Often times they are twisted ones. The wearer also gains inspiration for successfully tricking, riddling, or pranking others as well as for killing. This effect stacks. Once per day, If the wearer is hit, they can choose to roll a Charisma Save. If successful they can laugh off the damage, no matter how painful it was.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "SUBxjauzlH0W7EbG","flags": {},"type": 0,"text": "The Mask of Manipulation: This porcelain mask is serious. Its eye sockets are straight and focussed. A 9 pointed star is carved into the forehead, and the lips of the mask are made of a very exotic material. This mask allows the wearer to cast Modify Memory once per WEEK, and Zone of Truth once per DAY, and friends AT WILL. This mask also grants the wearer the Awakened Mind Warlock trait. This mask has a special ability in which the wearer may command the mask to cast Ultimate Modify Memory which is the same as Modify Memory but effects any intelligent creatures of the wearer’s choice up to a max radius of 1 Mile (no saves required). Once this ability is used the mask loses all of its abilities for good.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "u2BHRr4y7euGSkpe","flags": {},"type": 0,"text": "Hoppy’s Mask: While wearing this mask one small weapon such as a dagger or throwing implement becomes enchanted with a 2d6 Of necrotic damage. It also makes it so that the weapon returns to your hand after you’ve thrown it, or it is no longer in your hand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "0oUqkOwCl4w695Op","flags": {},"type": 0,"text": "Mask of Nightmares: You take on the appearance of what ever being or creature the observer is scared of. This could cause you to look different to different people as not everyone is scared of the same thing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "nJc0K61W01ioV7kB","flags": {},"type": 0,"text": "Grey Man Mask: wearer of the mask becomes uninteresting to all observers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "2TID0XD5kzMIFzZo","flags": {},"type": 0,"text": "Mask of Eyes: allows wearer to see in all directions, bonus to sight perception rolls","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "HO8aS0kpKJMF2iju","flags": {},"type": 0,"text": "Skull Mask: causes undead to think you are just another undead. Intelligent undead will have a neutral reaction to you, so long as you don’t do anything the angers them they will not attack you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "tC3qSZ0PkSN8AEgA","flags": {},"type": 0,"text": "Grim Reaper Mask: Grants wearer death touch (save or die) once per day. Also grants the wearer the ability to see spirits and the ability to send any spirit, soul, undead to its appropriate after life or Pergatory.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "SGAUqIYM9srkYnW3","flags": {},"type": 0,"text": "Mask of Infinity: looks like any other kind of mask. If anyone other than the wearer tries to pull the mask off, it creates a copy of the mask. The wearer appears to be wearing the same mask under the first mask. This works no matter how many time they try to pull the mask off. If the wearer removes the mask they can choose to create a copy or actually remove the mask. Note copies start fading away after about 20 mask are created or after 1 minute.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "eHlAU9S0ZL3uJ6Pu","flags": {},"type": 0,"text": "Rebreather Mask: allows wearer to breath underwater and makes wearer immune to inhaled toxins.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "zDLDimXy3CWGStIf","flags": {},"type": 0,"text": "SCUBA Mask: similar to rebreather mask except it makes a lot of bubbles when wearer breaths underwater.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "9ISNAUELsouzN02D","flags": {},"type": 0,"text": "Mask of the Bat: strike terror in the hearts of villains, learn martial arts, build cool gadgets, & beat the crap out of villains.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "J8X9jLzLkQjYSyl3","flags": {},"type": 0,"text": "Mask of Swarms: The mask resembles a giant locust head, recreated in remarkable detail. A close look reveals that it was created using the exoskeletons and body parts of millions of other bugs. When worn, insects, bugs, spiders, roaches, and any other creepy crawlies emerge, creating a swarm that engulfs the wearer’s body. The swarming bodies make the wearer more difficult to target and absorb damage. (Adds 20 Temporary HP, and, when worn during the day, adds 1 to AC. When worn at night or underground, imposed disadvantage on attacker).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "tgZzI8U1jKi7Rp3t","flags": {},"type": 0,"text": "Mask of Brutality – This mask resembles a growling devil’s face shaped from a single piece of a dark grey metal, save that the eyes and mouth are covered by bars like a prison cell. The mask, when put on, immediately deals 1d8 damage to the wearer as sharp needles pierce the skull and begin pumping a potent alchemical mixture of growth hormones and other substances into the cranial cavity, fiendish in nature. 2d6 rounds afterwards, the wearer gains a +5 boost to STR as their muscles bulge and swell, and their bones thicken. However, the mixture introduced into the wearer’s body results in an equal penalty to INT, reducing the wearer to a drooling, beastly hulk. Removing the mask deals 2d8 damage to the wearer as the needles tear free of the skull; the effects of the mask wear off after a long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "ZOj3Bg4KVoML1Rfp","flags": {},"type": 0,"text": "Mask Of The Half-Breed: This mask cannot be removed until the wearer is killed. When you are reduced to 0 Hit Points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a Long Rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "4JD8tHvQQPAZouUQ","flags": {},"type": 0,"text": "Mask of Many Colors: This mask appears to be a muti-colored dragon skull. While wore the bearer transforms into a chromatic Dragonborn or Half-dragon of their choosing. If a Dragonborn or Half-dragon wears the mask they will transform into a full-fledged dragon. Curse: whomever wears said mask, has an overwhelming desire to hoard treasure, and to serve Tiamat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "kTF4WKyWYVwoO71I","flags": {},"type": 0,"text": "Red Mask: choose an enemy before combat starts. It has disadvantage on Initiative.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "GiwWkFRlQWZI2OiH","flags": {},"type": 0,"text": "Iron Mask of the Hallowed Eve: A somewhat heavy mask with intricately carved patterns and runes. Presumably made out of some sort of iron, although it is impossible to tell. The wearer is immune to mind-affecting magic and is much harder to identify with magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "AhhNY8Z8Q9I3KROo","flags": {},"type": 0,"text": "Mask of the Shimmering Rainbow: A mask crafted from simple cloth and wood, it seems to change colour over time. The wearer can cast Absorb Elements at will. In addition, they have advantage on saving throws to resist petrification, charmed, frightened, and magical sleep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "jfCW6YcNVCpBu8SM","flags": {},"type": 0,"text": "Shadowy Mask of the Eclipse: The mask is always the colour of shadows, no matter what the light level is. The wearer gains 120 feet of darkvision, or an extra 60 feet if they already had darkvision. The wearer can also cast Darkness as a level two spell three times a day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "AMHP1sOCnWIAGtbK","flags": {},"type": 0,"text": "Grinning Mask of the Serpent: This mask resembles a snake’s head. The wearer cannot be frightened and has advantage on saving throws to resist charm effects. They also have advantage on intimidation checks and perception checks. However, they have disadvantage on persuasion checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "rt65byVYWSFNzVY3","flags": {},"type": 0,"text": "Mask of The Mask: An green tinged, hand carved wooden mask. Transforms the wearer into a ridiculous caricature of their former self (banana yellow zuit suit optional). Advantage on all Charisma/Dexterity rolls, +3 to Performance checks. When wearing the mask, you must make a DC10 Wisdom saving throw or suffer a bout of temporary madness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "wNDzvLvZVW6Comoy","flags": {},"type": 0,"text": "Mask of Lettuce: A large leaf of green lettuce pierced with two eyeholes. The wearer of this mask can polymorph into a head of lettuce for 1hr once a day. While they are a head of lettuce they retain their intelligence and wisdom, but all other ability scores are zero and they have 1hp. As a head of lettuce the player may speak to plants at will.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "RIZ2u3VQKyOyURaC","flags": {},"type": 0,"text": "Mask of Crystal Vision: A crystal mask cut at many angles. It’s wearer can simultaneously see (and comprehend) at every angle within 30ft. While they are wearing this mask they are incapacitated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "85ISnJnU5OOVNKNY","flags": {},"type": 0,"text": "Mask of Temples: a triangular clay mask embossed with a brick pattern. The mask has 5 charges. Spend one charge to cast one of the following spells: Moonbeam, Stone Skin, Spirit Guardians, Meld into Stone, Lighting Bolt, Hallucinatory Terrain. Each spell can only be cast once per day. Regain 1d4 charges a day. If the mask ever has zero charges it loses all magical abilities and it just a mask.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "5L9UlYTIK8SPrFWf","flags": {},"type": 0,"text": "Mask of Shadows: A black velvet mask with eye holes and no detailed features. The wearer can use the hide action as a bonus action while in dim light or darkness. Once per day the wearer may cast Gaseous Form on itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "2kR3gfsm9lQcaro0","flags": {},"type": 0,"text": "Mask of Barnacles: A wooden mask covered in barnacles — it is always wet. The wearer may walk across water (or other liquid surfaces) as if it were solid ground. Once per day the wearer may cast Control Water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "LGfYYUVGVfPPqdu6","flags": {},"type": 0,"text": "Mask of Maw: this silver tiger (or bear/lion/dragon) mask has row of pointed razor sharp teeth. The wearer may take a bite action as a bonus action. (Bite: +Dex to hit; 5ft reach; 2d6+3 piercing damage). Once per day the wearer may cast Fear as an action.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "H7rHN3Bptl3DTPvN","flags": {},"type": 0,"text": "Mask of the Time Druid: A silver mask with no eye mouth or nose holes. Adorning the mask lets the wearer see 3 hours into the past. The wearer cannot hear any sounds from the past or present while the mask is on.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "s91wdmQtusxVjfzr","flags": {},"type": 0,"text": "Mask of the godmaker: The name of the mask is never capitalised when referred to, as while the being within the mask has godlike powers, every being who knows about it will agree that it is no god. The mask itself is seemingly unremarkable, a multi coloured mask which looks like it was made of paper mache by a child, and painted haphazardly. However, when worn, the wearer will come into contact with a power being that will grant any one wish to the wearer. However, the wish will be granted as broken as possible, similar to a djinn or genie, causing the wearer to slowly transform into a powerful beast that is themed around their wish, bent on destruction of everything they held dear, while screaming praises to the godmaker.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "wQM5fIKx1XsyfWGB","flags": {},"type": 0,"text": "Mask of the Godbreakers: a mask that is wrought out of cast iron, and has the symbol of a large hammer embossed on the front. The mask belongs to a line of hunters that are bent of challenging the godmaker, usually consisting of loved ones of the godmaker’s chosen. When wearing the mask, the wearer can tap into the memories of those who had ever worn one of these masks, not just the mask they wear, as well as provide a mental link to others who wear the mask, allowing for a group of hunters to work in tandem perfectly. Said to be made from an older shattered mask, there are only a handful in existence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "mCO1otO0dWF1hJsW","flags": {},"type": 0,"text": "Mask of the Blinded One: a mask that resembles a bat, but is badly made, with the face being malformed, and the ears taking up much of the mask. When worn, the user loses all sight, and instead, is given the ability of perfect echolocation, being able to see with sound. Does not work well in places with a lot of hanging or free floating objects, such as in snow or the desert, but in solid places, such as caves and cities, is equal to or better than sight. Is capable of being used underwater. When removed sight is restored.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "l3j2HcaZEiVvZNRa","flags": {},"type": 0,"text": "The Perplexing Gaze: a large mask that encompasses the head, it resembles a human eye, veins and all, with a pink mass in the back resembling the muscles, as well as an optic nerve hanging from the back as if it was a pony tail. When worn,anyone who makes eye contact with the mask is unable to break eye contact, while no matter which direction they look at the mask from, it looks like they are still making eye contact. While eye contact is being made, all staring will have to make a roll to stop looking, with failed rolls causing them to be unable to do anything. User can cause the mask to ‘blink’, even though the mask lacks an eyelid, breaking eye contact with everyone, but stunning them for a round.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "QbN6A6HnTBJFk5Oz","flags": {},"type": 0,"text": "Mask of the Forgotten Friend: A featureless mask, similar in colour to pale skin. Has no hole for eyes, nose or mouth, but allows the user to function as if not wearing a mask at all when worn. While it is worn, all but the strongest of minds will perceive the wearer as a friend or close one, but anyone who knew the wearer before would have no memory of them, simply knowing them as a friend. False memories can be implanted by suggestion from the wearer, but takes considerable skill to do well. If worn for too long, wearer can suffer from dissociative identity disorder or depersonalisation disorder, among other things.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "jXnkdtpnLQiLANxd","flags": {},"type": 0,"text": "Dwarven mining mask – Designed and crafted by ingenious dwarven artificers and metal workers, this breathing mask was made to combat the dangerous brimstone fumes found deep under the earth. Grants the user immunity to any status effects and resistance to any damage from inhaling any form of dust or gas.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "E6fQVRo1vPvS9LGj","flags": {},"type": 0,"text": "An organic ‘mask’ that’s akin to a facehugger. It slowly drains the wearers constitution until their death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "it2Ti0YPfcA9IcRW","flags": {},"type": 0,"text": "Face of the Arbiter: A delicate clay mask without holes, shaped in such a way that it requires no straps in order to be worn. The face on the mask is stern and emotionally neutral, with sharp red lines accenting the hard edges and sweeping curves of the otherwise bland white face piece. While the mask is being worn by it’s bound owner, they are able to see through the covered eyes of the mask. The owner is able to detect a consciously made lie made in their presence, though lies made unknowingly and lies of omission are not detected in this way. If the bound owner asks a direct question to a single creature, the creature must make a Wisdom saving throw against a DC of 8 + the owner’s proficiency modifier + the owner’s Wisdom modifier or be compelled to truthfully answer the question to the best of their knowledge. In addition, the wearer of the mask is unable to knowingly speak a lie, directly or through omission. The supernatural properties of the mask can only be used by a single person, someone who had a part of their face removed and used in the making of the mask. A part can take the form of a small chunk of skin and flesh, a few teeth, or even a nose or an eye. The part is mixed into the mask, binding the article to the donator and making it so that the power of the mask can only be used by them. Upon the bound owner’s death, the magic is severed and mask becomes a normal face piece.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "cDNE1cyBMFKYUZYV","flags": {},"type": 0,"text": "Face of the Harvester: A delicate clay mask without holes, shaped in such a way that it requires no straps in order to be worn. The face on the mask is steadfast and peaceful, with orange, yellow, and green lines forming simple yet appealing patterns across the earthy tones of the brow and cheeks. While the mask is being worn by it’s bound owner, they are able to see through the covered eyes of the mask. The owner is able to identify and harvest plants with greater clarity and efficiency, giving the wearer advantage and doubling their proficiency modifier on Nature and Survival ability checks to understand and collect vegetation, so long as the wearer has proficiency in that skill. If the wearer does not have proficiency in one or both of the skills, they do not benefit from the mask’s bonus to that particular skill. In addition, the bound owner is more likely to receive a fruitful harvest while wearing the mask. If the bound owner harvests a plant while wearing the mask, the freshness and potency of the plant is extended for one and a half times the duration it would otherwise last. If the owner has actively and personally cultivated the growth of the plant, the freshness and potency of the plant is instead extended for twice its original duration. The supernatural properties of the mask can only be used by a single person, someone who had a part of their face removed and used in the making of the mask. A part can take the form of a small chunk of skin and flesh, a few teeth, or even a nose or an eye. The part is mixed into the mask, binding the article to the donator and making it so that the power of the mask can only be used by them. Upon the bound owner’s death, the magic is severed and mask becomes a normal face piece.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "Dn7sGCwyjmJui08v","flags": {},"type": 0,"text": "Le Masque Noirci: This wooden mask covers the upper half of the face and has a few shallow scratches over the left eye that cannot be removed or fixed, no matter who or what tries to fix it. The mask was most likely originally stained either jet black or a dark purple, but the color has faded over time. While worn, the owner cannot discern between different colors, seeing the world only in shades of black and white. That said, they receive an empowered darkvision that can pierce through even magical darkness, even if things can only be seen in black and white. Said darkvision extends out to 60 ft., but if the wearer possesses normal darkvision that extends farther, the effects will carry out to that distance. If the wearer of the mask attempts to look directly at anything emitting a light, they will suffer from temporary blindness that lasts for 15 to 30 seconds as a result. According to an old journal entry found with the mask, repeated attempts to look at light sources will increase the blindness time exponentially, to the point where the effect is permanent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "DwWJTsU8o8MtkX5l","flags": {},"type": 0,"text": "Face of the Terrified: A papier-mâché mask, vaguely resembling the face of a wide-eyed screaming humanoid. To work properly, this mask must be bound to over the course of a day, worn 24 hours by the desired owner. While the mask is being worn by an unbound owner, they find average things frightening and receive disadvantage on saving throws against the Frightened status. While the mask is being worn by a bound owner, they are instilled with a strange sense of courage, receiving advantage on saving throws against the Frightened status. Also, once per day, the user may cast the spell Cause Fear as a 1st level spell without expending a spell slot. While casting the spell, the mask contorts and emits a high pitched screech, layered over the wearer’s own yelling.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "NKefcHW3xLnVsA2Z","flags": {},"type": 0,"text": "The Fencer’s Facemask: If an opponent scores a critical hit against you while you are wearing the mask, roll 1d6 and subtract that from the total damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "KnpBTByffugxj8cy","flags": {},"type": 0,"text": "Surgical Mask: gain advantage on any medicine checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "48QPl1EgnGefgp1b","flags": {},"type": 0,"text": "Mask of the Hanged Man: A burlap sack around which hangs a noose. Upon putting on the mask, the rope tightens considerably, though not enough to choke the wearer. The fabric is ordinary sackcloth with a pair of scant eyeholes crudely torn into the front. The wearer must succeed in a DC15 Will save or become overcome with despair, suffering disadvantage on skill checks. Wearer can command the rope to attempt to grapple foes with advantage as a bonus action. Long term exposure to the mask causes 1d6 psychic damage per hour. Upon reaching 0 from this damage, the wearer simply becomes comatose, unwilling to move or take any action. Removal of the mask requires a will save of 15. This rough sack was the last thing that some condemned soul saw. As it hung with the recently dead, keeping them company as the carrion birds found them, it absorbed some malign energy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "2RNuNfVHKFN5Du8g","flags": {},"type": 0,"text": "Exfoliating mask – reduces blemishes and grants the user +1 charisma for 2d6 hours after wearing this mask during a short rest. Only usable once.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "k0pRT8AjzThn8erV","flags": {},"type": 0,"text": "The Statue’s Shroud – a marble facemask that grants the effects of the spell stoneskin to the user while wearing the mask. However, the user’s speed is reduced by 5 ft./round and is further reduced by an additional 5 ft every hour that the mask is worn. If the user’s speed reaches 0, they are petrified and turned into marble.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "oufbrbvjmNOg6NFE","flags": {},"type": 0,"text": "The Planar Visor – An obsidian mask with diamonds worth 100 gp each in the eye sockets. Wearing the mask and speaking the name of a plane of existence will allow the wearer to see into that plane through the eyes of the mask for 2d4 hours. One the time is up, the diamonds are absorbed into the mask and new ones must be placed in the eye sockets in order for the mask to work again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "ICCnzYrB0dHM37va"}
