{"name": "Druidic Treasures","description": "One hundred different treasures that would be considered sacred to any druid.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "X3bbUxRs8B3OfkNt","flags": {},"type": 0,"text": "A handful of Goodberries.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "o5fJajECwpsBhJUE","flags": {},"type": 0,"text": "A large walking stick (stats like a quarterstaff) with different animals carved into it all the way up. It looks like there are a few spots in the staff that still need to be carved.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "Il8T3fJOWKEcTIMo","flags": {},"type": 0,"text": "A hair clip with preserved leaves, feathers, small acorns or nuts, and flowers. When you Wild Shape, it always remains clipped behind your ear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "k2tRkSw6EdINF9yD","flags": {},"type": 0,"text": "A preserved acorn on a golden chain. When planted in clean soil near running water, a half-mile wide grove of oak trees sprouts in the area in 4d4 months.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "QMfO5o7kTxFDCAev","flags": {},"type": 0,"text": "A backpack with straps that are easily adjusted for different body sizes, and a clasp that can be opened by paws or teeth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "s05tug4dgDXXPGHr","flags": {},"type": 0,"text": "Silver chain that can enthrall listeners when shaken.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "Zh5lB85SIc6YcvgQ","flags": {},"type": 0,"text": "Enchanted weapons made from bone, wood, or stone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "BYFObCYFZQKcrwKA","flags": {},"type": 0,"text": "Animal figurines the size of chess pieces. Turns into the animal featured as an ally for 2d6 turns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "mzvxwfOZBsN7OW6u","flags": {},"type": 0,"text": "An ashwood club tied to the elemental plan of fire. Three times a day, it may be infused with the power of this plane, doing an additional 1d8 fire damage along with club damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "FmUtHxgRYmLb3HN5","flags": {},"type": 0,"text": "A bearhide which grants Wild-Shape:Bear once per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "y91JdTYGbDS1qA7c","flags": {},"type": 0,"text": "A satchel full of a hallucinagenic powder. Can be used by smoking, adding to drink, or throwing into one’s face. Grants one of the following effects: Blinded, Frightened, Exhausted, or Charmed. Only has 3 uses before the bag is empty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "EN7Td6MC9OuxnmDW","flags": {},"type": 0,"text": "A pouch of brightly colored pottery shards. Crows will perform small favors in exchange for a shard. Some crows like specific colors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "OwbruvUPS1ZzAOfP","flags": {},"type": 0,"text": "A small hand dart, carved from mistletoe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "jGtvWYVH2bguGp9W","flags": {},"type": 0,"text": "A collection of feathers, colored stones, a red ribbon, nuts, a small piece of honeycomb, etc. They are all gifts from friends.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "qqMnhPdn2m0Zfc6I","flags": {},"type": 0,"text": "A wooden compass that always points in the direction of the nearest fresh water source.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "DPIuxpwpDYAmrOQ9","flags": {},"type": 0,"text": "Wild Root: When planted overnight near your camp it spawns thorned vines that encumber any enemies near the side of the camp you plant it on. In the morning the runners and vines dry and you can dig up the tubers for breakfast and keep a couple for the next time you go camping. The night air smells of jasmine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "m2ySKeGTbDXBRWsX","flags": {},"type": 0,"text": "Moonbane Elixer: Wolfsbane essence, werecreature cerebral fluid, and a colloidal silver tincture will suppress or possibly reverse any transformation in any person suffering from lycanthropy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "FlQacwJWBsRKrc8l","flags": {},"type": 0,"text": "Cersei’s Taproot: A tapered quarterstaff that when pressed to a living tree trunk it sucks some sap and can be drank as a healing tonic or converted to flammable alcohol.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "fN9m9132icBoQ2ps","flags": {},"type": 0,"text": "Kamahl’s Claws: A bear claw necklace that gives you a +3 on attacks when in the shape of a CR1 animal or less.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "0by4ivP9BzcM6VBN","flags": {},"type": 0,"text": "Darkwood Orb: Druidic focus that adds an additional 1d4 necrotic damage to your offensive spells.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "uZQLU9cSTPHh4Qsu","flags": {},"type": 0,"text": "Death Mask of the Dryad: Carved from the heartwood of an ancient Dryad’s tree the profane nature of this ten-horned fetish gives you advantage against Fey. However, should a horn be planted in a Druid’s Grove it grows into a new Dryad and tree, it makes that Druid’s Grove permanent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "HdXkqSnrKZ7xJ0dh","flags": {},"type": 0,"text": "A pile of carefully paper-wrapped hard candies. If eaten they tastes bitter and awful. If a piece of candy is unwrapped and planted in the ground, it will eventually grow into a candy tree. Each consecutive harvest and replanting will net progressively sweeter candy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "Togrv22FI8asM5xR","flags": {},"type": 0,"text": "A wooden jar of black gel that smells faintly of apples. If applied onto a surface it dries to form a coating so reflective you could feasibly use it as a mirror.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "A525LMc1OLRJVK2N","flags": {},"type": 0,"text": "A massive 5 foot tall piece of ancient tree bark inscribed with druidic runes that seem to predict several events that have already happened and one or two that have not. Upon closer inspection a part of the bark looks like it was recently and deliberately broken off.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "b2fKHVYYGPzxGyKy","flags": {},"type": 0,"text": "An intricate multi-level ant farm complete with multiple habitats, glass viewing plates, and an automated system to feed the ants at various intervals. The ants are of an exotic, possibly magical breed and seem to be building something that definitely isn’t part of the farm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "7B27vVNMSJMCSLyv","flags": {},"type": 0,"text": "Gaea’s Umbra: A long chord rope of simple hemp with jade end caps. It begins to glow with green Druidic letters when wrapped around a tree. A portal opens beneath the tree near the roots that acts similar to a Bag of Holding, but able to hold large amounts of bulk items like wagon wheels and even a sled or small boat comfortably. Histories seem to indicate it was once able to instantly transport large armies of Treants during the rare times Nature goes to war.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "MUhkR9ixePZXU63s","flags": {},"type": 0,"text": "Breastplate of the Arch-Druid: The skill of the smiths who fashioned this out of petrified black ironwood has been lost to time. Truly a one of a kind piece of armor. The face of the Green Man is carved on the front and is said to whisper wisdom to the sleeping owner every night.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "W4Ot9i0Ci1pYU0gJ","flags": {},"type": 0,"text": "Emerald Nox Stone: Once placed into a necklace or ring and melded into your wildshape it adds 1d4 poison damage to your attacks. Your form has a sickly green and black aura wafting off of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "DUKoWfPk4tlZwcBR","flags": {},"type": 0,"text": "Willow Oftgütt’s Troll-Mix: These trollbane acorns, once thrown, a target creature must succeed on a DC 10 Constitution saving throw. On a failed save, a target begins to turn to stone and is Restrained. The Restrained target must repeat the saving throw at the end of its next turn. On a success, the effect ends on the target. On a failure, the target is Petrified until freed by the Greater Restoration spell or other magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "At2R5qGRHpZzB1yS","flags": {},"type": 0,"text": "Quarter Pike: A fire hardened spear and Druidic focus all in one that works with Shillelagh.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "gAkNmwgSVUXCqKbU","flags": {},"type": 0,"text": "Encyclopedia Druidica: These books are a compendium of knowledge from the natural world (Increase your Intelligence or Wisdom score by 1, to a maximum of 20). Any checks that are nature related just seem easier to you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "ec9FU3U48GfefRe6","flags": {},"type": 0,"text": "Bracelet of the World Walker – A small bracelet sewn out of various sorts of fabrics and strings, including spider silk, cotton, wool, and the fur of several species of animal. The wearer is unaffected by difficult terrain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "l2Z0NUY0YEf34pyv","flags": {},"type": 0,"text": "Pendant of the Earth, Seas, and Skies – A small wooden pendant held on a red piece of string. The wooden pendant has three gemstones set into it, one blue, one yellow, one green. The blue gemstone glows dimly in the presence of freshwater and brightly in the presence of saltwater. The green pendant glows brightly when underground and dimly when underground but above sea level – say, when in a mountain. Lastly, the yellow pendant glows brightly during the day and dimly during dawn and dusk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "PJffqq4m3LQU7Aom","flags": {},"type": 0,"text": "Wethershome – appears to be a staff made of three long sticks bound together at the top, held by a string at the bottom. If the staff is opened to form a tripod, and covered in branches, entering an opening in the staff-tent allows players to enter a warm, dry room with rough-hewn furnishings. These furnishings cannot be removed from the room or permanently destroyed. Items left within the tent appear underneath the staff when it is lifted up and re-bound.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "9oExd3saz98fb8kc","flags": {},"type": 0,"text": "Atulk’s Cocoon – a bearskin, painted with symbols, and beaded around the edges. A person who sleeps inside the skin can get a decent nights sleep even on uncomfortable terrain, and gains protection from heat and cold while wearing or sleeping in the skin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "fDv6AsagBtVKjLon","flags": {},"type": 0,"text": "The Dirtmap Wand – appears to be a normal stick. Can be used to trace a map of a nearby area in the dirt with perfect accuracy (up to a 300×300 ft area).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "ThdYtlo2RkGwPxdc","flags": {},"type": 0,"text": "Fetch Ball – A ball of dyed fur wrapped around a stone, roughly the size of a tennis ball. When thrown, targets within 10 feet of the ball must make a wisdom saving throw, or else drop what they’re doing to chase after the ball.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "DDFj1gI1z7vm1bVx","flags": {},"type": 0,"text": "Pendant of the Prey – a necklace decorated with a small mouse skull. After attunement, allows the bearer to find a path around any creatures the bearer would consider an enemy, if any such path exists.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "mbammiEw6cGoxRX9","flags": {},"type": 0,"text": "Pokeberries – small, dark purple berries. When burst, the berries create a thick, opaque juice that dyes objects a deep reddish-purple. Cannot be eaten.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "Torx9g49L20LbBKa","flags": {},"type": 0,"text": "Seed of Brief Harvest – when planted, this seed grows to form a small bush, resplendent with fruit and vegetables. After a day, the bush withers and dies, leaving a dull stone. A ritual may be performed to enchant the stone into a new Seed of Brief Harvest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "w2PrAtOFYm4Shbnn","flags": {},"type": 0,"text": "Heart of the Lumberwoods – A staff made of oak, wrapped in vines, and the top has a flower bulb growing out of the vines. In darkness, the bulb opens and releases fireflies that orbit around the flower and give off a soothing blue light (sheds dim light in a 10 foot radius). Once attuned, the bearer of the staff can use a bonus action to send the fireflies to a location within 120 feet (cast the “Dancing Lights” cantrip, without needing any components, and does not need to maintain concentration).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "BIfSEvzJcttzJXoo","flags": {},"type": 0,"text": "Twig of the World – A twig that, if planted, will grow to a full tree in 24 hours. You may remove one twig from the tree to do it again. Note: tree must naturally be able to grow or it won’t work.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "wUUio6kt48ve3DiQ","flags": {},"type": 0,"text": "Farseeker’s Amulet: Deepening your connection to nature as you sleep you are shown all the geographic features, weather patterns, and points of interest in the surrounding area. While sleeping you resemble a pile of leaves, sand, snow, or stones.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "kf9WQJj8cieZx9wa","flags": {},"type": 0,"text": "Chrono-mites: This amulet releases a particularly voracious species of termite from a pocket dimension where they are usually dormant. Any wood nearby is reduced to termite droppings in seconds. You gain advantage against treants, dryads, awakened trees and shrubs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "XJ14eDtCwPqMFnvx","flags": {},"type": 0,"text": "Crown of the Wild Hunt: You gain two additional wildshape transformations per day and has a 5% chance of summoning an ethereal wolf, bear, or T-Rex that is friendly to you at the beginning of the week depending on your level.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "IkHob0VSZtfXyT7z","flags": {},"type": 0,"text": "Scroll of Sticks to Snakes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "bgEPLMZQgbATAQt9","flags": {},"type": 0,"text": "Leamhán’s Blessing – A small, simple bowl made from elm wood. When filled with oil and set aflame, it acts as a compass for those who find themselves lost in a forest. The resulting smoke points in the direction of safety. Luckily, the bowl itself does not burn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "qKJBX5N33Z54F04f","flags": {},"type": 0,"text": "Yew Wand of The Phoenix: The feather in the core of this wand gives a spell caster 25 charges of Firebolt with a 5% chance of it being a Fireball instead. When held over a dying friend the wand has a 5% chance of healing them to full health. Your carrying capacity is doubled while attuned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "Ug6ZzIrZnnoiV1VW","flags": {},"type": 0,"text": "Blackthorn Shillelagh: Magical thorny vines spring into existence at a point you choose within a 30′ range. The vines can only occupy a 5 foot cube. Any additional vines must be adjacent to the previous casting. Alternatively, you can create 5’x10′ hedges by halving the density of the vines to create rough terrain. If a creature would be surrounded on all sides by the vines the creature can make a Dexterity saving throw. The vines can have any shape you desire, though it can’t occupy the same space as a creature or object. Each square has an AC 5 and 15 hit points. Reducing a square to 0 hit points destroys it. If you maintain your concentration on the ability for ten minutes, the vines becomes permanent and cannot be dispelled. Otherwise, the vines disappear within a day. You may attack twice each round with the Shillelagh cantrip.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "ArGLb0Ed1yoqr9KA","flags": {},"type": 0,"text": "Vileblight Seeds: Plant these at night next to a tree and wake up to black and yellow seed pods in the morning… growing on a dead tree. Smash one on your weapon before combat to deal scaling poison damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "E7tEaKI0WoAWBbzC","flags": {},"type": 0,"text": "Lost Ring of Orram: Your skin takes on a greenish tint and as long as you get 4-6 hours of direct sunlight you don’t feel the need to eat. Each morning thereafter you wake up to two handfuls of Goodberries and mysterious accelerated plant growth around you. Roll one night every month for a 5% chance of waking up next to a plant based Simulacrum of yourself. You have advantage in dealing with plant based creatures.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "UFZqGlpTBpvea0DI","flags": {},"type": 0,"text": "Verdant Symbiote: Your skin begins to resemble bark and ironwood. A sentient nature spirit has bonded with you over your body and add +1 AC to your armor. Spider Climb and Web are accessible in humanoid form and your carrying capacity is doubled.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "Kgg8a4NRscSsEOFC","flags": {},"type": 0,"text": "Savior of Gal’Darrow: By all accounts an ordinary coconut. But if thrown into a body of water it becomes a living ship. The sides fire large runners of vines that were said to be able to out wrestle a Kraken. When no longer needed the mast blooms and drops another coconut as the ship sinks into the waters below.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "jhmrP8p2RR1KzpJ2","flags": {},"type": 0,"text": "Dryad’s harp- a harp with little vines for strings and a oaken body with stray leaves. It appears to be alive requiring water and light to sustain itself. It’s leaves changing with the seasons and it blooms in the spring. If broken or damaged, it will slowly but surely repair itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "rZtPStXPGWklmIe6","flags": {},"type": 0,"text": "Nightshade Guardian: Plant this seed under your sleeping bag at night to envelope you in the center of an awakened tree all night while you sleep adding 1d4 poison damage to any attacks. In the morning it breaks open and blooms into a new seed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "JAKJxLk9SJnTUI7U","flags": {},"type": 0,"text": "Pangolin Bracers: Gain +2 AC and 1d4 slashing damage to your wildshape when hit with a melee attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "od8e9qlX9rpzEhjh","flags": {},"type": 0,"text": "Curupira’s Blessing: This amulet fits in your pocket and doesn’t require attunement. Your tracks are now backwards, leading people following you away and people running from you towards you. Trees seem to move out of your way and food always seems to be available to pick. Animals are drawn to you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "Rh3CIK9qgjN3NLdm","flags": {},"type": 0,"text": "Crow-bill of Ashwood: This specialized war sickle/scythe does 1d8 piercing damage plus an additional 1d4 fire damage. If flipped around the black mahogany handle can be used for the Shillelagh cantrip.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "dUcQquqwIQCJKXNI","flags": {},"type": 0,"text": "Mar’ Messeck: Twice a day hitting a button on this magical box creates a wooden Warforged that tries to help you with your problem. Once the task is done or it’s been 24 hours he disappears. “Existence is pain.”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "U4vyRLdVecQQleX8","flags": {},"type": 0,"text": "Expanding Stones: These tiny sling ammo sized rocks can turn into roughly 5 cubic feet boulders when thrown. Drawing the right Druidic rune reduces them back to normal size. Fun for camping if you want to retain heat, build a shelter, need a improvised table, or don’t want anyone coming at you from a certain direction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "HYyW5VGLfToXVD1B","flags": {},"type": 0,"text": "Enchanted Soil – Any seed, root, or fungus spore planted in this soil will grow. Soil acts as favorable planting soil & favorable condition for growing any plant or fungus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "umqE0wrSpMB5QMpk","flags": {},"type": 0,"text": "Rare Seeds – a collection of seeds from extremely rare & possibly magical plants & fungus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "FemG0vGNBgl2vNOD","flags": {},"type": 0,"text": "Staff of the Argonauts: A legendary quarterstaff made willingly from the heartwood of an immortal Oak tree. Etched along the spiral relief is an epic tale from ancient times. The middle is padded with golden wool and the top has two rows of dragon teeth and gets two charges each morning. Roll a 1d6 during combat to use a charge: 1. The blessing of the Sea God are upon you and five cubic feet of water leaks out of the bottom. 2. A mighty twenty foot tall Oak springs out of the ground in front of you. 3. An ethereal hero named Orpheus appears around you. Everyone who fails a DC 15 check is put to sleep (including you). 4. An ethereal brass-hoofed bull appears where you stand. Your heads align as you launch a Cone of Flame. 5. An ethereal serpent dragon appears around you and sinks his two fangs into the earth as you slam the top of the staff at the same time. Two soldiers (guard stats) spring from the ground and attack your enemies, but disappear at the end of combat. 6. An ethereal golden ram appears and heals the whole party completely even to the point of removing curses and exhaustion. Your next attacks are done with advantage as the War God blesses you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "UJSkPHTN3llzVJjM","flags": {},"type": 0,"text": "Laurel Circlet of Victory – A small circlet made of twisted laurel sprigs. When worn, this circlet gives the wearer a sense of unbeatable resilience, regenerating a point of health per turn when in combat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "rlwnypr2jNXgM3mS","flags": {},"type": 0,"text": "Shield of the Wild – A wooden shield, round in shape, its surface ornately carved with patterns of flowers and trees. When walking through woodlands, forests or jungles, the images change and move, almost matching the surroundings. Glancing in the direction of the shield, one might not see it at all, let alone the person carrying it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "AhAK6IQwqZAnNn1M","flags": {},"type": 0,"text": "A small sprout, caring for it adequately for 3d20 days will eventually cause it to grow into a small ent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "RDJldt8n5YzqNyIT","flags": {},"type": 0,"text": "Narvin’s Notebook: This book contains the notes of an unusually academic Druid. You have advantage on any intelligence (nature) check if you spend 1 minute reading the book.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "rmeTNZSNLFJllRLU","flags": {},"type": 0,"text": "Minor Volcanic Dagger: an obsidian dagger glowing red with pulsating energy, dealing fire damage instead of piercing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "VQISrfCvSd2ImDop","flags": {},"type": 0,"text": "Potion of the Beast: Gain an extra wild shape charge till next long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "GZ1vxzzx1GG0gjTE","flags": {},"type": 0,"text": "A necklace made seemingly made of several roots braided together, when attuned, it will allow the user to cast treestride once per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "UwSsEA9lkfbxcrca","flags": {},"type": 0,"text": "Chain of Spell Sporing – A daisy chain of of dried mushrooms that, when activated once a day it will cast one of the following spells at level 1 at random. (Charm Person, Cure Wounds, Faerie Fire, Fog Cloud)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "8DIQX21njqoGtS5D","flags": {},"type": 0,"text": "A small figurine of a curled up baby with an earth elemental like face carved of stone. If the figurine is planted in a druids grove and many long, extensive rituals are performed on it, a galeb duhr forms. This galeb duhr will become the guardian of the grove.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "KZDjm4M7sOPIJuvW","flags": {},"type": 0,"text": "Cocobooze Seeds – These are seeds of the legendary cocobooze tree. The tree is a tall, pine like plant with branches that spiral in a staircase fashion. A few coconut like fruit hang from each branch that are at least 5 feet off the ground. When split open, the cocobooze fruit contain an alcoholic liquid that tastes like fruity, flat ale. This plant is sought after by many a brewer and the seeds are rare and very expensive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "HvjSbVggKQVRpNrO","flags": {},"type": 0,"text": "The branch of a willow tree, stripped of leaves and turned into a bow. Worn fey runes are carved into it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "t4AAeUEXU5hvztMD","flags": {},"type": 0,"text": "A crown made of olive branches that never decay. The wearer is deceptively charming (Grants advantage on diplomacy checks). A few fresh olives pop off the branches every day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "b5HJ5HS10tiUUnuI","flags": {},"type": 0,"text": "A small brick of clay that will harden into solid oak wood after being exposed to moonlight. Druidic covens carve the clay into tools and the like before letting it harden. There should be more of this somewhere.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "OkR3xmUiD4uIprvJ","flags": {},"type": 0,"text": "An amber amulet with a large, random insect inside, preserved from a prehistoric era. Insects of the kind inside will be friendly to the wearer and may even listen to basic commands if you’re charismatic enough.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "2nVvSbXRNF1z1WU8","flags": {},"type": 0,"text": "An alligator skull that reeks of sulfur and bog water. The druidic rune for ‘Preserve’ is carved into the forehead. If left underwater overnight, then a small trinket made of jet will be in the jaws.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "H1hJAmvZ6ReK51o9","flags": {},"type": 0,"text": "An incredibly life-like snake carved out of wood. The snake will coil comfortably around your arm if you give it verbal permission.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "4CTHNpRV5WY5siSe","flags": {},"type": 0,"text": "Portable Baobab: This quarterstaff can quickly summon a 50′ high and 30′ in diameter tree to sprout out of the ground. Despite the tree only being considered halfway through its life cycle it is big enough to protect you from the dangers of the forest floor. Removing the staff gently sends it back into the earth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "JoAm2l87rOvHRgCJ","flags": {},"type": 0,"text": "The Amber Collar: One of the worst punishments a druid can visit on a sentient being. This collar can bind a Small or Medium creature. Escaping the collar requires a successful DC 20 Dexterity check. Breaking it requires a successful DC 20 Strength check. Anyone bound has six rolls to free themselves before being locked in amber stasis as a tree begins to grow out of the collar and the roots envelope them and dragging the victim into the earth itself for 100 years. The Amber Collar has 60 hit points.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "l0mcqqSKDucgAdke","flags": {},"type": 0,"text": "Whisper Moth Candle: Light this candle once per night to draw in a large moth to your hand. You can whisper a message to it and then tell it a person or place you want it delivered. The moth will then fly there and deliver your message.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "2cofuwwQ4GIlUI3e","flags": {},"type": 0,"text": "Green Arachnis Tripwires: The proximity to unstable magics where these 20 foot tall spiders dwell makes this silk web absorb any spell you cast into it and store it for later. Thread it around any two points and anything that passes through it is in for a nasty surprise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "rgSjDJBNlxAbAFc5","flags": {},"type": 0,"text": "The Crown of the Woods: This antler headpiece (+1 AC) once belonged to an ancient wood-elf prince making all deer, caribou, elk, and moose species consider you friendly. Once per week you may call on one of these to ride, but if you harm your mount the horns constrict and pierce you for violating your pact with Nature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "edgWPBI7P5DomBLc","flags": {},"type": 0,"text": "The Feywild Hatchet: Legendary prank gift to an old woodsman. Upon striking a tree it makes the tree grow taller and thicker, if used on an animal it heals them and makes them healthier. It wasn’t completely useless as it can hew stone and iron like butter and the resulting debris has a 5% chance to turn into 10 lbs. of assorted gemstones.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "KAoOAo83VQ8BUGkU","flags": {},"type": 0,"text": "Dryad’s Heart: Considered a blessing by the willing and a curse by the uninitiated this ornate amber, bone, wood, shell and jade beaded leather chest piece (+1 AC) transforms the wearer into a tree for 24 hours per day only recharging on the solstice. In the hands of a properly trained user of the Druidic language they can mark or tattoo their skin over time to lessen some of the more extreme effects. At low levels it gives the druid the ability to turn into a tree and back twice per day, leading to two charges of Barkskin per day while wearing it at level 5, and finally at level 10 it allows you to wildshape into a Treant. At level 16 your connection to Nature is so profound that you become the earthly anchor to your own NPC Dryad residing inside you that you may transfer to another tree should the need arise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "LmIZ60xicKtw9qUa","flags": {},"type": 0,"text": "The Thorncrown of the Forest King – a crown grown from thornbush, it will only obey a true friend of the forest. When worn and deemed worthy, it gives the wearer the ability to speak with nature and he will gain +5 on every check on nature or plant medicine. If the crown is stolen, every animal will turn hostile towards the carrier until it is brought back to its owner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "vcNPYYuHxu44zKVv","flags": {},"type": 0,"text": "Amulet of the Harvest Beast: Any animal you successfully hunt and any plants you pick yields double what you would normally find. When you’re in Wildshape, expending a single spell slot to heal yourself instead acts as if you were using two spell slots of the same level.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "lPezIz1sOxMgZG7w","flags": {},"type": 0,"text": "Rat totem: A rat skull painted in red war paint. If used successfully it summons a swarm of shadowy rats with red glowing eyes that cannot be targeted by physical weapons and behave like a swarm type encounter. They cannot fail climb checks and move extremely fast. Enemies attacked three times in a row by shadow rats will be climbed by rats taking continuously more damage and being encumbered/slowed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "viyS0R6dggOGrwcq","flags": {},"type": 0,"text": "Sprig of the Abomination: while attuned to this sprig, you can expend 2 uses of wild shape to assume a hybrid beast form. See the monster manual’s section on lycanthropy for the statistics of hybrid forms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "9c1DIcszWDDZ14lF","flags": {},"type": 0,"text": "Marshflitter Hive: These symbiotic 6 inch-long mosquito-wasps have flyby and drain 1 HP per round and share it with you. Their hive hangs off your backpack or over your shoulder. Every level gives you a new mature adult emerging from the hive (Up to four that understand Druidic).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "DT3bChHnmKSF5QAP","flags": {},"type": 0,"text": "Rock Troll Half Plate: This armor consists of overlapping pieces of rock-troll hide. It always looks pristine within a day after any skirmish as though the hide still retains some qualities its former owner. The fire bramble fiber weave gives off a faint glow and keeps you warm in cold weather, as well as keeps the hide’s otherwise tenacious regeneration in check. The smell however…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "cphMp6GYJZaOeoh2","flags": {},"type": 0,"text": "Windshear: An ornate scimitar that is infused with the power of the four main winds. Upon a successful hit one medium or smaller creature must succeed on a Strength save or be pushed up to 5 feet away from you. It can also be held towards a sail to aid you on windless days at sea.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "3IRb1YjP36r4k3q1","flags": {},"type": 0,"text": "The Crown of Moonlit Winters: A shimmering circlet made from enchanted ice and decorated with Druidic runes. The crown has a soft inner luminescence reminiscent of the night sky, making the wearer emit dim light in a 10-foot radius while they wear it. Attuning to the crown grants the wearer the ability to use the crown’s properties, as well as immunity to cold damage as well as blindsight out to 60 feet. Both properties can only be used if the wearer is directly under the open night sky. Once per day, the wearer may use an action to use the crown’s Herald of Winter property to change the weather in a 3-mile around the point they activate this property to some sort of snowy weather of the wearer’s choosing. This weather can range anywhere from a gentle snowfall to a moderately strong blizzard, and requires 1d4 minutes for the new conditions to take effect. The weather lasts for 8 hours, and requires no concentration to maintain. In addition, three times per day, the wearer may use an action to use the crown’s Freezing Light property. The wearer may conjure a brilliant moonbeam from the sky, filled with fast-moving freezing mist, forcing all creatures in its 10 foot radius between the ground and the sky to make a Constitution saving throw against the wearer’s spell save DC. A creature takes 3d10 cold damage and 3d10 radiant damage on a failed save, or half as much on a successful one. Any creature that fails the saving throw is also blinded and has their movement speed reduced to 0 for the next minute as their eyes are burned and their feet are frozen. The creature can make a Constitution saving at the end of each of its turns. On a success, the creature is no longer blinded and its movement speed is returned to normal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "Sa4CWOcnt4wiTJoQ","flags": {},"type": 0,"text": "Falling Leaf: A mottled copper scimitar that is colored in the shades of autumn. Etchings of various leaves cover the flat of the blade and sway gently as though exposed to an invisible wind. The scimitar is a +2 magical weapon innately, with an additional property that can be activated if the wielder attunes to the blade. Once per day, the wielder may use an action to use the blade’s Shroud of Autumn property if they are attuned to the scimitar. The wielder calls forth a swirling cyclone of leaves around themselves in a 5-foot radius for up to a minute. While the cyclone is active, all ranged attacks made against the wielder have disadvantage. If the property is used while within an area with moderate density foliage, the cyclone instead has a 10-foot radius and causes all melee attacks to be made with disadvantage as well. The wielder also gains the ability to use their reaction to cause a ranged attack passing through the cyclone to automatically miss its target. The wielder may stop the cyclone and have the leaves drift away using a bonus action on their turn. If the property is used while within an area with high-density foliage, the cyclone gains new benefits in addition to the previous improvements. The cyclone instead has a 15-foot radius, which is considered difficult terrain while the cyclone is active, and all ranged attacks not made by the wielder automatically miss if they enter the cyclone. One time while the cyclone is active, the wielder can form blade replicas from the swirling leaves to attack a multitude of foes. By doing so, the wielder uses an action to make a single melee weapon attack with the scimitar against any number of creatures inside the cyclone, with a separate attack roll for each target.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "LeulgDDaxqthO3SB","flags": {},"type": 0,"text": "Coral Marstaff: A reef-like quarterstaff that is covered in suspended globules of water which act as portals to the nearest body of water. Reaching in one can retrieve fish or marine animals up to five feet long. If used with two hands and braced it will halve the damage of all fire-based attacks in a twenty-foot radius.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "KWCbId8zA7CI2nGI","flags": {},"type": 0,"text": "Heart of Pando: A symbiotic sapling that can bond itself to an individual and creates it’s own forest of cloned trees over time. Should you die the trees can birth up to three new avatars of yourself over time. Your clones are named Harold, Bob, and Herbert but should you die a forth time you become one with the forest forever.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "9lR5hwGBygWmIQKR","flags": {},"type": 0,"text": "Primal Crystals of Akaroth: Each crystal representing the four elements adds 1d4 damage of that type to your attacks. Your animal wildshapes are now made out of those elements (fire, water, earth, air) should you choose.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "zx1u1ikJuCl5AVaN","flags": {},"type": 0,"text": "Moon Sickle of Cressk: Using this platinum, silver, and gold weapon to harvest mistletoe under light of the full moon lets you make a Druid Grove permanent in only half the time (6 months in-game). If you happen to find a suitable stump you can leave this weapon and the requisite material components in a forcecage within the Druid Grove and in one year it will have been made permanent by trapping a small part of you in a time loop just long enough to complete the ritual. Occasionally it has been known to fail and release a druid from the time loop should they die elsewhere.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "pie1yaPdmy03V7Vh","flags": {},"type": 0,"text": "Mask of the Crystal Sea: an egg shaped mask cut from an angular, opalescent crystal. The wearer of this mask not only gains +3 to perception checks to spot fey creatures but also receives fey as a bonus language. The fairies of the western wood call the mask “Syliang” meaning “god shorn.”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "dAr0DNACa9kP40e6"}
