{"name": "Items For Sale In A Fantasy Black Market","description": "Over one hundred strange and cursed items that you can only find in a black market.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "naabYMjcgiAo7tSM","flags": {},"type": 0,"text": "A book full of strange markings said to have been taken from the dead head of a cult. In reality, it was a book scribbled in by a toddler.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "v658Uwi5PgLZmEMD","flags": {},"type": 0,"text": "The Left Hand of Maaug – A large gauntlet covered in blades. It weighs a good 25 lbs., and as such is all but impossible to wear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "VsVg7Eg34MyCVrWL","flags": {},"type": 0,"text": "The Bell of Beloved Fortune- Said to bring true love- to your best friends- when rung. Does not actually provide any romantic benefit to the owner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "nroharhvLRCddODr","flags": {},"type": 0,"text": "Seventeen Key Ring- Each key has a 5% chance of opening a lock you find. Once a key has opened something, it will not fit any other lock.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "f5qYPeQsjMSd5tYV","flags": {},"type": 0,"text": "The Loud Coin- This grimy copper coin, when thrown on the ground, loudly comments on everything within 60 feet of it in Common, giving an accurate (if unflattering) description of the room and all its occupants.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "iZV6kmxBaTAS14JV","flags": {},"type": 0,"text": "Periapt of Porcine Attraction – This amulet makes the wearer adorable to pigs, boars, and similar beasts. The animals will not harm the wearer, nor are they romantically interested; instead, they simply cuddle up to the wearer and stare at them lovingly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "sKgOjXoo3ZoutwwP","flags": {},"type": 0,"text": "Clod the Unburning – A large, roughly hewn table with “CLOD WUZ HERE” carved into one corner. The table is absolutely and utterly fireproof; even on the elemental plane of fire, it feels cool and firm. It’s also a heavy table.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "iPFhI41o2CmsZ4pJ","flags": {},"type": 0,"text": "A six-pack of potions tied together. A note on one of the potions reads “This One Isn’t Poisoned!” The note magically moves between bottles when unexamined. The potions refill every evening at dusk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "WmXNgmuCThssbP1B","flags": {},"type": 0,"text": "A wand that can give a wish at who ever is targeted but it got mixed up with 20 other wands some possibly deadly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "5uDc3g4U1UZssX1g","flags": {},"type": 0,"text": "Illegal alcoholic beverages spiked with Illithid blood. It is said to have a strong hallucinogen effect when consumed. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "NjpwXjQoNYtuxCCm","flags": {},"type": 0,"text": "Poisons derived from Beholder eyes, claimed to have the effects of the eyes they were brewed with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "yNDbCkapPzpHPmii","flags": {},"type": 0,"text": "An unstable weapon, crafted from fusing multiple enchanted items together. The weapon is a powerful item, but has a 1d8 chance of shattering with a random spell effect cast upon the wielder (AOE spells affect wielder and all friendly/hostiles in range)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "vf2xEZIzbvXmRrkY","flags": {},"type": 0,"text": "Pocket (dimension) sand – a small bag of sand that is enchanted to open a doorway to a pocket dimension. To use, scatter the sand on a surface of your choosing, and utter the command word (shashasha!). A doorway equal to the space the sand covers (no greater than 10×10 feet) opens for 1d6 minutes. The sand falls into the pocket dimension on use and is consumed. There is enough sand to cover a 10×10 foot space, or 4 separate 5×5 foot spaces. If used multiple times, each doorway leads to the same pocket dimension.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "UaTmEGoi8tT3VlcA","flags": {},"type": 0,"text": "8 stones in a small leather pouch. Red, orange, yellow, green, blue, indigo, violet, black. Each casts a spell at its base level. The stones have qualities which show the amount of times they can be used, ‘perfect’ =3 uses, ‘crazed’ =2 uses, ‘cracked’ =1 use. Once the final use is expended the stone shatters into fine dust. To use a stone, throw it at the target. (Red (crazed), fireball; Orange (perfect), cone of truth; Yellow (perfect), daylight; Green (perfect), plant growth; Blue (perfect), create/destroy water; Indigo (crazed), command; Violet (cracked), animate dead; Black (cracked), power word annihilate)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "ACSbdS6nFaWlbbkm","flags": {},"type": 0,"text": "A dwarven heart on ice. Great for health potions!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "2PA6uChSMnjqekKt","flags": {},"type": 0,"text": "Griffin Eggs for high class dining. They’ll leave you full all day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "BH95mJfFQIPYWuTA","flags": {},"type": 0,"text": "Ancient Forgotten Currency – valuable collectible coins thought to be lost to the ages for a millennia. On sale today only!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "35pRXrRvW9QKQQMV","flags": {},"type": 0,"text": "A trained Quasit or Imp in a small cage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "P2ge00Fa94949GKS","flags": {},"type": 0,"text": "A vial of brass dragon’s blood – Blood, still warm, taken and preserved the moment it was slain. Those who consume are said to be able to detect lies Cast Zone of Truth once. The user is marked by the magic effects, and gains a mark on their skin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "CzPqmUiCSRkJjWtd","flags": {},"type": 0,"text": "Diamond Blade (+1) – A blade made of diamonds. The tang of the blade is silver, its pommel diamond as well. It reflects and refracts light and magic mysteriously. If on an attack if you were to add acid, cold, fire, lightning, poison, thunder, necrotic or radiant damage to your weapon damage dice, roll a 1d8, that added weapon damage dice type is changed to (1- Acid, 2- Cold, 3- Fire, 4- Lightning, 5- Poison, 6- Thunder, 7 – necrotic, 8- radiant).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "bsGKOJvXvpm5QTMX","flags": {},"type": 0,"text": "Sphere of Great Divination – A black obsidian crystal sphere filled with a dark inky fluid. Inside the sphere is a small white dodecahedron with black text on each of its faces. The sphere gives off a faint divination aura. As an Action, it may be shaken and the resulting text on the dodecahedron may be read as it floats to the top of the sphere. Treat as the spell “Augury”, but may only be used once per day, and has a 1d4 chance on use to give a random result or one the DM chooses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "NS8LNE2m4EZ18lsN","flags": {},"type": 0,"text": "An advanced innovation in the new field of gunsmithing- the Apache Revolver. Treat as a revolver (if you’re using 5e, the rules are on page 268 of the Dungeon Master’s Guide) with a built-in knife and brass knuckles. Probably not called the ‘Apache’ revolver unless that’s a place in your setting. And yes, it’s not a very practical weapon, but it seems to be selling fast.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "LpwVGJnNZMtJRWRJ","flags": {},"type": 0,"text": "An unremarkable-looking prayer candle. A precise wax-shaping technique has been used to hide magic sigils inside the body of the candle, such that when the wick is burnt it generates a field from which no sound can escape in a 12-ft radius. The candle burns out faster than normal, though, usually in about 10 minutes. It’ll simply look like you and whoever else you’re meeting with are praying silently, provided you aren’t gesticulating at each other.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "ecA7MVOxnIPKnsyy","flags": {},"type": 0,"text": "A phial of aboleth mucus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "dZlN4TkV3N7O9RAN","flags": {},"type": 0,"text": "A small ivory replica of a king’s crown. Its owner is able to participate in fractal chess, a version of the popular board game with no set number of players and an incomprehensibly large playing board. Players can communicate with each other, regardless of physical or planar distance, but can only do so when they make a turn, so messages by way of fractal chess are slow. There is only a single game going on, which started with its invention. There hasn’t been a winner for thousands of years, but there are plenty of losers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "Si0XSgIZVzo6X0bM","flags": {},"type": 0,"text": "A petrified toad. When held in the cusp of one’s palm for a minute, the toad’s body warms up and comes back to life. Whoever did so can command it to go to a location and stay there for up to 12 hours. Afterwards, it attempts to travel back to its user. The user cups the toad again for a minute until it petrifies, and they gain access to the toad’s recent memories.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "G0325XjRQ9lByrbr","flags": {},"type": 0,"text": "A portable peephole fashioned like a circle of steel, about half as large as a human fist. The corrugated end is placed to the surface of a solid object, then rotated clockwise, causing it to sink into the surface. This creates a purely visual hole (it’s a visual illusion, rather than an actual aperture) all the way through to the other end of the object. To remove, one would grasp the blunted tines on the outward-facing end and rotate counter-clockwise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "YkpNn8qRAJjYFahw","flags": {},"type": 0,"text": "The services of a band of mercenary orcs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "hn2zglRTlhECy4Dx","flags": {},"type": 0,"text": "Prankster’s gold, a liquid that turns into 100gp in recently minted gold coins for 24 hours after being poured out of the vial, before turning into an odorless gas. The vials are sold both individually and in bulk, and in different sizes. Understandably no one in this marketplace accepts gold coins as a form of tender.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "KLWonGC52QP7Go6U","flags": {},"type": 0,"text": "A mirror or lens that can be used to see invisible things but has horrible glare when exposed to most light sources.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "J5OJonLXiZO88jQO","flags": {},"type": 0,"text": "Counterfeits of prestigious wines, spirits, cheeses, and the like. Well, surely they’re counterfeits- otherwise there wouldn’t be so much, sold at such discount prices.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "FUHCeHLZHi0gKmTY","flags": {},"type": 0,"text": "A ‘Calinic breed’ cat. Striped purplish, it can sense poison, and prefers to eat poisoned food, even if it is full. Luckily the cat seems to be immune to poisons, toxins, acids, and venoms. It will also eat oozes and slimes. Unfortunately, it otherwise behaves like a normal cat; there are very few people who want to take care of a cat and simultaneously find a Calinic’s abilities useful at this market, so the seller is probably offering the cat at a lowered price.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "fGXwsitQD9FwFPst","flags": {},"type": 0,"text": "The deed to a tavern, hostel, or other innocuous city building; it has a large, clean basement with hidden side rooms, perfect for a secret laboratory, meeting room, vault, torture chamber, or what-have-you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "2e1EfJVCUyFt2eo1","flags": {},"type": 0,"text": "A scroll containing the secrets to finding and operating a magically hidden cavern base in the mountains.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "a5msnP6JyT2i62bx","flags": {},"type": 0,"text": "Maps of secret passageways in the underbelly of old cities or castles, sold next to maps of recorded passageways between the Underdark and the surface world. They have some warning symbols on them, but they probably don’t account for every danger. The maps are unreadable to those who haven’t purchased them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "xwaZK1KjLgicw3qC","flags": {},"type": 0,"text": "A writ granting one favor, within reason, from a criminal syndicate. Your payment helps keep them in business. The write can be magically tracked by them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "fooVqkaMpEnTuePf","flags": {},"type": 0,"text": "A magical vellum parchment that can be wrapped around a limb to make it look like a wooden prosthetic, or around a weapon to make it look like an innocuous object of similar size and proportions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "9vhXarykSZO6rXTj","flags": {},"type": 0,"text": "Binary poisons. Each is sold as a pair of dropper jars. Anyone who consumes an effective dosage of the first and second jars’ contents within 36 hours of each other suffers the effects of the full, original poison or drug. There are multiple different poisons and drugs being sold in this fashion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "RST5kW0c1urZ573d","flags": {},"type": 0,"text": "Dossiers of blackmail on city officials that magically update as more blackmail becomes known to the criminal underworld. The organizations that sell these magic envelopes censor information on the bribes they perform.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "WviTuQgWY7FbYXXZ","flags": {},"type": 0,"text": "A trained mimic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "lgznADOBj0a49ZR6","flags": {},"type": 0,"text": "The Talking Fungi – a fungus that when eaten let’s you speak and understand all languages for 1 Hour. When the effects ends you forget how to speak for 1 day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "78xlRQYSZcXuJTk7","flags": {},"type": 0,"text": "A compass that points to the person who has the most money on them in a room. Doesn’t work outside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "xGZAF5uV49BVaGI3","flags": {},"type": 0,"text": "A dagger that always misses the target. Excellent for screwing over that special someone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "IeZU0ImMN5GJpXob","flags": {},"type": 0,"text": "The Tainted-Love Necklace – A silver necklace with a purple gem on it. Put one drop of your blood on the gem. Anyone who wears this necklace will be permanently charmed by you until they take it off. Wearing the necklace long-term causes the wearer to become greatly addicted to being charmed (to the giver specifically but also to charm spells in general). VERY illegal; punishment is life in jail in Neverwinter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "qWTpz9OdRh8mNZn5","flags": {},"type": 0,"text": "A fake-lactery (aka – A Fool’s Phylactery). If you have the item on you (which is the size of your fist) and drop to 0 hp, your soul goes into the device and stays there for one long rest. Then you return into your body with 1 hp and 2 levels of exhaustion. The item breaks after.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "Qth0joMSgwxRKzkV","flags": {},"type": 0,"text": "Back-water Love potions – Very effective (DC 15 wisdom save) and lasts for 1 week. The drinker falls head-over-heels (or heels-over-head if you’d prefer) in love with whoever gave them the drink. But there’s 10% chance of the drinker becomes obsessive, stalker-ish, even violent towards other potential suitors. If this occurs, the drinker will stay this way for a month instead of a week.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "F64FGUkbgIbgGObK","flags": {},"type": 0,"text": "A mirror that, when hung in a room, let’s you see through door and walls in the reflection.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "FhwXe1SVDOsM47Zz","flags": {},"type": 0,"text": "A kobold skull that grants you luck (1 re-roll of a d20 once per day). Being around kobolds will cause them to attack you en mass and with great rage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "z7AyJStpppGJTBOV","flags": {},"type": 0,"text": "A small orb you keep in your pocket. It gently buzzes when someone talks about you with hatred or malicious intent (provided you’re within 250 feet of them).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "CInE74ueGTqja4Tl","flags": {},"type": 0,"text": "Torture Wine – Tastes like delicious fine wine. After a long rest, the user becomes overwhelmed with pain is unable to move or take any actions for 24 hours. During this time, they must make a wisdom save (DC 15) or they will be emotionally scarred from the horrible experience (-1 to charisma permanently)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "AAaFuBsUOMTYYt7c","flags": {},"type": 0,"text": "Doses of “Juiblex,” – Phials of a viscous black liquid that causes catatonic euphoria and is extremely hazardous to one’s health.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "KSgfSnZnqlaMfrD7","flags": {},"type": 0,"text": "A Clockwork Thing you Don’t Know what it does – It’s got sort of a brassy part and a springy part, and a glass tube, and the merchant is very insistent you keep it on the hush-hush that he’s selling it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "Zx9s3UnPAi7ZHIxg","flags": {},"type": 0,"text": "Cutting of Carnivorous living plants – Just think, planted in the right soil you could have your very own assassin vine in your garden. That’ll chase the crows out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "5W9BrLzhYDDmDyoh","flags": {},"type": 0,"text": "A dark scrying glass – Only shows you things you’re better off not seeing. This one came to the merchant after the previous owner looked in and fell into a suicidal depression.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "SCLsKyfnC6VcFxya","flags": {},"type": 0,"text": "A Spherical puzzle box – Gives off a malevolent aura and certainly does not pass a “Detect Evil,” check. The Merchant assures you that it can be opened, but asks that you please not try it until you are well away from them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "u3XdRlM6J6q0GHPZ","flags": {},"type": 0,"text": "Elemental Spheres – Handheld glass spheres designed to be thrown and shattered to release the trapped (and quite upset about it) elemental inside. Their manufacture was officially prohibited after a number of grisly accidents, but there is always a market for an easily concealed destructive item.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "lVUppaVEAmoi0hYU","flags": {},"type": 0,"text": "Lembas-style bread – An off brand Elvish baked good made by off-brand elves. They might just be goblins actually. Fairly sustaining, but tastes foul, as if it’s mostly rancid suet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "5phSWexIo1x3Mvdj","flags": {},"type": 0,"text": "A perfectly ordinary apple. It’s the only thing at this old woman’s stall, but you don’t quite trust it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "r8BDD3TMrgQSKjOE","flags": {},"type": 0,"text": "A skull that produces a constant flow of ash from its sockets; produces one pound of ash per minute.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "sIAZVTja9DEpbSqj","flags": {},"type": 0,"text": "A caged black cat, whom has an aura of dark energy; all creatures who come close to the cat have their life force sapped by the cat’s aura.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "UFNTdgEJ2WJGNRW8","flags": {},"type": 0,"text": "A glove that allows you to rewrite an entire document in an instant when you touch it with the glove.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "ctVFoxDqJz0BXtGz","flags": {},"type": 0,"text": "A cursed jumpsuit; the jumpsuit cannot be removed, and if the wearer tries to perform any sort of crime it has that crime done to itself. For instance, if one wearing the jumpsuit tried to commit arson, their hair would be set on fire; if they tried to steal from someone, an object of theirs would disappear and reappear in someone else’s possession, et cetera.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "hsuSxtUgsOXSxv4o","flags": {},"type": 0,"text": "Bugbear saliva – when applied to the skin, makes the user take 2d4 damage but makes them resistant to fire, thunder, or acid damage for 1d6 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "BkbKBecYCXKWsc9f","flags": {},"type": 0,"text": "Religious artifacts that have been banned in the region.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "2oQCM4rbm83Y7JLV","flags": {},"type": 0,"text": "Books that have been banned in the region.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "0zJqBY69UDXKjnUQ","flags": {},"type": 0,"text": "Contracts from a local assassin’s guild.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "EjQf5GrOll4aBkvZ","flags": {},"type": 0,"text": "Forgery services – seal (search, impound, stop the bearer or this cargo at your own risk) / taxes paid / writ of safe passage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "8GmavJXUgnobsxjg","flags": {},"type": 0,"text": "A stuffed Tabaxi Ranger, I call it Tabaxidermy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "FUlYq98R9kFLvE1L","flags": {},"type": 0,"text": "An old gnome that speaks in a raspy whisper. Sells necromantic spell scrolls and offers discounts if the buyer can provide blood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "6pXK1hU46eUZsbal","flags": {},"type": 0,"text": "A nervous thief trying to sell a fake eye made of ivory with an opal iris that he stole from an old sea captain. Says that it brings bad dreams and whispers to him in the dark.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "r2uCLOhMUFmadHYd","flags": {},"type": 0,"text": "A dwarf coated in what looks like a decade of dirt promises to be able to gain access to any building in the city, assuming money and cleanliness is no object.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "kfXlVCw9nsoaOXvl","flags": {},"type": 0,"text": "A Human with a mechanical arm claims they can crack any safe you bring them, for the right price and a share of the goods.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "KNlgvoid42N9UuBf","flags": {},"type": 0,"text": "Infernal Paradise – A painting depicting the infernal realms. If you splash it with blood, it opens a portal to said realms. If you are really unlucky some of the denizens will take the chance to come through the portal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "gXW7DLiYTCpazxOl","flags": {},"type": 0,"text": "The Old Flute – A strange, yet beautifully carved wooden flute. When played, it rouses the blood of allies and strikes a primal fear into the hearts of foes. When played under a Hunter’s Moon, it will summon the Wild Hunt.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "EG4kd0MGzsheCCIH","flags": {},"type": 0,"text": "The Eldritch Key – Sold by a rather haggard and nervous looking ex-thief. She claims that the key can open any lock even ones that are magically protected. However what she doesn’t tell you, is that the more you use it, the more you see a shambling abomination, crawling out of the dark, in the corner of your eye. Naturally nothing is there when you look. Maybe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "v4RZf2wQpkteZyph","flags": {},"type": 0,"text": "The Two-Faced Shield – A large metal shield with the image of two screaming faces opposing one another. While equipped, when damage is successfully blocked the shield casts Cutting Words on the attacker. While equipped, when the user takes damage the shield casts Cutting Words on the user.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "e1eneVoMxztebps8","flags": {},"type": 0,"text": "A kabuki style demon mask. It gives the user advantage on intimidation checks, but disadvantage on persuasion checks, and any investigation or perception check that relies on vision, as the eye slits are too small (that could be solved with spending time to file the eye holes larger). You could either curse it, or have some trickster line the inside of the mask with sovereign glue.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "ObkGmdLd8OqwNIet","flags": {},"type": 0,"text": "Unicorn Horn. They say it’s a cure-all, but you’d have to be a real bastard to use it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "0IJDI1DKUFzNJETP","flags": {},"type": 0,"text": "A baby grimlock. Blind, mewling, and defenseless. Could possibly be raised to be a servant of some kind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "36NZtm9UmToyO0rl","flags": {},"type": 0,"text": "A Hand of Glory – Any not evil aligned creature other than the wielder within 30 feet of the lit candle is subject to a DC 18 Hold Person spell. A creature paralyzed in this way loses 3d6 maximum health and the beginning of each of their turns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "VA3Whyt9l371umGB","flags": {},"type": 0,"text": "Powdered Roc’s Beak. Consume to polymorph into a giant eagle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "sQGOgg9TWOXPNrAK","flags": {},"type": 0,"text": "A ring of keys, each cloned from a different room in a nearby manse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "Y7SMZFkLRw3j3RK0","flags": {},"type": 0,"text": "A favor from an oni.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "LIRtlfPfE7XhkSN7","flags": {},"type": 0,"text": "A six-pack of Potions of Greater Healing. Three of them are actually disguised Potions of Poison. 50/50 chance of drinking either.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "8S3hLCdsljkeEhvT","flags": {},"type": 0,"text": "A strange, brown bar, about as thick as a bar of soap. The vendor claims it comes from a far-off land, and requires a deeply arcane ritual to create. It has a slightly sweet smell; biting into it, you find it has an incredibly sweet taste. All other foods and desserts pale in comparison evermore after tasting the glory of the Chocolate Bar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "BnUiZ4mF1E1URMDU","flags": {},"type": 0,"text": "Eye of Spying – a mummified eye. Once attuned the eye can be placed in a location & the user can see what an eye sees","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "rrKZ5mHmCt7rc7n8","flags": {},"type": 0,"text": "Key of Mimicking – if key touches another key, it can take that keys shape","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "ZhR8XzzsB3nehFQU","flags": {},"type": 0,"text": "Lantern of the Sneak Thief – light from the lantern can not be seen past “x” range to anyone outside of the range, the area appear to be unlit","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "J9J0tLtOMzuCKnuy","flags": {},"type": 0,"text": "Skeleton Key – key fits in & can unlock or lock almost any normal lock.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "2nltY0rxnRnYLjux","flags": {},"type": 0,"text": "A pouch containing a blue powder that when sprinkled on an object makes it so that no spell or magic item can sense any magic or alignment from the object. The item still retains its magical abilities. The powder must be reapplied every 6 hours to maintain its effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "QwgmipIbdFNitBpZ","flags": {},"type": 0,"text": "A powerful demon lord named Eas’thi’kaula who has been trapped in a tiny, unbreakable glass dome. It will plead to be released and to be allowed to do evil things.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "2yZW8nKe5WOEBd72","flags": {},"type": 0,"text": "A bauble that looks as though there is a miniature universe inside. Looking into the bauble for too long can cause short-term madness, though tieflings are strangely immune.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "dVd6qZooPkeYTLLi","flags": {},"type": 0,"text": "A bar of soap that was supposedly made from the stomach of a Basilisk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "eaZA2fCOAwg3W5Eq","flags": {},"type": 0,"text": "A seemingly ordinary marble. When a creature touches the marble with its bare skin, it feels a great searing pain, but the marble doesn’t actually physically harm them in any way.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "wfhjzUGgwYQ1oxU7","flags": {},"type": 0,"text": "The left foot of a hanged man who was innocent. If put in a cauldron full of hot water will turn the content in a superb soup – those who eat the soup will not need any more food for the day and will not suffer from cold environment effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "JIqcVOZPAFUEbBIV","flags": {},"type": 0,"text": "Myconid’s Powder – literally pulverized myconids, great for empowering sleep-related spells. Side effect: the target of those spells will grow mushrooms on his body for a couple of days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "WaVxw9Y2rtsLv3qf","flags": {},"type": 0,"text": "A small vial that contains the hairs of a princess. They are said to bring luck to young brides.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "yyKtKDboRz2YgQY5","flags": {},"type": 0,"text": "A goblin skull, which wears a leather muzzle. When removed, he tells the story of his death in a sassy, high-pitched voice. Every time he starts, he changes some details to best fit his listeners (if it has an elf in front of it, the merchants in its story will be elves etc.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "AR4HOv9nnaJXMfaE","flags": {},"type": 0,"text": "The book of prayers of a priest violently killed. It is said to keep the ghosts away, but surely it stinks worse every day that passes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "6mwtiX2H7peNXfQb","flags": {},"type": 0,"text": "A leather glove. It is said to come from a pretty famous thief and to have brought his powers with it – every time the user removes it, there’s a 10% chance one of his fingers will disappear, forever stolen by that thief’s spirit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false},{"_id": "GgR7NQvfk9mgqjrI","flags": {},"type": 0,"text": "The bones of a nation’s mascot animal (eg. All swans in England belong to the queen, or Bald Eagles representing the USA). Said to have magical (get specific! Divining, enhancing, invoking, etc.), aphrodisiac, or male “potency” enhancing powers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [101, 101],"drawn": false},{"_id": "ktfQCrrgodWlA3EJ","flags": {},"type": 0,"text": "A birch black orb that no one will get close to because the last 2 owners mysteriously died (nothing is wrong with it, it was just a coincidence).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [102, 102],"drawn": false},{"_id": "wbfnVPHSkTJiMOu2","flags": {},"type": 0,"text": "Sunglasses that can let you see everyone that is possibly interested in you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [103, 103],"drawn": false},{"_id": "U9yyPVp57VfwHejL","flags": {},"type": 0,"text": "A ring that when put on someone’s finger your skin starts turning to steel and it spread quickly to stop it you have to amputate your finger/hand/arm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [104, 104],"drawn": false},{"_id": "6XNVbpOiHNJkRT4M","flags": {},"type": 0,"text": "A caged faerie. Shake the cage for magic dust. The dust grants a luck bonus/advantage on one roll in the next hour. Every time you shake the cage there is a 5% chance the faerie dies from concussions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [105, 105],"drawn": false},{"_id": "BqMaSIRz5FIBdfUL","flags": {},"type": 0,"text": "A farmers hat that when put on a scarecrow brings it to life under the hat owners command. It will follow any instructions but likes to be violent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [106, 106],"drawn": false},{"_id": "vM9q2LO2pg2Y9nIx","flags": {},"type": 0,"text": "The skull of a human who died from being struck by lightning twice. Its eyes shine in a 60 feet cone of light.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [107, 107],"drawn": false},{"_id": "TzUm2nGK6bElwUqJ","flags": {},"type": 0,"text": "A large eyeball suspended in a jar. It looks at shape changers and invisible creatures otherwise it does nothing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [108, 108],"drawn": false},{"_id": "gLeFb3ce6rz9wZJK","flags": {},"type": 0,"text": "The memories of a dead guard. The object itself is the hilt of a dagger (no blade). When gripped firmly the holder sees a random memory from the deceased’s life. Hilt comes with the seller’s overly sincere guarantee that it was obtained in the most ethical of fashions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [109, 109],"drawn": false}],"formula": "1d110","replacement": true,"displayRoll": true,"_id": "yUAa4VFClRsZvUyB"}
