{"name": "City Quests","description": "One hundred quests and adventure-starters for a metropolis.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "A4iwqw72O2ASrHBZ","flags": {},"type": 0,"text": "The lord of the city is rumored to have been killed and replaced with a doppleganger. A local guard thought he saw the lord change skin, but he can’t be sure. He approaches the party for help with the matter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "zkBo7z7FNBeTitvo","flags": {},"type": 0,"text": "A townswoman has been hearing strange rattling and moans coming from the abandoned house next door. She asks the party to investigate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "wbeykrXkAUEBcfoA","flags": {},"type": 0,"text": "The local blacksmith tasks you with bringing back (1d10) silver or from a nearby mine that roaming gnolls recently took residence in.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "u7Dpls0ioSsOBQMX","flags": {},"type": 0,"text": "Walking around the city, your party notice many of the citizens are missing one or two fingers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "WUbVH5HucjrsGomx","flags": {},"type": 0,"text": "The market is buzzing amd filled with people arguing. It appears that all hens in the coty stopped laying eggs, and has driven the price of eggs sky high.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "lJ6ccgSlUXBgTriI","flags": {},"type": 0,"text": "A local farmer asks the party to either scare off or kill a pack of wolves that have been terrorizing his cattle periodically.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "Rxzhh0PKsFtAPijI","flags": {},"type": 0,"text": "Two opposing tailors each have half of the finest pair of pants ever created. You have been hired to repair the pants and reunite the halves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "9UHQznenpoLbNxCD","flags": {},"type": 0,"text": "A local dancer complains of screaming at odd hours of the morning.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "PC3e16qIAbOWCBzO","flags": {},"type": 0,"text": "The library has been infested with small mimics disguised as books. Exterminate them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "FlcNWEzXfrC39QDN","flags": {},"type": 0,"text": "Rumor has it that the local librarian is secretly a dangerous lich/vampire. Investigate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "Ld1iir9lNrg5LNm4","flags": {},"type": 0,"text": "A bard has been found dead in an alleyway. Investigate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "9sWB3GERzYZTJAw6","flags": {},"type": 0,"text": "A young boy has a small pouch of copper stolen from him by teenage thugs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "fHuAkKufOEbftaCq","flags": {},"type": 0,"text": "Through less-than-reputable channels, the party hears about a plan to hunt a small roving group of purple worms. The local crime syndicate wants the precious and hard to obtain organs and blood from the worms. The local city guard wants the location of the nest discovered and reported and nothing more.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "k7KKpYIiSlpDDoIU","flags": {},"type": 0,"text": "A noble requests that the party deliver a small package. Around ten minutes after the package is delivered, someone approaches the party and asks where their package is, providing valid identification.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "RY5HbThbXpYHTBaS","flags": {},"type": 0,"text": "A city watchman requests the party’s help in setting up a sting. If the party agrees, the operation begins, but when the target arrives, at least one member of the party recognizes the target and believes them to be innocent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "pAsZbOpefK2i1t7k","flags": {},"type": 0,"text": "The owner of an herbalist shop hires the party to descend into the city’s sewers and gather ingredients, including an organ belonging to a creature that should not rightly be living in the sewer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "LNRR58bpvIPEujSN","flags": {},"type": 0,"text": "A wizard/scholar shows the party some maps detailing the locations of lightning strikes in the city in the past few years/months/days. There is a strangely perfect circle of lightning strikes around a small, inconspicuous area. An orphan is attempting to learn magic, and the spell he’s attempting is much too powerful for him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "KxfFjTOtjKegsTzc","flags": {},"type": 0,"text": "A local organisation ask for your help to find and eliminate cult influence from a variety of districts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "v6Tquz4dXwCmmFJB","flags": {},"type": 0,"text": "The mayor asks you to help them with a zombie problem.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "dJ9tPynQNudr1aCB","flags": {},"type": 0,"text": "A rash of political assassinations has sweapt the city council. The only other connecting thread is the same calio cat being seen at the scene.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "4ivhxjEMxr1KPkbe","flags": {},"type": 0,"text": "A massive sinkhole has collapsed the market square into the sewers. The local urchines claim seeing a shadowy tower and a glowing rainbow mist rise from the hole in the middle of the night.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "dpp6DmXw7PVm0okQ","flags": {},"type": 0,"text": "A grandly dressed man or woman of significant weight shouts at the adventurers to stop a young thief that ran off with a basket of hers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "CpCgjLJfzSOHJOIR","flags": {},"type": 0,"text": "A local bard has been abducting local pets and harvesting their tendons for lute strings. A young orphan approaches the party and asks them to rescue his cat, as it is the closest thing he has to a family.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "1NwoZrxGeCvWU4yK","flags": {},"type": 0,"text": "The party is approached by a hunched man with an awful, hacking cough. His face is obscured somewhat by a hood, but he asks the group for some medicine or healing, preferably in his own home.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "9isA21hBV8dcdGOS","flags": {},"type": 0,"text": "A townsman claims to have seen starved, pale humans dragging others away, and the players see that exact man get dragged away moments later if they dismiss it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "Ur4REo85iwayfJN6","flags": {},"type": 0,"text": "An increasing amount of people are being found dead in their bed with bite marks in the neck. Rumours of vampires are going around, however the bite marks of the victims correspond to their own arrangement of teeth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "cDx5wz7IjYvCAJnZ","flags": {},"type": 0,"text": "It has remained mysteriously cloudy above the city for the last couple of weeks and dead birds keep dropping out of the sky at night.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "M6JTqACMJ3RnV0LD","flags": {},"type": 0,"text": "One day the players find that their favourite tavern is just straight up gone. It has been replaced with a normal living house or two. Nobody in town, not even the people who visited the tavern regularly, can remember the tavern.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "oLneelL57BDYby23","flags": {},"type": 0,"text": "A small child asks you to help their father who has been injured in an alley, but when you arrive, nothing is there. The child sits crying and hugging nothing but air.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "tOR5mhz25F7js9xY","flags": {},"type": 0,"text": "All of the Clergymen in the town have fallen deathly ill. The town elder asked the party to investigate this phenomenon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "29vI7xGNCwzxUTEb","flags": {},"type": 0,"text": "A young child approaches the party and asks that they find his missing siblings. Their last known location was the decrepit chapel where the city outskirts meets the forest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "Hrjg7XoOOSpiZFWj","flags": {},"type": 0,"text": "A sweet old lady stops the party in the street and asks if they can go and buy things on her shopping list for her. She hands the party a bag of gold and the list. Upon closer inspection, the items seem to be ingredients for a deadly mass ritual.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "OPfOIcqJoLMUz7Js","flags": {},"type": 0,"text": "A mad alchemist set up shop next to your favorite tavern. The whole establishment reeks of foul eggs and other unpleasant things. The tavern owner asks you to help convincing the alchemist to stop his work or leave.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "lLDNTvnrF7VUnIAj","flags": {},"type": 0,"text": "A plague of rats has struck the poorest streets of the city. They seem unusually focused and vicious. Seek out and quash the infestation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "4b7HUic2kYZYjSLj","flags": {},"type": 0,"text": "A tavern has burned to the ground with thirteen people inside, and inside was found the bodies of ten dopplegangers. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "TBMIfCrw5Sr6DSJ5","flags": {},"type": 0,"text": "A local smuggling gang has recently begun battling against a tribe of Grung in the sewers- they have appealed to the city guard for help, and frogs have been seen in concerning numbers after recent rainfalls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "2bbKxjlzHYqnPZFi","flags": {},"type": 0,"text": "Rumors abound that the local magistrate is a devil in disguise- but in fact, they are a polymorphed dragon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "VDtkxnMoBsoTxS2g","flags": {},"type": 0,"text": "An ancient fey ruin has been discovered beneath the city, and green-eyed deer and wolves have begun running through the streets at night, howling and hunting down those who don’t get inside fast enough.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "A1BIgzJR9UCeVVLh","flags": {},"type": 0,"text": "A child has fallen ill and the local herbalist needs some very specific ingredients but can’t leave the child unattended, the herbalist requests your party to get them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "i7sd44jkIiTB2apg","flags": {},"type": 0,"text": "A string of missing children have been happening in a sector with constant reports of a “dragon” in the sewers. The local guild council asks the party to investigate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "ROzSzHAa5jZ12MEb","flags": {},"type": 0,"text": "A large tiger is running loose in the market. If the party kills it, the noblewoman it belongs to emerges from the crowd and demands immediate compensation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "higLJuUHOtcuaJLr","flags": {},"type": 0,"text": "A bit of food sold to the party (cake, pie, soup, etc.) suddenly has a humanoid pinky finger found within it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "XK7Y6d41qGaMRoPM","flags": {},"type": 0,"text": "A string of young noblemen have turned up missing, and the only connection is that they all visited the same brothel.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "xOEEP10xercww66F","flags": {},"type": 0,"text": "A magnificent circus has arrived in town, but during the last night of the festivities the castle will be robbed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "MvFRGDqyuhl8OC9S","flags": {},"type": 0,"text": "An old ship thought to be lost at sea for many years suddenly returns to port, seemingly no worse for wear. The crew and passengers are completely unscathed, and no one has any idea how long they’ve actually been gone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "MrUaPJhBaQ2anK6j","flags": {},"type": 0,"text": "The poorest and youngest citizens start to drown on dry land and in open places, skin soaked and slimey. There is an aboleth somewhere infecting the oldest, deepest, well of the city with its slime. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "cFmWBVAkLW0W5Qsr","flags": {},"type": 0,"text": "Somebody is “kidnapping” all the bronze statues in the city. Its either a military faction building a massive hidden cannon, a were-rust monster, or a mad mage perfecting an animate object spell. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "AzhCLf9KJ06KLYqy","flags": {},"type": 0,"text": "The Guild of Actors and Musicians has challenged both the Illusionest Guild and Bard College to a contest of pomp and pagency for the next festival. They need the party to sabotage the competition. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "PfMnsjix5SU8zt11","flags": {},"type": 0,"text": "The city guard has lost two female members undercover in the brothel district. Not missing but giving up law and order in favor of vice and hedonism There may be a succubi flipping all of the agents being sent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "Nj93fDu8c8OL0wBm","flags": {},"type": 0,"text": "The local brewer’s latest batch of high end whiskey has been sabotaged/cursed by fae. The five barrels already sold need reclaimed quickly and quietly less the brewery’s reputation suffers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "7mw7z8CdamouQlny","flags": {},"type": 0,"text": "Half the city has become overgrown with dense vegetation overnight. The city watch is busy defending the rest of the city from wild animal incursions from the newly-formed woods, so the Captain of the Guard asks the party to investigate the root of the matter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "sExejv9WYd67PXMl","flags": {},"type": 0,"text": "An infection seems to spreading in the slums. City officials deny any proof of it and guards no longer keep watch close to the slums at night. You are beckoned into an alleyway by a hooded figure who implores you to find out the fate their loved one who went into the slums to heal the sick.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "atJxBdo6VYBlQ6pd","flags": {},"type": 0,"text": "A local sports team have gotten inexplicably unstoppable in a very short time. Rumours of something amiss range from dark bargains, to an amazing halfling herbalist (and everything in between). Collect clues, follow up leads, and get to the bottom of it!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "nX9XhDLTaj7K7ZRR","flags": {},"type": 0,"text": "The water in one district has suddenly become highly flammable. The local government want to find out why, and want it stopped. Players find that a group of anti-establishment rabble employee a pyromancer to make this easy to hide accelerant, but something went wrong.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "RmkSxnMoKDnfaFal","flags": {},"type": 0,"text": "The entire upper class are loosing their hair and want you to get to the bottom of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "B2qJbgMZEGbvlA5s","flags": {},"type": 0,"text": "It’s election time for the new city Mayor. To everyone’s surprise, the Kobolds that live in the city sewers have put forward a candidate for the job… ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "GXMJjRCkvjtktik6","flags": {},"type": 0,"text": "A local cult of demon worshippers have recently been seen helping the community, feeding the homeless, and housing the poor. The city guard is SURE they’re up to no good, but can’t PROVE it. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "nU4eP7QxobO47HsD","flags": {},"type": 0,"text": "The village drunkard is stuck in a Groundhog day loop, and uses his knowledge to mess with the party for 24 hours, as it’s the most fun way to spend repeating eternity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "oWo4UIIqlHwyDZQI","flags": {},"type": 0,"text": "A distressed-looking housewife implores the party to kill the giant rats living in her basement. Once down there, however, the party finds hallucinogenic mushroom spores that cause them to see their greatest fears. It’s otherwise a perfectly ordinary basement.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "WdxC6SsvJzrUIjHz","flags": {},"type": 0,"text": "A peddler with a cart selling odd wares, such as jugs that transform water into oil and pots that heat up without fire, has been seen wandering the streets at night. However, the items he sells often malfunction or explode.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "0OT7I76q1YV2xH11","flags": {},"type": 0,"text": "A talking rat has been hustling the three shell game in dark alleys, cheating locals of their gold. It’s rumoured it wears a hat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "IENyvXKFwelsRXYm","flags": {},"type": 0,"text": "Every full moon, the cats of town gather inside a deserted house. What are they planning? ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "lqWZt6wgYgZcru8v","flags": {},"type": 0,"text": "A local merchant asks the party to deliver a note across the city. When they return for payment the merchant doesn’t remember the party. An investigation will show that his left ring finger is now missing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "xTgEcPO9GTLyISD8","flags": {},"type": 0,"text": "The party sees a local elderly woman attacked by a large half-orc man. He steals a small pouch filled with the leaves of an exotic plant. If the party returns the plant to the woman, she rewards them with a dozen cookies made from the plant they returned to her. After consuming the cookies the adventurers find out that the plant is this worlds equivalent to marijuana.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "hLwengrVAntX35cN","flags": {},"type": 0,"text": "An Ooze that was planted in the sewers to clean them and deal with the rat problem has grown ginormous and started to split into more Oozes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "QLl5RuYZVTtW18iC","flags": {},"type": 0,"text": "The party hears about a man getting murdered last night. The perpetrator is a spirit and there were plenty of witnesses, but only about half saw the spirit. Every night another victim is taken until the group can unravel the secret.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "YvAuQrXQrHWTodeV","flags": {},"type": 0,"text": "A man is confronted by a mob for not being able to control his sorcery.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "rnhXLJy9EHdS2Yiv","flags": {},"type": 0,"text": "The local Thief Guild is fighting a Feud with the local Gypsy family for the drugdealing control of a district. The governors know this and get money for looking the other side, a lot of money, but their feud might recall unwanted attention over the city and his pocket, he ask your help in the matter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "XOt0piq32B3GJkYI","flags": {},"type": 0,"text": "A brewer of the second best ale in town believes the most popular brewer has made a pact with a demon to enhance her wares. If the party investigates, they find that all the brewers in town have unknowingly made deals with the same demon, which has plans to adulterate all their wares and take control of the townsfolks’ minds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "HoZEaTLoQSdTHcaB","flags": {},"type": 0,"text": "Workmen are sledgehammering tombstones from the local cemetery for material to repair the cobblestone streets. The dead are not happy about this.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "yzZLkRnsZOChVDDF","flags": {},"type": 0,"text": "A statue in the town square has disappeared overnight and footprints (apparently from the statue) are found leading to the Magicians’ quarter. It could be a prank or something more sinister.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "eMjcmftm96aLnJVA","flags": {},"type": 0,"text": "A drunkard begins to screaming at the party, claiming they robbed him. When searched by watchmen, the man’s purse turns up in their pockets.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "QijU7cwNL5Uw9ASH","flags": {},"type": 0,"text": "Bodies have begun appearing at the exits of the sewers with bite marks on them. Rumors of cannibal cults, lycanthropes, and other such things have begun flying around. You are hired to investigate the matter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "xzDayN4gzkVY5Dvy","flags": {},"type": 0,"text": "A seemingly mad doomsayer is yelling in the streets that the sewers are a gateway to the Abyss. Every day this is ignored, d8 demons of a challenge rating of 1 or lower will crawl out of the sewers at night. Every week this is ignored, the challenge rating increases by 1.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "RkWC7fdIcTdgMuXu","flags": {},"type": 0,"text": "In the big garden of a powerful family, the party notices several woodland critters acting strange. Upon further inspection, they appear almost human in their mannerisms. If the party inquires about the family, they learn that they are rather known for being proficient in charming and polymorphing…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "XpyqNqZ4qxSfMWvb","flags": {},"type": 0,"text": "A single member of the party notices a young boy in an alleyway with a third eye in his forehead. The boy telepathically tells the member to come find him in the graveyard.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "xybdrEooHDDIIWlX","flags": {},"type": 0,"text": "The party is stopped by a traveling salesman, that frantically insists on handing a spherical object wrapped in cloth to the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "GIl1XGKagIWpWgCC","flags": {},"type": 0,"text": "Eleanor, an heiress to a wealthy baron’s estate, is found murdered in the old meatpacking district. Gretchen, her identical twin, plasters the city in posters offering a bountiful purse for the head of her sister’s killer. Meanwhile, a woman claiming to be Eleanor swears that it was her sister Gretchen that was killed, and is offering a matching reward to anyone who can uncover the truth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "p0JTWInYRujgTDLW","flags": {},"type": 0,"text": "A beloved statue has disappeared from the center of town. An alderman asks the party to find it, but the more they investigate, the more people insist that the statue never existed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "CHSmPM2ZQCcVihEq","flags": {},"type": 0,"text": "Animate slimes and oozes are seeping out of the sewers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "y2H18VrLbYCfxkV5","flags": {},"type": 0,"text": "A long line of ill townfolks are waiting impatiently outside the apothecary’s house, they been there all day and either the apothecary or her assistant are answering the door. The thing is that the apothecary kept some creatures caged to farm their poison and somehow, they were freed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "fas9qfw5dgDpz9cT","flags": {},"type": 0,"text": "The party encounters a burning building and must rescue several commoners trapped inside. Later, they discover that this is one in a string of arsons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "6XuxyGf9IjecJxJl","flags": {},"type": 0,"text": "The party must earn the respect of a local group of toughs by competing in a bracket-style fighting tournament. However, some competitors have been meeting with unfortunate accidents… ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "1VIpfDzs33GyDZEa","flags": {},"type": 0,"text": "Several locals have committed uncharacteristic, violent acts. Each claims to have been commanded to do so by a benevolent deity in their dreams. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "UnoNWB8DkQWY6yzJ","flags": {},"type": 0,"text": "A talking cat follows the party, promising to take them to a magical place where wine flows like water and gold litters the ground. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "a1m2P7BCYbAYI79Z","flags": {},"type": 0,"text": "The building of a new road has earned the city the ire of the local druids.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "8tQ6r61eu5U2zylH","flags": {},"type": 0,"text": "The local miners have gone on strike, demanding higher wages and better equipment. The Boss wants your to remind them who’s in charge. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "5YmxY5RRtYmuGv5Z","flags": {},"type": 0,"text": "A portal to hell/the abyss opens in the town square, but nobody else seems to notice or care. Demons are now shopping in the market.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "wQqFksj3yW4qNSRx","flags": {},"type": 0,"text": "When the local innkeeper is rebuilding his hearth, a removed section of a wall reveals a human skeleton embedded in the masonry, covered in strangle carvings.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "EjTaiI9x2y84f6mS","flags": {},"type": 0,"text": "The group sees a Drow named Vicepenny with a red balloon trying to lure a child into the sewers from a sewer drain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "mMP5qM1IRvzQm7LT","flags": {},"type": 0,"text": "A monkey steals and runs off with one of their hats. Will return for a piece of fruit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "B5lT9fNALk4DNzLx","flags": {},"type": 0,"text": "An employee in a lumberjack costume offers the party free samples of jerky from a nearby tavern counting as one daily ration.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "8ZQZmmiTOE0mk6i3","flags": {},"type": 0,"text": "A group of mean geese begin chasing any dwarves or gnomes in the group. Geese are protected under the city rulers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "uH8EgUnoSakpQSO5","flags": {},"type": 0,"text": "A peaceful Hill Giant sells his intricate lace patterns. People wonder how he does it. Upon interrogation he reveals he does most of the work himself but his two Pixie roommates are always waiting for him to go to sleep. The lace over your face lets you get a good night’s rest no matter where you are.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "5Y7LCgNtH70IEQSe","flags": {},"type": 0,"text": "A hippy elf sells a single dragon scale necklace with your name on it for 1d6x10GP.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "9BZKBh7Q0gcIb3Yb","flags": {},"type": 0,"text": "The party gets a coupon for one free lesson “For You & A Friend” at the local Fighting Pit. They have to pay for their own uniforms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "6bWQ1xhhNEVjXb0c","flags": {},"type": 0,"text": "Ever since the ascension of the new baron/burgher, criminals have been taken into the keep and never seen again. The captain of the guard knows that the keep should have run out of room in the dungeons long ago, but he hasn’t been allowed inside to see them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "JiHHtRNf4Aa89O1J","flags": {},"type": 0,"text": "A public execution is taking place in the town square, the town is split on whether the accused is actually guilty. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "Owq1YOEOxdloCvV4","flags": {},"type": 0,"text": "A house/shop in the middle of town has vanished entirely, as if it were just erased from creation. A strange scent and magical residue permeates the premises.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "ETJ0qIhQT6pbcS81","flags": {},"type": 0,"text": "A very belligerent (and often drunk) old man is causing problems in town. The hangup: it is the burgher’s dearly beloved uncle who remains an extremely proficient fighter in his advanced age. The guard can’t apprehend him without serious injury to the man.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "XxtZYrOUGDZkOXWQ"}
