{"name": "New Planes of Existence","description": "One hundred different Planes of Existence that will distort your player's views on reality!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "rKn21uqIFiutWZYk","flags": {},"type": 0,"text": "The Market: An infinite bazaar that is quite well known. People from across the multiverse come here to buy and sell goods. It is said that literally everything can be found for sale here. There is no government or restrictions on what can be sold, but there is a seemingly infinite legion of clay golems that stop any thieves or murderers. The place is so huge that there is a group of urchins that will help you find your way to what you want, but they demand quite a lot of money for it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "dsCCabwz2V342yJp","flags": {},"type": 0,"text": "The Dusk: A good equivalent of the Shadowfell. While the Shadowfell represents the vile things that lurk in the dark, the Dusk represents the beauty and inspiration found in the night sky. The place is ruled by living versions of the Material Planes’ constellations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "WIZZ1eOS8KiVjUDQ","flags": {},"type": 0,"text": "The Realm of Infinite Fists: A plane artificially made by a spellcaster. The entire plane is made up of tons upon tons of fists that beats anyone that enters the plane to death. The plane’s portals can be disguised as everyday objects. For example, a pair of underpants.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "WaX28kbiCHzc1W8p","flags": {},"type": 0,"text": "The Dojo: A single massive training ground, made for a long-dead emperor’s expansive army. Hundreds of fighters, monks, and anyone else that wants to learn the ways of combat study here. If you die here from sparring someone, you come back to life immediately afterwards.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "iw0mXpYBx5FSaLUZ","flags": {},"type": 0,"text": "The World: The god of mimics and doppelgangers, disguised as a material plane. Literally everything here is a mimic and everyone that isn’t another traveler is a doppelganger. This is like their afterlife.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "cN7zKuu9UwvK0nGU","flags": {},"type": 0,"text": "The Alley: An eternal ghetto where it is always midnight. Once the HQ for a street gang lead by a powerful sorcerer. Somehow, the gang was trapped here. Some of their descendants have devolved into strange creatures while others have formed tribes that worship the old boss, who they refer to as Boss. They speak in gibberish, but someone who understands Thieves Cant will immediately know what they mean.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "unOhWiCxznYppj2s","flags": {},"type": 0,"text": "Tartarus: Not a plane. This is the only spot in the entire multiverse that is totally empty. There is no space, time, or matter here. The worst of the worst are imprisoned here by the gods. You’d best leave and hope they don’t follow you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "siAPDGMmTzCHvahX","flags": {},"type": 0,"text": "The Phylactery: An entire demiplane, converted into a phylactery by a lich. The lich knows you are here.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "fxALVMfYOgM9y6v6","flags": {},"type": 0,"text": "The Mirror: A copy of the Material Plane. It is used as a sandbox by powerful spellcasters. A spellcaster can control the entire world here using only a thought. You may be able to get back to the Material Plane using the mirrors of other spellcasters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "ObccNXdHKvXoaesR","flags": {},"type": 0,"text": "Electricus: a more techy version of Mecanus, with exposed wires and tesla bolts instead of cogs. Populated by metal constructs. It’s theorized that this plane is involved in a complex calculation, that has been going on for ages.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "aUFyu1xGZRvUM3Ph","flags": {},"type": 0,"text": "The Orphanage: nobody knows exactly what this lifeless plane was when it was created, just some decades ago. It quick became a gigantic orphanage though, as people dropped orphans they didn’t want to take care of here. Now, some better people built houses for the orphans, and provided them with means to live and leave. Maybe the kids there never grow up and some children on the Material Plane dream of getting to go there. Or maybe the kids still grow up and kick people out into random realms once they go over 18.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "uHSRWbuSdc4LGjBh","flags": {},"type": 0,"text": "Ultra Fractal: a plane in which size does not matter. It’s composed of a giant net, with coloured lines at perpendicular angles spaced regularly. They can easily be bent by hand though, which changes the composition of spacetime in that area, scaling things appropriately.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "7fuwWrfdqNzqghJ6","flags": {},"type": 0,"text": "Vacuum: a plane without air, or a ground. It has just some small islands floating in space, inhabited by slimy, anaerobic humanoids who can leap between the islands effortlessly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "CHuf9AHeTjTzu1jK","flags": {},"type": 0,"text": "Sovereignty: a massive city-plane, ruled by a god-king, who conquered the entire plane in the dawn of time. They have unequaled military power, but are unable to leave their plane.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "vlpkspgbxRy6Xr5P","flags": {},"type": 0,"text": "Plane of Euphoria: Looks like your ideal location, but in fact is a demiplane of some cosmic entity. You feel complete happiness and are extremely unwilling to leave. This plane in fact uses any living creature that ends up there as a battery to power the cosmic entity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "bGnPdkj1hdyYWCBz","flags": {},"type": 0,"text": "Land of the Snowy Mountains: is rumored to be the true home and origin of the goliath race. It is a series of unending, snow capped mountain ranges where only the fittest survive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "p2MgT72VdCf4uisu","flags": {},"type": 0,"text": "The Eternal Battlefield – An endless flat plain locked behind a huge golden gate. Here, warriors of all eras and cultures gather to revel in glorious combat. To enter it one must prove themselves worthy to the Gatekeeper, the mightiest warrior of all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "Y3IcGhtwNrSRoudF","flags": {},"type": 0,"text": "Corpadverticus: an endless, flat plane, carpeted, with an endless labyrinth of little roofless shelters made from cloth-covered partitions. The ceiling is only two meters high; the partitions are about two-thirds that. A sort of light that doesn’t sustain plant life emanates from panels in the ceiling. Each shelter contains a bureaucrat; each bureaucrat has a quill, a stack of paper and a drawing of either a kitten clinging to a branch or a beach scene. Periodically, imps with small carts containing stacks of paper pass through the pathways between shelters. The answer to any question can be found here, but you’ll have to make a request in triplicate and the snack machine in the waiting room is empty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "HKCExaXqq508m0pD","flags": {},"type": 0,"text": "Primordial Realm: a branch of the Earthen plane, just much more unstable. Lots of raw earthen power, with dense jungles and dinosaurs unlike any on the Material plane!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "9e343CsXH7SylGFc","flags": {},"type": 0,"text": "A plane occupying a narrow, long area confined by rounded roofs and filled with rows of seats with a central aisle. At the front is a chamber which allows control of the plane’s movement.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "RpbR5Tawk8STobrA","flags": {},"type": 0,"text": "A plane of spear-like mountains rising from a thick, almost impenetrable mist. Strange sounds emanate from below the clouds. Each of the tall barren peaks is occupied by a gatehouse connected by great stone bridges, creating a network between the peaks, far far above the cloud layer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "kXiIgFt5LfwazWom","flags": {},"type": 0,"text": "Janet- A whole planet sewn together entirely out of denim, buttons, zippers, and metal rivets. Created thousands of years ago by ancient mystic tailors, the plane has since gained a few other materials over time, though denim is the base of it all. Living Cloth Golems take up residence here, and many come from all planes of existence to pay for their services, for the golems are master tailors, craftsmen, leather workers, and zippersmiths.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "fIxQNT0kIhmyPSPU","flags": {},"type": 0,"text": "Tempore Mortis- A plane where time has no meaning and acts in unpredictable ways. Vast expanses of bleach white sand cover the plane with occasional spouts of sand falling into the pitch black abyss of a sky. Despite this, it is constantly bright out, though the air is stale with a slight grey hue of dust that never settles. Black bones of creatures fossilized in place dot the landscape and travellers must be wary of running into patches of time that move rapidly forward, or backward, or not at all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "952f9QTCDFezio77","flags": {},"type": 0,"text": "Conifer- An endless forest that has no top and no bottom. The many animals and various native populations live among the branches of the massive trees. Plants, trees, poisons, and herbs of all kind, mundane or mystic can be found here. But travelers should stick to the well established branch pathways, lest they be swallowed by the forest and never return. The plates of giant pinecones are a popular building and craft material.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "RG9qkNbw2BexOT4F","flags": {},"type": 0,"text": "The Quasielemental Plane of Oil: An infinite bog filled with oil, fires, and corpses waiting to become one or the other. With the proper planer magic and technical know how oil wells could be built in the material that spew liquid gold out from the Plane of Oil with no actual drilling necessary. The immense pressure of the plane makes living there a hassle for most, but short trips are possible and companies are willing to pay good money for adventures to travel over and make repairs to their wells.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "5Eflp5mupbcFznhm","flags": {},"type": 0,"text": "The Great Bath: This ocean sized, warm, sweet smelling, and slightly soapy body of water floats in a peaceful sky. There’s a few islands in the water and a mile boarder of wooden planks and grass around the perimeter, but 99% percent of the plane is 3 and a half feet deep water. It is not uncommon for bitter enemies to be visiting the Bath simultaneously, but fights never break out in this sacred place of cleansing. It’s an odd sight for Angels, Demons, and Devils to be relaxing together, unless you’re visiting the Great Bath, and then its par for the course.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "BtkZKwUk88fhLFyc","flags": {},"type": 0,"text": "Warp Space – Partially composed of various dimensions and partially made of the space between the planes, Warp Space contains ways into every single plane that exists. However, the whole plane is fractured and unstable, with no permanent pathways. As a result of this, any travel there is extremely dangerous, and the portals rapidly change size, shape, and location, and randomly fade and reappear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "37iXBFTAfXHVSJ7k","flags": {},"type": 0,"text": "The Eighth Great Sea – A vast ocean, not unlike parts of the Elemental Plane of Water. There’s an ocean floor, islands, and plenty of life. However, be warned. Magic flows freely here, and random spell-like effects can manifest with very little warning. Giant sea monsters and ocean titans walk the sea floor. Fish carry lightning and ice magic with them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "vIXs4bt56MMcrM7m","flags": {},"type": 0,"text": "The Shattered World – Once a world like the Prime Material Plane, some unknown force broke the world into thousands upon thousands of chunks, some mo larger than a pebble, some the size of a mountain. Those who fall can fall for miles before hitting anything solid. On the plus side, ores are very easy to find, albeit very dangerous to actually mine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "OanzDN0IPEFoHNON","flags": {},"type": 0,"text": "The Endless Library – What it says on the tin. An endless library filled with winding shelves and a copy of every book ever written, organized neatly. There obviously isn’t enough books for an endless library, but after a while the library shelves start to repeat. Helpful modrons organize the books and guide travellers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "IlLyjdKzwWngHOkg","flags": {},"type": 0,"text": "The Plane of Half-Shadows: like the Ethereal plane, this plane is co-located with the Material Plane. So although someone in this plane of existence cannot physically touch things and beings in the Material Plane, they can (dimly) see into it and observe what happens. This ability to see into it is limited, and functions best where there are dark shadows. The darker the shadows, the better one can observe, while the places corresponding to well-lit areas or places of absolute blackness just show up as opaquely thick fog banks in the Plane of Half-Shadows. Spies and thieves speak with wonder of the incredible power this plane offers for surveillance since it allows peeking out from the shadows while being unobserved, not to mention the ability to pass through walls and other solid objects. What these would-be spectators neglect to mention is the significant danger to the unskilled in meddling with travel to this plane. While there are numerous tomes that teach the meditative states or magical processes for entering the Plane of Half-Shadows, most of these sources do not address the question of how to return. Many a skilled rogue has thought themselves masters after discovering how to enter the Half-Shadow state, but then found themselves marooned in an unforgiving landscape of shadow and fog, where nothing is solid (even the residents of this plane are intangible) and they are incapable of affecting the world, except that their loudest screams make their friends and loved ones back on the Material Plane feel slightly uneasy around regions of deep shadows. Eventually this disturbance ceases when the plane traveler dies of starvation leaving their bones behind in the half-shadows.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "scZtoI1f5124SbJY","flags": {},"type": 0,"text": "A single immense castle with what seems to be partially maintained grounds is surrounded by dark woods. In the far distance is an immense spiral of a mountain, it’s peak concealed by few. The whole plane is in shades of black and gray and no color is expressed. Inside the castle is an entry room from which sprawl labyrinthine hallways with infinite rooms that vary from lived in but filthy to rooms which seem as if they have not been occupied for centuries. A staircase also rises from the entry room, allowing for one to go up to more hallways or down in a catacombs below. Visitors must be wary. Pale visages of people may occasionally become visible only to fade quickly once noticed. Undead haunt many of the unused rooms, and the forest is a haunt for gargoyles and the aggressive, twisted, jet-black, parodies of normal fauna are equally as threatening. The denzions of the castle are never seen though evidence of habitation is apparent. Time does not pass in a logical way here, instead it is only relevant to perception, and may pass much faster or slower for those outside of each other’s perception, and even differently in different rooms. The plane loops around itself so that venturing into the featureless forest eventually leads to the castle or mountain, and the atmosphere is so bleak that characters must succeed on a will save to complete a long rest or fail and have a great depression come over them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "PUPti6ZIIPks16pO","flags": {},"type": 0,"text": "The Asylum City: A 4 dimension metropolis, suspended over a chasm within Pandemonium, it is refuge for beings across all different planes. Law and centralized controll is impossible midst the ever changing geography, order only being maintained by crime lords and urban warlords carving themselves a piece of the great city plane","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "rcwxCiSVBZ8rTzz4","flags": {},"type": 0,"text": "The Poisoned Eden: A large collection of swamps and marshland, it is filled with noxious fumes and dangerous animals and spirits, similar to those found in the material plane but far more twisted and primordial. Small pockets of civilization are the slave manors of the residents of this plane, maintaining control through iron fisted brutality. Some wage war on the swamplands while others are content to be kings of their own small pockets of civility","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "V0fYvQDJpeX0cL8L","flags": {},"type": 0,"text": "The Gentlemen’s Room: A small plane, consisting only of an ornate, medium sized study room, with a large bookshelf, able to contain countless books due to enchantment, though none of any truely ancient knowledge, as well as a cabinet of fine liquors, and several leather lounge chairs. Its only occupant besides visitors is a butler by the name of Danes, who will work the make the guest comfortable for their stay. Many suspect the plane was invented by a group of nobles who formed a club to have an excuse to get away from their wives.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "8hJloQ7vnHSv0NuY","flags": {},"type": 0,"text": "All Sea: An endless plane of salt water, with neither wind nor fish, it is filled with ships from countless ages past, all the ships once lost at sea. Most die of starvation in the realm, though some have managed to create a self sustaining settle from boat wreckage and whatever was left on board the ships.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "UmivGdOUJsfsrzBM","flags": {},"type": 0,"text": "The Land of Gravity and Growth (LOGAG): This land is made up of asteroids that are connected by huge vines the vines get nutrition from the ultra fertile soil that makes up the asteroids. This leads them to be attracted to if he asteroids. This also leads to the asteroids being covered in massive overgrown forests. The plants grow so fast you can see them move if you pay enough attention. Some asteroids being larger and smaller creates some strange gravitational effects, some asteroids have more or less gravity then others and when they pass by each other some strange things can happen.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "stbaVgraZnRa3WTP","flags": {},"type": 0,"text": "The Land of Glass and Dreams (LOGAD): this plane is much like our own however the trees, the ground, the sea,1 appears to be made of glass. They have the same feel of there material plane counterparts however they play tricks on the eye. The creatures of this land have learned to use this and the overflowing magic of the realm to there advantage, using illusions, quick movements and various other tricks to catch there prey off guard. Some creatures have even evolved to no longer have eyes so they are no longer deceived by them. The weather seems to have some of the same tricks as the creatures. Light storms, hallucinatory dust coming down from the mountains. You can not trust what you see.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "LUSentPSTpvD7qm2","flags": {},"type": 0,"text": "The Web Of Lies: The Spider Goddess sits at the center of her web, twitching her lines and pulling the souls in her grasp ever closer to her maw. Her Spiral Skein is a twisted tower of lies and deceit, with eight strands of silk reaching from the roof of the Spider Goddess’s Tower Palace to the edge of her realm and a sin in each void. The first is lies, a cavern full of pillars pretending to hold up the sky. The second is made up of cramped chambers representing envy, while the third is maggot-filled grottoes filled with seductive light. The fourth contains eternally dark tunnels of fear; the fifth, a place of betrayal; the sixth, an arena of murder. The seventh space is home to arcades of avarice and appetite, containing all things mortals would kill or die for, while the eighth is a flaming skein of fury, representing the death that comes to all mortals. From u/PhilosophicalPickle","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "sISc1iqqpVUXSKoz","flags": {},"type": 0,"text": "The Crucible: The Crucible is a hierarchy of power, trickery, and conflict. The highest point is Snake Mount, a city built into a mountain that triples in steepness with every twenty paces. There are twelve Arenas here, where mortals and fiends are locked in eternal combat for prestige in the eyes of their lords. Two rivers flow from the Snake Mount, wide and strong their flows, but they are made of the blood of the fighters who perish in the arena. One river carries victors in their longboats to the City of Triumph, a settlement much lower than Snake Mount, but quieter. It has a steady foundation in bedrock, and is shaped in the form of two fighters, one with an axe raised over his head, poised for striking, but the other with a quick dagger flashing from his belt toward his enemy’s gut. The second river from the Mount is more sluggish, but much broader. It carries the defeated to Mors Adthel, a city which hangs on a cliff over nothingness, where spindly river-rover-men pluck them from the water and pile them up to build a dam to stop the river from taking their city over the waterfall and into the abyss. From u/PhilosophicalPickle","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "DiWHAa7P9RyATT3Q","flags": {},"type": 0,"text": "The Filth: The Filth is a vast field of mud under a cold, white sky. There is no landmark, but a single tall, wooden post, upon which sits a ragged figure with the skull of a vulture for a head. If one dares listen, it whispers the way to the Queen of Decay’s throneroom, deep under the mud, where no light reaches. Innumerable sharp arms pass one down through the suffocating earth, and they take an entrance tax. No mortal finds audience with the Queen of Decay without losing something, perhaps an eye, skewered by a chitinous leg, perhaps the juicy flesh from beneath their fingernails, drilled out by quick mandibles. The Queen herself is unassuming after this ordeal, a diminutive crone, but her world breathes with her, as her hands and legs and intestine, and her garb is made from the remains of past visitors. From u/PhilosophicalPickle","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "gVPrymk843OrwZjM","flags": {},"type": 0,"text": "The Pits: The Taskmaster’s Pits are cold and uninviting, but with occasional great belches of sulfurous heat. The Pits are infinite rolling hillocks of dirt pounded solid by workers’ feet, broken there and here by grey-leafed pine trees. All the mortals here wear masks, and all the fiends are in human form, and go without. They are a busy and determined lot, trooping to and fro listening intently to the commands that come from the crevices that open up in a geyser of bronze fog and a booming, nasal voice. With haste, the masked mortals set about sealing the fissure first with tools, then with the bodies of their fellows, until the wound is healed. The humans wear masks of wood, monstrous faces upon them. The elves wear cloth, and they have babies’ faces. The others wear metal, and they are smooth and featureless. They traipse back into their towns at the end of each working day, afflicted with contentment, and then devour one of their number. The Taskmaster sits at the center of all of this, in the deepest Pit, in a pool of ink and oil, which fills steadily before igniting at a regular interval. When it does, the Taskmaster orders an audience with every mortal soul in his possession, but what they speak of is unknown. From u/PhilosophicalPickle","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "aHVJwqv9PAMtpzsx","flags": {},"type": 0,"text": "The Fair: The demon lord Jubilee’s realm is a simple affair – a sprawling, lively town engaged in eternal celebration. The occasional drunk has been known to find himself in an unfamiliar town square, between a tall inn, a brothel, a brewery and a fountain that runs with mead. This is Rockton, Jubilee’s debauched capital, where hedonism and lust run rampant and the sky blushes gold from jubilation. There are stone baths rimmed with amethysts and more than five hundred rooftop statues. Jubilee himself can be found at every place – he is in the inn, dancing on the tables, while Jubilee is drinking in the square, while Jubilee watches drowsily from a grassy patch by a tree. It is no surprise that mortals end up coming here, but they do grow bored as their lord and his fiends do not. They eventually flee into the groves and dells of the surrounding forest, where fouler creatures than drunks dwell, kept infinitely alive on a diet of ale and sex, and driven mad by lust or gluttony or stagnation. There is no fulfillment to be found with Jubilee. From u/PhilosophicalPickle","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "YGpT008LCGVQS5Jo","flags": {},"type": 0,"text": "The Nightmare: Perhaps of all the major Planes of Existence, the Nightmare defies exploration the most. It is the most visited plane by mortals (for we visit there every time we suffer a nightmare) but also the most changing. Phobetor changes her plane to a fresh horror every few moments, with a tremendous flash of lightning. A mortal might find himself falling from the top of the tallest tower one moment, the next, trapped in a corner as a mountain lion approaches. Another flash, and he is face to face with Phobetor herself, who is an unassailable mass of bone and horn, suspended from above by sinew like a macabre marionette. Her eye sockets are hollow but alive with malice, and her jaw swings open to consume her victim a split second before he awakes, sweating, frightened, but alive and in the Material Plane again. From u/PhilosophicalPickle","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "z2vxmlmwm6OQh6fk","flags": {},"type": 0,"text": "Nerium: Nerium is the Flower that Bites, the Beautiful Snake, a glittering world of alluring smell and hubric brimstone. Curtains of incense cloud the doorways, and vistas of success open up before sudden plunges. A demon lord floats in a caravan pulled by a Halfling who was once an Orc, bound in silk and encircled by a gold band of seven leagues. Banners and standards float from the lord’s body, trailing throughout the crimson night. There are three windows; through each of them a moon can be seen, and before them all is a dog, who was once an imp, who sits on a tasseled pillow. The pillars and arches of ornate stone give way below to a vast drop, and then a tangled briar of not-quite-trees and almost-flowers. There are beings down there, though it is not clear who or what they are, or once were. From u/PhilosophicalPickle","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "YdYrU8bS78N5Cht8","flags": {},"type": 0,"text": "The Conjunction – A world of infinite gateways. The gateways lead to all the other dimensions. Many of the gateways also lead to other places in the conjunction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "TC2rsqP9UzQlLQHk","flags": {},"type": 0,"text": "The Web – an entire dimension overrun by giant spiders. Everything is coated in web.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "P5FfBzIyII03mN03","flags": {},"type": 0,"text": "Hades Simulacrum: A strange, endless land of white mist and moss covered marble columns. The realm appears to be a by-way between the material plane and the many planes for the dead. Those who fall inbetween end up here. Those who end up here appear as they did in their final moments, never rotting, but if wounded healing to appear as they did on arrival. Living statues, carved to resemble angels and demons, wander the realm mindlessly, lashing out at random passersby.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "LHMrsgh0dlySLG5r","flags": {},"type": 0,"text": "Bank of the Immortals: Any immortal being accumulates many assets, none of which they want harmed. Some create their own planes to hold them. Others visit the bank of immortals, and infintly large, infinitly complex vault/bank plane which will safekeep anything from lich’s phalacteries, to dragon hoards, to godly artifacts. For a regular fee, be it in gold or in memories","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "2t6tal4efenSnZWW","flags": {},"type": 0,"text": "Demiplane of Concessions: Often mistaken for a place of refuge and salvation, this sliver of demi-reality is an unending dessert of salted popcorn, ranging in sizes of pebbles to giant boulders. Spiking the landscape are volcanoes that periodically erupt spewing the aforementioned popcorn. Glacially slow rivers of caramel sinuously carve the landscape and travellers might encounter pools of sickly sweet brightly colored shaved ice and sticky gooey cheese. GMs might want to populate the plane with candy-themed monsters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "8csK4h2kJELW9szL","flags": {},"type": 0,"text": "The Reflection: A plane of existence most used for banishing intelligent sentient beings. This realm is composed of countless mirrors in different shapes and forms that reflects the viewers nightmares of their twisted selves. You don’t have to eat or breathe in the Reflection and whenever die here somehow, you came back to life through a random mirror. However the body of yours now become the reflection of you in that particular mirror.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "1Ws90CzjnuoIxy2o","flags": {},"type": 0,"text": "The Bank: Why do coins have so little weight? Why can gold split into silver? Why is the currency of the world all the same? The answer is The Bank. An entire plane made of the magical currency used by all. Plains of platinum, Geysers of gold, rivers of silver, oceans of copper, and forests of electrum. Everything in this plane is money and as such everything that lives in this plane is powerful. Dragons wage war for the hordes, undead pirates roam the seas, and massive titans of coin wander the land. Ruled by The Banker who is magically connected to all coin he manages the wealth of planes. Beware any who take any coin from the plane without The Banker’s blessing as his Auditors will hunt thieves and counterfeiters across time and space. (a plane to explain those who do not use currency encumbrance and split their money as they need it)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "chBeLBhXUqDE7AMX","flags": {},"type": 0,"text": "Gods’ Grave: There are few places in which the gods avert their gaze but one such place is the Gods’ Grave. Here lies the dead bodies of the gods, even the ones who aren’t dead yet. These bodies flow with magic and act like islands upon the void and many a mortal who would hide from a god’s anger takes sanctuary here. But be careful where you tread for a god’s wrath can be awoken from beyond the grave. Evil footsteps upon a good god may erupt radiant fire, a kind heart sitting on a god of war can bubble a horde, and metal feet on a god of nature can unleash nature’s wrath. And above all, do not step upon, listen, or speak to the bodies of the Gods of Death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "H8ujSPZ2jVQ74Izc","flags": {},"type": 0,"text": "The Unreclaimed: A land of mystery and wonder, anything that has ever been lost winds up here at some point. Be it a lost sock, a single gold misplaced, a wonderous artifact lost to time, or even a train of though. Anything that has been lost or forgotten winds up here. Anyone as well. The denizens of this plane are all those who have been forgotten, or have vanished under mysterious circumstances from the other planes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "ruQ1K9iJejeRFZAf","flags": {},"type": 0,"text": "The Elemental Plane of Taste: Flavor and texture become more than sensory concepts in this place, here they become real. Composed of many landmarks, such as the desert of saffron, the land of spice and pain, the great mires of bitter guarded by tart frogs. The greatest lord currently in the land is a great sugar elemental, who has taken over by crippling all contenders with horrible addictions, which only he can satisfy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "CIrfhcvQbdAUyKfu","flags": {},"type": 0,"text": "The Antipoles: A plane of constant two sided extremes. A continent of constant volcanic eruptions and spewing lava ravaged by an unending hail storm. An plain of earthquakes whipped by undying tornadoes. The stillest, coldest, saltiest, and darkest of oceans exposed to an cloudless stagnant sky burning with three suns. No matter the place lightning will either burst out bellow or strike from above. Some say this plane was created long ago as a hell and prison for the most powerful of the elemental genies. Find one and they may grant an wish with no tricks if you find a way to release them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "7bp7F987xXgFA7Xb","flags": {},"type": 0,"text": "The Ballroom of Suffering: A room of white crystal that floats like a bubble in an infinite chasm. All around you is the refection of all pain and suffering. Death, rape, murder happens all around you in a ghastly reflection of reality. In the middle of the room is a pillar which holds a grail. If you consume the liquid inside you will never grow old. However it will send you to different worlds and different times in a never ending quest to stop all pain and suffering.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "ezLpfTqWrihJgwb7","flags": {},"type": 0,"text": "The Game Show: A plane entirely made up of puzzles, fun encounters and treasure. When you enter the plane your hit points are increased to 10x their original amount. You cannot heal there and when you die you are permanently banished from this plane.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "MfJzh5GpRWK7oGyP","flags": {},"type": 0,"text": "The City of Sing: Powerful wizards are not the only ones who create planes. The City of Sing was created by a powerful bard who wanted an entertaining, magical, and musical realm. The cities buildings are shaped like various musical instruments, games of chance and entertainment venues of all kinds litter the city, and Music Lane will cause any who travel down it to start singing and dancing about what they are doing and why. Any who travel there will have an invisible servant tending to their needs as long as they are within the city borders. Outside the city are the Genre Wilds that provide the food and resources for the city’s visitors. The Jazz rivers, Rock Mountains, Blues Ponds, Reggae Jungles, Country Plains, Heavy Metal Mine, Soul Sea, Hip Hop Valley, Gospel Forest, ect. These wilds are safe within the borders but the deeper one goes the greater the danger. Shielded Magic Carpets go and come from the deep within the wilds once a day as part of the city’s Adventure’s Safari Challenge! Better survive till the next tour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "iP108626vgjqtvPR","flags": {},"type": 0,"text": "Cracked Shell: The inhabitant of this massive egg left before memory or record. Now it floats within the void a curious mystery of the multiverse. On the outer surface of the shell are civilizations both old and new carved into the very shell. Ancient yolk that acts as fertile slime fields growing mile high mushroom forests filled with slimes and serpents. The realm is always warm a heat that seems to infuse every part of it and seems to have no source. On the inner surface the yolk is deeper making a ocean of yolk in which swims creatures of all shapes and sizes. A single Kraken makes his home in these seas having slain the Dragon Turtle that once lived there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "9kk7IYNYzPw0XaNr","flags": {},"type": 0,"text": "Heroes’ Feast: A massive waffle. The squares are filled with delectable liquids (soups and sweet drinks), the folds valleys of meals (bushes of fruits and trees of meat), and the center a mountain of dairy products. The food here never rots and is always the perfect temperature for the food being consumed. Eating a full meal gives the effects of a heroes feast but as soon as one eats a feast food based monster shall rise to challenge the heroes. Watermelon elemental, Syrupy Serpents, bacon flesh golem, Jam and Jelly slime, Vampire Steak, ect. Seems the place was made to test and reward heroes. Heroes who do especially well get an magic item that can only be used by those proficient with cooking tools.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "2tf5RnAJ16q894lm","flags": {},"type": 0,"text": "Dwarfhalla: A dwarf’s paradise and heavenly afterlife created by the Gods of the Dwarfs. Rivers of fine ale flow from endless mountains filled with all sorts of rare metals and jewels. Endless fortresses are being built and improved upon with clockwork barbers giving the finest beard and hair cuts. Arena’s of warriors fighting to prove their metal and no oceans. Visitors are welcome but the realm will eject any living being after one week and after they can not return. Only 1 object can be taken with the a visitor as long as it is given to them by a dwarf whose respect they have earned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "0mERe3ICamY3MHwt","flags": {},"type": 0,"text": "Ghost Ship: You are on a ship stuck between the realms. On the outside it looks like a normal ship but it is much larger on the inside and it seems capable of traveling to other realms. The bodies of the crew appear to have all been killed by some strange creature(your choice of Aberration). Avoid the enemy and find the clues to find the captain’s secret escape hatch to escape or find a way to defeat the enemy to claim the ship as your own.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "ucqD1qPwvO69sRaA","flags": {},"type": 0,"text": "The Ball and Chains: A moon size black ball whose surface is one massive abandoned city. Attached to the ball are great chains that lead to a dark void far above. None who have entered the void to see what is chained up in the void have ever returned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "ZXYoorabiJ3iHCsN","flags": {},"type": 0,"text": "The Answerable: People only travel to this plane when they search an answer to a question. They are put in the room where the question is answered by someone in the plane who knows the answer. They cannot leave until they have answered someone else’s question.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "gYx5mV2EegYBpgp5","flags": {},"type": 0,"text": "Soft dimension. Everything is super soft or has high viscosity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "O8TL4zpOcLRubRlT","flags": {},"type": 0,"text": "Blind dimension. Organic life simply did not evolve to sense anything in the visible spectrum. Use other senses or exploit other ranges of the EM spectrum to thrive here.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "9dLLNpzrNkLUBkmK","flags": {},"type": 0,"text": "Cancer dimension. All organic life is subject to uncontrolled cell division. Everything turns into blobs of meat or veg. Basically, a realm of chaos.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "i9ZuBahHMDDA2DBE","flags": {},"type": 0,"text": "The Say it First dimension. You cannot do anything before speaking it out loud first in this dimension. You wanna assassinate someone? You must say “I am going to assassinate Bob”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "0VpiTrQCNnY7EGAy","flags": {},"type": 0,"text": "The non Euclidean geometry dimension. Hard to speak about, but essentially things like parallel lines could intersect. There are different types: hyperbolic, elliptical, spherical. Some scenarios might arise where you may turn left or right 90 degrees 4 times in a row and not end up where u started.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "mIfX9hjFqOphcOMc","flags": {},"type": 0,"text": "Saline: The plane of salt. The ground is covered with several feet of crusted salt. There are no plants, no standing water. There are mounds of salt and salt ‘trees’ made of large salt crystals. There are several different kinds of salt. Some of which are edible; many of which are not. A few are even toxic. The only animals are crystalline quadrupeds which consume salt and excrete other types of salt.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "7UGGe6ZXJ16IEZiM","flags": {},"type": 0,"text": "Rust: Something built this thing and then something broke it and now it rusts. It is world sized but not world shaped with levels upon levels down into its structure. A massive rusted structure whose purpose, builder, and destruction have been lost to history. Defunct clockwork sentries, constructs, and guardians lay dormant till approached then attacking any living thing. Large holes blasted by some ancient weapon give passage to the deep dark innards of the structure. Large metal towers and craters of rusted metal liter its surface. Mysteries and danger lie upon this wreckage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "qFocUyCmcAL4Wqyt","flags": {},"type": 0,"text": "Min To Max: This realm looks like a white room where a simulation of any object or creature the person is deeply familiar with can summon. Can only be in this realm only once in their existence. Only 1 person can be in at a time. If a group enters into this realm they are isolated between realms till each person goes through the realm 1 at a time, any who were already in once get bounced back to the previous realm or the realm they are from. They can only be in it for 1 minute before being bounced back to the realm they were previously in or are from. In this realm the weave is tightly wound and magic infuses into the creature artificially maximizing the character. All stats are now at 20 and the character can make 6 d20 rolls to accomplish a task, solve a puzzle, or use magic. 1 of the d20s can be turned into a natural 20. When knocked out of the realm take 3 levels of exhaustion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "kAAkvkB1EdFWOe5r","flags": {},"type": 0,"text": "Monologue: A small planetoid possessing a single road and a forest with a lake that goes through the center of the world. What really sets this world apart is that visitors hear strange voices arguing over what the visitors should or should not do and the clinking of dice. (All out of character conversations and dice rolls can be heard by the characters)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "nKoR0gttJtkeD4Ws","flags": {},"type": 0,"text": "Brain Punch: This realm looks like an circular arena covered by a glass dome sitting on a tall hill. While in this realm all character have their intelligence and strength stats swapped and dexterity to set to 10. When the bell rings its a free for all fist fight and last one standing gets an attunement free belt of Hill Giant Strength. The belt will only work for the winner and if anybody tries to throw the match everybody loses. (the fight is nonlethal unarmed attacks)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "4zq0RhjMdDjrWmgp","flags": {},"type": 0,"text": "Repto World: This dino world is a primitive world like one might see in Chult but in which lizards are all. Lizard versions of all normal beasts exist in this realm which is populated primarily by Lizardfolk. A dangerous and savage land but for the adventuring druid or ranger a place to discover new beasts to tame or learn. It is also home to many rare herbs and plants.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "rQhGIEiRwKfG3gSa","flags": {},"type": 0,"text": "The Temple: This massive world sized temple floats within a realm of eternal twilight with temples made of gold, obsidian, and wood. This temple contains countless rooms each dedicated to a different god. No temple is closer to the gods. The devout come to this temple and pray and if their prayer is true the god will respond. A trail will be given to the devout and a feat gifted to successful. But if you travel into a room of a god you do not worship expect a deadly challenge to earn the god’s respect or perish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "PlpuF1rIPAQzbpIT","flags": {},"type": 0,"text": "Uncanny Valley: This valley sits within a giant floating ring with a single road going through the valley and a series of identical houses on each side of the road. Each house has a pleasant and polite family of a mother, father, daughter, son, and dog. Most of the families are humans but families of the other major races are present. If you knock on one of the doors they will let you in and offer you a meal and bed for the night and then let you leave the house but no magic seems to work to let you escape the realm. The people are all disguised mindflayers (the dogs are Intellect Devourers) practicing how to act to fit in with the races in plans for a future invasion. Floating within the center of the ring is the Elder Brain that controls the mindflayers. Clues will be hidden throughout the realm on how to escape, send a message to the gith, or destroy the Elder brain but if you attack or reveal you have found out what the people are they will drop their disguises and attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "CUNayxGBlkHhsS9H","flags": {},"type": 0,"text": "Deadmind: An abandoned strong hold in the shape of a massive brain, its twists and turns acting as a labyrinth of psychic traps for those who travel it. It now houses two tribes one of Githyanki and one of Githzerai. They hold an uneasy peace as they work together to hunt down an unique and dangerous Elder Brain that has appeared in this realm. An Elder Brain Lich that commands the undead as well as it’s mindflayers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "fcsEjCP4cjiJMvdH","flags": {},"type": 0,"text": "The Ever Eye: This is planet sized eye covered by a salty ocean. Small floating islands of sand have markets and houses where the few who have learned to live on this world reside. Those who sail upon it often head to the pupil where the water drain down a massive hole. When one falls within the pupil they can see and only see one secret that they seek. Their ship will then fall to a random watery realm. But beware ‘One Eye’ the one eyed Beholder pirate sitting within and controlling his Stone Juggernaut.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "Xk2jwkwyTaBiC2jf","flags": {},"type": 0,"text": "Dark Mirror: This strange realm seems to glow a dim purple with a seemingly eternal reflective black floor. When one enters the realm mirror copies of those who have arrived begin to drag themselves out of the floor. These copies have all the same abilities and items as their counterparts except their alignments are flipped. In most cases this will cause the copies to attack your groups but in rare cases (usually in neutral aligned members) some may be willing to switch sides. Once the copies have been defeated (or ones that abstained from the fight have left the realm) the realm will show a moment in the future and then the dark world that will come across if this moment is not stopped. Note: defeated enemies when they hit zero hp will shatter then sink back into the ground, items cannot be taken from defeated foes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "3bd2mui0cf5ULN9K","flags": {},"type": 0,"text": "The Brewery: Garden and factory together to make this realm of alcohol. Said to have been created by an Elf Druid winemaker, Gnome Arcane Tinkerer mead maker, and an Dwarf Cleric of Hanseath ale brewer. The surface is a garden of various fruits and grains with a sprinkler system of holy water watering the plant. The plants are grasped by magical vines and put into pools of magical fermentation mixing and aging the plants with magical swiftness. The pools drain to a massive underground brewery that prepares the liquids through various pipes, tubes, vials, and distillers. It is then pumped into blessed barrels and bottles holding the sign of Hanseath. Currently robotic barrels of ale are digging a section out to start producing underdark beverages overseen by a Drow, duergar, and deep gnome brewers who have made this realm their home. A brewer’s paradise to learn the unique methods of producing many rare beverages. Several minor and a few rare magical items that can only be used by brewers can be found here.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "bJ6meQP9C7rNceE6","flags": {},"type": 0,"text": "The Map: One does not know if this realm is unfinished or intended to be the way it is. The realm looks like an well illustrated line map with everything the color of brown parchment. Oceans and mountain are as high and wet as they would be in a normal realm but they are marked like on a map. Elevations are marked, as are longitude and latitude. Large words flow across areas showing the name of each river, lake, and country. The map is also layered as one heads deeper in new areas with new names will appear. Can you find the X on the map? Cartographers are able to navigate this realm much easier than others (make all rolls investigating, tracking, and learning with advantage if the character is a cartographer). Several minor and some rare magical items that can only be used by Cartographers can be found here.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "RM7oZVIMVrvJR9Aj","flags": {},"type": 0,"text": "Feet Wear: Shoes are important. The guy who made this realm certainly agreed. A giant boot with magical properties allowing one to walk upon any surface as if it was the floor. Various shoes are just hopping around all around the place. If you capture a pair they will be passive and if you have a cobbler you can work on the shoes and depending on the type of shoes depends on the type of magic the shoe will give. Gather the various materials from the surfaces of the shoe and you can make an attunement free magical shoes. There is a city inside the boot and nomadic tribes on the bottom sole of the boot. All sandals are edible and taste like jerky. Travel across the entire realm and you gain the Mobile Feat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "bDCOFjHJjFRk75p9","flags": {},"type": 0,"text": "Glasslamp: This realm is one multicolored ball of glass with a burning fire deep down in the center of its world. The fire bursts up and when it does in creates beautiful structures of glass from mountain to castles. Glass trees grow potions of various types and large Decanters of Endless Water within majestic glass fountains litter the land. Deserts of colorful glass baubles, stain glass castles, and pits of bubbling liquid glass are but a few things found in this realm. The light in this land shines from within and glows a through the glass of the world. Glass in not the only thing in this world though. There are blowpipe fields growing as well as glass chests of marvers, blocks, and tweezers, For this is a world not just of beauty but for the perfecting of a glass blowers craft. The glass objects made using the glass in this world are near indestructible and enchanted blowpipes that can double as weapons can be found here though only usable by a proficient glassblower. A glassblower can gather the unique glasses of this land and use an active geyser of glass to pull magic into the glass to craft a single magical item, weapon, or armor usable only by them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "17ULkCRYxF0eEf6Z","flags": {},"type": 0,"text": "The Gem Sea: This strange ocean is made up entirely of precious gemstones. Some strange magical property allows gold and silver ships to sail upon it but this sea is also dangerous. Blood ruby sharks, emerald dragon turtles, sapphire krakens, diamond swordfish, quartz crabs, among other magical gem creatures lie within this ocean. A jeweler’s trained eye can see these dangers through the sea of gems and can avoid it while instinctively knowing what gems can be used to craft a magical item. A jeweler can use the metal of the ship and the jewels of the sea or its monsters to craft a single magical ring, amulet, crown, circlet, or other bejeweled object. Jewelers are the only people can swim in the sea as other can walk upon the surface for a minute before they begin to sink. Beware the longer one sails on these seas the greater the danger so either leave through known means or find the pearls of this land than can be broken open to create a portal to another realm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "SDQrLwXRZsOgh5Xt","flags": {},"type": 0,"text": "Leatherworker: This world was supposed to be a place where leatherworkers can perfect their craft but it went very very wrong. The world is made up of writhing leather pulsing and shifting. Roaming the land are beasts with a thick leathery skin covering every part of their body, including their featureless faces. They move directionless as muffled noises vibrating from under their leather carapace. They all posses a magical blind sight and if they detect any creature that is not leather they will immediately attack. Pools of strange red liquid can be used to immediately treat any hide so it can be used by a leatherworker but beware the creatures tend to congregate round these pools. The leather on the creatures are magical and as such magical armor can be produced from a slain beast, if one is a leatherworker, but the horror of doing so will cause constant psychic damage as one skins the creature. The more dangerous the beast the stronger the leather one can receive from it. Skins must be used to create an object before leaving with the leather, if not the leather will come to life outside the realm and attack the party and when these are defeated they turn to dust. A leather worker who works on the horrifying and difficult leather of this realm finds normal leathers far easier to work with and as such get advantage on future leather work.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "e1CR1i0x8orKJJrA","flags": {},"type": 0,"text": "Ceramics: The ground of this world is soft clay but all the buildings, creatures, and people are ceramic and pottery. A pottery forest of druid ceramic gnomes (lawn gnomes). The pottery forest is made of clay trees that have pots of various inks growing from it. Waterfalls are large vases pouring out water, cave entrances are large pots on their sides. The great danger of the land is a demonic bull that goes about shattering everything it sees. If the bull is slain the blood can be mixed with the clay of the floor and depending on the design and ink used on it will have a unique magical property and can only be used by an potter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "Yhe7LnnOZ25rEVKj","flags": {},"type": 0,"text": "The Game: A realm that seems to be another Material Plane, with one continent and two massive kingdoms, Blackridge and Whiteholm. Upon arrival, the party members’ clothes colors change to match one of the kingdoms and they are given a weightless chess piece fitting for them (a cleric becomes a Bishop, a fighter becomes a knight, a rogue becomes a Rook, etc.). After visiting the realm, they may begin to notice that enemies and allies of theirs have pieces that match them. In their own world they will meet one person for each piece. The pieces will all eventually battle each-other. In the Game, there are thousands upon thousands of pawns and they are all constantly waging war against eachother. If you wish, roll a 1d4. On a 1, the players appear in the middle of a raging battle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "zCyAYXo1IrZi9Hau","flags": {},"type": 0,"text": "The Flesh: An entire planet made of the flesh of people sacrificed to some Eldritch being. The core of the planet is made from millions of Tarrasque skeletons. The bones sell for a great price and are worshiped by a group of warlocks that defend them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "iGpfYzBfo6ElNpPm","flags": {},"type": 0,"text": "The Table: This continent sized table sits in a large doorless red room with a lantern above providing light and heat. The Table is a training ground for carpenters and those of the field can alter the wood of the table to create blocks of wood that the artisan can work with. Littered upon the table are finely maid cabinets, houses, and tables from previous carpenters who have are working in this realm. A carpenter can spend time here to create an wooden structure to hone their craft but if they make something that can open they may receive a different boon. Depending on how good work and the type of container a carpenter creates here depends on what will be inside the container after it is closed and then opened. A house contains full furnishings and a magical deed so you may return to the house once a day to rest and then reappear back where you were when done (may take up to 8 people with them). A chest may possess a treasure horde. A cabinet may have magical clothes. A small box may have a magical ring or amulet. A person may only interact with items they have created or those an woodcarver has given permission to touch otherwise it is ethereal and one would pass right through it. Can only create one house and one other container that will possess a magical item.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "hBX17VbTxY98kc19","flags": {},"type": 0,"text": "Behold: This is insanity. This world is a large floating dead Beholder. The liquid upon its eyes act seas, the depths within its nose and mouth is an underdark and abberations live all across this realm. Each of the eyes have a magical aura around it is in accordance with the type of beam that would normally come out of it. The Eye of Disintegration vaporizes any organic matter that touches the eye’s sea, the Slow Eye has all that sail upon it go in slow motion, and the Fear Eye will cause those who sail upon it to imagine horrible monsters right below the surface of the water, etc. At the center of each eye and at the center of the giant beholder is a large fortress, each possessing a beholder waging never ending war on the other beholders of this realm to claim this dead head as their own. The reason for their mad desire to conquer this dead world is only known to them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "YkoEAtoY59lC42s1","flags": {},"type": 0,"text": "Masonry: This realm is seemingly an endless series of stone rooms with each room made of different material, designs, and cultural influences. Rooms vary from large ballrooms to cozy offices and in each room are the material for a mason to learn how to make the bricks, mortar, or other aspects of the room. Mastering the technique gives the mason magical insight into the history of the structure and the culture that created it. The rooms may also contain trap doors, secret walls, and traps within the floor and walls as well as occasionally stone constructs that will attack those who enter the room. Each room has four doors and when one enters the room the door behind them closes and disappears. One of the doors in each room will exit the realm to a random realm. If a mason masters 5 methods they can get a magic item that can only be used by masons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "zTJG3nEvMO2crgAi","flags": {},"type": 0,"text": "The Compass: This realm is a large compass. The sky is a see-through glass surface with a starry sky beyond the glass. This realm is a sea with a large swinging magnetic arm, one half red and one half blue, that shifts and points at some unknown target in the multiverse. Lost sailors often show up in this realm for some strange reason and if they can survive the waters, the flying constructs, and mechanical kraken that inhabit this realm and reach the center they can appear at something they lost, whether it be home or some lost object as long as it belongs to the group or person. A navigator who sails these seas will gain greater insight on directions and locations and as such will have advantage on navigation skill and will always know what direction they are pointing even in other realms and underground.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "dReP9XhWvz1WKMXI","flags": {},"type": 0,"text": "Whittle: This realm is made up of a forest of massive tree houses each tree being a different type of tree or bush. The treehouses are like magical apartment buildings with a small cities worth of people living in each tree. The trees grow equally large fruits and trees that do not have fruits have farms growing crops for the people upon the branches. A wood carver can summon a piece of high quality wood from within each tree to use on a project. Depending on the type of wood, the quality of the carving, and the type of object carved will determine the magical properties of the item carved. Magical properties can be applied to one carved wooden weapon, once carved wooden arrow, and one carved wooden figure. Treants travel across the forest tending to the trees and protecting those who would do it harm. Hostile giant insects live in this realm and the people are willing to pay to have those willing to fight off insects damaging the trees in places out of reach of the Treants.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "4Ym4UXzhkfDcCt48","flags": {},"type": 0,"text": "Paint and Pencil: This realm started as a flat piece of paper floating in the void. It seems though as one paints and draws upon this land it grows to match what was drawn and now it is a massive mishmash of different art styles and tones. The realm does seem to have a preference and only those proficient in the drawn arts can contribute as bad art simply erases itself. Caves of charcoal drawn shadow creates and underground towns. Ivory towers drawn in chalk. Painted landscapes and portals to other realms. Pencil sketched citizens and colorful creatures. The surreal nature of this realm means one can come across exaggerated monsters next to realistic animals, a photo-realistic forest next to sideways cherry waterfalls. The creatures of this realm behave as the artist intends but as time passes and the artist dies their nature shifts based on how people respond to the art. A large bear can be a terrifying enemy or a lovable friend depending on how a person interprets the art. Same so to racial biases, a dignified elf may behave like a pompous self-righteous pansy or like a wise and caring mentor, a battle scared orc can be an honorable defender or mindless attacker. If multiple people encounter the same art at the same time have the characters make a wisdom check and whoever wins will have their interpretation of the art be the current reality. If an artist contributes to this realm with both art and adventure the realm will grow a magical paintbrush or pencil that acts as a Magical focus and possess art based spells determined by the DM","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "JlnbGhoKITjzAEw2","flags": {},"type": 0,"text": "The Tavern – The result of a Wish spell gone awry. This plane consists of a tavern roaring with sounds of merriment and laughter. Drinks are flowing aplenty and warm, freshly cooked meats and stews are coming out of the kitchen seemingly without end. Someone wished this moment could last forever. Everyone in the tavern knows your name and welcomes you. If you ask them existential questions, they seem to have a hard time hearing over all the laughter and excitement and they just pat you on the back and offer you a stein of ale. You’re welcome to rest in the rooms upstairs. The catch: Opening the front or back doors allows you to see the city streets outside, just as they were in the moment the spell was cast. You can hear the bustling of crowds and hear the rainstorm coming in, but upon passing through the threshold, you find yourself back inside the tavern just as if you were stepping inside. There is some lingering magic in some of the things in the tavern. For example, a fork that when poked through something can lift it as if it was weightless. See the minor magic items list. You may have a knife that cuts through air to create a portal home or a key that causes every door to open to any place on the material plane you wish. Any items removed from The Tavern become inert and after 24 hours, disappear entirely. For added creepiness: There is a large painting on the far wall depicting a merry tavern scene with musicians and laughter. Drinks are being raised to the adventurers just walking in who are cheering in return. Upon closer inspection, the faces of the people walking in seem to resemble your own.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "QAcHXJ5XzcUbxhZx","flags": {},"type": 0,"text": "The Lost Realm: a world covered in gigantic junk piles. The only way to reach the Lost Realm is to become lost yourself. Everything that has been lost, discarded, or forgotten in any dimension can be found in the Lost Realm (existing simultaneously within their own realm and the Lost Realm). Objects that are lost, discarded, or forgotten slowly materialize into existence withing the Realm. Beings, Creatures, and Objects that are found within their own dimensions slowly fade out of existence from the Realm. Whispers of forgotten knowledge can be heard on the winds. People within the Lost Realm slowly start to lose their memories of who they are and where they are.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "mgnB87iqUsertquS","flags": {},"type": 0,"text": "The Coaxial Concave: This bizarre plane is organized into16 concentric rings that appear to the stacked in descending order of size in constant motion continually shrinking and descending towards its center. When the disc enters the inner most ring, it drops and expands to envelope the 15 other rings taking its place at the top. This cycle takes months or decades depending on some unknown mechanism. Orbiting the concentric rings is a golden glowing orb, giving the discs its cycles of day and night, along with a sizable metallic orb that tends to oppose it. In reality the glowing orb is a Solar Dragon, and the one that serves this plane’s moon, a Platinum Dragon. Each of the discs are populated by a variety of intelligent species, primarily elemental and constructs, in cities that resemble laboratories, factories and observatories. Strangely, creatures that inhabit any disc are resized when the enter an adjacent disc so that they remain relative in size, respectively. The elementals are unique in physiology, suggesting arcane interventions so old that none recall it, but unlike elements find surprising homeostasis in their bodies —what might be mistaken for mud elementals have geysers of flames or an inferno for its head, a water elemental has lightning sizzling inside it. Some are more extreme in their cohesion, apparently coalescing around powerful crystals. Among the more recognizably humanoid are wryrwoods, androids and intelligent golems each carrying out tasks based on factions who do not share aims but are rarely in conflict. Many of the non-elementals are engaged in astrology, numerology and aeronautics required for the mining of the nearby asteroid bodies, rich in sources of gases, liquids and biomaterial that the rings generally lack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "TWxxGumbUGxiHJkV","flags": {},"type": 0,"text": "Roll twice on this table. You end up in a crossing between two of the planes. If you are using this list for what plane you teleport to, you end up in a crossing. If you are using it for something like where your players must go, they have to go to a specific crossing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "tEF8PLdQLb0WVV5j"}
