{"name": "Interesting Bard Instruments","description": "One hundred amazing instruments that your bard NEEDS to have!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "o3jQ0aTnCth7dT3b","flags": {},"type": 0,"text": "A lute that was carved from an enchanted tree. When played, the illusion of sheet music and music notes can be seen flowing around the player.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "PUeOhqFuOAx4tbNm","flags": {},"type": 0,"text": "A set of reed pipes made by a Satyr. Their sweet and mysterious sound grants disadvantage on saving throws to resist being charmed by the musician.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "oj3UQmz3ClDqgvNp","flags": {},"type": 0,"text": "A vuvuzela that, when blown, sobers every person up within a 20 foot radius.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "IgvuGoFFfZZCWjjz","flags": {},"type": 0,"text": "A tuba that spits out water, the pressure is determined by the quality of the music.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "vl6JNsvadu0AvslD","flags": {},"type": 0,"text": "A comically long recorder that’s long enough to be used as a functioning quarter staff.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "YNeT8FfHbrgY9gpB","flags": {},"type": 0,"text": "The Hydrophary – A species of aquatic plant that is vaguely octopus-shaped and can be played like a bagpipe. It wiggles its tentacles with delight when played.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "RtRb4gGHFYUVVxkL","flags": {},"type": 0,"text": "Any type of string instrument that, when the command word is spoken, turns into a type of axe. The size of the instrument decides what type of ax it is: violin is a handaxe, guitar and lute are battle-axe, and bass is a greataxe. Speak the command word again to revert back to instrument.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "hNYzaiqJ0Ja0ygvH","flags": {},"type": 0,"text": "The Phomenflumphen: You’re not sure what this is. It appears to be equal parts accordion, bagpipe and drum. The Gnome playing it seems to know what they’re doing though. Without training, all checks with this bizarre instrument are made at disadvantage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "wkhyXuBY71xU4H5U","flags": {},"type": 0,"text": "A conductor’s baton that allows you to shift the pitch of someone talking to make it sound musical.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "e3tF6ZutUTijCg5f","flags": {},"type": 0,"text": "Cetacean Song – An ocarina seemingly crafted from snowflake obsidian that produces some decently low notes, and is shaped somewhat like an aquatic animal of some sort (inspired by this)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "M4OS3aaCnBSEurWL","flags": {},"type": 0,"text": "Conductor’s Instrumental – At first glance, it just looks like a typical conductor’s baton. However, depending on the direction and speed it is moved, it will softly hum a note.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "QYApifFX0sjd49tv","flags": {},"type": 0,"text": "Hidden Headbanger – It doesn’t look like too much, just a simple polished wooden 6-string guitar. When a bard plays it, however, it sounds as if it were an overdriven electric guitar. Has a disclaimer on the bottom written in small text: ‘FOR THOSE ABOUT TO ROCK’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "dKhMRZ7j0xauC0W1","flags": {},"type": 0,"text": "Zamchroma – A zampogna with tubes made of a special glass that ‘catch and toss’ light that passes through them, giving them the appearance of being made of solidified and slowly shifting rainbows. It produces notes that echo very slightly, and overall sound heavenly or ethereal in nature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "eoaVKNPzKpOluAKL","flags": {},"type": 0,"text": "A saxophone with special compartments for storing rations. A snacksophone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "mocCr97wtmxnIc4r","flags": {},"type": 0,"text": "The Dread Lute – Found deep in a dungeon on the corpse of a powerful bard. The wood is rotting and the strings are long gone, but “playing” it still produces beautiful music, as if it were brand new.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "1B2AbXHZ0KJpW0n8","flags": {},"type": 0,"text": "The Flute of Love – The mage who sold this to you said it would make any listener fall in love. That doesn’t seem to be true, but any music you try to play comes out as the same love song, every single time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "BUvfllE7mQzgN3zp","flags": {},"type": 0,"text": "Goblin Drums – A pair of small hand-played drums that can be worn around your neck with an old bit of rope. Whenever you use them to grant inspiration, any goblins in earshot also become inspired.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "pt2dy40jC1Kl58IZ","flags": {},"type": 0,"text": "Chance the Rapier – This intelligent sword speaks with incredible creativity and rhyme. You can sing along with it to get the same benefits of a bardic instrument.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "hMs5LJB4liNRo6nN","flags": {},"type": 0,"text": "An enchanted accordion. Whoever plays it will slowly but steadily increases the tempo of whatever song they are playing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "39Bz5qatZfZRryE9","flags": {},"type": 0,"text": "A Stroh violin with the horn decorated with dwarven runes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "ddknO0ZHnzDaGTeV","flags": {},"type": 0,"text": "Namic’s Bladder – A set of Uilleann Pipes, black as ebony and with an incredibly clear sound. Said to have been created from the bones and bladder of a Black Dragon by Hersem Grelelian, who defeated the dragon on the way to her wedding and presented them to her husband.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "8ASoPULU61PgKsbw","flags": {},"type": 0,"text": "A member of the violin family made out of iridescent ivory. It changes sizes and transforms into the different forms of the family depending on the phase of the moon, starting as a violin on the full moon and growing into a double bass by the new moon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "HAUNmv2EPWjrgiVS","flags": {},"type": 0,"text": "A very worn looking banjo with the peg head made out of a carved piece of driftwood. Grants the performer the benefits the rustic hospitality feature with anybody that listens to a successful enough (DC 14) performance using the banjo.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "LlYxzy4p00D0ZX46","flags": {},"type": 0,"text": "A foldable grand piano that also doubles up as a boat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "ldi3fJ8zsMPxE5UL","flags": {},"type": 0,"text": "The mouthpiece of a flute. When held to the mouth, the rest of the flute is revealed. It’s ghostly blue and produces sweet but strangely sad notes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "AouIPb1EhL6v8FhX","flags": {},"type": 0,"text": "A small flute carved from bone. When played, it sounds like a massive pipe organ, and even the liveliest of tunes has an unnerving, ominous tone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "OTBnGgJVO8yRLltU","flags": {},"type": 0,"text": "Shoes of Tap: Tap dancing shoes that when you click the heels, as bonus an action, allows one to tap dance on any surface. Movement speed decreases by 10, because you are dancing, but ignore difficult terrain, can dance on water, and can dance on walls when tapping magic is in use.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "IGUHePJSwsE0Ixqz","flags": {},"type": 0,"text": "The Pipe Pipe: A smoking pipe that doubles as a playing pipe. If you smoke and play at the same time you can magically control the shape of the smoke.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "1YI0VGKKYnzC9f98","flags": {},"type": 0,"text": "Brass Plate: This large brass instrument wraps around you and acts as plate armor. When you roll a 1 on sneak the instrument starts playing mocking music as you move.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "nIQQhxxN0QGQk6KV","flags": {},"type": 0,"text": "A set of wooden spoons, ebony black with a glossy finish and silver inlay. After attunement, when the phrase ‘Spoonblades, to my aid!’ is called within a 15-foot area, the spoons transform into two spoon-shaped shortswords (Treat as a +1 weapon).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "wMSlVtyNWuUBkkGV","flags": {},"type": 0,"text": "A set of four elderwood carved string instruments: The Shining Violin, The Viola Melodious, The Morning Cello, and The Bass Sonorous. The four instruments have a deep amethyst luster, and golden inscriptions in an elvish script. The inscriptions tell of a tryst between the God of Forest, and the Mountain Goddess. The quartet hasn’t been played together in 500 years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "kEhVb6EDaFHzCE2a","flags": {},"type": 0,"text": "The Bass Bass. It’s a large contrabass that looks like a fish. If you press a button on the neck of the bass, the fish head will tell a bad joke.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "NpsQudrQcbSJD5OU","flags": {},"type": 0,"text": "The Brass Bass Bass. A Double Bass, also fish shaped. Playing the bass gives you the ability to breathe underwater when playing the bass, and advantage while doing so.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "CfrI9wBL946E7B3D","flags": {},"type": 0,"text": "The Brass Sass Bass Bass. An octobass carved for a giant, also piscine. When played with enough skill and force, able to deal structural damage to walls, doors, and other nearby objects. Will randomly interject with cutting remarks aimed at any nearby hostile creatures in their native tongue.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "XeJ8lKhD9O1yNaHj","flags": {},"type": 0,"text": "A jaw harp carved from a peacock’s bone. Can cast feather fall once per day. The performer has a faint image of a peacock’s tail appear behind them when playing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "NEirlcocysC5TV5W","flags": {},"type": 0,"text": "Pearl – An undersized lute that slowly (yet constantly) drips water while it is being played. The water is fresh and potable, but only drips while the music continues.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "xDx9sWmrWMBOZmlu","flags": {},"type": 0,"text": "The Golden Fiddle of Georg Ja. Legends say that he played this fiddle at the wedding of the ancient Queen Kershaw, banishing a demonic presence that had plagued her for a decade.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "IAVkAhsbjitIcRtQ","flags": {},"type": 0,"text": "The Silver Fiddle of Georg Ja. Legends say that Georg played this fiddle as Kershaw’s kingdom burned, swearing revenge on the armies that had destroyed his lover’s domain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "7dDE5zYDmbzIVKE1","flags": {},"type": 0,"text": "The Brass Fiddle of Georg Ja. Legends say that Georg never really liked this fiddle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "mtPTZ9OF4WgeP9gp","flags": {},"type": 0,"text": "Fae Flute: an intricate flute whose music is understood as language by Fae creatures. While playing this flute you have Sylvan as a language.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "8ihQOJtkznMIGIvS","flags": {},"type": 0,"text": "Dread Drums of Doom: Deep booming drums that make creatures uneasy. Enemy creatures have disadvantage on save vs. frightened condition. Creatures who are immune to fear/frightened condition are unaffected.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "yc2zoBAPZCUMfkDy","flags": {},"type": 0,"text": "First Mate’s Harmonica: An old harmonica engraved with a compass card and a variety of fish. When played on land it summons a fresh breeze smelling of salt and seaweed, putting everyone in a melancholic mood missing the sea. Playing the harmonica on a boat or ship of any size however grants the mercy of the sea. As long as the bard is playing the creatures of the deep show now interest in attacking the ship, an aft wind drives the ship forward and rogue waves lose most of their power before hitting the ship. When the music ends the effect slowly wears off and things return to normal over the next 30 minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "gZ9QvTiJWI80CJ5b","flags": {},"type": 0,"text": "An ancient set of pipes made from the hollowed out finger bones of a dead bard, with his soul still bound to them. When music is played from the instrument, listeners can faintly make out a gentle vocal accompaniment that perfectly fits whatever is being played.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "KF4U0Wj5lfUGO2qi","flags": {},"type": 0,"text": "A wooden, roughly carved hunting horn that still has patches of bark remaining on its surface. The deep, haunting sound it makes is dark, foreboding, and above all else, wild, with its notes echoing far longer than they should. Once per week, the player of the pipes may use their action to mark a creature. At the start of the player’s next turn, a pack of 2d4 spectral wolves coalesce into being near them and begin to hound the marked creature. The wolves pursue and attack the marked creature relentlessly, being completely immune to mental manipulation of any kind, and otherwise have the same stats as regular wolves. If a spectral wolf dies, it dissipates into the air for 24 hours, after which it reassembles itself within 100 feet of the target and continues its hunt. This effect persists until the marked creature dies or a week has passed, at which point the wolves give a final howl before evaporating and returning to the hunting horn, eagerly awaiting their next prey.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "7OgALH57FoBd0oZS","flags": {},"type": 0,"text": "An intelligent banjo of common, almost aggressively average craft. Insecure about its own worth and fantasizing of respect and honor, it refuses to sound like a banjo and instead sounds like a grand piano through sheer force of will.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "F6RPsnYovkDu6R5D","flags": {},"type": 0,"text": "A magical harp that causes whatever false legend sung while playing it to become true.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "KxL54IM1GJ6EjNwl","flags": {},"type": 0,"text": "A set of panpipes made from a tree struck by lightning. Playing the pipes allows the piper to subtly and slowly alter the weather to either induce or reduce thunderstorms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "KLb2dtNt6TdYdU1a","flags": {},"type": 0,"text": "The Dijj- a long, hollowed out greatclub, the Dijj makes a deep and oddly pleasant sound if blown into. If used as a greatclub, the strikes make powerful echoes, adding an extra 1d6 thunder damage to each hit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "E3leDD6B8cTawPoo","flags": {},"type": 0,"text": "The Paltry Psaltery- A diminutive dulcimer-like instrument, in the hands of a talented bard, this instrument can bring bad luck and meager gains for enemies. As an action once per rest, a bard can play the Paltry Psaltery and force all enemies he sees to make a Charisma save (DC 10+ the Bard’s performance modifier) or be subjected to the effects of the Bane spell. The effect lasts for as long as the bard plays, plus 1d6 rounds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "bCQrU6RZxSbXatss","flags": {},"type": 0,"text": "Old Man’s Shawm- This otherwise nondescript brown shawm has three wrinkled old faces carved into the bell. If a command word is spoken and then the instrument is played, one of the faces will open its mouth, creating a strange overtone. Anyone hearing the resultant music for one full round must make a constitution saving throw or gain one level of exhaustion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "dcIHhXUsf6hXkV8r","flags": {},"type": 0,"text": "A small drum with a symbol etched on the skin. Closer inspection reveals that the symbol is in fact a tattoo denoting membership to a now-defunct bandit group. (Things did not end well!)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "rrQhWgQxOY0n0BSR","flags": {},"type": 0,"text": "An ocarina made out of a large beetle exoskeleton. The sound is not dissimilar to a cricket’s chirp.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "NBKo7ZWCfkn1BZvD","flags": {},"type": 0,"text": "A 2-meter long string instrument with a thin slate body and metal strings (4 of them). Easy to play and far more durable than it looks. It has no name and nobody knows where it is from.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "Cr1KgK2jTBTlSvnh","flags": {},"type": 0,"text": "It looks like an axe but it’s completely blunt, hollow and riddled with holes. When swung it makes whistling sounds of different pitch – depending on the speed and direction of the swing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "Uf2Zgs3BgTvWk24o","flags": {},"type": 0,"text": "A didgeridoo. Spiraling around it’s length is an epic saga of a great war from history, but key details are false including the victors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "Zl7o3r2SCnVmi7Mv","flags": {},"type": 0,"text": "A shamisen that has leaves growing out of the tuning pegs. If removed, they grow back very quickly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "5X1EfCdBb4egVTZZ","flags": {},"type": 0,"text": "An aged fiddle made of bits and junk, the finish is patchy and the pegs might even be bits of hardened cork, but an upbeat tune played on this fiddle never fails to get people wiggling fingers and doing a jig. If the listeners resist, they make a Charisma saving throw and dance uncontrollably for 1 minute on a failed save.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "jJlcrBnlJdGhXudY","flags": {},"type": 0,"text": "A white Japanese-style flute delicately inlaid with strange runes of blue-black metal. Close examination will reveal that the flute is carved from a human femur. It always sounds beautiful, but breathtakingly mournful.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "SMTBEKuqgy95PWsj","flags": {},"type": 0,"text": "An old and damaged wooden flute, held together with bandages. Inexplicably, there is a small plant growing out of one of the finger holes. It produces surprisingly beautiful music considering its condition.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "LZQ4gIAJ7Brv9KVe","flags": {},"type": 0,"text": "Bamboongos: A set of bongos made outta bamboo, that when played, summons 1d4 musicians that will give advantage to any bard song or inspiration. For every musician above the first one that is summoned, the inspiration/song gains a +2 bonus, for a total of +6.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "xkHQ3cu3p27KPp1j","flags": {},"type": 0,"text": "A lute with the body made out a giant tortoise shell. Grants +1 to AC when not being played and is strapped to the bard’s back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "zgg4ClT5h0xWSQ3D","flags": {},"type": 0,"text": "A french horn decorated with black bronze dwarven runes that can only play melodies in minor key.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "AiNL8AXZ5QTEL5Rk","flags": {},"type": 0,"text": "A fiddle made out of pure white wood and engraved with elven runes that can only play melodies in the major key.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "Doc3yTeqEbr3m3QZ","flags": {},"type": 0,"text": "A harp with a body made out of an opaque golden glass that seem to glow as the instrument is played.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "8anIdsXetC3MVMac","flags": {},"type": 0,"text": "A bassoon with the bell joint carved into the shape of a dragon’s head that shoots smoke rings when played.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "OSv2pfsOFD9eOfOP","flags": {},"type": 0,"text": "A cornett with an axe blade attached to the lower half that allows it to be used as a handaxe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "ppJDU19Bk00RQOqe","flags": {},"type": 0,"text": "A shield with two metal sticks that can be taken out of the back. When hit, may either sound like a steel drum, a gong, or an odd snare drum, depending on which side of the stick the bard is hitting with, and where on the shield they strike.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "gwH71RBzw9Ov5uAK","flags": {},"type": 0,"text": "The Whistles of The Deep – A set of stone chimes, expertly crafted by dwarven musicians in absolute darkness. The expert player can, while maintaining a proper rhythm, cast stone shape once per long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "kpuyYKMsns5Jecpm","flags": {},"type": 0,"text": "A shoulder brace that can be inflated. When a pipe is inserted into the end, it can act as a small, high-pitched bagpipe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "7osTOGHpbA43Fl02","flags": {},"type": 0,"text": "A smaller lute that plays pluckier tones called a lute-kelele.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "2KlxVakbpiC0A4OD","flags": {},"type": 0,"text": "A banjo called the ‘Banjo of Truth’ that once per day allows the performer to play a bad country song to cast one charge of Zone of Truth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "b8rtRFxzITq5QmEB","flags": {},"type": 0,"text": "A bedazzled flute called a Jewel that blows out different scented vapor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "0ujzF4S0snqC79uS","flags": {},"type": 0,"text": "Boots of the Dawn Chorus. A collection of bellows, whistles and trumpets adorn the soles of these shoes. Each dance the bard performs sounds like an ethereal birdsong. However, when the bard is fleeing from battle, it sounds a lot like a gaggle of honking geese.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "UFfpL4JSKPot5f88","flags": {},"type": 0,"text": "A magically enchanted Glass Harmonica; when picked up it will float in front of the musician and start to spin as fast or slowly as the musician asks it to.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "3ut6D7UpsENKJ7U6","flags": {},"type": 0,"text": "A shamisen that is always cold to the touch. When played, the leaves fall off every tree within a 100′ radius.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "tWg26OpN0fGQi0dp","flags": {},"type": 0,"text": "The squire’s hurdy-gurdy: the soul of the squire who last owned this instrument is bound to it. When it’s played, a ghostly voice sings praise of the nearest warrior deemed worthy (with varying degrees of accuracy).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "0ZAb0TEoOUYHXj2b","flags": {},"type": 0,"text": "A lyre that sounds inexplicably familiar to everyone that hears it. No matter what song is played, it always makes the listener feel nostalgic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "eu5LAddHrqMDpXL6","flags": {},"type": 0,"text": "The Thunderhorn: A horn with a polished white-gold exterior. No matter how hard you blow into this horn, it is always comically loud.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "gPOEdKHCpS0PSOJI","flags": {},"type": 0,"text": "A whistle that only people you choose can hear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "6yLadpve9tqzzCYk","flags": {},"type": 0,"text": "A tiny brass bell wrapped in silk cloth. When the cloth is removed, the slightest disturbance unleashes a deafening ring.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "KJqBPnhH4pYO0jSy","flags": {},"type": 0,"text": "A 15ft Alphorn that when blown summons icy winds and frost. Oddly enough, it also causes a chance of summoning a St. Bernard with a small keg of brandy around its neck. (Roll a d20, if natural 20, dog is summoned.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "8P1T67HK7ZrZXDsp","flags": {},"type": 0,"text": "A mountain dulcimer made of black locust wood. The sound-holes are intricately carved in the shape of stars. It re-tunes itself on clear nights.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "d6qVN608RH0mWjbm","flags": {},"type": 0,"text": "A lyre that suspiciously resembles the description of one belonging to a certain sun god. It seems to glow with radiance when played. Creatures associated with the moon visibly cringe when they see it, as if they do not like the thought of it’s existence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "NfN1k2jIvmw0LZtE","flags": {},"type": 0,"text": "A hurdy-gurdy made from darkwood, with enchanted strings that produce illusions while being played. The illusions are clearly illusions, and won’t trick anybody, but are entertaining nonetheless. The form of the illusions range from a tiny ship sailing across a wall, to sapling growing out of the floor. The illusions are always transparent to an extent, and appear almost holographic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "8Jq0EU4ex5FD1ZcS","flags": {},"type": 0,"text": "The Phoenix Egg – A beautifully constructed Red xun, said to be made from the egg of a Phoenix. It is said that, if it is played correctly, it will restore those who die around it to life (mimicking the effect of the revivify spell).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "JS7iQ2ormTQnw9v3","flags": {},"type": 0,"text": "An Upright piano that is actually a highly mobile construct built with adjustable legs to be able to move in different terrain. If the piano is played badly or a less than favorable song is played then the constructs personality will take over and it will slam the lid shut, possibly on the musician’s fingers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "QM1G2Qb3wf9rKKAT","flags": {},"type": 0,"text": "A string instrument created by and for Elven musicians. The strings are made of specialized bowstring. When they are plucked in the right way they can shoot an ethereal arrow, which deals sonic damage and leaves a ringing in the targets ears.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "RIUfUCDluaLaGLsx","flags": {},"type": 0,"text": "The Dragpipes: A set of bagpipes where the bag itself resembles a dragon’s skull. The horns are exaggerated to form the reeds while the player blows through the mouthpiece connected to the back of the neck. The sound of the Dragpipes mimics the roars of different dragons so the player can convince or cause frightening presence to people making them think there is one, or many dragons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "CJFHjTvmoGMU4xA8","flags": {},"type": 0,"text": "The Barbarian’s Cello: A cello carved from ironwood by dwarves. Its music, when played correctly, instills resolution, confidence, and defense in others.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "wSdkdCa97Wdkrq9y","flags": {},"type": 0,"text": "Conch Shell of the Officer: Legend says that this trumpet-like instrument was used by the Captain of the Guards in one of the ancient merfolk kingdoms. Used to rally troops to protect its nation. Sometimes it will drip out water, even when it is completely dry. It is inscribed with the words ‘take me up’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "CrGbVG819LO6l6y6","flags": {},"type": 0,"text": "Fairy Bell: A tiny bell (not fairy-tiny, but regular human tiny) formed from silver and bronze. It has three icons on it. The longer it is rung in rhythm, the more cumulative the effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "aUZJ5mmQhTKwaGl5","flags": {},"type": 0,"text": "Harp of Hades: Necromantic magic flows off this instrument. Though it looks like any angelic harp, its music has been known to drive people to depression, sorrow, and madness. Any necromantic magic in the area increases in potency. Those unfortunate to hear its song are likely to see visions of horrifying events that they never knew about, such as the murder of a loved one that was disguised as a natural death or a repressed memory.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "wC8BQrzzD3yAOxOA","flags": {},"type": 0,"text": "Marimba of the Wind: Under each tone bar is a secret compartment, perfect for a rogue to hide things. It also seems to bring impossible good luck to the player, though this cannot be proven.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "wzdFm3zLCl4mycyi","flags": {},"type": 0,"text": "The Triangle: If arcane words are invoked (which can be seen inscribed on the triangle if exposed to temperatures either hot or cold strong enough to kill a man), the center of the triangle becomes an invisible dimensional portal, like a bag of holding.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "WfXpqnxrWXmR66mu","flags": {},"type": 0,"text": "Organ of the Dreaming Land: When played, the nearest sleeping person will begin dreaming of the circumstances around the player. It cannot be played by anyone not of noble birth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "g4hFP0PseOVkCgC0","flags": {},"type": 0,"text": "Drum, That Which Calls Thunder: A drum of unknown origin. It appears to be made from traditional methods, with clay and perhaps crocodile skin. But there is something more ancient about this drum that you can’t quite put your finger on. It turns any attack back toward the source (like turning back arrows to the people who shot them).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "pUe4WvQua7DcnOW2","flags": {},"type": 0,"text": "Perfect Stillness – This strange instrument appears to make no sound when played; however, all those listening become hyper-aware of all of the sounds around them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "C6FupsHRwLSfiWV5","flags": {},"type": 0,"text": "The Master’s Desk – An exquisitely smooth guqin, carved of cherry wood and perfectly tuned every time it is uncovered. Believed to have belonged to Guit Prox, the ancient Minotaur sage of lore.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "tpyA98jaG1sMNJck","flags": {},"type": 0,"text": "The Bann’s Fiddle – A light green Fiddle with a bow like a sapling, it is impossible to play the Bann’s Fiddle sadly. Every song has an upbeat, cheery tone. When sad songs are sung on the fiddle, there is a strange magic that turns them happy by the end, resulting in a strange retelling of many tragic sagas.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "MuVO9uhBSaQtN2JU","flags": {},"type": 0,"text": "Red Chuk – A small red box with a wooden handle, the Red Chuk creates an impressive percussive sound when struck. Anyone playing has advantage on any persuasion or performance check to act in accordance with courtly formalities for the next hour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "AfAaJbrVfdqC8jEG"}
