{"name": "Artifacts of Great Power","description": "One hundred artifacts of amazing power for villains to possess and PCs to destroy. Artifacts are capable of devastation on varying scales, but have a specific weakness to destroy them.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "WIJagN6eqMum8lfb","flags": {},"type": 0,"text": "Orb of Planar Melding: This orb allows the user to overlap planes of existence through a complex ritual. Whether razing cities by combining it with the plane of fire, or using it to open up the world to an army of demons and undead, the scale provides dangerous power. Destroyed by: utilizing the orb to combine opposites such as the Positive and Negative Energy planes, or Feywild and Shadow Planes together, the artifact will implode taking a radius of 200 ft with it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "nl3Uufc41FKfSP0l","flags": {},"type": 0,"text": "Ark of Famine: At first glance, this wooden box appears much like a child’s coffin – a long wooden box, completely unadorned, full of sand and designed to be carried by two pallbearers using handles over the shoulders. However, the Ark houses the collective spirits of those killed by hunger and crop blights long ago. Drawing on these spirits, the Ark consumes any and all crop or plant matter in a maddened hunt for nourishment.Destroyed by: Wherever it goes, any plant matter or food within 300 feet is destroyed and cannot be recovered. Prying the Ark open and filling it with water will destroy it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "wy2zhlalJL4yo3NR","flags": {},"type": 0,"text": "Heart of Magic: The still beating heart of one of the most powerful sorcerers who ever lived. The magic in their blood still powers the heart. The heart can be used as a spellcasting focus, and when used as such, all spells made with the heart count as two levels above the level of the spellslot used. Flaw- the heart is still unstable, and all physical damage done directly to the heart causes the heart to violently react. When this happens, the heart gives off a violent blast of magical energy, dealing radiant damage equivalent to the original attack in a 20ft radius sphere. If attacked by necrotic damage this ability does not trigger, and the heart takes double damage.Destroyed by: The heart has 100 HP total. If the heart reaches 0 due to physical damage, it violently collapses, dealing 10d10 radiant damage in a 300ft sphere. If the heart reaches 0 due to necrotic damage, the heart slowly begins to shrivel up, until it is about the size of a grape, at which point it collapses into dust.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "9MSa9Fl9XKYzhzLO","flags": {},"type": 0,"text": "Eldritch Rod: Created by an unknowable primordial deity, it appears to be composed of dark oak into the shape of a long tendril. While the wielder may use it to have an additional 10 spell slots, any spell cast through it will have a wild effect to it of an evil nature. The woes of the user do not end there however, the rod with also wrap around the wrist of the caster permanently until a way to remove it is found. The longer one is attached, the more evil and chaotic in nature they will become, slowly connecting their mind to that of the incomprehensible deity that created the rod. This link could have it omniscient benefits however if the user seeks to please their new god.Destroyed by: The cursed wielder must cut off the arm that is binded, burning it along with the cursed artifact. If it is simply burned without sacrifice the character will have angered the deity, if it is not purified in flame the mental link will remain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "uEMYZ7Kd28Adqxvz","flags": {},"type": 0,"text": "Gravestone of Decay: By chiseling a name of a person, place, or concept into the stone, it will begin to wither away across the material plane and die. A person will take minutes, whereas a city could take months or years, and entire concepts (freedom, justice, etc.) could take centuries.Destroyed by: The only way to destroy it is for someone to selflessly carve their own name into the stone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "Kjy2LTJEf9oZVukH","flags": {},"type": 0,"text": "The Key: It looks and feels very much like a normal key, but emits an intense magical aura. The key can open any door in existence. It can even be used, to create and open a door out of thin air that leads to where it’s user desires. It’s more than a mere teleport. It can be used to enter a parallel room in which the user is able to see the world without anyone seeing him. He can’t collide or interact with anything in the “real” world though. Even traveling between universes and realities is possible. The magical power can also be used to cast spells.Destroyed by: Since once you’ve unlocked a normal door, it stays unlocked, the doors that the Key opens stay open until you have left back through the door you have created. Thus, the only way to destroy the Key would be to open the room where you are unable to interact with anything, and then leave the key in that room, and then close the door. This would render the key stuck in a place which no longer exists. Bonus points for going into multiple layers of that room and leaving it deeper.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "BiR6nbkVS3dCNxfq","flags": {},"type": 0,"text": "The Rift Sigil: A sigil of an arcane rune, which, when placed on a surface creates a hole which expands 1d10 feet in all directions each week. The hole is an extradimensional rift which consumes objects and creatures that it encounters: the passage is one way, and creatures and objects that pass through it are destroyed. A creature may willingly enter the hole: a creature that does so survives the trip, as their willpower keeps them from being consumed by the void on the other side. They take 1d10 psychic damage per minute while here.Destroyed by: A runestone exists inside this realm: it is sentient, and has the following statistics. Rift Sigil Rune: AC 18, HP 100, SPD 0 S:10 D:10 C:18 I:22 W:22 C:22 Damage Immunities: Bludgeoning, Slashing, and Piercing damage made by nonmagical weapons, and psychic damage. Actions: At will: Confusion, Slow, Eldritch Blast (3 Blasts) Intelligence is the spellcasting ability for these spells.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "lCO5eRsDfTAUb0ZK","flags": {},"type": 0,"text": "Spear of Thirst: This spear is +4 to hit and does 1d12 piercing damage plus 1d12 necrotic damage as it sucks fluids from the victim’s body. On a critical hit, the victim must make a DC 15 CON save or die, drained to a husk. The wielder gets 1d4 temporary HP each time it kills someone with a spear.Destroyed by: Submerge it in the body of a radiant creature like an angel. Or an undead: it can’t drink from the undead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "7EXq20GUtNMqaSFT","flags": {},"type": 0,"text": "Heart of Gold: An artifact that if the user holding it kills an unwilling good oriented user, all evil oriented characters in the nearby vicinity have a one in (number) chance of becoming increasingly good natured depending on how much good of a person the sacrifice was (up to DM’s discretion). However, this also works the other way around. Introduction: The protagonist could be either extreme good or extreme evil character killing like-oriented individuals. The PCs then find out about the heart.Destroyed by: The heart loses HP for each willing participant (depending on how much of a good or bad person they were). The heart originally starts with 1HP but increases with every unwilling participant of the ritual by 1 point.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "3t1iKJN70871tQeo","flags": {},"type": 0,"text": "The Orb of Omniscience: Like a crystal ball with telepathy but anybody can use it any number of times per day. Best not to be destroyed, best if the party takes it for their own use.Destroyed by: Can be melted in lava.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "tBye0VZMg6VF8yf4","flags": {},"type": 0,"text": "Sarcophagus of Rejuvenation: This ancient sarcophagus has incredible regenerative properties. Spending a short rest inside it restores all hitpoints and cures minor diseases. Spending a 8h inside of it can bring a man back from the brink of death, regenerate limbs and halt aging. Spending time inside of it without any injuries starts to drain a person’s humanity and they move closer to chaotic evil alignment.Destroyed by: The sarcophagus power can be disabled by placing a wonderus item of legendary power that’s intent is to cause harm. After that the sarcophagus is able to be destroyed by a magical weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "dB1ktQN7yp8iq6YR","flags": {},"type": 0,"text": "Metallurgist’s Bible: This ancient book conveys upon it’s user the ability to make masterworks of war. Any weapon crafted with this artifact’s knowledge does double the amount of damage dice (1d6 shortsword –> 2d6). To retain this feature, the weapon must be soaked in the blood of an ancient red dragon once a year.Destroyed by: For every point of damage it takes, it immediately heals the same amount, and conjures a spectral weapon that seeks out it’s attacker and does the same amount of damage back. The only way to destroy it is to burn it in the fires of the forge where it’s first weapon was created.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "Se1ceYaJVijOIm6O","flags": {},"type": 0,"text": "Clockwork Heart: While in the process of creating the Modrons, Primus created a clockwork heart. Since this heart wasn’t useful to making the Modrons he set it aside and forgot about it. In order to attune to this artifact you must hold it pressed to your heart during a short rest. The artifact slowly enters your chest and fuses with your heart. Unattuning kills the person because the artifact can’t be unfused from their heart. While attuned to this artifact you have advantage on death saving throws. Also you can open up a portal that leads to the plane of Mechanus or back to the material plane from Mechanus once per day. Modrons recognize Primus’ creation and will avoid fights with the person attuned the clockwork heart unless they are attacked. Once a creature has attuned to the Clockwork Heart, they begin to gradually lose the ability to feel emotion and instead become more logical. The process is slow, but speeds up significantly whenever an aspect of the heart is used (such as opening a portal to Mechanus or making a death saving throw only because of the advantage provided by the artifact). At the end of the process, the creature will be completely unable to experience any emotion and will become a logic-centered being.Destroyed by: The heart most be brought to a plane of chaos, tainting it. Once the heart is tainted, it can be destroyed as a normal object.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "JWvWI3M6Opc534FB","flags": {},"type": 0,"text": "The Ring of Infinite Wisdom: While wearing this ring you can tap into some of it’s infinite wisdom by sucking your thumb. While you are tapping into the ring’s wisdom in this way your current wisdom score increases by 10 up to 30 temporarily, and you even receive premonitions of the future.Destroyed by: The ring can only be destroyed in a 10 minute bath in the tub of the demon prince of foolishness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "qpzDTFAYGNCdBmgd","flags": {},"type": 0,"text": "The Brain Staff: A long wooden staff with a pink orb on one end. It can efortlessly control the minds of any monster it’s user desires, and is able to control an infinite number of creatures at once. The user can give it simple instructions that the beast will follow until the day it dies, and keep commanding it.Destroyed by: The Staff is also able to control the minds of creatures emotionally bound to people, like pets and familiars. However, the person who the creature was bound with can attempt to break the spell by making the monster recognize him/her (which would take some time and Wisdom checks). When that happens, both the staff and it’s user are overpowered and explode in a 300 feet radius.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "hlRuZpoxMzA8Meui","flags": {},"type": 0,"text": "The Infinite Locket: This mysterious pendant, when viewed, takes the viewer to a realm of their own memories, where they relive their favorite memories. The pendant slowly drains them of their life until nothing remains.Destroyed by: Must be opened and viewed to work. Because it can’t move, it’s very easy to become lost. If somebody closes the pendant, the spell is broken, but the victim is left with a feeling of longing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "1lSKBJceJtVUBCNI","flags": {},"type": 0,"text": "The Mark of Ancestry: This wrapping bonds to the user, allowing them commune with all those who have bore the mark before. They lend the user their wisdom and muscle memory, allowing the user to perform feats beyond that of their skill.Destroyed by: The mark technically steals a portion of the user’s soul when used. Additionally, if the mark becomes unbonded from a user, that user can never bond with the mark again, as their soul has already been collected.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "i7zKl9g3x440g1vV","flags": {},"type": 0,"text": "The Machiavellian Mirror: The Machiavellian Mirror allows viewers to cast spells through it or freely scry on any location or being the viewers are knowledgeable of. The mirror itself can also cast various mind control spells on targets visible in the mirror at the user’s behest (DM’s discretion on which and the number of uses per day). The insidiousness is multiplied because the mirror’s control is such that targets may not realize that they were influenced by a spell, especially if they were only instructed to do reasonable things. The mirror can even be used to disadvantage the charisma and wisdom saving throws of targets visible in it if needed. Other Suggestions: The Machiavellian Mirror’s owner should be intelligent and paranoid, someone who takes all sorts of mundane and magical precautions to prevent the mirror from being visible and even having a reflection, especially when not in use. The owner should also take precautions to make sure they are knowledgeable of even potential threats, and that they are visible and findable at all times (e.g. command a ring of spies).Destroyed by: If the Machiavellian Mirror can “see” its own reflection clearly, (e.g. another mirror or smooth surface polished finely is brought into close range in appropriate lighting conditions), the mirror spontaneously smashes itself into smithereens and becomes useless. Viewing another mirror through the Machiavellian Mirror does not count.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "9z2N24hejuXv0apu","flags": {},"type": 0,"text": "Seed of Iron: As the first seed of the first iron-wood tree, the small seed holds the power of a strong nature deity. Whenever the seed is allowed to touch dirt, the seed immediately burrows into the earth. In a 2000ft radius, a forest of iron wood trees will begin to grow. They require no water and will dig through anything in their way. When the forest is done growing, a small tree made entirely of iron will appear in the center of the forest. In a year it will produce another seed of iron. The forest is neither good nor evil but flows with wild magic and may become home of fey creatures if given time.Destroyed by: If delt 75 points of damage the seed will be destroyed. When the forest is in the possess of growing the seed will stay 30 feet below where it was planted, surrounded by a hostile plant creature made of ironwood. If killed , the seed with die and the forest will die with it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "p01WsTlFICkU1MjM","flags": {},"type": 0,"text": "The Dionysus Rod: The wielder of this item can loosen the inhibitions of anybody the wielder sees fit. Promiscuity, risk, eccentricity, and general impulsiveness. The more the rod is used, the more the wielder slips into madness, eventually being unable to control the rod’s powerDestroyed by: It can only be broken by those who have broken free from the rod’s will. Once you restrain yourself from the rod’s call to impulse, snapping the rod in two is as simple as finding the holder.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "yonvq6b7svuOQGx9","flags": {},"type": 0,"text": "Chalice of Plenty: A solid gold wine chalice encrusted with a diamond and ruby rim. The one who possesses this item will find themselves increasingly successful in matters of finance and trade. The chalice influences its owner to become increasingly gluttonous in all aspects, to the point of eventual demise.Destroyed by: The curse can be lifted if its owner uses the wealth gained strictly for benevolent purposes, which reverses the effect. To fully destroy the item, the wielder must adopt an ascetic lifestyle and resist temptation until their death, upon which the chalice will melt down into liquid gold and evaporate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "3IidKfznhGjl4aqz","flags": {},"type": 0,"text": "The Crown of Hosts: A silver crown with six vertical ornate peaks that reach straight up one foot, each inset with a translucent green sphere. Each sphere houses the trapped spirit of a spellcaster that slightly glows within. The wearer of the crown must be a spellcaster and can command the spirits to cast whatever spells they knew in life. This can be potentially devastating, allowing 6 actions, plus the spellcaster’s, per turn. The wearer knows the power level of each of the spirits, but does not know the exact number of spells they had memorized when they died. The trapped spirits regenerate spells at the usual rate afterwards.Destroyed by: If any of the trapped spellcasters uses its last spell, it is immediately freed. The soul of the wearer of the crown is sucked into the vacant gem and becomes its new slave.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "CnPN7vx4TJyN6q4a","flags": {},"type": 0,"text": "The Cornucopia Of Plentiful Harvest: A small wooden cornucopia, which, at the dawn of each day, fills itself magically with whatever food the possessor desires. Any food summoned this way to the cornucopia is taken from somewhere else in the world, and is magically enhanced, giving a +4 bonus to a stat based on the food. (Dm’s choice on what food will give what stat)Destroyed by: Placing food into the Cornucopia removes its magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "4sEYmSMvvXOSjLWY","flags": {},"type": 0,"text": "The Most Humorous Jest in the Plane: A small scrap of non-magical paper, which has a Jest written upon it. When it is read by a user, it causes them to be consumed by unstoppable laughter which continues until their death. Upon viewing a single word of the Jest, the user must succeed at a DC 15 will save or read the entire Jest. The user reads the Jest in their native language.Destroyed by: The Jest is easily torn, if the user can pass a DC 20 will save (read the Jest on Failure). The Jest only loses the ability to cause mayhem if torn into multiple pieces which cannot be reassembled (E.g. tearing the Jest into 10 pieces, and then burying them at various locations).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "P8kBWjHSNSH8BYoJ","flags": {},"type": 0,"text": "Eroded River Rock: This mundane looking flat rock has been washed smooth by eons of swift rapids flowing over it. It still drips as if recently removed from the river that created it. It has been imbued with the power and fury of the river. When water is dropped onto it, the rock accelerates the water into a powerful stream which has the power to erode any non-magical surface. Combined with the Create Water spell, the effects can be devastating. Locks cut through in seconds, buildings eroded to the foundation in minutes, landscapes sculpted in hours, mountain passes cut in days. Used offensively, the jets of water can do serious damage to anyone foolish enough to get in the way.Destroyed by: If Destroy Water is cast upon it while it is not carried, the stone will erode into a fine sand. Alternatively, placing the stone back into the river where it was created will cause the stone to erode.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "aAgvlHb1QshKsmok","flags": {},"type": 0,"text": "Devil’s Crown: Summons and enslaves fiends. Radiant damage is doubled against the wearer.Destroyed by: Exorcism.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "34y5XaPT9PHxQUYO","flags": {},"type": 0,"text": "Maab’s Scepter: Summons and enslaves Fey. Cold Steel deals double damage against wearer.Destroyed by: Iron Cage, Iron Axe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "AZQPiq2Cwq5poOLg","flags": {},"type": 0,"text": "Ice Queen’s Coronet: A slow creeping madness envelopes the wearer. Ice powers and penguin henchmen named “Gunther” come with it.Destroyed by: Volcano, Fire Elemental Temple (bonus points if you keep a shard to destroy no.4 with it.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "aChLS3JOgBq2PEO4","flags": {},"type": 0,"text": "Fire King’s Daughter: A bottle stores a female fire djinn princess. Control of fire and summoning fire elementals.Destroyed by: Sink, Glacier, Water Elemental Temple.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "mwy7g3BZU5bEVMER","flags": {},"type": 0,"text": "Wood from the Handle of Death’s Scythe: Renders the owner safe from Death. No matter how much damage they take, they will safely return to normal in 24 hours, with 1 HP. The piece of wood, when held, gives the user a sense of cautious invulnerability (re: doesn’t make ’em go crazy with “I’m INVINCIBLLLLEEEE!”). It’s a small, pebble-like smooth dark brown hunk of wood, as it has been through countless owners throughout the beginning of time; if examined closely, flecks of what could be described as “black glass slivers” seem to pulse through the wood.Destroyed by: the more “resurrections”, the less memories the user has (a set number between player and DM, which can go up any number between play sessions, but cannot go up if the Wood was used during a play session). When the user cannot remember who they are, they are turned into an unsaveable, unresurrectable zombie, that can only be killed by normal means (re: immune to magics).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "ZCUOJIpYscASimip","flags": {},"type": 0,"text": "Time’s Hourglass: This item bonds to the first person to touch it. Once that person dies, the item becomes able to bond again. The user may activate the hourglass, and a small portion of sand will run out, allowing them to perceive time in reverse, and thus, changing the future.Destroyed by: There is a finite amount of sand in the hourglass. With each use, more sand runs out, and when the last grain falls, the user ceases to be.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "3aN0NrDtUPpUCvxh","flags": {},"type": 0,"text": "The Zealous Mace: this +1 mace does an extra 2d6 damage to any fiendish or abyssal creature. If the welder kills a fiendish of abyssal creature with this weapon, they must make a wisdom save (dc 15) or fall under the mace’s power. The next time they see any evil creature, they will be compelled to strike them down. In addition to this, the mace become a +2 and does 2d6 damage to any evil creature. Upon killing an evil individual, they must make another wisdom save. If they fail, the mace becomes a +3 weapon and the wielder is compelled to kill any neutral or evil creature it sees from there on out, behaving more like a bloodthirsty monster than a humanoid. If they kill 20 creature, the transform into either an imp or a dretch (their choice) and can never use the mace again.Destroyed by: The mace has no power over someone until they kill a fiendish or abyssal creature. After this, removing the mace from the person’s possession and casting lesser restoration will cure them. After they kill a neutral creature, a greater restoration spell will be needed. However, they will have an urge to get back to the mace for 1d6 days after a restoration spell is cast.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "ESwCfH4wkadc8aUm","flags": {},"type": 0,"text": "The Statue of Ananamura: This 3 foot pure-silver statue of a dragon shines with radiance in the day time and any aristocrat would love to have it. But this is not so at night. One the first night the statue is in a new residence of someone who willing accepted it, the dragon might have appeared to have moved slightly, taking on a permanent pose in the morning. The next few, the own will hear whispers and see things moving in the shadows (must make a fear resistance check nightly, dc 11). After 10 days, the dragon fully comes to life at night and tries to consume any living being in the home. Killing this dragon will work but the statue will reappear unharmed at sunrise, and the dragon will wrathfully sneak out the one who killed it the next night.Destroyed by: If the dragon is awake, you must give the statue away to someone else. If it not awake, you must bury it in an area affected by the Hallow spell. Digging the statue up will cause the process to start again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "dR5gHfwcNrHGITuU","flags": {},"type": 0,"text": "The Fragile Urn: An ornate urn filled with ash, the user may call upon a deceased ancestor and ask a singular question. For each question asked, a crack grows onto the urn. This process repeats as cracks continue to appear in the Urn.Destroyed by: The integrity of the Urn will eventually be compromised from all the cracks and will break, rendering it permanently destroyed. No one knows how many cracks the urn can withstand before breaking.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "i9PnxncS6AWKZPYD","flags": {},"type": 0,"text": "Footwear of Eclectic Gaits: A normal pair of footwear, or so it seems. The wearer must attempt a dexterity roll anytime they wish to walk (difficulty 6, and increases by 1 each day, to a maximum of 15). If the roll is not attempted, or is unsuccessful, the wearer is cursed to a walk in a very strange manner (add difficulty to social/dexterity rolls at the DM’s discretion.Destroyed by: The only way to destroy this artifact is to fully submerge the wearer in water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "q06ywtjEDvtYaf7N","flags": {},"type": 0,"text": "The Lunar Sickle: A sickle with a glowing white blade shaped like the moon, and an embelished navy blue hilt adorned with marble stars. Requires attunement, and can be attuned to by any class. Unlike standard sickles, if attuned, it deals 1d10 melee damage while still being Light and a simple weapon, and can be used as a spellcasting focus. Once per day if attuned, user can activate its Lunar Shine ability, revealing the moon as huge and bright in the sky, sending 10d10 radiant damage in a 20 foot radius, affecting only enemies within that radius.Destroyed by: The Lunar Sickle can be destroyed only by a 1d4 hour long ritual to purposely destroy it, which must begin at midnight. this ritual must be performed by someone attuned to the item.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "fbrFxkLFdfVZoYMD","flags": {},"type": 0,"text": "The War Fan of Admiral Huztin: Enchanted with the soul of a fused elemental, the war fan summons violent storms over any target area. Should the war fan approach its own storm, a 100ft rad. circle of perfect weather surrounds it.Destroyed by: Used to conquer countless pirates at sea, the admiral doomed its power to the water depths in case of his defeat– the fan disintegrates when submerged in water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "e1bVV9chlnbmku8f","flags": {},"type": 0,"text": "Bracelet of Mesnoarh: Seven large ovals of onyx set in forged gold adorn the ring of Mesnoarh’s bracelet. The bracelet shrinks tight around the arm of user, siphoning life energy to maintain the heavy cost of a demon trapped in each stone– their names scribed in the gold.Destroyed by: To remove the bracelet, the arm must be severed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "Ne3hLqyc02sXE6hF","flags": {},"type": 0,"text": "Helm of the Chisolm: Deep beneath the dunes of Shiftine, where the Chisolm plains once lay, graze forever still 1,000 head of templeforged bull. Siege machines of awesome destruction, these creatures wait for call towards the next crusade by they that don the Helm.Destroyed by: Only a martyr can extinguish their path.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "sTnWMnAANbeQhhKU","flags": {},"type": 0,"text": "The Hugfeld Globe: Mysteries surround this articulate map of the world, as fraud and misinformation frame almost every border of its model. What is known for sure, to much disdain far and wide, is that every line drawn upon it erects a wall.Destroyed by: Luckily, the accompanying Hugfeld Pen has been missing for quite a while.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "nmIo03dXD8soVVpp","flags": {},"type": 0,"text": "Unlucky Rabbit’s Foot: This dessicated lagomorph appendage is highly saught by hags. Sliced clean from a forest spirit with a necrotic blade, the foot leaves blight in its steps with every hop.Destroyed by: The foot can only be stopped by returning it to the spirit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "Y0vgkI7IsekS06LI","flags": {},"type": 0,"text": "The Book of Togrutl: A book written in a completely alien language that few beings in reality can read. A creature can decipher the language of the book if he/she spends 8 hours a day studying the book for one year and passes a dc25 intelligence check. If a creature who has successfully deciphered the language reads the book he/she unlocks the power to travel between planes of existence with a thought.Destroyed by: The Book of Togrutl can only be destroyed be a specific magical furnace in an ancient library.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "0zYv4oJurtnoEe4M","flags": {},"type": 0,"text": "The Dagger of God Killing: This weapon is a +3 dagger. If you speak the name of a god while you are on the same plane of existence as them they become mortal for 24 hours, this ability can only be used once per day, while a god is mortal in this way any attack with this weapon against them deals an extra 3d6 necrotic damage.Destroyed by: They say the Dagger of God Killing can only be destroyed by a powerful force older than the gods themselves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "26wQo7MmFCj53hDX","flags": {},"type": 0,"text": "Soulrender: The Soulrender is a small iron sphere with necromantic sigils and black diamonds on the outside. If a humanoid spends 6 hours chanting an incantation while holding the Soulrender, the sphere emits a magical blast that goes through all nonmagical barriers and most magical barriers in a 600 foot radius. Any humanoid within the blast has its soul torn from it’s body and dies, the blast is otherwise harmless. The Soulrender survives the blast, the person who activated it doesn’t.Destroyed by: The Soulrender is indestructible unless it is robbed of it’s magic by an extremely powerful healing spell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "A8gG6yiAdWedak2U","flags": {},"type": 0,"text": "Doom Moon: All ability modifiers receive a -1 penalty that cannot be removed within the moon’s area of effect. Those who pray to the moon are unaffected by this drain, but doing so permanently charms the supplicant to treat the moon cult as friends to be trusted and allies to be obeyed. (This effect overcomes usual resistances to charm) An ominous moon that never rises or sets is draining the mental and physical vitality of those in its range to fuel the birth of a false god. There is quite a bit of time before the moon-egg hatches, but scholars of esoteric mystery believe the draining effect will become worse, and moon will eventually draw in every living thing for a thousand miles with a siren call so they can be drained to nothing.Destroyed by: Kill the moon! The cult’s base is an ancient pike-like tower of wondrous metal directly below the false moon. The spire fortress is the perfect needle to pierce the shell and puncture the embryo. The Resistance has perfected a bit of supermagic that can launch the whole building like a rocket. They just need someone to sneak in there and plant it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "nhthWgs3NG20VQKT","flags": {},"type": 0,"text": "The Wand of Endless Bubbles: A sickly green wand with a circle at one end. When swung in an arcing manor for the first time a spew of bubbles shoot out. The user quickly finds that the flow of bubbles isn’t stopping no matter how they move it after, and the rate they are coming out is only increasing at an accelerated rate. Each bubble deals one damage of a random type on whatever they pop upon.Destroyed by: While the User could simple abandon the wand, at the rate the bubbles are created they would quickly envelop the land it resides in. A temporary solution is to trap the end in a case of some kind that instantly pops the bubbles such as a sword sheath, sack, or wrapping of some kind. However, the container used would slowly dissolve. A permanent solution is to either destroying or deforming the ring through which the bubbles form, or finding a way to remove its magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "ikrEc1E7JPUhWkDa","flags": {},"type": 0,"text": "The Front Line: A shield that is 3/4 the size of who ever is wielding it. Grants +3 AC. While wielding it the creature can grip it with two hands and slam it into the ground to create a barrier that extends in a semicircle in front of them and upwards to from a half dome (dimensions are up to the DM). This barrier can absorb damage ( amount absorbed is up to the DM , I used 10 + 3*level). Attacks made against the barrier always hit. To maintain the barrier the weirder must not move.Destroyed by: The barrier is destroyed when enough damage has been done to it. The shield can be destroyed by by any normal means.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "iEPwJvwZaX1lnujM","flags": {},"type": 0,"text": "The Portal Wand: a wand with the ability to shoot little energy balls that create two-way portals, into anywhere the user wants.Destroyed by: Can be destroyed by making a ball cross a portal, overwhelming space-time, and teleporting anything in a 30ft radius around the wand into an unreachable pocket dimension.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "dmodBmAUbvkghzCV","flags": {},"type": 0,"text": "The Teleorb: a massive purple orb. Can be attuned to by performing an odd psionic ritual, and the person attuned to it can use telekinetic powers to control any willing creature or innanimate object with less than a tonne of mass.Destroyed by: Can be destroyed by making the user try to use the telekinesis on the orb itself, making both the orb and the user disintegrate in a million particles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "8f5hqBsO6HlJYIUi","flags": {},"type": 0,"text": "The DNA Sword: a sword with two razor sharp, helicoidal blades, that emit a faint green glow. On the other side of the hilt, there is a steel needle. The sword does 3d8 + 3 base damage, and stores the genome of the creatures killed with it. The needle can then be used in an egg, or womb, to fuse the baby’s DNA with one or more stored DNAs, leading to the birth of a hybrid.Destroyed by: The sword cannot understand hybrid DNA. If used to kill a hybrid creature, it will shatter, and release deadly radiation, growing massive tumors in any creatures in a 60ft radius.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "FDxABcKrGVbaIYew","flags": {},"type": 0,"text": "The Weeping Blade: This gleaming dagger shines brightly, the way someone’s eyes do before they cry. When it is drawn, it becomes covered in tears. These tears are a deadly poison, that can kill anything within a day. Even god’s have fallen to this weapon’s touch. Worse, once it becomes attuned to its wielder, it will always return to their hand. To wield this weapon, one must have known great sorrow, and must sacrifice something precious and irreplaceable to it.Destroyed by: The rightful wielder of the Weeping Blade must hold it while something happens that causes the wielder to feel nothing but joy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "F9PO6FuT4IXfRGC3","flags": {},"type": 0,"text": "The Cometstaff: Supposedly tipped with a piece of celestial iron, this staff grants its wielder power over the heavens, allowing them to summon storms, control the winds, and even call down lightning or meteors. Aside from making its wielder an unstoppable force on the battlefield, it can be used to water crops, or keep ships safe at sea. Indeed, those uses are what it prefers, and if only used for war and conquest, it may fail at a critical hour.Destroyed by: The Cometstaff must be brought to the very depths of the earth and be burned in the fire of a dragon’s breath. The dragon must never have seen the sun.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "WwUgwnIchhOs9elc","flags": {},"type": 0,"text": "The Unbreakable Buckler (Fallen Relic – AVERNUS/ABJURATION): As legend tells, this shield can never break. Even under the force of the Gods. +1 Shield. Can be thrown as an action (20/60), and will bounce back to the user who has attuned with it. Allows for the protection fighting style to be used for allies up to 20 feet away.Destroyed by: If brought to a holy Temple of Bahamut this item could be destroyed with a number of priests and a ceremony.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "elPmnLAayveQBWg3","flags": {},"type": 0,"text": "The Perpetual Chalice (Fallen Relic – DIS/CONJURATION): As legend tells, this cup can bring the holder’s wishes to life in exchange for something of their own. Twice per day, as an action the user attuned to this cup can spend 2d8 +5 health to ask the cup for anything using DM’s discretion on amount and size. The item asked for must be able to fit through the cups top.Destroyed by: If brought to a holy Temple of Bahamut this item could be destroyed with a number of priests and a ceremony.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "K3HRIiBeo5ogvTcz","flags": {},"type": 0,"text": "Sordid Sickle (Fallen Relic – MINAUROS/NECROMANCY): Legend tells of a mighty black sickle that can harvest fallen crops as if they were new, sometimes it was even told of it bringing those freshly dead back to life. The Sickle allows the attuned user to bring back freshly dead (1 hour) creatures back to life twice per day. However, if these creatures are not healed, or a DC 16 Medicine check is not made on them within the next hour after revitalization, they die again.Destroyed by: If brought to a holy Temple of Bahamut this item could be destroyed with a number of priests and a ceremony.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "zBQ0mviBIw8XkhuD","flags": {},"type": 0,"text": "Inferno’s Beginning (Fallen Relic – PHLEGETHOS/EVOCATION): Legends say this torch is what lit Hell itself ablaze. The Torch allows the attuned user to cast a spells for free using its 15 charges. DC 18. Continual Flame (1 Charge), Firebolt (3 Charges), Flaming Sphere (5 charges), Burning Hands (7 Charges), Fireball (10 Charges), Fire Shield (6 Charges), Wall of Fire (8 Charges), Delayed Blast Fireball (12 Charges).Destroyed by: If brought to a holy Temple of Bahamut this item could be destroyed with a number of priests and a ceremony.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "js21iJbTmWe1A8q7","flags": {},"type": 0,"text": "Seeker’s Stone Pendant (Fallen Relic – STYGIA/DIVINATION): Some legends say the wearer of this pendant can see through solid walls at will, penetrating even the mind. Allows the user to see through walls when activated. The pendant may be activated 3 times per day allowing the attuned user to see outlines of living things through walls, as well as hear conversations held. The user may also use this amulet to cast Detect Thoughts as normal, using a charge.Destroyed by: If brought to a holy Temple of Bahamut this item could be destroyed with a number of priests and a ceremony.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "Ad04MfG1AUetnMKu","flags": {},"type": 0,"text": "The Ambiguity (Fallen Relic – MALBOLGE/ILLUSION): Tale tells of an object that has no true form… none at all. This object when held by its attuned user can be transformed into any basic weapon, small items, or shield. It can do this 5 times a day. ALL MORPHS ARE TO THE DM’S DISCRETION.Destroyed by: If brought to a holy Temple of Bahamut this item could be destroyed with a number of priests and a ceremony.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "xl6fd9vkHp1Pr7zS","flags": {},"type": 0,"text": "The Crown of Madness (Fallen Relic – MALADOMINI/ENCHANTMENT): Legend tells of a crown that can make others lose their mind, possibly even control them. Allows the attuned user to cast Crown of Madness DC 20 up to 3 times per day.Destroyed by: If brought to a holy Temple of Bahamut this item could be destroyed with a number of priests and a ceremony.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "HFEctZHgpnBTcZtd","flags": {},"type": 0,"text": "The Adapter’s Helm (Fallen Relic – CANIA/TRANSMUTATION): The Legends say this powerful helmet can transform the material of anything living or not. Allows the user to cast spells, instantly, using its 10 charges. DC 18. Barkskin (3 Charges), Stoneskin (4 Charges), Flesh to Stone (8 Charges), Gaseous Form (6 Charges), Stoneshape (2 Charges), Major Transformation (2 Charges).Destroyed by: If brought to a holy Temple of Bahamut this item could be destroyed with a number of priests and a ceremony.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "DEKGIPW3HP2AT1gb","flags": {},"type": 0,"text": "Esintur: Esintur is a bone white magical longsword that requires attunement. While attuned to this weapon and kill a humanoid with it, the humanoid’s soul is trapped in the weapon. Esintur can hold multiple souls at a time and has two uses for the souls. Use #1 for every 10 souls within the sword weapon attacks with the sword gain +1 to attack and damage rolls.Destroyed by: If the person who is attuned to Esintur drops to 0 hit points, a soul is expended and he/she drops to 1 hit point in stead, when a soul is expended in this way it is destroyed forever. Esintur cannot be destroyed be outside means but if it collects 52 or more souls the sword immediately explodes, dealing 10d10 radiant damage in a 30 foot radius.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "cNPAvXYdOBKJQ3k2","flags": {},"type": 0,"text": "Crown of the Faceless King: A golden crown inlaid with rubies, requires attunement. A person who is wearing this crown and is attuned to it can sense the deepest desires of any humanoid within 20 feet.Destroyed by: The Crown can only be destroyed if the person who is attuned to it and is wearing it is beheaded to the cheers of a great crowd.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "5rPWe1fG90UXhaWy","flags": {},"type": 0,"text": "Aspect of the Thought Seer: A powerful stone that was imbued with the Goddess Elutil’s power. When She fought with the evil God Naphistim, their combined power fused and the stone cracked into many pieces, birthing a new Lesser God Nephim. The villain collected these pieces and brought them together, in doing so, he is able to control Nephim to some degree and learn the answer to any question Nephim could answer.Destroyed by: It is destroyed when both positive and negative energy are attack it at the same time, falling to pieces once more.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "DRychHZkQWfJssOc","flags": {},"type": 0,"text": "The Manual of Monsters: A magical tomb that holds absolutely every single monster (including races) and has stats for each entry. Not only does this hold the entirety of Monster knowledge, but its also in alphabetical order.Destroyed by: It could be destroyed with the venom of a purple worm used as ink in a quill of aarakocra feather. When the names of each monster are scribbled out with this writing instrument, one monster of that kind dies. When all the names are gone, the book falls to ash.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "4tJEQP6sxpchhAtf","flags": {},"type": 0,"text": "Tenlock’s Armor: Tenlock’s Armor is a +3 suit of plate armor engraved with many ancient occult symbols, it requires attunement. While you are attuned to Tenlock’s Armor, gods, angels, and other divine beings cannot see, detect, or directly hurt you, and you have advantage on saving throws against divine magic.Destroyed by: Tenlock’s Armor can only be destroyed by submerging it in a specific holy spring for a year, finding the spring will be a challenge as it is almost as old as time itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "CWv96NiDJ7LlSevW","flags": {},"type": 0,"text": "Boots of Grounding- All energy based attacks do no damage to the wearer and instead are directed through the heel into the ground.Destroyed by: The boots explode if touched together while attacked by an energy attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "AiE9SBzEEBYKVbmJ","flags": {},"type": 0,"text": "Hangman’s Rope: A sentient rope that stays wrapped around the forearm of the user. If you’re hidden behind or above an enemy you can make an action to hang them. The rope will shoot out and wrap quickly around the neck and hoist them upwards. If you were behind them it will simply tighten. The rope can be cut but will regrow after a long rest.Destroyed by: It can only be destroyed by learning how to perform the coveted infini-knot and using it on the rope which will kill its sentience.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "jjLnL7q9RRwVv8Os","flags": {},"type": 0,"text": "Book of Babel: A small book that can be turned into a medium-sized portal. When you enter you go to the Library of Babel, a nearly infinite library with every book that has been written and will be written. All combinations of letters on pages can be found within the uncountable shelves. You have to come back to where you entered the library to leave.Destroyed by: The book can only be destroyed with the most powerful fire spell in the current world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "2jSLgyK4spjbdoYh","flags": {},"type": 0,"text": "The Lost Battle Standard of Vandria Gilmadrith: Elves are drawn to this banner which doubles as a war hammer with an extra long handle. The divine nature of this artifact means different spell effects can occur. Stories tell of clouds of fire obliterating armies, or a ray of light has smote ruin from across the battlefield.Destroyed by: The core of the standard is corruptible with the essence of an elven god of a chaotic alignment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "TX2KPAex2p2z00QK","flags": {},"type": 0,"text": "Heart of the Titan: An amulet that cracks the earth, enslaves earth elementals, and creates mountains. It cannot be destroyed, only buried in a mountain range to keep the power in check. “Flesh begets Flesh. Stone begets Stone. Jagged rocks will remake the throne.” -inscription.Destroyed by: Using the heart to crack open a mountain and pitching the heart into its core allows the mountain to envelope it. This mountain would then constantly be growing ever so slightly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "NyCsPuFP6UpwmQb1","flags": {},"type": 0,"text": "Dagger of the Golden Hind: A ceremonial dagger made of a now extinct creature and her horns adorn the handle. Her blood has been feared by all creation because it is fabled to be able to kill a god. Nine out of ten ampules of her blood remain on the sheath.Destroyed by: Using the True Resurrection spell on the item will destroy it, replacing it with an immortal creature of legendary tranquility.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "b0jqfmGlCizFoDrj","flags": {},"type": 0,"text": "Jester’s Mask: The mask attaches itself to the wearer who is then transformed into a powerful demigod of chaos. Imbued with immense powers of deception and trickery, the wearer aims to sow destruction from the shadows wherever it can.Destroyed by: First, the wearer must be killed, and then the mask be exposed to an artifact from a lawful deity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "swwPxzZbKF8yL6v4","flags": {},"type": 0,"text": "Helm of the Valkyrie: Enraptures aasimar & celestials, reaps the souls from battlefields, and grants the wearer scaling radiant damage.Destroyed by: Can be destroyed by a fiend cursed melee weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "OQ1UDt4CBuHY9x0j","flags": {},"type": 0,"text": "Eye of Odin: Amulet that shakes the entire plane, disrupts time, and shoots lightning.Destroyed by: Return it to Odin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "GwIezFpSJVLfUkr3","flags": {},"type": 0,"text": "Cursed Helm of the Gorgon: A serpentine sentient helmet that constricts onto an unlucky soul and unleashes rows of preserved Gorgon eyes and Basilisk venom adorns the spikes and tendrils. Launches and regrows spiked darts that petrify.Destroyed by: A mirror may kill the host, but the helmet has to be pinned by a magic spear and set on fire.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "TysJeGHF3WKKvdIo","flags": {},"type": 0,"text": "Shapestealer: A Morningstar that allows the user to immediately become anything that the user kills with Shapestealer.Destroyed by: Shapestealer can only be destroyed if it is chewed up by a legendary behemoth that slumbers deep beneath the earth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "Pza625fvROY3TjUZ","flags": {},"type": 0,"text": "Box of Nothing: A small, simple looking chest that, when opened, violently sucks everything around it into itself. Anything that enters the chest is erased from existence.Destroyed by: The Box of Nothing can only be destroyed if it tries to destroy another artifact of great power, than the box erases itself from existence instead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "oiirl0aVo71tGTwg","flags": {},"type": 0,"text": "The War Room: A large room designed for the planning and coordination of military campaigns, built around a very large and well made table, with a variety of miniatures for staging maneuvers and an entire wall covered with a rack of maps that are at least one civilization collapse out of date. Up to 10 of the miniatures are equipped with concealed needles for drawing blood, and the room itself can be attuned to one individual. When the attuned individual is at the table, he can set a blood-filled miniature on it to gain an immediate bird’s eye view of the donor’s surroundings, up to 50 miles square. If the donor is underground or indoors, the view switches to a map of the structure, which is unveiled as the donor explores. The donor and the attuned individual can freely communicate. 3x a day, the attuned individual can perceive the viewed area as through the spell True Seeing. 1x a day, the attuned individual can use the table to cast Meteor Swarm, targeting the projectiles anywhere within the viewed area. Switching between miniatures takes about 5 minutes. The blood must be renewed once a year to maintain the connection. The connection between donor and room can be severed by either washing the blood out of the miniature with cold water (no harm to donor) or by dropping the miniature into a boiling pot (triggers immediate death save by donor), neither of which actually requires the attuned individual to be involved. The donor does not need to be willing or aware of the blood sampling for the room to work, nor are they automatically aware of all functions of the room.Destroyed by: Weakness: A blood donor who willingly and knowingly provided a sample may betray and kill the attuned individual. The donor may then A) instantly attune to the room or B) light the table on fire, consuming the entire room in flame in less than 10 minutes and triggering a death save for any donors still connected.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "sCgYu4PPgUWScbRb","flags": {},"type": 0,"text": "The Ring of Overly Charismatic GentlemenThis ring has enough illusion magic to change the appearance of anyone wearing the ring into a well dressed noble gentleman who is charismatic as hell.Destroyed by: Whenever anyone touches the ring who is of the opposite sex of the wearer while the wearer is using the ring.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "LCu7i1sl7Ra8Lg1H","flags": {},"type": 0,"text": "The Elder’s Staff: a staff that allows the user to take a brief look into there future to see their future-self in order to give him or her advice about anything they believe is important.Destroyed by: Once the staff is used to see the few brief moments of one’s life before their death the staff burns violently to the point that with in seconds the users hand is melted onto the staff. The burning glows as bright as the sun, and will continue until the staff explodes killing the person who used it to see their death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "LcStmSH3gG1DWQ6R","flags": {},"type": 0,"text": "Amulets of The New Order: A set of five pieces of one amulet that once assembled create an amulet that has the power to enchant the people around the wearer, simply by the wearer rolling a Charisma check of sixteen DC.Destroyed by: The enchantment is broken once someone knows that they are under the influence of the enchantment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "N5SlGj4KXDUsixPh","flags": {},"type": 0,"text": "The Adamantine Arm: If someone severs off their own arm and attaches this enchanted, indestructible arm on, than they become stronger than the strongest giants.Destroyed by: The arm can only be destroyed if it is attached to a mortal and that mortal is cast into a forge at the heart of a great mountain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "hMj5dqaCXSfODZdX","flags": {},"type": 0,"text": "Uwadru’s Paint Brush: Anything painted with this paint brush can be brought into reality. The paint brush can’t create anything larger than ten feet in any dimension, or anything magic, other than that your imagination is the limit.Destroyed by: It can only be destroyed if it is eaten and digested by a powerful demon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "XiN0VJftgYAvbitT","flags": {},"type": 0,"text": "Chalice of Immorality: This fabled cup goes by many names. Any water drank from the chalice permanently restores youth.Destroyed by: The chalice can’t be destroyed by any means, but if it is filled to the brim with an alcoholic drink brewed by a fiend for 6 days, it loses all it’s magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "E5waGG9b40mYhi0p","flags": {},"type": 0,"text": "Medallion of Anti-Magic: The wearer of this has a 300 ft sphere of anti-magic field around them.Destroyed by: It can only be destroyed by a weapon that has been allowed to rust.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "nmVmPY5jxFeJHCpf","flags": {},"type": 0,"text": "Apple of Discord: A golden apple engraved with the words “to the fairest” in elvish. The apple radiates powerful enchantment magic that drives the vain to desire possession of this item.Destroyed by: The only to destroy this item is to show it to the avatar death itself, who will promptly take it forever.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "WKUdnmAI5CF5n2yN","flags": {},"type": 0,"text": "The Pyromaniac’s Ever Glowing Ember: This seemingly innocuous small red coal holds the power to cast powerful fire spells. With each use, it must consume something larger (kindling, log, tree, house, village, etc…), but can be reset if the user is killed as the artifact then consumes him or her in flame.Destroyed by: If someone eats the ember and successfully completes a sequence of high fortitude saves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "EoE4wlaJCGazP0iK","flags": {},"type": 0,"text": "Blade of the Soulripper: This rune-decorated katana is said to envelop the soul of whoever it kills. If the blade is not sated daily, it begins to eat at the life force of the wielder.Destroyed by: If the blade is locked away for a long period of time (determined by the GM), it will turn to dust.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "uZjvytJs7qH0UexU","flags": {},"type": 0,"text": "The Master’s Die: Has 1d20 charges. Each roll of the die will provide the roller with a vision of the future that is congruent with the number rolled (eg. a 1 will show the roller themselves picking up the die after it is rolled; a 10 shows the party meeting an NPC later on; a 15 will show the roller a minor villain attempting their plan; a 20 will show the BBEG preparing for the final battle). The die also summons a monster with CR equal to the aforementioned roll.Destroyed by: Rolling this many times is the only way to destroy the die.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "uCCJKY0arCgP8ODn","flags": {},"type": 0,"text": "Lamp of Wishing: A lamp that contains a genie. The genie will grant up to three wishes to the holder. Each wish has a 1/100 chance of instantly killing the holder and a 1/100 chance of destroying the lamp.Destroyed by: Rolling a 100 after the wish on d100 and destroying the lamp. Wishing the genie to be free of his bounds. This may result in a powerful NPC ally to the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "dlivFw8xXWCa9UdQ","flags": {},"type": 0,"text": "The Chaotic Heart: If someone manages to survive having their own heart removed and replaced with this one, they will have incredibly destructive, red lighting based powers, and have their mind corrupted by the chaotic intent of the heart.Destroyed by: The only way to destroy this artifact of chaos is to have it squished between the great gears of the extraplaner machine, Mechanus.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "opDDiWwm274pONJK","flags": {},"type": 0,"text": "Ravenheart: a black half-cloak (only covering down to about lower back) that is greased in wax and has a silver raven as a pin. 1/short rest, active with a bonus action: turn into a flock of ravens (still 5ft square big) for your move action (must be a single move), and then return to normal shape. While in raven flock form, you do not provoke attacks of opportunity, and all creatures moved through takes 1d12 necrotic damage. [If you want more power, just make it more usable per rest, or increase the damage/raven flock size] Ex. of powered Ravenheart: Flock of ravens: now 15ft square, deals 5d12, and grants the wearer +2 AC and +1 to all saves. Lore: the great-auntie Hag Fibblestitch sowed the cloth of the cloak from the black hair of children she kidnapped over a dozen years. She would lure them into the Crestwood, and once they were lost, send her pack of shadow hounds upon them. Once she completed the cloak, she gave it as a boon to a Rightous Paladin who wished to find the evil that was stealing kids. Many years would pass while possessing it, as he searched for the cause. When he learned the truth of his gift, he was driven mad with grief and self-loathing. The Paladin would end up jumping off a bridge to end his own life, and his corpse can be found at the bottom of a lake now. The cloak was retrieved by the hag, and continues to be given to would-be heroes.Destroyed by: the Paladin had a knife given to him by the mother of the first child lost. A simple steel dagger, it still remains as sharp as it was since the paladin lived. Only it can cut the cloak.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "xgKCgDoQS9xQdxJc","flags": {},"type": 0,"text": "Mask of Thespari: This mask, when worn, allows the wearer to imitate any person perfectly, using a combination of illusion, enchantment, and transmutation magics. Not even close friends or family members will be able to easily see through the disguise.Destroyed by: If the wearer of the mask says their own real name while disguised, the mask is destroyed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "IZPBG8ZMe30AxI27","flags": {},"type": 0,"text": "Plow of Blight: This ordinary looking wooden plow corrupts any ground it plows. Any crops planted in this corrupted soil grow to become hoards of evil plant creatures.Destroyed by: Certain archdruids can learn an ancient ritual to destroy this accursed plow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "FL9R9KTAyPxJsrkH","flags": {},"type": 0,"text": "Powerseeker: This purple orb knows where many artifacts of great power lie, and it will show where they are to those who it deems worthy.Destroyed by: The Powerseeker crumbles to dust when all the great artifacts it knows about are destroyed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "ffLfOcUnzjj55EBr","flags": {},"type": 0,"text": "The Black Ring: A glass ring with darkness inside it. Any corpse that the wearer touches rises to become a zombie under the wearer’s control and the wearer can try to bring undead not under their control under their control.Destroyed by: The ring is destroyed if it is thrown into the sun, good luck!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "tkaItTgCxyUbJyK2","flags": {},"type": 0,"text": "The Shattered Sword of Quo Yang: This once ornate and beautifully crafted sword is broken into several shatters of steel and a hilt with a jagged cracked blade still attached. If the sword can be reforged to its former glory, it is believed that the wielder can unite and rule a broken and divided kingdom to return it to power.Destroyed by: Only by offering all the pieces to an active volcano.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "URdTHxOIvnQ359uz","flags": {},"type": 0,"text": "Whistle of the Imperator: This whistle when heard requires a save to not fall into a temporary catatonic state prone to suggestion. Reflex save for a chance to block your ears, fortitude save to not fall into the standing coma, and a will save to resist against the suggestion. The blower of the whistle requires some sort of ear impairment or risks knocking themselves vulnerable to sleep and suggestion.Destroyed by: The whistle itself is actually quite ordinary aside from functionally protecting what is inside. The magic comes from a small stone of enchanted onyx inside the chamber. Removing the stone neuters the enchantment, but destroying it requires using the onyx as a component in another spell or ritual.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "Jkpv1SKGBC83doSb","flags": {},"type": 0,"text": "Ascot of the Serpent: This shiny silk ascot woven with various shades of green thread holds the power of a demonic snake god. Wearing the scarf will fill the user with power, while slowly transforming them. After a period of time, the wearer is reborn as a snake servant of the demonic snake god.Destroyed by: After days of careful study, a practiced tailor of seamstress can discover the locking knot to begin unwinding the fabric. Once reduced to a single continuous string, the enchantment is broken and the string can be destroyed by any normal means.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "NGMh2E8eoDXnPwxR","flags": {},"type": 0,"text": "Needle of Unstoppable Destruction: This needle looks perfectly mundane, but it is perhaps the most dangerous instrument of entropy in the multiverse. Anything that touches the point of the needle cracks and unravels and crumbles to dust, and I do mean anything, including any artifact on this list.Destroyed by: There is no known way to destroy this thing, your best bet is to cast it out of reality itself. USE WITH CAUTION!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "Y9dhyp8UZzNK4NWu"}
