{"name": "Odd “Landmarks” to Spread Across your Fantasy World","description": "One hundred different interesting landmarks that your players could come across in a fantasy world.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "1UO1jizwNl7juu4t","flags": {},"type": 0,"text": "The Pillar of First Blood – A 15ft dark stone pillar that has engraved writing on each side ‘The spot where the first blood was split between a batch of common devils”.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "J6vKpyKLGVu85owb","flags": {},"type": 0,"text": "The Drawing Moss – A smooth stone with a bunch of growing moss on it. Touching the stone with a bare hand results in the moss slowing moving to wherever was touched. On the stone are several handprints and doodles perfectly covered over with the moss.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "3BFhhzz9hB64cs9M","flags": {},"type": 0,"text": "Curci’s Crypt – A small white stone structure deep in the woods with carvings of trees on each side. Entering brings you into the hidden crypt of Curci.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "2ZJbw2k35FSZKYb1","flags": {},"type": 0,"text": "The Crumbling Shack – Far away from any civilization lays what once was a small shack. The windows are broken, some walls have crumbled away, and parts of the roof are open and fallen in.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "Dbtr57KfLmmBpxh7","flags": {},"type": 0,"text": "Trio of Faces – On the side of a rocky cliff are a well carved trio of protruding faces all looking the same direction","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "funcTx1N5RRs8WPK","flags": {},"type": 0,"text": "Cone Shaped Prison – In the middle of a grassy field stands an 8ft slim cone made of iron bars, in the middle of the structure lies a sun-bleached skeleton bound in iron shackles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "bs3sngx9c2nZghkT","flags": {},"type": 0,"text": "The Tree of Sacrifice – A abnormally large and oddly pale brown tree where the branches are twisted, and the leaves are a sickly saturated green color. At the base of the tree lies a blood stained alter that the roots of the tree have grown around it and now hold it in place. The base of the tree as well as the ground around the alter are permanently stained a deep red. If the tree is cut, a thick blood sap seeps out of wound. If a creature is sacrificed on the alter, the blood pools near where the roots touch the alter and are absorbed while what appear to be veins appear on the tree that go up into the branches.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "b8YnKt1GrzT5XKOZ","flags": {},"type": 0,"text": "The Bone Pit – In an open field there is a 10ft wide and 50ft deep pit with no life growing around it. The walls of this chasm are lined with dark cobblestone and going down there are three uneven sized holes that are covered by iron bars. At the bottom there are a large pile of bones.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "iv6eIlC3lbKtJVDK","flags": {},"type": 0,"text": "The Odd Stone Slab – A big square stone slab rests hidden near the side of the road. Carved into the slab is a symbol and a riddle that upon answering correctly leads to a small dungeon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "X0WG2PtyRahzyP5p","flags": {},"type": 0,"text": "The Copper Fox – A 4ft oxidized copper statute of a fox with a small locked box in its mouth and two ruby eyes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "V9nTq5cVMWRzS0gj","flags": {},"type": 0,"text": "The Pointing Eagle – On top of a large rock formation is a big iron statue of an eagle pointing its body to the east.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "byP6eQSwaOOY6QX1","flags": {},"type": 0,"text": "The Feasting Table – Out away from any kind of civilization sits a large gray solid stone table with ancient carvings on the sides. Upon its surface are newly lit candles and a banquet of food that seems to be warm, fresh, and untouched by its surroundings. If one where to eat or take anything from the table, the next day it would be completely restocked and replenished.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "fnDuXZBzIJWyCaSW","flags": {},"type": 0,"text": "The Jeweled Bush – A seemingly average looking berry bush that happens to grow small jewels instead of berries. If one where to try and consume one of the jewels picked off of the bush within 24hrs, that person gains a temporary magical effect or bonus, otherwise it’s a normal jewel.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "LAS8StGW0eXuJ8l5","flags": {},"type": 0,"text": "The Ice Blood Spot – Located on the cliff face of a large mound of ice there is one spot that is dark red instead of the pure blue that surrounds it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "Py2O89m7t4ZNe4zD","flags": {},"type": 0,"text": "Dragon’s Graveyard – in a valley, there are 8-10 adult dragon skeletons, half-buried.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "4SGOBrZ5wCBpSr6K","flags": {},"type": 0,"text": "Petunia, the Land Whale – A large whale skeleton surrounded by petunias. The whale is miles away from the sea and the petunias aren’t native to this location.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "VaYQqDRJwiI6Hhpv","flags": {},"type": 0,"text": "Wondrous Obelisk – an obelisk, comprised of rose quartz and decorated with sylvan runes, appears to be of fey origin. it is surrounded in a 120-foot field of wild magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "HOFTydQdl3kXkyAY","flags": {},"type": 0,"text": "The Old Folk Hero – A half erected statue of an old folk hero. Either under construction or half crumbled.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "MafADGmYpk9mSCdq","flags": {},"type": 0,"text": "The Hope Tree – It’s an oak tree with the word hope carved into it in large letters. No one knows who did it or why, but it’s turned into a useful landmark for the local village.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "0N0yBfbL1VPJ7TmV","flags": {},"type": 0,"text": "The Moon’s Egg – It’s a massive dome-like stone formation that shines pearlescent in the moonlight. It lays in a bare outcropping of rock and is warm to the touch.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "NY2L7pj01qhpWBs8","flags": {},"type": 0,"text": "Hollering Pit – A 50ft deep sinkhole. Well-hidden at the bottom is the lair of an accomplished burglar who calls himself the Jeweler. He’s too old to do much in the way of harm, but the countless traps he installed are not.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "3JMPQuejWE7ubPFg","flags": {},"type": 0,"text": "The Painted Cliff Face – A cliff that has been entirely covered in paint from hundreds of people.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "epPKKIGZSJ1DV6SN","flags": {},"type": 0,"text": "Threeshades Tower- A weathered, ivy-mantled square tower atop a small hill. Has three levels, and each is built from a different kind of stone. The longsword stuck in one of the bricks on the top level is +1 and can project the bearer’s voice up to 50’ away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "4OPxQ1d0zxqWRQIs","flags": {},"type": 0,"text": "Pigeons’ Chest – an ornate, but empty, chest of silver and pearl sitting by the road. It will not move by any means yet discovered, material nor magical.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "ZILtnpSDH7sIC7U5","flags": {},"type": 0,"text": "The Ol’ Inn – The ancient ruins of a strangely ‘modern-looking’ tavern located in the deepest patches of forest. No path leads to it, no other buildings or ruins are found besides it, but dozens of deformed footsteps can be found heading out of the site. At night, the faint, muffled sound of a single viol can be heard coming out of the muddy floor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "P4xhJMT0hDgp9mRP","flags": {},"type": 0,"text": "The Forgotten Emperor’s Statue – An incredibly detailed, broken bust of a young wood elf, bearing a red crown. Its nose and left ear are missing and where its left eye should be, the socket is destroyed, and a monstrously decomposed snake eye can be found. The base has a bronze plaque which reads (in broken Celestial): ‘The only one truly meant to rule’, followed by a name which seems scratched out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "oPRYo7qeIfPMFoqg","flags": {},"type": 0,"text": "The Candle Trees – deep in the woods, a small group of trees whose leaves are bright red. They contrast starkly with the normal trees around them. The Candle trees appear otherwise normal, but the dried leaves can be brewed into a tea that warms the bones even on the coldest nights.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "ALNW2CqgQdMTeb5L","flags": {},"type": 0,"text": "Tale of a Desert’s Origin – A granite obelisk in the desert with glyphs on it. It seems to tell the tale of a very powerful magic user stealing all the life from this area, killing all the plants and turning it into a desert.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "Ouit6tOHfO1Xqlzy","flags": {},"type": 0,"text": "The Waning Waterfall – a small waterfall that appears to reverse direction on every night with a bright full moon, running up instead of down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "ODLjnYBAoDVpU246","flags": {},"type": 0,"text": "The Sandmount – There’s a strange dune of sand in the middle of this grassy field, covered in scorpions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "kCm98J19kbS7qVg3","flags": {},"type": 0,"text": "The Awoken Stones – three stone pillars at the top of a hill, each engraved with a different rune of no known language. The pillars appear to change positions, but how this is done is unknown.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "c0jlvHkxv91oMOPK","flags": {},"type": 0,"text": "Ghost village – There’s a half-buried village in the sand, with sandstone walls being the only remnants… except for one house, which has a simple roof and door carved into the stone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "OKPQ0cu66UiK59ii","flags": {},"type": 0,"text": "Impossible Shipwreck – Dashed upon the rocks are the remains of a large merchant ship. Weathered and ancient, the skeletons of the crew still scattered around though most everything of value has long since been looted. The most peculiar thing about this is that the rocks, and ship, are in a cavern 100ft underground, miles from the nearest navigable waters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "la7jJSiFEiD2yTPo","flags": {},"type": 0,"text": "Sapphire Beach – a small stretch of coastline hidden between two nigh-inaccessible cliff faces. The sand is particularly fine and a brilliant blue. Rumor has it that the sand was formed when giants destroyed the jewel horde of a local dragon. There are also rumors of a dragon being sighted in the oceans nearby. Digging deep into the sands turn up giant bones.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "4Eye6ZDGjgBpKzsX","flags": {},"type": 0,"text": "The Lovers’ Spring – a secluded hot spring, with the initials of many young lovers carved into nearby rocks. Discarded and forgotten undergarments can be found on tree branches in the area.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "OSFjk2SR5gWLeKpY","flags": {},"type": 0,"text": "The Arms of the Last Bard – A broken but thick 15ft wide half-circle embedded to the ground made of quartz and intricately laced with gold strips. An assortment of precious gems are embedded in its surface. Any attempt to collect and/or destroy this construct will cause severe psychic damage and a loud high-pitched tone to play loudly. The half-circle aligns perfectly with sunset/sunrise and every time it does, the most beautiful flute melody plays that is sourceless.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "vLrHA5cnE9JCoFvO","flags": {},"type": 0,"text": "The Iron Tree – A big, old tree which seems to be made of iron, but as far as anyone can tell, is alive and growing, if slowly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "RZbiYe7loGRqLuYN","flags": {},"type": 0,"text": "Hades’ Hand – A 15ft tall stone hand stretches from the ground, reaching for the sky.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "0ALMT3q8xkUsrC7Y","flags": {},"type": 0,"text": "The Stone Toad – A gigantic stone carving of a toad’s head, crumbling, half-buried, and covered in moss.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "BKlZy1us0VuQMmyB","flags": {},"type": 0,"text": "The Wrecked Ship – The sun-bleached wreckage of a ship that ran aground long ago. Inside the hull is a massive cage with thick steel bars that appear to have been smashed outward from the inside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "qElPC57C7bykHAty","flags": {},"type": 0,"text": "The Three-Sided Tower – A half-collapsed stone tower with curious triangular architecture. The bones of a lonely watchman sitting in a chair lie atop it. The watchman wears a helmet shaped like a triangular pyramid. Several towers of this type can be found around the same area.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "h8vVqBsQWvyWExlZ","flags": {},"type": 0,"text": "Giant’s Playground – this field is entirely stone, and many massive footprints can be seen stomped into it. There are boulders laying around, some cracked.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "Kbi5T0a0451qkpa6","flags": {},"type": 0,"text": "The Fallen Hero – The legs of a giant metal statue standing beside the top of a waterfall overlooking the valley below. At the bottom of the lake below the falls, the head and torso can be found. It appears to be the likeness of a famous ancient hero that a PC might recognize.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "dsbBlV61l2H5Qcyi","flags": {},"type": 0,"text": "The Charity Cave – A cave with a chest that says, ‘if you take something, leave something.’ It’s unlocked and has several trinkets inside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "tZxhUxap08F5179I","flags": {},"type": 0,"text": "The Eye of the Moon – on top of this hill is a pool surrounded with stone. The water is always cool, and at night the full moon can always be seen in its reflection, regardless of clouds or moon cycle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "k4wuMqZ63EwAMPc5","flags": {},"type": 0,"text": "Bigfoot – A large tree in the forest that bends and splits in such a way that the bottom looks like a foot, with toes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "Zc0J3oHxIhYn5YNN","flags": {},"type": 0,"text": "Goddess of Death Statue – A worn smooth but still recognizable ancient statue of a goddess of death. At her feet sets a black stone bowl filled with fresh rose petals. If you were to kneel down at the bowl and look up at her, you would see her eyes stare unwaveringly into yours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "FjpwPfGZogEsV5Lh","flags": {},"type": 0,"text": "The Red Altar – in the middle of a copse in a strange swamp lies a smooth altar made of red stone, with strange carvings of trees and water all around its base. Upon touching the altar, you will hear a voice in your mind ‘sacrifice”, and you will feel a strange primal urge to sacrifice a creature on top of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "cNdL80f1P7oOAwI3","flags": {},"type": 0,"text": "Timnar’s Beard – A copse of trees growing in a single spot on an otherwise barren mountain. Unbeknownst to the world, it is the burial place of a great wizard of earthen magics. It is watched over by a trio of stone golems and a handful of slumbering treants to guard the immense knowledge held within the tomb.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "xY3ogzwYlYwB7yb3","flags": {},"type": 0,"text": "The Sundered Mount – a mountain that appears to have been cleaved in two and creating two crumbling peaks with a narrow cut of a valley between them. It does not appear naturally created.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "Vsv4y55TMszFiFHs","flags": {},"type": 0,"text": "The Mage Wastes – A region where fertile grassland suddenly stops and abruptly becomes a barren wasteland of decaying grass and reddish soil. It seems as if it was the sight of some magical battle. The ground is pocked with craters and scorch marks, yet it seems as if this battle was an ancient long finished, but the battlefield has remained a wasteland frozen in time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "FQxcZ7U11GlJdeQA","flags": {},"type": 0,"text": "The Dragons Maw – A series of jutting tooth like spires of black igneous rock which rise out from the sea. These “teeth” have proven to be an extreme hazard to sailors and shipping which pass too near to them. Tearing hulls and ripping sails.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "Gd6SMOh6o7uLfYNJ","flags": {},"type": 0,"text": "The Gods Sacrament Statue -A old weathered statue of a god with beautiful gems inlaid and surrounded with wicker basket offerings of gold, flowers, food, and trinkets. Stealing from the statue result in a curse (permanent level of exhaustion) from the deity until either greater restoration is cast on the thief or they repent and make an offering of twice the amount stolen. Award inspiration for respectful offerings or prayers given to the statue.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "ETUd7JhOI3qmLcCb","flags": {},"type": 0,"text": "The Dragonblood – A massive artwork carved into a boulder placed some ways away from the banks of a nearby river. The artwork seems to depict a struggle between giants and dragons, with the giants as the victors. The faintly red runes which line it are giantish, and anyone who can decipher them will read that it marks a momentous battle between giants and dragons, over which should decide the course of the river.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "kjXOcZdlEuVX5upA","flags": {},"type": 0,"text": "The Daughter of the Sun – An enormous stone of a singular soft yellow color. It is hot to the touch but by day it is warm and comfortable simply standing near it. By night however the stone begins to glow brightly, illuminating its surroundings in radiant golden light. Large chips of the same stone can be found in the foliage growing around it. With similar glowing properties.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "11ZsYLFVkUhXceqh","flags": {},"type": 0,"text": "Would you kindly -A sentient door in the side of a mountain that has short term memory loss. He has no idea of his name or how to open himself but enjoys talking with travelers none the less. Speaking the magic word “please” will cause the door to open revealing a shortcut through the mountain. No form of magic or otherwise can lead through or get around this door without speaking the magic word due to an ancient magical barrier.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "a6qKiufen6dVsw4Y","flags": {},"type": 0,"text": "The Bread Boy – a small statue in a park depicting a street urchin. In one hand he has what is left of a small loaf of bread. With the other hand he is spreading crumbs for the birds, so they do not go hungry too. A place where the street kids gather.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "LqR6eNV0Pv7P1skN","flags": {},"type": 0,"text": "Sculpture Garden – a small clearing in a forest, near a cave mouth, contains dozens of statues of humanoid creatures, many armed & armored, all with looks of surprise & horror on their stone faces.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "LrZRlj2jCgm6QA2K","flags": {},"type": 0,"text": "Saben’s Cauldron – a large, circular pool off of a main river which is geothermally heated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "BsiCc7EySwJU2e4m","flags": {},"type": 0,"text": "The Teeth – a series of vaguely conic stone spires lined up along a gentle arc. Each is over 15ft tall and 5ft across at the base, and tapers to a narrow tip. Nobody knows the origin of this formation. Some say the teeth are all that remains from some colossal dragon skeleton, others think the stones were placed there by a dragon cult, or as a sign from Bahamut.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "vdNrjTUvMrDyJ5gw","flags": {},"type": 0,"text": "Mage-Crater – a 120ft diameter crater. Now filled with water and inhabited by pond creatures.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "5N0ZHFKKBYF12aTo","flags": {},"type": 0,"text": "The Old Man – a natural rock formation that just happens to look like the face of an old man with a long beard. Ruins of temples from several ancient civilizations can be found in the valley below, apparently attracted there to worship the face, or perhaps just to be under his watchful gaze. Most humanoid races in the region are sure the old man looks like their race and have their own legend about him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "GFafLfx0ctLVXMPW","flags": {},"type": 0,"text": "The Deino Flats -roughly 40 acres of salt flats. A long dried up saltwater marsh from ancient times.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "TO8FFVFk92n84tD0","flags": {},"type": 0,"text": "Grand Defender – a large, symmetrical hill where the site of a great battle once was. Stone rubble and ruins barely peaks out from the top. Flowers are left there every so often.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "UGhAm207355rJspG","flags": {},"type": 0,"text": "The Adventurers Billiard Hall – A stone statue of a Local adventurer rests on a green glass dome in the center of a public lake. The dome is lit gently from beneath. Somewhere nearby lies a dilapidated entrance which runs through a small puzzle focused dungeon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "jcRMuFhJrqlj8w0p","flags": {},"type": 0,"text": "Turned-Inn – An inn that has been carefully constructed to appear as if it was turned upside-down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "UWraMIoWNikhSlQ3","flags": {},"type": 0,"text": "The Signposts – A collection of several dozen poles each with a dozen or more signs mounted to them pointing towards various distant lands, nearby businesses, and bizarre joke locations. It started with travelers who erected a signpost pointing to their distant homelands which other travelers added to. Eventually it got out of hand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "Nah9Y7Yc6d2nARb1","flags": {},"type": 0,"text": "Worm’s Desert – A small sandy desert only a couple hundred acres in size of so. A great desert-making worm arrived from another world and sought to covert the world into an ecosystem like its home but caught a local disease it was unresistant to and died before it made much progress. The residual poison from the worm’s body deters plants from overtaking the sand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "a5SMdHTOxbrswor1","flags": {},"type": 0,"text": "Lightning Lab – A bizarre building with a strange mushroom-shaped metal lattice on top. It was the lab of a researcher studying non-magical electricity who died from electrocution.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "l99EQuE3mk5dldQW","flags": {},"type": 0,"text": "The Sandlot – A square of property with no building where children come to play. A greedy landlord raised the rent on a long-term elderly tenant when they purchased the property, driving the tenant into poverty and eventually death. The tenant cursed the land with dying breath that no-one would never profit from the property. Every future tenant was driven out by terrifying haunts, and eventually the building was burned down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "1WSQSBlpOXDleAVr","flags": {},"type": 0,"text": "Dwarven Monument – An enormous high relief of six dwarven warriors cut from a cliff pointing the way along, commemorating their epic journey.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "P4HavCbOcZQiqvkq","flags": {},"type": 0,"text": "Atlas Boulders A series of differently sized large stone spheres far too large for a man to lift. The strongest giants would lift them to prove their strength. They sometimes move, so perhaps the giants still use them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "TWE2ff3fSuMnkmTA","flags": {},"type": 0,"text": "Ancient Battlefield – ramparts, high hills, and trenches filled with water that stretch for mile marking the location an ancient battlefield. It has grown over.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "lqDjDIYMSHHIt0XJ","flags": {},"type": 0,"text": "The Epicenter – A large swath of woods where all the trees in a massive circle have been bent at a 90-degree angle towards the center but continue to grow that way. There is nothing (currently) anomalous at the center, but a powerful coven of druids hold it as one of their holiest places and guards it closely.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "UR4kbOt1NbgIIYs1","flags": {},"type": 0,"text": "Ol Demons Place – a once portal to the abyss, sealed by hero’s long ago, now just a crumbling arch with an unsettling aura.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "SZl8ttKJEIeGRpPN","flags": {},"type": 0,"text": "The Broken Hill – a hill that you need to walk uphill to get to and walk uphill to get away from.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "ej7Ql8h7u63TYjRY","flags": {},"type": 0,"text": "The Rooster of Mourning – An enormous statue of a rooster, made from a strange metal, finely detailed and colored. It is hollow, and when the first ray of sunrise strikes it, a great, sad-sounding crow arises from it. Legend says that it commemorates a great battle in the distant past.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "6O1xKZ5MRqNlZiTH","flags": {},"type": 0,"text": "The Angry Spot – a small stone platform on the top of a hill, standing on the platform makes a person irrationally angry. Barbarians may involuntarily rage as a result.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "OlKjPRrfdAxNwFXr","flags": {},"type": 0,"text": "The Alter of a Thousand Arms. – At a crossroads sits an unusual statue, made of stone it stands over 10 feet tall and has arms sticking out in every direction with their palm turned upwards. In nearly every hand there is a candle, some still lit but most are fully melted. Placing a candle in one of the hands and lighting it will give the player the blessing of ‘A helping hand.’ When a player next fails a roll, they may roll an additional d6 and add it to their total.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "dmNg9xuUaoTAyZJz","flags": {},"type": 0,"text": "The Weeping Sister – A fifteen-foot statue of a girl unmarred by time. Next to her are the shattered remains of another statue, close enough that the body may have once held her outstretched hand. The feet of this larger statue are all that remain affixed to the earth – the rest is scattered throughout the clearing. Water, clean and pure, travels down her face in steady rivulets but leaves no erosion there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "MahAetFSPg9DJfFm","flags": {},"type": 0,"text": "The Sensible Stone Head -a large stone head protruding from the surface of a glacier. It is the head of an earth elemental and if you get his attention, he is friendly. If asked what he is doing their he replies ”swimming in the river”, given he exists at a geological place the slow flow of the glacier is like a river to him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "0SFjNZPPJUu63YYm","flags": {},"type": 0,"text": "Glass Tree – A fairly tall an elaborate tree made entirely out of glass raises from the earth, at its base there is a plaque written in dwarven, it’s to commemorate a dwarf leader who fell in battle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "XiXYJ2HMYk9KR3ZA","flags": {},"type": 0,"text": "The Titan’s Blade – A 50 ft rust covered sword driven into the earth. The whole area has a magical aura and no wildlife lingers within a quarter mile of the sword.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "G9GJ1ZTGDGnYcPlR","flags": {},"type": 0,"text": "The Well of Good Tidings – A well by the side of the road that is a base in a local hafling tradition that if one where to lose a tooth, that it is to be tossed in the well with a tip of the hat. When doing so, good fortune is sure to come. Characters that throw in teeth later find small amounts of wet coins in various locations on their person. Characters that throw rubbish, or are otherwise disrespectful of the well, find their respective objects on their person once more soaking wet and covered in bite marks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "uhnZ28M6RTk56oli","flags": {},"type": 0,"text": "Skilltown – A small but clearly once-bustling town lays abandoned inside of a titan’s skull. The skull is half buried in the sand; its eye sockets and mouth aim up at an angle. Walking through its mouth is the only way to enter the town. The skull looks to be that of an enormous version of whatever scariest creature lives in that area. It provides ample shade during most of the day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "JTov8w620KXfS6zJ","flags": {},"type": 0,"text": "Best Rest Graveyard – A cleric once prayed over a graveyard that all within would ‘rest well.’ Now anyone who falls asleep in that graveyard has the best night of sleep they’ve ever had.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "CFKR8mRt9y9jY8pE","flags": {},"type": 0,"text": "Bird Hill – a grassy hill of noticeable height rises from the otherwise flat plains. On the hill are several lines of cobblestone that do not grow grass and have no discernible pattern from the surface. If flying, however, you see the cobblestone lines form the shape of a bird, along with some arcane symbols. If you happen to look up during the spring or fall, you’ll see migratory birds alter their course to fly over this hill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "jcvfyzjd4w1iXtdi","flags": {},"type": 0,"text": "Stairway to Nowhere – All that remains of an ancient fortress, the remarkably well constructed staircase rises for 3 stories out of the ground at the end of an ancient road, and then just abruptly stops.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "soXjyf9dwReq9IOZ","flags": {},"type": 0,"text": "The Crossroads – This is the place where four kingdoms meet. The main road for each lead to a massive stone pillar. Many years ago, all four kingdoms were at war, and a pillar was placed there as a symbol that none from neighboring kingdoms would be allowed to cross. It is now an annual meeting place for the four to discuss their continued amnesty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "816AacuO1ebifwQl","flags": {},"type": 0,"text": "Cloudland Canyon – It’s a canyon nestled in a northern mountain range that’s so high even the base of the canyon is a higher elevation than most of the other mountains in this world. Wondrously magical things occur here.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "lzpR8gOx1GEwjhZh","flags": {},"type": 0,"text": "Stone Tree Garden – It was a garden from a former ancient culture, which vanished out of unknown reasons. One of the only things found was this tree garden. Are the trees made of stone or turned to, no one knows.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "mX7ZPhZv4YOSfjXW","flags": {},"type": 0,"text": "‘The Circle’ -There once was a meteorite which crashed into the land. The first to arrive found weird writing in a (Insert required size) diameter circle. No one could read what was written. In the center of the circle, where the meteor should have been, there was nothing, not even a small crater.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "vWvhMZqdJgbGDzbx","flags": {},"type": 0,"text": "The Well – A seemingly normal well on the top of a hill. Anything that is placed into it is immediately tossed out of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "ctoMcpINxtmqzlf5","flags": {},"type": 0,"text": "The Pariah’s Mountain -One mountain among an otherwise unimpressive range, its only defining feature is its completely upside down. The base measures about 60ft across, but the peak 3,000ft up is easily a mile across. Stairs may have been carved into the side, but the climb down to the summit (or is it up to the base? The locals aren’t quite sure) is precarious at times. The locals are also similarly vague when asked about what’s on top…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "yPbE8QfWdvZrzYo9","flags": {},"type": 0,"text": "Worried stones – A group of 3 standing stones with anxiety. When encountered in their clearing, they will disappear once all eyes are off them. Careful inspection will reveal them to hiding nearby – peeking from behind a nearby tree, bottom of a lake, hidden by bushes, behind where the party is now looking, etc. If discovered, they disappear again if not observed. The stones are not malicious, and do not harm the party. They would just rather you all left them to it, thank you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "m8m4j6fydjmLRggj","flags": {},"type": 0,"text": "The Quiet Creek – An otherwise ordinary creek that runs through a forest. It is abnormally quiet near the stream, in such that there is almost no echo around it, and it is surprisingly hard to hear from a distance. All along its course stand small boulders, almost fully grown over with moss.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "a9KakFQMcfF7SfdW","flags": {},"type": 0,"text": "The Shifting Hills – A large field of hills, dotted with rocks, grasses, and flowers. Careful study has found the hills are constantly moving, as though old creatures crawl along under a carpet of earth. Magics which call upon the earth always seem to produce unexpected results when among them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "oZ93dcI4E0uNoVyP","flags": {},"type": 0,"text": "The Devil’s Wager – A large disc shaped stone at the base of a long dormant volcano. Visitors toss a copper at it for good luck. There are a couple hundred copper around it. It is considered extraordinarily bad luck to take the coppers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "6FV3VEkaDm1yMWQ1","flags": {},"type": 0,"text": "The Swordleaf Trees – there is a patch of trees here with a non-stop turbulent wind rustling the leaves and branches violently. The leaves’ edges appear to be razor sharp.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "o5a5imrtq0PXN4o0","flags": {},"type": 0,"text": "Beacon Mountain – A mountain that, on some nights, has a bright ball of light form over it which slowly dissipates over several hours. Local religion strictly forbids climbing the mountain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false},{"_id": "haRUA7alY8jFeQnz","flags": {},"type": 0,"text": "Mist Valley – a short pathway of stone carved into a mountain, roughly five feet wide with names of couples and graffiti on the stone walls. The pathway always has a thick fog settled over it, making it seem eerie.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [101, 101],"drawn": false},{"_id": "GyBjt2eZ5BYdHl6e","flags": {},"type": 0,"text": "Ancient Battleground – Deep in a forest, trees are marred with years old axe and sword marks. Hundreds of skeletons dressed in rusted armor and weapons lie in this area. Taking a trinket, or even loitering may be unwise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [102, 102],"drawn": false},{"_id": "SSIYhcH8VlfYNRC6","flags": {},"type": 0,"text": "True Clarity Bridge – A bridge between two high places that, for many people, while staring off the side, provides answers for their most troubling issue or deep question, whether they were looking for the answer or not.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [103, 103],"drawn": false},{"_id": "bA39Ko9MhD3HWwhC","flags": {},"type": 0,"text": "Lover’s Glade – Two sequoia trees whose bases are over a hundred feet apart have grown together and connect about 160 to 180 feet off the ground. The branches and leaves of these giant trees create a pleasantly shaded area below which is often used by the local populace as sites of wedding ceremonies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [104, 104],"drawn": false},{"_id": "uesBYK9TPhbTTDwj","flags": {},"type": 0,"text": "Round Rock – A mysterious perfectly round rock that stands nearly 20ft tall. It is too heavy to roll and never seems to chip. It is the center of many local legends, varying wildly on their truthfulness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [105, 105],"drawn": false}],"formula": "1d106","replacement": true,"displayRoll": true,"_id": "6cZWiPqHBokPL3dZ"}
