{"name": "Nordic/Viking Encounters","description": "One hundred different encounters for a nordic/viking campaign!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "utIw0jBZcrwa6wzA","flags": {},"type": 0,"text": "A tiny village and surrounding homesteads have been razed by a pack of orcs. The two wolf riders have a chain gang of women and children ready to move but not before they plan to set fire to the trembling old and infirm they have piled in the village square.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "eaQ35ylMK0Sj3gqb","flags": {},"type": 0,"text": "3 Trolls sitting at a campfire eating an animal they have slain today.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "2p0uRwAXrNp7uBOB","flags": {},"type": 0,"text": "A lightning elemental trying to get back to it’s home: inside Thor’s Hammer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "qpMIrbWE3H7oa8B2","flags": {},"type": 0,"text": "A young man claims to be the son of Odin and is backing up that claim by conquering nearby townships. He wields a +3 spear that flies back into his hand after he throws it and give him True Sight (it’s a relic he found)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "TxRbGi5XC75y0uUe","flags": {},"type": 0,"text": "A booming sound is heard over the sea during a storm, but it does not sound like thunder. The storm giants are fighting and their battles are causing endless storms and floods. Sail into the heart of the sea, through this weather, and stop them","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "f22qfbFfQEwo0LDK","flags": {},"type": 0,"text": "Dwarves under a mountain are crafting an item that looks like a giant ruby. If they complete it, it will allow fire giants to obey their commands. The ice giants are not pleased about this","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "WxRcc7rOISrNBZ0y","flags": {},"type": 0,"text": "Two dragons attack each other over a viking village. Both die in the battle. Now the villagers are going to go to war with each other, as two leaders want the corpses for themselves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "55wRtqHN8QGEnWma","flags": {},"type": 0,"text": "Giant Elk rutting as a neutral one but still dangerous","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "XEOJRGgRDvviqSAF","flags": {},"type": 0,"text": "A dwarf named Fafnir is running away with an otter skin full of cursed gold, depending on the difficulty you’re after have him slowly turning into a black dragon. At a minimum he’s almost a half dragon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "reImxl4Qxn2fZVZ7","flags": {},"type": 0,"text": "A rumor is heard about a mysterious well (Mimir’s well) that grants magical boons to those who sacrifice something to it. (Or the players stumble upon the well.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "6RIJ5U63fLP1738F","flags": {},"type": 0,"text": "Raiders need some more muscle on a pillage!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "7xq6oksbEwd7twpK","flags": {},"type": 0,"text": "As the players are threatened with freezing to death on a mountain pass, a welcoming cave turns out to be the entrance to a formidable Jotun community. Or a bear den depending on level.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "BX0QunL45CnvZeOO","flags": {},"type": 0,"text": "A woman in a bar reveals her self to be a fallen Valkyrie. She needs your help to return to Asgard (or your world equivalent) and prove her honor. Turns out she’s “fallen” for a reason and getting her back to Asgard would be disastrous.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "Rf3FDzeQANuuERXo","flags": {},"type": 0,"text": "A famous bard has been replaced by a servent of Loki, and now walks the land twisting the myths and tales of old, spreading all the wrong lessons to the wrong people, causing chaos all the while.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "S1KgVCDi7j6iLy7e","flags": {},"type": 0,"text": "A local Jarl’s son has been captured and the Jarl wants him rescued. The son is being held in a pit. If the players enter the pit, it fills with (highest character level) x d8 constrictor snakes and the illusion of the Jarl’s son fades.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "rXV5jUn55ugHCqlD","flags": {},"type": 0,"text": "Rumors are abound that the dwarves in the nearby mountains are at work at a great golem, one which will claim them alone victory at Ragnarok.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "2oUauiZKlT8Qkmcp","flags": {},"type": 0,"text": "The draugr have risen and are attacking the countryside. The Jarls and lords protect their cities with powerful runes. But they will only hold for so long. Find the source of these draugr and end this madness","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "Cc2crK4rREtx7s6J","flags": {},"type": 0,"text": "A strange man comes from faraway shores, preaching a lord beyond all the gods, a lord of vengeance and mercy, of blood and wine. A lord encircled in vines and nailed to a beam. He has gained quite a following, performing miracles of this foreign god","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "6o5UGqCME9cglgcg","flags": {},"type": 0,"text": "A madman wanders from township to township, claiming to have returned from Helheim. Such a thing is impossible, but the man is said to see ghosts, and is as cold as the grave.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "pBIwRiYDlNNSeUvl","flags": {},"type": 0,"text": "A group of dragons, chromatic and metallic, have gathered in concert for one purpose: To kill the world serpent, and if they’re lucky, Niddhog also","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "ccMvdkZFCwRUHJti","flags": {},"type": 0,"text": "The cults of Loki are determined to give their god a weapon that can match the might of Mjolnir. They have gathered the best smiths and enchanters they can to craft the weapon for their god.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "fVgX7S7TzVPZ1V8J","flags": {},"type": 0,"text": "A fleet of longboats made of strange, black wood has been spotted upon the coasts. They are demanding the first born from every village as tribute, or else they shall burn the countryside to ashes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "HPODIIZXrqmCihZW","flags": {},"type": 0,"text": "A mysterious saga stone has appeared overnight with glowing runes written in a strange language that none of the locals can identify.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "PErbslMFHHbWh5PL","flags": {},"type": 0,"text": "A lycan is killing hunters and wanderers in the name of Fenrir, hoping this will break his chains early","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "9q3St3C5Whhucucc","flags": {},"type": 0,"text": "A dark wizard, a necromancer, has found a way to turn trolls into draugr, and now aspires to amass an army","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "d7bFhcfsvxuo8rPy","flags": {},"type": 0,"text": "A spirit that was to be taken up by the Valkyries to Valhalla has broken loose from their grasp and now possesses mighty warriors to be a warrior again here on midgard.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "dBMGVQ0jUwPpSi6G","flags": {},"type": 0,"text": "An old woman throws runes in her shack on the edge of a pine forest. The bones scream of portent and woe. Darkness falling over the land and a chill winter that hasn’t been seen in 100 years. As she weaves her prophecy the party is quietly surrounded by 1d6 Ice Spiders.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "DUXbaWYAYJXMG8lm","flags": {},"type": 0,"text": "You stumble onto an empty dragon horde cave that is camp to a raiding party of Duergar. They think you’d make excellent slaves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "ABiGl3wPyhF5JDjQ","flags": {},"type": 0,"text": "Near a cemetery 1d20 skeletons rise looking for glory. Their Jarl stole their treasure horde and ran off. Two gold coins each is enough to send their poor souls to the afterlife victorious. They give you the cursed family name of the thieving former Jarl.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "fcxUhWzmKtHGZQiB","flags": {},"type": 0,"text": "A Jötunn (Giant) determines he wants to taste any exotic members of the party. The patchwork furs, skull belt, dwarf armor necklace, and massive stone club make for a very convincing argument.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "iixsrMs9pa3HEUSU","flags": {},"type": 0,"text": "You find a wounded shield maiden with her dead compatriots in zombie form closing in on her. Two of the zombies are on fire.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "3abMgfDsGkAxeYC7","flags": {},"type": 0,"text": "Cultists have a magically restrained Valkyrie on a sacrificial altar in the rib cage of a long dead god. They chant as they pour blood in her mouth to suppress her divinity. The ten cultists summon 1d4 Fire Elementals, but if the Valkyrie screams she can kill half of them. She begs the party to get her to the nearby ruined temple of Odin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "O9szuHXwxxp8kKBL","flags": {},"type": 0,"text": "An empty long boat is scuttled on the shore. There’s zombies tied to the mast and one stuck in some fish nets. Ten more in chainmail armor walk out of the water towards the ship and the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "XKgH2ixmB7vfg7b7","flags": {},"type": 0,"text": "A small dwarf woman is being chased by a hell hound. Her father the Jarl had recently passed away and her uncle seeks to usurp the land she inherited.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "NCqKD7mpQ7tax6Xv","flags": {},"type": 0,"text": "You stumble upon a horde being buried. The 1d6 Vikings were about to sacrifice a boy and girl to protect the treasure from the afterlife.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "b8LEZer18j0A1ZCl","flags": {},"type": 0,"text": "A herd of elk run past you. The party discovers a grizzly bear, fur black with shadow, and eyes glowing red with rage barreling towards them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "S31Et1AznuvB0w2e","flags": {},"type": 0,"text": "A ghost begs them to return her skull to her nearby body on a stone throne. Her chainmail covered body animates and raises 1d6 skeleton warriors to show her thanks as she covers the party in darkness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "JqkovqXxSDz2qAeq","flags": {},"type": 0,"text": "Dark magics are at work when a pair of two-headed, undead dire wolves attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "fBF0c6fcgK1hoiQM","flags": {},"type": 0,"text": "A child of Fenris stalks the party. A great wolf in her own right, about 15 feet at the shoulder, she begins to creep ever slowly towards the PCs. If the party runs to the end of the forest she reverts to a harmless human form as her magic is bound to the woods.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "0EOotSECLLo2Xvht","flags": {},"type": 0,"text": "A whisper and a giggle is heard coming from the woods. The spirit of a dead Viking girl is seen as she summons 1d6 skeletal wolves. She was intentionally poisoned and fed to this particularly savage pack in life and now she commands them in death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "hb1JUnDhXOkdNcZV","flags": {},"type": 0,"text": "A small fishing village is raided by 1d4 pale orcs while the fishermen were out on the lake. They’ve already slaughtered half the village, small fires have broken out. One stupidly fell into a net.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "3jkp2uzLDc7fH1OL","flags": {},"type": 0,"text": "An unnatural fog rolls into the path from the woods. Far off into the woods you hear a witch cackle as 1d4 will-o’-wisps attack the party","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "ijkfp7nEf5uRrGmU","flags": {},"type": 0,"text": "You find a boat maker and his family at his mooring being surrounded by Drow. They want to drag him to the Underdark to make boats so they can lay siege to an island on an underground lake that is protected by blind merfolk…and home to a great and dangerous treasure some say was buried deep in the earth by the god of the sea himself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "fnHuS38jK3ohfvcR","flags": {},"type": 0,"text": "Four dwarf lumberjacks bursts from the treeline being chased by 1d4 demon-possessed Treants. They are not happy and one is missing a chunk from their leg.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "KGjbZoyEBIhXUeyV","flags": {},"type": 0,"text": "You come upon a flaming boat going down a peaceful river. The occupant, however, has other plans as a flaming corpse claws towards you screaming as his hemp rope bonds burn away. You wish the water could have been a little deeper","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "FAFpyY0cH7a3NmGQ","flags": {},"type": 0,"text": "A lone Viking holding a battle ax stands at the end of a bridge you must cross. Silent and covered in a berserkers balm you know he is planning to kill all of you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "EyRG3buR7f8iAG5T","flags": {},"type": 0,"text": "A Tiefling Viking is ending an argument with a friend by pointing at her horns and yelling, “Yeah! Well at least mine are real!!!” Shocked to see someone this far out here they decide to rob you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "TkAboMpc2k66I8eB","flags": {},"type": 0,"text": "A golden stag of Freya has been murdered by a pair of mountain trolls. These stockier cousins of your garden variety troll are known for their cruelty and affinity for throwing large stones and blocks of ice to tenderize their food before eating. Burning the stags body in a proper funeral pyre would really put you on Freya’s good side.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "F2Ynm24KWSjhNJq1","flags": {},"type": 0,"text": "A fox being chased by four mastiffs is looking tired. Seeing the party she jumps into the biggest member’s arms and reverts to her human form. The red haired girl pleads for help just as 4 Vikings and a priest ride up to the party. “The child is an omen of evil! She is a witch and must be judged!” If asked how the riders dismount and draw their weapons shouting, “By iron!” When saved the girl thanks the party and introduces herself as Siggi Lokisdötter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "6dukei4OuouLfUfE","flags": {},"type": 0,"text": "A dwarf smith has been murdered while delivering his commission to a nearby temple. An orc stands over his corpse while unwrapping a spear that pulses with electricity. His raid bellow alerts the other orc band nearby as he rushes towards you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "rOC1d4fe3BCwilxM","flags": {},"type": 0,"text": "The stones crack open as a yawning portal from Hel opens and out screams a pale fallen Valkyrie with jet black hair. She was sent to kill a member of the party, but if overwhelmed she goes after a random family member or loved one and holds them hostage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "HOMLmsdVhvRDYSxk","flags": {},"type": 0,"text": "A raven of Odin warns you that a Jarl was recently murdered nearby and to just keep walking. The thanes fighting for power have separated into two main factions. Any side the party chooses will have a distinct advantage over the other. After the battle the winning faction murders the women and children of the defeated side. Leaving the bodies out for the ravens.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "B8qi7MSWTPGkmnQd","flags": {},"type": 0,"text": "A young shield maiden battles a necromancer in a fight to the death down in a frozen moor. Her mirrored shield redirects the wizard’s spells as he smashes down hard with a hand ax. Her friends (of every local race) held by dead hands, forced to watch her die. The three hundred ghouls surround the two fighters, growls and groans echo in the ice flats as ravens fly aloft in a darkened sky. If the party doesn’t kill the necromancer in 4 turns the shield maiden sacrifices herself to land the killing blow, dispelling all the zombies (and creating a pact of peace between all the denizens of the North).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "fYmBvwKxABR7H6JI","flags": {},"type": 0,"text": "A camp nearby is bragging about a recent successful raid. They toast and prepare to open the 1d4 chests they stole from an exotic land. One chest shoots out a cloud of acid and the other ones are mimics.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "rkiwPByzxhjGGH8c","flags": {},"type": 0,"text": "The anger of the gods manifests in the shape of blood and thunder. This is gonna be messy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "EOlQvrij1JTzYR1m","flags": {},"type": 0,"text": "Whalers have landed a large whale. They just began to harvest the blubber when 1d4 Ice Trolls caught the scent of blood. Half the whalers are already dead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "QOmAiEaF9XQboUoH","flags": {},"type": 0,"text": "A giant and aggressive Wild Boar defending its shotes from the group","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "xf4qLSzZt4bEdr8v","flags": {},"type": 0,"text": "A cart full of farmers fly by with torches and spears. The ones in the back call for help as they yell for you follow them. A king troll has been seen along the Eastern borderlands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "OrmEMZODd84J7XoF","flags": {},"type": 0,"text": "Twin Viking siblings (boy and girl) run into the party. Their family has fallen on tough times and they were sold into slavery. The new master beat them bloody and one of them within an inch of death so they ran. Two hounds, the master and a handful of farmhands are in pursuit. If it’s discovered he beat them so bad he faces dire consequences from the Jarl.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "1Whyy7MFQnfN9iYj","flags": {},"type": 0,"text": "A bonfire in the woods reveal ten Vikings and a cage full of Tieflings. One has already been blood eagle’d as another corpse burns on the pyre.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "jwR8KDRGJTg8FHi4","flags": {},"type": 0,"text": "A group of Brownies run into the party and are being chased by an angry necromancer. They stole his skulls. They give you open invitations to trade at their invisible villages that dot the countryside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "ioIrA6hogSTNAPzQ","flags": {},"type": 0,"text": "A little elf girl runs up to the party begging for help. Her ear has been cut off. A group of Vikings need her ears to bless their long boat. They are not leaving without it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "skdVH9eh7GPn4oTL","flags": {},"type": 0,"text": "Three masked Jötunn ice giants have ripped a boar apart on a two story jagged ice crystal and are drinking the blood by wringing out the corpse. They see you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "6ADkLM48LAZDPl9F","flags": {},"type": 0,"text": "A Treant and a raccoon are having a conversation in a clearing. A one eyed Tempest cleric with a hammer attacks the party. His name is Röht and he looks pissed. They carry a very impressive gem.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "gIYvzHSKfD5WT0V7","flags": {},"type": 0,"text": "The snow becomes thicker and heavier as you travel. An Ice Elemental freezes the last victim of a previous adventuring party. As she lets out her last scream you realize you are in the middle of a grizzly statue garden of at least 50 frozen corpses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "0YSSmj7bMd57BAct","flags": {},"type": 0,"text": "A child of the World Serpent thinks you’d make a nice snack. Don’t worry it’s only a baby…at only 30 feet long","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "HYqH6avnfigaA9AO","flags": {},"type": 0,"text": "Black magic permeates the air as you see a human sacrifice taking place at a blood covered altar before a human-faced dire-elk. It has human arms dangling off the side of his head under his antlers. The cultists call him a “Child of Loki”.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "WMKQMdbg7BxhYhLv","flags": {},"type": 0,"text": "Hel spits open and four goblin skeletons with hellhound mounts come for the soul of a party member","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "EjOUSHok2WhETJgl","flags": {},"type": 0,"text": "A hag is seen chasing an animated suit of chainmail armor. It begs you to help it. Eventually it will want to be turned back into a human.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "wH2W5roWb3dkSJLy","flags": {},"type": 0,"text": "A Hill Giant carrying off four sheep can be seen stomping onto the path. He spits out the shepherd’s leg and heads towards you with a crooked, bloody smile.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "Iqd3MM5ODjTQNoUK","flags": {},"type": 0,"text": "The wreckage of a wagon is seen on the trail. A ghost appears and begs you to help his family. Off in the distance two women and a boy are screaming as they are about to be sacrificed to Loki by some cultists.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "5GENsaFnELgiOzuY","flags": {},"type": 0,"text": "Six enslaved Yakfolk pull a great sled for a Fire Giant. She uses her flame whip to convince you to serve her.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "qUDjr4tHX2QVewHG","flags": {},"type": 0,"text": "A group of Hill Giants have made camp up ahead and are preparing dinner. The 12 course meal of peasants would like to be uninvited, if possible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "PzXpNLwFWOexw3gm","flags": {},"type": 0,"text": "The rain begins to hammer down along with the thunder and lightning. A bolt of black lightning hits the ground and 5-10 skeletons begin to rise up out of the mud.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "ut1S1wWeKeOwtf4B","flags": {},"type": 0,"text": "A group of dark dwarves waylay a trading caravan of regular dwarves and Tabaxi. They have a blind pale Hill Giant helping them. Two of the guards have been killed and one of them eaten.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "L6tzlIVLYsQ95Q1L","flags": {},"type": 0,"text": "A mourning family drags a shrouded body of a woman along the path. It is still moving. They wrestle the corpse near the open grave with a large runed cover stone. It’s hands are bound and mouth stuffed with straw. Her lover shows up and tries to steal her away before being sealed away by the protective magics. If you save the corpse she thanks you by biting your necks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "3MrnJHXeTRMHqrYU","flags": {},"type": 0,"text": "Drums are heard in the distance. A group of Vikings are blowing horns and calling the goddess Hel to this realm. They are about to offer a blood sacrifice of a Valkyrie and five red headed maidens. Dark magic begins to dance along the bones of a long dead Red Dragon skeleton. The fires are starting to grow…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "oNP4T0GoVSS8g1mo","flags": {},"type": 0,"text": "A viking is seen training a horde of goblins and hobgoblins to fight in a shield wall. He smiles as he sends them at you for practice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "yjhdiLAa5BI8qkSU","flags": {},"type": 0,"text": "The weather begins to worsen as a freak snowstorm begins to blow in. A crying blond Viking girl with one glove runs into you and begs you to leave her alone. She unleashes a large ice golem and a tiny animated snowman at the group. After the battle the girl’s sister runs up asking which direction she ran off to. Fortunately there’s a lovely sauna and comfy cabins nearby where you can let it go.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "N6ygJUhuT39NlnBk","flags": {},"type": 0,"text": "A black drake crashes down and tries to make a meal of the party. Black smoke billows from its eyes and mouth. Someone is controlling it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "KjPOC94CKWp0w32y","flags": {},"type": 0,"text": "A volcanic fissure opens in front of you. Six elemental lava zombies crawl out of the flaming maw heading towards you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "xCFm2zjA22OCeDL0","flags": {},"type": 0,"text": "A one horned female Tiefling is being chased by Vikings looking for a war horn. Blood steadily flows from their broken stub with bruises and cuts covering their battered body. She begs you for mercy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "HSD6f8ufTkocpVjn","flags": {},"type": 0,"text": "In a dark fen a great sword rests embedded in a dais of stone. Great brambles grow around it. This was known as the Fey Slayer and drove the Fey from this land ages ago. Two guardian shadow dryads watch over it, killing any they deem unworthy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "0yXP0v1AcTjKz4t1","flags": {},"type": 0,"text": "A trio of Mountain Trolls are about to eat an Asimar Wizard, a halfling, and 13 dwarves. The troll horde nearby is as epic as the smell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "PZ7eSItL7QkVwe6z","flags": {},"type": 0,"text": "A Viking has slain his friends. He says the armor he wears is cursed and made him do it. “Kill me, before I kill you too.” as he fights back tears and makes his way towards you. A dark spirit does reside within the armor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "1L86HZE0l0bELbLy","flags": {},"type": 0,"text": "An old great grandmother sits by her slain family on the side of the road near her burning cottage. Pale orcs laugh at her feeble attacks with her arthritic hands. The farm burns and animals cry as they are set alight by the spreading flames in their paddocks. “Odin grant me vengeance. Odin grant me justice.” she cries as an Orc Raider punches her in the gut, dropping her to her knees. The rolling thunder and freak storm begins to form. The air is heavy as she gets up one last time to lay her curse. “Valkyria!” is her last gasp before passing out…you are all suddenly possessed by battle hardened spirits under sway of the All Father and you have only one driving urge: kill the orcs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "nND6Wbb4lZezbrTX","flags": {},"type": 0,"text": "A warrior named Sven of Orkney and his archer wife are being chased by his uncle’s men. He is the true heir to the nearby hold. A necromancer amongst the thugs demands Sven’s blood. Sven has travelled and has wonderful stories to tell if you save him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "pyuZ2z2HIkVMbit0","flags": {},"type": 0,"text": "An elf Berserker in a bear skin cloak stuffs a handful of mushrooms into her mouth and runs at the party with her glowing red battle axe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "gTY4aFD605UEwmTF","flags": {},"type": 0,"text": "The earth beneath your feet reverberates and you hear something heading to the surface. A black ooze bleeds up and forms a gelatinous cube. A little digging reveals it was made to guard a buried treasure horde.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "hrtPJJ4rEBk8KXh4","flags": {},"type": 0,"text": "Red-eyed Ice Genasi and a Frost Giant pierce the Bifrost to invade the realm. This is just a scouting party. You are the only thing stopping a full scale invasion of the realm from happening.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "pvdn3XGqeNyyDIvw","flags": {},"type": 0,"text": "Four hooded Raven Kenku jump out of a nearby potters field, necromantic energy at the ready. They are easily distracted by shiny objects.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "e1bxiuryVUZxeJsi","flags": {},"type": 0,"text": "You find a baby crying in the middle of the road. His mother dead next to a dire wolf corpse, sword plunged to the hilt in the beast. The baby radiates a magical aura. A two headed dire wolf approaches. The hammer pendant around his neck points to who might be his father.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "EzndHajy4mKgpebX","flags": {},"type": 0,"text": "A tiny prince is about to be murdered by an unusually tall orc. The orc reveals his uncle paid for him to kill the child. If you save the child the Jarl will offer you the title of Thane should you eliminate the uncle and his vassals.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "4284gLW9nSZmdKof","flags": {},"type": 0,"text": "A red dragon whelp cries as it is being lashed and tied to a wagon by a group of Duergar. They have broken one wing already and knocked out a fang. Mom can’t be too far away…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "QjZpEy3RN7FV5gJr","flags": {},"type": 0,"text": "A Sorcerer has been attacked by the Jarl’s men. Beaten, stabbed, shot with arrows, and castrated they are preparing to drown him. He promises you great rewards if you help him. Rasputin Vordav will be eternally in your debt.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "bS4EIYreGf5IOghO","flags": {},"type": 0,"text": "Three warring Holds have met on their contested borderlands just out of arrow range of each other. In the middle a necromancer has captured five druids in a forbidden ritual. The corrupted life magic of the druids sends out a wave of death energy that instantly kills all three armies. Quietly a new undead army begins to rise. Kill the necromancer to break the spell and return the people to normal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "NmGICboqphOYzxu4","flags": {},"type": 0,"text": "The road takes you through the ruins of a massive mead hall. The dwarven support columns are ornately carved, telling the story of a great Jarl that united his people of all races against foreign invaders. The stone walls have been melted by dragon fire. Three red dragonborn attack the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "NDXgeX6N1yGCWzFz","flags": {},"type": 0,"text": "A wedding party is bringing the bride-to-be to her new husband. The political marriage would bring two warring Holds together. The pale orcs, fearing a united enemy, have dispatched four wolf riders to kill the wedding party and plant weapons of the other Hold on the bodies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "EiSv0GajaqtmNzda","flags": {},"type": 0,"text": "A party of Drow head towards a cave after attacking a group of travelling merchants and their carts. These Drow are different, blind, unable to speak a discernable language, and more feral than their regular cousins. The bound slaves beg for help. Their chitinous armor and weapons are quite unique to any surface dweller, as they haven’t been seen in 200 years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "Qy6gNAScIvnmXnWO","flags": {},"type": 0,"text": "You find Loki casually sitting on a rock next to the path. He wants to make a deal with the group that ultimately involves killing another god.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "mXFoT0ObXh6qgIDq"}
