{"name": "Campaign Start Scenarios","description": "One hundred different interesting starts to a campaign.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "9O5Yf1gxRg3iHEJl","flags": {},"type": 0,"text": "The party starts as slaves to a massive organization of Ogres who are looking to put the characters into a salt mine for the rest of their lives. As the guard has his back turned for a moment, the party catches a glimpse of a key ring around his belt. Could that unlock their shackles?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "mclDRXYiBq7lBJbP","flags": {},"type": 0,"text": "A merchant sold each party member a lemon item- a cracked hammer, tin-plated armor, etc. The party meets outside his shop, which is ‘coincedentally’ closed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "ZwGkBwtdEV9CZp61","flags": {},"type": 0,"text": "Someone dug a deep pit trap in the road, and a character (or someone else) has fallen in. The party gets together to help them out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "zqsrOUkDj0yZmZJh","flags": {},"type": 0,"text": "The party starts as gladiators and must fight each other. Either money or slavery led them to the colosseum.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "r5vikn5yr8rkYSiW","flags": {},"type": 0,"text": "The group are all on a caravan together travelling from one town to a nearby city. During the day, bandits/orcs raid the caravan, killing and burning some of the wagons before they take off into the wilderness. The group emerges from the ruins of their caravans and are forced into a makeshift group… do you search after the raiders for revenge? Get back items stolen? Or do you continue on your way because you have more important business/mission to attend to?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "48WOIENjeEx3kn55","flags": {},"type": 0,"text": "They are all framed for the same murder/robbery, and meet in jail.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "gdNtUfX782SOEc4s","flags": {},"type": 0,"text": "The party all have ties to a specific Church. They may be members of the Clergy, Enforcers, or someone who has a negative tie to said Church.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "F89I4F7cXiproVZ5","flags": {},"type": 0,"text": "The party is told about a new tavern that is offering free drinks for it’s grand opening. They all attend and get Shanghaied. They wake up on a slave ship with no equipment and have to escape or take control of the ship.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "9V4FKQMWqu9pxKB5","flags": {},"type": 0,"text": "A party member (or several) are all aboard a trade ship headed across the sea to deliver rare goods, when their ship is swallowed by a giant whale/sea monster! Inside it’s gullet are the rest of the party and several other rough-looking sea folk in what looks to be a small town hobbled together out of several shipwrecks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "lBbLduCNrdOwAaA4","flags": {},"type": 0,"text": "Each character steps into a magical portal leading (players can choose intended destination). A random teleportation mishap puts them together in the bottom of a cave, holding each other’s gear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "HWlDbph0W6yUSrK7","flags": {},"type": 0,"text": "A strange plague has run rampant through the town, turning nearly everyone to stone. Your party were unaffected and meet in the silent inn, filled with statues.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "IDvkmO5mU8O5aHqx","flags": {},"type": 0,"text": "Each party member is being blackmailed (using their respective bonds). The blackmailer has gathered them together with the offer of a score big enough to wipe away their debt.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "qCaLZj3IqAVdfyVO","flags": {},"type": 0,"text": "The inn the characters are staying at is shockingly packed. They are forced to share a table. A local tough claims it is her reserved table and demands the party leave, or face her gang…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "EpLqWuL45zz5SQ5e","flags": {},"type": 0,"text": "The party each owe an important debt to another party member (have them work out whom owes whom).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "M63DQ4g4NOVGH9aQ","flags": {},"type": 0,"text": "The party are stuck in the cellar of an evil wizard. Each of them (for their own purposes) attempted to break into the tower and were caught by security.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "ywWj4ODRl9RkBkRT","flags": {},"type": 0,"text": "Each party member has been having strange, recurring dreams involving the party as great heroes. They have never met each other before- until this chance meeting on the road…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "ToGInO4ucQcKz2MF","flags": {},"type": 0,"text": "The party wakes up chained to each other in a sandstone room with a portcullis to one side letting in a very bright light, the sound of thousands of people cheering right above them. It takes them a second to process that they’re about to fight another party/a giant creature in gladiatatorial combat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "08YnhW91VqH2pH8h","flags": {},"type": 0,"text": "You’re all at a funeral when the deceased comes back to life and lunges at the grieving family.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "tMSSXlDsoARWP48k","flags": {},"type": 0,"text": "You come to consciousness. Your eyes open, and there’s an immediate numb feeling in your arms. You glance at them, but you’re not laying on your back. You’re chained up. Your body slumps forward with a fierce pain in your shoulders. Chains clamped around your wrists, you look down. Your legs are also chained, not together, but to a wall. Panic sets in as you glance up you see other figures, your friends, all in the same predicament, except one man who seems to be in an iron cage. They are all unconscious to, slowly coming round. You have no gear, you’re stripped back to just your clothes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "9x8cBNd70mohUwRM","flags": {},"type": 0,"text": "The party all arrive at a dungeon at the same time, to answer the same advertisement asking for help retrieving an artifact. When they start to argue about whether or not they should work together and split the reward, they get ambushed by a small group of goblins.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "81gihCamUTaBxihH","flags": {},"type": 0,"text": "The party were all passengers on the same ship, when it was caught in a storm. Washing up on shore amping the wreckage, they seem to be the only survivors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "54sCMJmAPsoe1330","flags": {},"type": 0,"text": "Party is chained together, walking behind a wagon. One of the guards mentions that you are all going to be sacrificed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "yA9zOHDKsCsOVUg8","flags": {},"type": 0,"text": "As children, you were each enrolled in a cross-cultural pen pal association. You are meeting the other writers for the first time as adults.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "6CcqRxt9oyos5oBi","flags": {},"type": 0,"text": "You are all victims of a doppelganger who stole each of your identities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "9nOWPyfu6ERAInvg","flags": {},"type": 0,"text": "The players are invited to the reading of the will of [Random Player’s] Great-Uncle Thrice removed. When they and the rest of the party show up, they discover that Great Uncle Thrice had been something of an adventurer themselves – why, they once acquired the Mysterious MacGuffin from the Temple of the Red Herring! They also discover that they weren’t the only heavily armed group to show up….","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "QhduVpOf7au8keKy","flags": {},"type": 0,"text": "The party has been asked to help protect a traveling carnival going to the next city over. All is well until one day, the strongman is found wounded in his tent, claiming a member of the carnival is was taken into the woods by whatever attacked him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "dRTHfJH6xIVrNxjK","flags": {},"type": 0,"text": "The party was previously tasked to steal something from a primitive tribe. They managed to take it, but were caught, and now are running away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "SiEOSepo9UMMd0P9","flags": {},"type": 0,"text": "The party is in an inn, and suddenly people outside start to scream, and a person kicks the door, screaming “Dragon!”.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "JKztvDf72ldBWLwU","flags": {},"type": 0,"text": "The party is attending to a mutual friend’s wedding. Something bad happens during the event, and drives the party into adventure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "wCLQcTJ0TKiuiam2","flags": {},"type": 0,"text": "The party is in a big castle, attending some sort of event. A random fire begins, and threatens to quickly destroy the whole building. The party must escape, as they decide who, among all the people in danger, they are gonna save.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "683C9a54yOQXdsn9","flags": {},"type": 0,"text": "The city is burning. Enemies run through the streets, slaughtering all the citizens they see, with little to no resistance. Luckily, the party members weren’t attacked yet, but they must find a way to leave. All of the city gates are guarded by enemy soldiers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "a4fQtBE1HRAezdHI","flags": {},"type": 0,"text": "The party is approached by a man who claims to be stuck in a time loop [think Groundhog Day]. He says they already helped him before, and is very close to figuring out how to break free from the loop. He is able to provide the party with any evidence they ask for.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "3as5BxFa3qR2CLFK","flags": {},"type": 0,"text": "The party hears word of a man who claims to be a prophet of the apocalypse. The man was arrested for disturbing the peace, but the party begins to find evidence for his predictions coming true… [that doesn’t mean there will be an apocalypse, just that the man predicted many elements of the plot’s main conflict.]","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "4ApIqZ4ddBQ3fwKx","flags": {},"type": 0,"text": "A serious infection broke out in a big city. Authorities set a quarantine, but the party sees a group of people escaping.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "KJtmGLd7auw3tecl","flags": {},"type": 0,"text": "There are shooting stars in the night sky. They make an incredible light show, that makes most of the citizens stop what they are doing to watch. When it all ends though, people come to their homes to find that their valuable possessions disappeared.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "llrS62R8wk6pOmr1","flags": {},"type": 0,"text": "The party is next to a city square, where an opposition leader is making a speech to a big crowd. Suddenly, soldiers [who may or may not be aligned with the government] attack the crowd.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "cEfUcvrZCmxSvW8p","flags": {},"type": 0,"text": "The group has been pressed into naval service by a corrupt baron and needs to find a way to jump ship.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "HNYiRLkqOewP8t05","flags": {},"type": 0,"text": "The group (who haven’t met each other yet) are all enjoying their drinks at a tavern when a gang of ruffians breaks down the door demanding protection money. After the situation is resolved, the group finds themselves in trouble with the law.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "LxoSQxkc7amAwWjE","flags": {},"type": 0,"text": "A mysterious figure recruits each of the group members for a heist, only to betray them once the job is done.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "fxEiSOLszqFWXgeJ","flags": {},"type": 0,"text": "While sitting in a tavern a man approaches a member of the party and kneels before them. Crying the man tells him he is thankful to see the rightful Lord is alive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "QGwPcu4cYP5vJqnI","flags": {},"type": 0,"text": "The party finds, to their surprise, that they are the only non-cultists staying at the inn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "JiBZbUjfLnQLBM6z","flags": {},"type": 0,"text": "The party are all young citizens of a small town and as their “coming of age” rite, they must explore the tomb of a local hero and bring back an etching from his casket. What they don’t know, is that every rite like this that takes place in the town is more of a game that is set up by the mayor and other officials and townsfolk who have set clever tasks in order to challenge the would be adventurers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "cWiys3m7A0bCkDep","flags": {},"type": 0,"text": "The party start as guards to a noble’s gathering on the eve of a revolutionary uprising.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "ZVNNMWxK9Y0232HK","flags": {},"type": 0,"text": "The lord is holding a grand tournament. From near and far, people come to participate in the melee and/or archery contests, while the glorious knights come to joust. Along the main road to town stands a huge popular tavern/inn, about a day’s ride from the tournament. It is bursting with travelers on their way to the tournament, among the visitors of course the characters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "g73WYvpgonDHkjzo","flags": {},"type": 0,"text": "The characters wake up aboard a plague cart. Their bodies are about to be dumped in a mass grave.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "2UtXTI1fVcrjifYD","flags": {},"type": 0,"text": "The characters are all at the town square to witness the execution of a notorious bandit leader. The bandit’s companions launch a rescue operation without regard to the safety of the audience. (Option: When the hood is drawn off the bandit – or the executioner – one character is shocked to see it’s a relative.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "ZmJtPyPNEV1ZMwRM","flags": {},"type": 0,"text": "The characters have all grown up together in a small farming community and are expected to take over their fathers’ work. However, one rainy spring evening, a knight leading a company of soldiers comes to muster all able-bodied people in the area. War is coming.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "WAYpE3oVtXOSJnGP","flags": {},"type": 0,"text": "The party starts as disparate treasure hunters who have been brought together by a wealthy patron to seek a legendary tome. Little does the party know, the tome is one of unspeakable evil, and their charismatic patron is the leader of a secret organization. An organization bent on destruction/subjugation/apotheosis/something evil.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "IBEkYh5keTAZ6EeM","flags": {},"type": 0,"text": "A large gathering has brought the party to one town; a festival, a circus, etc. At night, a band of thieves rummages and steal all the expensive (more than common gear) items in the village. All adventurers are hired to find out who did it and get back all the stolen goods.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "XJ0PODHH7xyxTlgM","flags": {},"type": 0,"text": "For reasons of your own, you have each chosen (or been chosen) to join Ye Olde Heroes for Hyre, the largest private security & mercenary company in the land. As the newest recruits you’ve been assigned to the same squad. Your squad leader has just handed you your first assignment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "SDXi47TPmGvV66i7","flags": {},"type": 0,"text": "A traveling carnival has rolled into town, and you’ve all decided to check out the attractions. A commotion erupts and you realize that you’re all in the path of an escaped (or was it freed?) angry beast. Its trainer is nowhere to be found; you’re the only ones who can stop it from charging into the big top full of helpless townsfolk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "idxNjUgwFV9b2RG7","flags": {},"type": 0,"text": "The party has been executed by way of bottomless pit for crimes real or imagined. However, after hours of falling, they find themselves in a bustling underground City with a citizenry full of “executed” peoples. They must find their way back to the surface for their revenge.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "eZ9plLGCaH9jXgo8","flags": {},"type": 0,"text": "You arrive at the gates of the reclusive gnome inventor Tinky Tonka’s factory, each carrying the golden ticket that allows you to see what goes on inside. What wonders await!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "RJ9zNx5H0RNvqefE","flags": {},"type": 0,"text": "Metal men have come out from an old ruined castle and have begun chopping down the forest. They carry the lumber back to the castle, but no one has gotten close enough to see what it’s being used for.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "ejV8KAW1V0zMWaex","flags": {},"type": 0,"text": "You are each arrested and pulled into the Chancellory Court. There, a tearful widow declares that it was one of you who killed her husband. When she cannot identify which one, and you each declare your innocence, you are provisionally released while more information is gathered. You can escape the town together, or band together to find the real killer. The DM can also talk privately to one player beforehand, so one of them is actually the killer, and can put that into their character’s backstory.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "gulcEzDJgdVID7zl","flags": {},"type": 0,"text": "You are each contacted by Sowusi Aletongo, a Thayyan Prince who offers you an incredibly lucrative deal. When you arrive at the agreed upon meeting spot, an abandoned cabin in the forest, you find only the other party members.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "q2zuGTU86BQVsHNF","flags": {},"type": 0,"text": "You are all (at least) 2nd cousins via the progenitor Golan the Virile, a handsome, dashing and marriage-hopping bard. He arranged a small inheritance for all of his progeny and step-progeny, and had all of them meet in small groups based on geography. The party represents the grandchildren in your area.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "5IkDqlXje550sLa5","flags": {},"type": 0,"text": "The surrounding areas are all suffering an extreme drought but this town is having a massive harvest festival. Different rumors intrigue each member enough to make a trip.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "YGfe1B9tAth24etC","flags": {},"type": 0,"text": "Heavy rains have washed out all bridges and paths except the main highway. People have formed a caravan to reach higher ground. Your party has all ended up traveling together.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "0CEOUpwx8HT8B186","flags": {},"type": 0,"text": "A local magistrate has sent his brute squad to round up anyone who looks suspicious. Your party was all gathered up. The magistrate isn’t looking arrest you. He is looking to form a band of strangers to kidnap someone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "nNIBz6NQOGZEIusm","flags": {},"type": 0,"text": "You have all attended a large banquet. During the feast you have all been knocked unconscious. You wake in the morning and all the guests but you have died.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "Ka0jIYyUV1UoWr7b","flags": {},"type": 0,"text": "A huge, Violet hurricane came blowing through the town where all the characters happened to be staying. You are trapped for hours together in a cellar while it blows over.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "htui1i55IZ3sgtKy","flags": {},"type": 0,"text": "Each player owes a favor to a local Lord. A mysterious figure recently came to the Lord and purchased those favors, and now he calls the characters together to collect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "2JUTmAdYb3cw6BEe","flags": {},"type": 0,"text": "You are orphan children and you are part of an orphanage that is self-supporting with agriculture. Suddenly, the golem-worker stops working.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "eqzWkuFSRAXQkSdb","flags": {},"type": 0,"text": "Some noble lord has made a call for adventurers to help him clear the goblin infestation out of his land or complete some other quest appropriate to the campaign. Whoever does the best job will win a prize. However, all of you missed the memo that you were supposed to come in teams of (insert party size here). You’re the only ones who showed up alone, so now you’re stuck on a team together.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "9vxLcI1NCXdWWk0m","flags": {},"type": 0,"text": "Each of you independently helped stop some crime or disaster just before the campaign began, all for your own reasons. You have all been invited to some ceremony where you will be honored for your participation. During the ceremony, someone who isn’t happy about your deeds attacks, targeting all of you specifically.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "x4IljLbg16vgkmK1","flags": {},"type": 0,"text": "The players are all trying to kill the same reclusive Lord and have planned thier break ins on the same day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "luBF6BS4S9LzXYPV","flags": {},"type": 0,"text": "It’s the day of the year every guild in the capital dreads. Every guild must present their annual accounting report to the department of accounting in order to determine if everything is reported correctly and is in order. Each member of the party has drawn the short straw of delivering the books of their respective guilds, and have spent the last 8 hours standing together in line, getting to know one another to pass the time. As the first of the PCs makes it to the front, a commotion can be heard at the entrance…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "gLRgR8rX7fDGK4rk","flags": {},"type": 0,"text": "As you fall uncouncious in battle, you hear the god Lathander speak out to Tyr: He is not ready yet, let him go! You wake up from a bird pecking around your clothes. Around you body’s lay on the ground, there are people in the distance. The air smells metallic from the blood around you, the ground is red. You see some others wake up, and your eyes meet. You notice a connection in their eyes. Wounded, what would you like to do.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "gjSBK8qR7hL9uzbV","flags": {},"type": 0,"text": "You’re startled into wakefulness by the crow of a rooster. You manage to unstick your eyelids, to find that the pressure on your chest was the rooster itself, who glares at you with homicidal malice and crows again. This sets off the monstrous headache you had only just started to understand you had. You slide off the wooden… shelves, covered with straw? that you were sleeping on and stagger to your feet. NOW the headache hits: this is a hangover only in the sense that the plague is an illness. You are in your only set of fine clothes, now ruined: smeared with mud, dung, broken eggs, straw and the thick, pungent smell of the jug of mysterious liquor you now remember that guy in the hat insisting you drink. A couple of hens peck the ground near your feet. You vomit in the dust and straw in front of you: the chickens investigate. You wash out your mouth with the last sip of stale water from your canteen. Now you can see that you were sleeping on the bench of a wagon, which somehow crashed through the wall of the chicken coop. Vanished are the horses you remember pulling the wagon, too fast across a bridge with the rest of the party in the back. The rest of your party is sprawled across the coop and begins to awaken. The rooster crows again. Gods, it hurts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "eHSGjL6fGsPrdBwg","flags": {},"type": 0,"text": "The party wakes up on a beach in front of a neverending forest that seems to go on for forever, no matter how far they go. They must complete a quest in the woods in order to be allowed to leave.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "hV1TRlef7sayeDsR","flags": {},"type": 0,"text": "Returning home after a long journey, you’re comforted by the familiar sight of the rolling hills that surround the village and begin thinking about a hot bath and your nice, comfortable bed. Your happiness turns to shock as you crest the hill. How can the entire village have disappeared?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "3867MMjkdNf6O1FP","flags": {},"type": 0,"text": "An aging wizard wishes to give back to the community and start his own wizarding school. He urgently needs his first ever spell book, but he sold it some years back while travelling the land. Return it and he’ll pay handsomely.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "mY63Qkr5EvC7O2Yi","flags": {},"type": 0,"text": "The characters are attending a local fair and doing their own things when they hear screaming. The performers at the center of the fair are being attacked. While everyone else rushes away from danger, the heroes put their heads down and charge in.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "2k6TWw6CLbJp6BJi","flags": {},"type": 0,"text": "Your party has just finished its first job as official adventurers walking back to the woman who gave you your job when she comes running up, claiming the princess has been assassinated and the group is being framed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "MZjOnq8t0WnwvfOq","flags": {},"type": 0,"text": "The PC were part of a dungeon exploration group. Almost all other npcs apart from the leader, his mage and three of his soldiers met their demise in those heavily trapped dungeon. Im the last room, some sort of artifact os displayed on an altar, surrounded by mounds of gold and gemstones. While resting, one of the party overhears a conversation between the leader and his mage assistant. They want to get the artifact and gold to themself. During night, whem everyone seems asleep, you see the leader and his aide at the pedestal where the artifact is. On touch, the leader screams and throws the artifact towards the group, to suddenly get ripped apart by an unknown force. A strong wind seems to suck in all that is close and its getting stronger. You wake up everyone, tske the artifact and run out of the dungeon. Outside, the dungeon collapses and you are stranded in the mountains without gear or rations, only one horse with provisons is still there, while all others fled. Its the PCs and the three soldiers survived.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "g9etRVgvIDnJqwkA","flags": {},"type": 0,"text": "The party is hired to investigate a death at the archaeological dig site of a ruined city. One of the archaeologists disappeared into thin air, only to reappear days later. He seemed fine at first, but then during supper started rapidly aging and died of old age. While investigating, the party steps through a one-way portal. They find themselves in the city before it was ruined, and later on figure out the entire city is stuck in a Groundhog Day loop. They have to either figure out how to break the city from the loop or find out how to escape themselves while not dying the same way the archaeologist did.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "NZrseWWMVjdQH4NK","flags": {},"type": 0,"text": "A strange looking ship without a crew floated into the local docks. The charts inside seem to chart a route to previously unknown lands. In the cabin what is presumably the captain’s journal is found written in a strange language, stained with blood. The journal has been translated, all you need to do is join the crew.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "bnFNd2BEzPuKYca5","flags": {},"type": 0,"text": "The party starts out as a group of young nobility at a private academy that their elders sent them to to learn about culture, etiquette, and politics. Unknown to the elders some of the masters were also teaching them how to fight and cast magic. These masters are new arrivals and no one is quite sure how they got their positions. One night when the party is heading to their secret training (which they don’t realize is not part of the normal curriculum) they find their new masters slaughtered and some clues that will lead them on the rest of the adventure. Secretly the masters were a group that con-ed their way into the academy so they could train and recruit the young and powerful for their cause [insert main quest here].","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "7d5o3VCKjZsQW7D8","flags": {},"type": 0,"text": "The party are all at a huge auction: the only problem? They all want the same item.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "mGgVzWvo1jTuZLPe","flags": {},"type": 0,"text": "Annual hunting competition, the party is thrown together as a band of misfits since the competition requires a certain hunting party size.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "GmqcdlizpB3jAwcg","flags": {},"type": 0,"text": "A local magistrate puts together a special task force of city guard and ex-cons to take down a city smuggling ring.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "UcsUpmmLHd3BUcg4","flags": {},"type": 0,"text": "Group is in a seaside tavern when a local fisherman barges in with tales of a terrific sea monster. After calming his nerves, the fisherman wants to hire some adventurers to slay the beast.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "EREBgXyfXBa8t357","flags": {},"type": 0,"text": "Local tavern has a dance competition. During a particularly vigorous Goliath clog dancing performance, the floor gives way and the party and many bar patrons find themselves in the bottom of a cavern that also happens to be a large goblin settlement.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "b5zXEt0RF5LrlZyQ","flags": {},"type": 0,"text": "The BBEG captures the party after hearing prophecy that only they can stop his evil plan. The party had never met, the BBEG ends up being what introduces the group to each other.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "wAH2X4QoVhfEBFLY","flags": {},"type": 0,"text": "The party is attending a city’s Carnevale masquerade event. During the festivities in the main square, a group all wearing the same mask start stabbing revelers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "YPLiWDD05cMVnr2X","flags": {},"type": 0,"text": "A strange door leading to a magical endless and random dungeon has appeared in the countryside. It quickly becomes a magnet for adventurer’s and their hanger-ons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "1vchBIJEQvLSSkRg","flags": {},"type": 0,"text": "Party is summoned to famous eccentric wizard’s tower. The wizard is hiring adventurers for….. test subjects.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "mqjyXJ2FxyHNXhff","flags": {},"type": 0,"text": "During general sewer maintenance, a new series of tunnels are found under the city. The town is hiring folks to explore it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "fytJcZWrh7ZAZdkj","flags": {},"type": 0,"text": "A new continent is found across the sea. Adventurers are all travelling across the sea to tame this new wild land.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "DoMEKowRKyTYjXMQ","flags": {},"type": 0,"text": "In the kingdom that the players were in there was a group of famed hero’s who have saved the land several times, kept the peace, and at this point, provided stability to the monarch since they can influence public opinion. Unfortunately, they all died in their sleep one night at the palace of what seems to be a potent and rare poison. The current monarch, who only recently assumed the throne after their father’s death, fears the people might turn on them so they seek to cover up the heroes’ mysterious demise. The monarch’s wizards believe any magical illusion could be found out by any number of magic users in the city so they use scrying to search the kingdom for look-a-likes. The players have been brought together as they each most resemble one of the fallen heroes. They are only asked to play the part of the kingdom’s legends but end up actually getting caught up in an adventure to protect their homeland and must become the heroes they were pretending to be.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "Y7ybTRYGmXjv2vTS","flags": {},"type": 0,"text": "The party along with a couple of NPCs have been kidnapped by a litch to be used as experiments. They must break out together, but little do they know that the NPCs are being used as spies by the litch.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "fFf2LKyDgJDrraqj","flags": {},"type": 0,"text": "The different members of the party have been hired to steal a magic book from the king’s archives. However, touching the book teleports you inside it. The characters must work together and survive to the end of the book’s story or find some other way to escape the book.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "ae4aeNzNVXb25Xtf","flags": {},"type": 0,"text": "A play about a werewolf is going on in town. It turns out they used a real werewolf as an actor to help with realism in the show, and the theater has hired the PCs to restrain him while acting as werewolf hunters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "w7mRWE2peCVY63Hb","flags": {},"type": 0,"text": "The PCs were given the options of life in prison and the labarynth. Assuming they chose the labarynth, they are teleported to a saw style dragon’s lair and must work together to survive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "6trYgOQubEMUOjVJ","flags": {},"type": 0,"text": "A mermaid gave each of them a magic sword and told them they were the chosen one to kill an evil lord. When the players all reach the Lord’s castle carrying similar swords they figure out that the Lord isn’t that evil and the mermaid just wants someone to kill her ex. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "0S1rIwMKjMrjyS2F","flags": {},"type": 0,"text": "You all wake up in a burning cornfield.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "orqqaeK3ZUK9u2r7","flags": {},"type": 0,"text": "The party wakes up to a rumbling as the tower wall of the dungeon they were in collapses into the sea. The time dilation field that held them is now broken as the castle deteriorated. It’s been three centuries since they were imprisoned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "6v8uEFa1StmR9eH4","flags": {},"type": 0,"text": "The party is left to die at the edge of town. Some are tied to stakes, a pillory holds a couple of you, others tied flat to the ground from each limb, and one is shoved into a pauper’s cage. A dog is enjoying licking the bare feet of one prisoner…but there’s something tied to his collar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "9J4aXUChTEDVhBYh","flags": {},"type": 0,"text": "One of the players is a very powerful noble prince who has hired the other characters to guard him as he makes a hunting trip. The hunting trip will be ambushed by a cult that needs the prince’s blood for a demon ritual. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "Ca3LuRSJT7FmHe2j"}
