{"name": "Unusual Scifi Bartenders","description": "One hundred interesting and unusual bartenders that you can find in all reaches of the Universe.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "9RAfKdR9sZCxVbA5","flags": {},"type": 0,"text": "A gigantic centipede curling along the length of the bar, several sections of its body are serving different customers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "8ab3rHciJ4RQN1mb","flags": {},"type": 0,"text": "A mass of small, uncoordinated robots are attempting to serve drinks to customers. They are spilling drinks, shattering glasses and generally doing a poor job of service but somehow manage to succeed through sheer force of numbers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "Xsc9uMNyG4pbI9ZM","flags": {},"type": 0,"text": "A time-traveler who gets the drinks by entering a small portal in the back of the bar and ordering the drinks in other bars in different times and dimensions as a fake visitor. He can get you any drink what-so-ever for twice it’s original price. Also might permanently alter reality because of time traveling paradox.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "SdmGeoFMpPIIdcm8","flags": {},"type": 0,"text": "A large computer wired up to an automatic drinks dispensing, cash-collecting mechanism that happily serves the patrons drinks while beeping incessantly. Flashing lights included.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "Q1Cicq00i7Tr5JuO","flags": {},"type": 0,"text": "Skliff – A six foot tall amoeboid with a faint purple hue. Skliff has the unfortunate habit of accidentally absorbing the drinks that it serves. Although it can’t talk, Skliff has a reputation as a great listener and several regulars insist that it has given them great advice. One even says that Skliff saved his marriage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "uDq4xkGtyyCq6row","flags": {},"type": 0,"text": "Graelg – An enormous creature, not unlike an earth anglerfish, however, Graelg’s lure is a voluptuous humanoid. Graelg heard the commotion of the bar, and used the sewers to move underneath and place its lure. The lure moves behind the bar and has enough connection to the Graelg’s brain to carry out small talk and get orders, unfortunately not enough to get them all right. This is fine for the Graelg because the humanoids who are attracted to the lure enough to not care about the mistakes will follow it downstairs to the basement and the Graelg’s mouth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "oaRSkppK31dvMZyh","flags": {},"type": 0,"text": "Terrence – Standing nine feet tall, Terrence is a humanoid beetle from Exoplanet 648-A89. He’s covered in a slick, blue-black, chitinous armor, and fine hairs of the same color. Terrence can serve four trays of drinks at once, and the other bartenders will ask him to help with carrying up a particularly heavy keg, barrel, or rack of canisters. Terrence also acts as the bar’s bouncer, but those who work with him know that, despite his intimidating mandibles and exoskeleton, Terrence is a sweetheart.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "j4sttok1hRnUwltg","flags": {},"type": 0,"text": "Thompson doesn’t actually own the bar, or work here. He was a patron here some time long ago, and one day decided to help out by bringing an empty glass from a nearby table back to the bar. On his way, someone ordered a drink from him and he figured ‘I guess I could bring it to him…’ and while on his way back to serve this patron, someone else requested an order of onion rings. Thompson tried to find the wait staff and kitchen staff and owner, but to no avail. He has been serving patrons ever since. He keeps all the tips he earns, but dutiful keeps careful tabs on the bars books, and stores all the gold he receives from drinks and food in barrels in the cellar for when the owners eventually return, whenever that will be. He figures ‘If I owned a tavern and was indisposed, I hope some kind soul would cover for me for a while!’ and so he’s been working here for the past 12 years. He never takes any wages, and lives only on his tips. He keeps the decor in the tavern exactly how it was that day he stopped in for a drink 12 years ago, and has basically faked it till he make-d it since. He is a kind old man, and no one really knows he isn’t actually the proprietor. He doesn’t correct anyone who assumes he is, for fear of someone taking advantage of the tavern. He cleans up every night by himself, locks the door, heads home, and in the morning is the first one back making sure glasses are cleaned, floors are swept, the beer is cold, and the Turnip and Fig tavern runs smoothly, day in and day out, until it’s owners return.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "qUC4kphXBebVOdtq","flags": {},"type": 0,"text": "A bartender who becomes very offended by color yellow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "coBc21AGG1E6lbOO","flags": {},"type": 0,"text": "James is a 7′ tall, 3’x3′ wide featureless metallic gray brick, and is the bartender for the Incognito bar on the seventh rim, fourth spoke. The bar itself is nothing unusual, featuring low- to middle-grade beers and cocktails that show little ingenuity. James’ stage presence, however, keeps the bar packed every night. Those hoping for a drink may chant out, ‘James! James! James!’ and if enough do so simultaneously, the lights in the bar will flicker and go out for a moment. When the lights turn back on, the chanters will find their desired beverage in a glass in front of them. Trying to keep a flashlight on James will keep the trick from working, and testy patrons are quick to discourage people trying to find out the secret. Prices are clearly marked and payments are on the honor system, as James is the only employee. Those who skip their bill, however, often wake up to a home visit from James himself looking to collect on their drinks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "f34zKKTrgK10jL50","flags": {},"type": 0,"text": "A completely generic human who very scared and confused because of all the weird patrons his bar is receiving.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "nidDIn8w4Kw1vSty","flags": {},"type": 0,"text": "An octopus in a trench coat. No one knows why it’s there, but maybe the manager thought it was a mind flayer or some kind of alien. It doesn’t understand any language and will only serve a generic beer… in a slimy glass.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "dNvhiwpK42wo87t2","flags": {},"type": 0,"text": "A dog, he is a good boy. He fetches any drink you ask for and people pay him out of respect. He owns and runs the establishment himself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "rZIkDylCm9bwjV7A","flags": {},"type": 0,"text": "Gabbo is relatively human-like, spare for his metallic-green skin and exceptionally wide mouth. He’s also not technically male, but insists that it’s ‘close enough’. He has a vice for small gambling wagers, and has given out far too many free drinks because of it. His boss would fire him but the regulars adore him!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "6oDYwFRpgo3BIuHW","flags": {},"type": 0,"text": "Lin-Sabah: She is a part time Lepidopterist (A person who studies or collects butterflies and moths), and partially genetically modified her body to communicate with her pets. She owns a bar to fund her research, and her insects take tabs and deliver drinks when she is busy with other customers. The butterflies are for mornings and moths for night. Her eyes are cloudy and she has small wings and antennae. Lin will let her pets try tasks to test their limits, but gets very defensive over customers trying or accidentally hurting her pets. If a customer kills one or starts a ruckus, she’ll swarm them till they leave. She is constantly talking to her pets, so she is almost always talking to someone at any given time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "svIrz39GGA3Z9Cdb","flags": {},"type": 0,"text": "Sinhestara (Sin for short) is a tall green woman with a pair of antennae on her head, and three breasts that she shows off with sparkly hot pink pasties. Her bottom half is long and snake-like, and naked. In fact, the only clothes she really wears are her standard leather bracers around her four wrists. She is an expert multitasker with those four arms. Her eyes are dark and nebulous, with no distinct pupil. Her black hair is held up in a wild ponytail, save for her feathered bangs. It shines slightly red in the light. She elongated her S’s when she speaks. She herself doesn’t have a forked tongue, though, it’s just a habit she’s picked up from her native language/dialect. She is confident and open.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "p4OkZOahkUuJS0li","flags": {},"type": 0,"text": "A child-sized octopedal arthropod, which continually shouts insults at its customers. Its insults frequently reference the anatomy of its species, so very rarely are anyone’s feelings ever hurt. Decent drinks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "5yJGU8MKbZja75EE","flags": {},"type": 0,"text": "The ‘bartender’ is a custodian, which will direct any customers into holding pods and collect payment. The real bar is in virtual reality accessed by the pods. The pod will alter the chemical makeup of one’s body (or run a temporary behavior modifying script for any robotic customers) do intoxicate them when they imbibe beverages in VR. Reroll for the bartender within the VR pub. Perceived drink taste and strength scales with cost.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "kCwBiks6842Dxyju","flags": {},"type": 0,"text": "The-one-that-is-called-barkeep is a Feloorian Anemone from the seas of Telvar-1c. It is a four-meter tall grey-blue mound of flesh, bristling with more than three dozen tentacles, and embedded into a large ring of slightly porous sea stone, which serves as the bar. Every 17 years a new stone must be shipped to the bar, and the barkeep moved to it, as it slowly consumes the minerals it contains for sustenance. Seven of it’s tentacles end in large eyes with ‘Y’ shaped pupils, each a different color. It has learned over centuries to individually control the multiple nictitating membranes that each eye possesses, allowing it a degree of interaction with it’s patrons beyond simply making drinks. The remaining tendrils branch into myriad tiny tendrils, which it uses to ply it’s trade, using a large ring-shaped framework hanging from the ceiling of the bar, containing an impressive number of bottles mounted neck down into valved holders. The frame also contains a misting system to keep it’s skin moist and hydrated. While it cannot speak, it can hear, and always acknowledges customers with a friendly nod of an eyestalk as it mixes their requested drinks. If one were to look closely at the selection of ingredients, there would be some oddities found. A blue bottle with a faint luminescence labeled ‘wistfulness’, a green bottle whose contents seem to bubble constantly and whose label is in no known language. There is one with a liquid that seems to be holding still in the shape of a crashing wave, labeled ‘joyous homecoming in the last days of summer’. A jet-black bottle with the ominous label of ‘the unmaker’, and many others.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "Y7hBLxKgO4E9w7nJ","flags": {},"type": 0,"text": "Ni’Mora is a very young hive mind. They have four bodies; all of it’s preferred type, bipedal sentient beings. They work here because of their aversion to forcing other sentient beings to join against their will. Ni’Mora is the child-mind of K’naxx, a hive mind that spans seven planets. Ni’Mora is always looking for new bodies, and is a cheap surgical team, they can heal even death up to 24 hours out when given permission to assimilate a being.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "KZ5VRhumwsejuX1h","flags": {},"type": 0,"text": "A humanlike robot that makes drinks by consuming each ingredient separately, then removes a glass from within its abdomen that contains the desired drink made perfectly. On occasion, a small piece of metal such as a washer or bolt will be sitting in the glass, much to the robot’s embarrassment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "raMvUugYseHJNBAP","flags": {},"type": 0,"text": "You-want-some-more is a mechanical automaton with a soda/liquor dispenser arm. Theoretically, it’s programmed to ask ‘Do you want some more?’ A bug in the coding drops the ‘Do’ and it simply states it’s command as it overfills drinks. The programmer was shot dead playing poker on Alpha-7, and he used a really good password.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "8lUiTUNJeaFWZLar","flags": {},"type": 0,"text": "Very eccentric. Looks human. Organs, limbs, and all. No apparent extra features. Insists that he is named ‘The Bartender.’ There is a picture of The Bartender outside the Tavern, but occasionally on return visits, he looks different. Still human but very distinct. Once or twice it was actually a WOMAN. So many patrons seem to revere this Bartender. You sometimes hear his name spoken, whether I fear or reverence, in remote corners of the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "98LjSgRJ9qEaQJ3i","flags": {},"type": 0,"text": "A small fetus wearing a tiny tailor made bartender suit. It floats in a levitating glass orb, surrounded by smaller glass orbs that orbit it. Drinks are never ordered, but if anyone wants to get a drink, it would read on the bar, with the price added to their tab. Each drink is made telekinetically, with the various orbs moving about, grabbing drinks within them and mixing them. It’s signature drink is the ‘Child’s Play’, a multicolored, swirling glittery drink, that invokes a feeling of safety, and contentment, usually followed by happy childhood memories when possible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "jJKcOrvxPbm2fsGl","flags": {},"type": 0,"text": "The bartender is a small humanoid of an unrecognizable species, but he appears to be very, very old. He wears a drab robe and sits solemnly on a chair behind the bar, next to a cooler. While you’re ordering your drink, he pulls it out of the cooler before you finish speaking. It’s perfectly made. He immediately prepares another drink and places it in the cooler, ready for the next patron.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "FMCKDSUQuh4NJoOr","flags": {},"type": 0,"text": "The bartender is a dense cloud of noxious gas with 5 colorful luminescent orbs floating in it. The gas is telepathic and speaks in your mind with an ambiguous accent, with the orbs flashing as it ‘speaks’. It materializes your desired drink out of thin air and it is delicious, but the cloud has a habit of bursting into song.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "3pWmADnaawbivHZG","flags": {},"type": 0,"text": "The bartender appears relatively normal, although there is something suspicious about him. When you reach for your coins to pay for the drink, you realize that the required payment is missing. There is no possible way he could have reached them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "naHPL0nPEJMeZLYp","flags": {},"type": 0,"text": "This bartending robot has So. Many. Arms. Unfortunately every drink it makes is poisonous to humans.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "aw5fGd6xsiZtHMXO","flags": {},"type": 0,"text": "Upon reaching the bar, there is a dense cloud, which shimmers and moves in erratic patterns. When you order a drink, the cloud condenses near an empty cup and a ‘rainfall’ of the drink you ordered falls into the cup. Toppings and the cup are moved by way of a strong force of wind. Taking a hold of the drink, the cloud moves past your ear and random sounds from across the room are seemingly carried by the wind to form the words ‘thank you’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "O04llNfMZmzHhjEv","flags": {},"type": 0,"text": "A sloppy looking slug creature sits behind the bar. The 12 drinks on the menu are ones you’ve never heard of. Upon ordering one, the slug lifts its body and exposes 12 breasts. One of the breasts is put in a device, which squeezes it spouting different colored liquids for each one. The action looks gross but the drink looks and tastes amazing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "Y3JEZoVfEU12fGZs","flags": {},"type": 0,"text": "Buford, an uplifted grizzly bear, doesn’t have any strong opinions on local politics. He will talk your ear off about how 16th wave microbrewers shot themselves in the foot by trying to lobby against sentient yeasts. Jokes about pic-a-nic baskets are a great way to get yourself banned form the bar for life.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "bP5NNnsw4eLbrWWM","flags": {},"type": 0,"text": "Exodus is an artificial intelligence and techno-prophet. At least, that’s what it claims, and since it always seems to know why you’re there, who you’re meeting, and what you’d like to drink, it’s hard to argue. Its avatar (a wild-eyed man with a tendency to say ‘Lo’ and ‘Unto’ more than anybody is used to) is only ever seen inside the bar, yet it always seems to know what’s going on outside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "aq2nLusG2igSCNli","flags": {},"type": 0,"text": "After her face was mutilated in a chemical spill on Orleans VII, Edmée Jackson-Salazar managed to walk away with an impressive settlement which she spent on two things: a custom-built holoprojection facade which covers her features with a mostly believable simulacrum of her old face, and the bar where she now serves drinks. Edmée has no love for the corporations that suck the life out of the working man, but none can say if rumors about her involvement with various groups of that persuasion are accurate or not. If you’re feeling brave, Edmée’s home-brewed tequila is said to use Orleanian agave, a strain banned for its mind-altering properties.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "sWUp4b0dw1PLuq9P","flags": {},"type": 0,"text": "The bar tender appears to be a normal human despite his purple skin tone. He seems like he is ignoring you to clean a glass whenever you approach him, but if you order a drink his visage flutters for a moment and the beverage is set in front of you, as he continues to work off the smudge on the glass that he just can’t seem to get.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "HZBxRoCx6UYiIzWE","flags": {},"type": 0,"text": "A star being that is behind a protective screen which emits the ingredients necessary to make your drink by performing fusion on the hydrogen it consumes as sustenance, which is then collected and dispensed into your mug.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "T6shTLL1NoORV8US","flags": {},"type": 0,"text": "A dozen clones of the same guy along the length of the day making the same jokes and wise cracks to all the patrons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "mCd6GQbArNGv4HOX","flags": {},"type": 0,"text": "A rock monster scoops up several gems and grinds them into a fine powder, which he puts onto the rim of a fancy margarita. They glow with a slight iridescence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "ePD8HuIOwUOi79vi","flags": {},"type": 0,"text": "A hot alien girl in a dingy bar, stating that she’d ‘like to check out your midichlorian count.’ Whatever that means.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "yXiPnKnnPQmA2Uz8","flags": {},"type": 0,"text": "A robot with arms and hands that seem to be able to split infinitely into smaller and smaller appendages to serve everyone at once.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "jWkO2U67ktbIP2gI","flags": {},"type": 0,"text": "Placing your palm on the bar and thinking about your order causes your drink to lift out of a nearby opening on the bar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "DegxF1evjX03CHxz","flags": {},"type": 0,"text": "A motionless brain in a jar reads your thoughts as you approach the bar then telepathically makes your drink and slides it to you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "VYw8FfdjfTsFhQVg","flags": {},"type": 0,"text": "A pair of twins alternate adding one ingredient each to your cocktail.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "qNGw9kVDezscrHAy","flags": {},"type": 0,"text": "A chip in the table overhears your group requests for a round, and a hovering drinks tray brings them over.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "cRueJZdh7wKqXkGP","flags": {},"type": 0,"text": "A robot that is monotone but very sarcastic and makes fun of whatever the patrons order.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "STINBurTMOCTN6Db","flags": {},"type": 0,"text": "No bartender. Instead, everything is automated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "S0tX6KXLs4r0Clcx","flags": {},"type": 0,"text": "An alien that only understands what you’re saying if it rhymes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "ggENMM4Qvm8ncah2","flags": {},"type": 0,"text": "A human man from the 1950s. He’s not sure how he got there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "3XQOpLkCjDkU9bMl","flags": {},"type": 0,"text": "A gelatinous being that excretes each drink from a different reservoir within.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "ZhqtvJxNOOS9H87V","flags": {},"type": 0,"text": "A pair of tentacles emerging from a portal. You never see what’s on the other side.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "BLTLIJFhRf9Yv5pk","flags": {},"type": 0,"text": "A tree that grows each drink. You pick each drink like fruit. It’s branches cover the ceiling.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "3ZHGJ2gvZIdGhLOf","flags": {},"type": 0,"text": "A team of tiny aliens no more than 5 inches tall.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "KEuo1AcP89Dut5pd","flags": {},"type": 0,"text": "A human with a tattoo in an alien script down their forearm that they insist means ‘Unbreakable’. Anyone that can read the language sees that it means ‘Translation servers currently down, please try again later’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "fbh3ykxTzNW96ili","flags": {},"type": 0,"text": "The ‘bar’ is actually an elevated strip of dirt. When a drink is ordered, the plants needed to brew the drink (barley for beer, grapes for wine etc.) grow in fast motion before being quickly harvested and brewed by machine workers. This whole process start to finish takes about 5 minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "JmRenbqS4mLjCqi1","flags": {},"type": 0,"text": "Formerly a generic, faceless mook serving under a recently toppled evil empire; now a bitter, usually drunk washout. He wears the tattered remains of his old uniform. He will begrudgingly serve whatever you might ask him for if it’s available in his (admittedly limited) stock, but if he recognizes you as someone involved in the collapse of his former employer’s empire, he might just pull a gun on you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "6VXoXwlxqzogAAKr","flags": {},"type": 0,"text": "A nonsentient aggregate of nanomachines, formed into a roughly six-foot rectangular prism; the aggregate recognizes commands for beverages and can reformat any matter into a liquid matching the order placed. Just don’t leave anything particularly important within grabbing distance, or you just might end up drinking your gun as a shot of whiskey.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "4YzdScEOJ8Myfm9k","flags": {},"type": 0,"text": "Skudge: a foot-tall gremlin-like creature that carries himself around the bar on a platform pulled here and there by a surprisingly complex system of wedges and pulleys. Skudge is a mechanical genius, and can probably fix up any damaged gadget you give him, for a price; just don’t expect factory new if he does…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "rLp1AroSfc42cuEW","flags": {},"type": 0,"text": "A giant glass sphere levitates in mid air filled with a colorful swirl of gasses. When an order is placed, some of the gasses start to rain down on the inside of the glass and collect at the bottom, which then bulges and forms a massive pint sized raindrop that falls into the waiting glass.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "EV9QE6gf8YYtygVT","flags": {},"type": 0,"text": "Zenith! – he has a humanoid metal body with 1940’s speakers for a head (the kind with the mesh façade to cover it). He can ‘see’ with the radio antenna protruding from the top of his head and patrons have noticed he has memorized his bar’s layout; which has started rumors that he’s actually blind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "nRZI98a7HpetFF6V","flags": {},"type": 0,"text": "A bartender which is a claw machine, and you pay and play for your drinks. Still inside a bar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "Y26pzVRDRaNUVaNA","flags": {},"type": 0,"text": "A mass of black tentacles that burst forth from the floorboards in order to collect drinks, take and deliver orders, clean tables, and throw out rowdy patrons. They communicate through the use of a chalkboard.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "bMcsYyBOsDwOkooJ","flags": {},"type": 0,"text": "A telepathic humanoid shape shifter that skims people’s memories in order to create a face that the customer would be comfortable with. If things get too busy features start to mash together as they can’t keep changing back and forth that quickly. If you are in the bar after hours you will see that the true form is that of an incredibly pale sallowy agender person with no distinguishing features whatsoever with the exception of their lack of features.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "mgUr5d1RgUEBVjoD","flags": {},"type": 0,"text": "Several space age Roombas that knock into people’s feet and then curse using holographic Q-Bert symbols. There is no ‘bartender’ so to speak, but there is a touchscreen menu at every table that is guaranteed to fuck up in some way.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "eyIpwlQubnKKhaFM","flags": {},"type": 0,"text": "The bottles are all animated and have a place where you can scan a credit chit. They will proposition you for drinks in the same competitive way that people would offer dances at a strip club. Each bottle is programmed with it’s own personality, and the regulars have chosen their favorite drinks based on personality rather than taste.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "3vMSZuSm9RLTSd6u","flags": {},"type": 0,"text": "A creature so strange, so alien that in order to protect the sanity of it’s customers he puts a baroque painting of a king over his ‘face’ with the eyes cut out in order to make him more approachable.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "Hp0Pr5tYiFtUe1rB","flags": {},"type": 0,"text": "A very hairy man (?), long red waves of it covering most of his body. The only thing visible is a long protruding nose and gnarled old arms. When making a drink, he takes the glass and brings it close to him, behind the layer of hair, along with all the necessary taps and ingredients and tools. After a shockingly short amount of time, he’ll hand you the beverage. Surprisingly, there’s nothing wrong with the beverage. Even more surprising, not a single hair gets in your drink.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "vVUqnircDDXyfQeG","flags": {},"type": 0,"text": "The bartender (male), a patron at the bar (male), and a pregnant mother (both female) are all in fact the same person at various stages of their time travelling life.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "eC0iOOfH6pLVcNYJ","flags": {},"type": 0,"text": "Sentient Alcohol – You shout out what you want, and the appropriate bottles begin to shiver and shake. A thin stream of liquid rises, snakelike, from its bottle and then writhes into a glass. Rumor has it that anyone not paying gets a massive hangover that lasts until the debt is paid.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "QT2hghP9kvKdSnE5","flags": {},"type": 0,"text": "The bartender has a loose sleeveless shirt that shows much of their skin. Across their skin, you notice that their tattoos are not merely ink, they move across the skin. The bow of the pirate ship bounces across the tide with the foam spray splattering across the mermaid figurehead. ‘Mom’ who passed away in ’93 curls her arms a little tighter around her infant child, and brushes the curls out of their eyes. The villain in black robes severs the heroes hand with a blazing red laser sword, before the hero stumbles off of the platform.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "EX3FO4bJAlaa55rp","flags": {},"type": 0,"text": "No one knows his name, but he appears to only serve water, and glares at everyone until they drink it. The only reason that he’s still in business is the only other bar in 100 light years serves only metallic salts mixed into various radioactive isotopes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "v75FAxhyyLLepnDi","flags": {},"type": 0,"text": "Krema Soada, a beautiful alien woman that loves to sing and dance as she makes the drinks. She never asks what you want but every time she sends a drink on it pleases the customer. She loves talking about herself as long as you don’t ask him why he’s a guy now?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "XBMFdUuunETppKnS","flags": {},"type": 0,"text": "A human bartender that survived an unfortunate encounter with radiation while serving in the galactic force. While he survived unharmed and with no outward ill effects, the damage to his DNA was such that he is no longer legally classified as human, and as such was striped of his place in the force and of his citizenship. Because of this, he has spent the last decade as a drifter, working odd jobs (such as in this bar) and is openly antagonistic towards other ‘Legal’ humans.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "CLXTyewfz7TEBMZz","flags": {},"type": 0,"text": "Six-Fingers. A man without eye sockets that has a large forehead that goes from the hairline to the middle of his nose (hence its name: Six Fingers of forehead). It is not known how, but always prepare unique drinks for his customers, without ever repeating the combination of beverages.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "oIRFoOH22XaMSsea","flags": {},"type": 0,"text": "A human with a single robotic arm tends the bar. A few minutes after you enter, their shift ends and they’re replaced by a robot with a single human arm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "s6UleRiiNbgWT9oi","flags": {},"type": 0,"text": "A series of bartenders all impersonating the original bartender that opened the place decades ago.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "fUzlo0DA7PM1vFjB","flags": {},"type": 0,"text": "A series of soda fountains that let you pay for an all access booze buffet from different planets and realms. This is a great deal if you can get your fill within the (short) time limit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "8JCaM35wcQdovNBa","flags": {},"type": 0,"text": "A refreshment station similar to the ones at amusement parks that spray an alcohol like substance (in a mist) that absorbs through the skin as soon as you walk into the bar. From there, there is no bartender, but several bouncers and a greeter that explains that they will incredibly drunk within 2 minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "vKkoQ1qJHMOJKLlG","flags": {},"type": 0,"text": "A giant slime that can change its form to anything at will. The entire bar is its body, and he offers beverages made from the re-arranged molecules of its waste. It charges no money, but instead subsists off of the bacteria from your feet. When you walk around you can feel a slight sucking sensation as though picking up your feet in thick mud.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "nBZBIFs54wDOlcm5","flags": {},"type": 0,"text": "Several mosquito robots that inject illicit substances into people, as they ‘need’ it. An engineer sits behind a computer in the back controlling their actions and keeping the party going through constant surveillance and strategic druggings.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "rezaLJyPRgC9jSq1","flags": {},"type": 0,"text": "The bar has no staff members, instead everything is on tap and you serve yourself, with all the glasses keeping track of how much you have put in them and charge you accordingly. The flaws of this system become apparent when a visibly drunken man stumbles up to the tap and starts poring beer straight into his mouth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "KD5ZL1Vje9ZdolTw","flags": {},"type": 0,"text": "The First Mercy- an archetypal angel, from wings and softly glowing eyes down to celestial arias whispering out around her. She encourages all who come into the bar to consider giving up drinking and tries to push non-alcoholic beverages. Nevertheless, the bar always has a multitude of patrons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "t5r1POEyPhcqn1XE","flags": {},"type": 0,"text": "A clone of the current President of the Galactic Federation. Loves to talk politics.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "zK06ToIGey4O936D","flags": {},"type": 0,"text": "Chyrossis of Nyx- A 10-foot tall Cyclops, dressed in a tuxedo. Has a golden club, emblazoned with ‘The Management’ in fiery letters, hanging over the bar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "4GM7sfLTnTE0fMl7","flags": {},"type": 0,"text": "A headset is provided when you enter into the bar; you are ‘transported’ to a 1920s speakeasy, with a tough-talking moll named Sweet Marie serving drinks. Unclear whether it is an elaborate virtual creation or actual time travel. Drinks are all period appropriate, though.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "ollUwt8tJnN2ZL29","flags": {},"type": 0,"text": "A handsome, charismatic human named Frankie Ghullet holds up the bar. Observation shows that he is in fact chained to the bar with large iron foot shackles, with just enough chain to allow him to move around the bar. If asked about it, he usually responds jocularly that you had better pay your bar tab.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "S06b16xtYZ5xhfow","flags": {},"type": 0,"text": "A large mirror stands on the edge of the bar. Every customer sees themselves making the drink that they ordered and serving it to them. As it turns out, people are naturally generous with tips when they are tipping themselves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "RORPEBESF6aRBWso","flags": {},"type": 0,"text": "A slowly melting, moving ice sculpture pours drinks, which are pre-chilled. The runoff from the melting sculpture falls down a drain; once the sculpture is too far melted to effectively serve, it climbs into a freezer and is replaced with another sculpture.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "kd5Qkb4TlByWgDhw","flags": {},"type": 0,"text": "The Barman – Inexplicably, no one can give a description of what the Barman looks like, or really remember the Barman at all. In fact, no one can remember what they drank at the bar either. They definitely did drink- their accounts show payment- but everything about the bar is… vague.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "zhem1NtSbLakJ50I","flags": {},"type": 0,"text": "Angry Tom – The ghost of a pirate from the 18th century. The bar is carved from a piece of the quarterdeck that Tom once walked. Tom haunted the wreck of his ship, and then the bar, for centuries. Eventually, he tired of haunting and became interested in bar tending. Now, he is as much a fixture of the bar as his quarterdeck.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "Cc8lsOSgELaD2hxw","flags": {},"type": 0,"text": "The Sneaky Gobbo – An incredibly sneaky bartender, who enjoys refilling glasses when no one is looking. It is bad form to explicitly order a drink; instead, one sits down with an empty glass and comments on what one likes to drink. The glass will be filled shortly, with the sound of pattering feet and mischievous giggling. Payment is taken in a similar manner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "FY37YENrG1lSd2iN","flags": {},"type": 0,"text": "A brightly colored, cassowary-like bird stands at the bar, head slightly cocked. It makes no immediate response to those ordering drinks, but bawks after about four seconds. Moments later, a fledgling comes out from the back room, rolling an egg with the drink order inside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "jJNPy8H4t7kpb0zw","flags": {},"type": 0,"text": "Gidzet looks like a garden gnome, down to the hat, and is constantly, constantly muttering under his breath; he intersperses actual sentences to customers with his muttered undertone. He seems to know everyone by name, and careful listening catches the name of the listener in the muttering, but nothing else.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "8JSvStrzGj9u7RJc","flags": {},"type": 0,"text": "The Wicked Witchy Wenches of Abason IV – The bar is dark and misty, and there are the sounds of flitting things in the blackness overhead. Managing the bar are four wrinkled, green-skinned crones, stirring a huge black cauldron over a purplish fire. Every order is filled from the cauldron, but corresponds to what is ordered. The four crones cackle as they hobble back and forth, serving customers, but are actually pleasant conversationalists and useful contacts. Anyone gathering sufficient information finds a fascinating tidbit- there has been fourteen of these witches who have married customers and left the bar. When the marriage ceremony was complete, the witches were transformed into beautiful maidens; the couples went on to have happy, comfortable lives, and each had five children who are on the course to be great heroes. After each of these marriages, another crone appeared, keeping the number in the bar to four at all times.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "DlVz4D4GJmJTmh2X","flags": {},"type": 0,"text": "A somewhat ragged anthropomorphic rabbit named ‘The September Hare,’ although the bar’s frequenters call him ‘Sep.’ He has a picture of himself with his more famous cousin hanging behind the bar. All drinks are served in oversize teacups.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "3c8H0z6HTiiYm8hA","flags": {},"type": 0,"text": "A large statue stands behind the bar. Close consideration reveals that it is covered with tiny scaffolding and ropes; there are miniature people running back and forth through the scaffolding, pulling levers and shouting commands to each other in a language that can’t quite be understood. The statue jerkily moves and fills orders.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "NFouaEYaW7swrYBf","flags": {},"type": 0,"text": "Just Jack- the bartender is a dark, lithe human male, with darting, wild eyes. He takes every order with a nervous giggle. He fills drinks by carefully placing the cups, then wildly stabbing bottles with a butterfly knife, eyes bright and a fiendish grin on his face. The bottles reseal after bleeding out the proper amount of liquid. No one has ever failed to pay in the bar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "zou2g7tW5XINW1YF","flags": {},"type": 0,"text": "A disconnected human hand, rather like ‘Thing’ from the Addams family. Pours with incredible grace and speed. Does not speak, but clearly understands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "O76tU9Uiw7i4L2ZZ","flags": {},"type": 0,"text": "A giant, 3-D version of an 8-bit sprite waits the bar. It appears to move glitchily, and makes GameBoyesque sounds as it pours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "5d13Va4Cua0mkfIT","flags": {},"type": 0,"text": "A strange octopus-like alien takes up the entire ceiling. It passes drinks across its many tentacles to serve the various customers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "HKGLpkrvDXescLJY","flags": {},"type": 0,"text": "A miniature spray cannon sits on the bar- when a drink is ordered, it processes the vectors and launches the drink through the air into the glass on the table. It is accurate 99.986% of the time!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "CfvZyEwvPEzI7b8z","flags": {},"type": 0,"text": "A 1980’s-style retro futuristic D.J. acts as bartender. The drink mixer is a giant synthesizer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "O1YfxhOcRU8KRoxu"}
