{"name": "Rare Art Objects","description": "Have an art collector in the group? Maybe a thief? One hundred things they can get their hands on.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "KK1UglgXThPZiSeg","flags": {},"type": 0,"text": "A beautiful painting of a wheat field landscape. The paint was imbued with magic and every time the painting comes in direct contact with moonlight, it seems to come alive and move, as if it were a window.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "me4nDUO1S7mGCwqc","flags": {},"type": 0,"text": "A gilded wineglass fashioned from a human skull and set with lapis lazuli.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "K3TNlg4DHP73AYcR","flags": {},"type": 0,"text": "An intricate mechanical clock with the inner workings exposed. Everyday at noon the gears shift into a new configuration but the clock continues without missing a beat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "4zcZryiQB9KVpscK","flags": {},"type": 0,"text": "A painting of a beholder. It is surrounded by treasures and cultists praising it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "29KnzMXBCQHoYT0P","flags": {},"type": 0,"text": "A small stature of one of the party members. It’s expertly crafted out of limestone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "JVJBHXS9aX1YjZkO","flags": {},"type": 0,"text": "A golden eye. The pupil is made of rare jewels.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "HxqNGjOOsobR6HvC","flags": {},"type": 0,"text": "A painting of an owlbear hibernating. The beast lays asleep in a cave, two cubs huddled together with their mother and each other for warmth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "Qtp91GVZb2GRv4FV","flags": {},"type": 0,"text": "A live sized statue of a terrified soldier made out of stone. You might want to keep on your toes…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "QAQel0I9JQku7xpu","flags": {},"type": 0,"text": "A glass orb with small intricate battle figurines fighting in it. The figurines will move when no one is looking at the orb.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "X8Fe40hjx4h7fVTU","flags": {},"type": 0,"text": "A rough sketch of a dwarf on a piece bark. It is hundreds of years old.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "ewxnXGNiTuaXE7Et","flags": {},"type": 0,"text": "A mask carved out of dark ebony wood. It is surprising light but doesn’t float in water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "KBpnVDnncNS5yOwk","flags": {},"type": 0,"text": "A ceremonial knife with a dull point. It’s hilt is made of silver and is three intertwined dragons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "CapPf2H8XDS5U8GN","flags": {},"type": 0,"text": "A giant rug depicting the entire history of a queens life. It’s colors never seem to fade.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "mBZZLkOy4HyP8X86","flags": {},"type": 0,"text": "A jade statue of a wandering trader with a large pack on his back. His race is indistinguishable.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "B4IJTbTFq1UfsH5f","flags": {},"type": 0,"text": "A tea set carved out of mother of pearl. Will turn salt water into fresh water if the user is thirsty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "RGhEPRAOa0dp66Zs","flags": {},"type": 0,"text": "A statuette of intertwined palm trees made from precious metals. When the wind blows through it, it makes a pleasant chiming noise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "dxoXKOgfCnK7T5ti","flags": {},"type": 0,"text": "A carved scarab set with precious jewels. When one of the legs is pulled, the wing-cases flips open revealing a miniature painting.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "7ni9rdWlPUk7B7r9","flags": {},"type": 0,"text": "A tapestry woven from the finest silk. It depicts a king and his court having a feast in a garden. A kirin (or some other appropriate holy creature) flies across the sky in the background.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "smlS0Z2A7khIiwed","flags": {},"type": 0,"text": "A beautifully illuminated manuscript (you choose the topic). The illustrations almost seem to leap of the pages. It is bound in dragon scales of various colors arranged into a pattern/picture.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "K5KKGjzNf3Fc667I","flags": {},"type": 0,"text": "A guilded arrow, completely impractical for any bow as it is made of solid gold and encrusted with gems.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "AdHlgidjtVVKfAOM","flags": {},"type": 0,"text": "A stone tablet with one of the first recorded symbols of language.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "72QgL4FST8qi0GIy","flags": {},"type": 0,"text": "A red gem inside a blue gem inside a green gem. How the gems formed within each other is a mystery.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "iYnaSvNKUYWUuXEX","flags": {},"type": 0,"text": "Half finished painting of a great king. He died from a heart attack while sitting for the artist.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "w8dEtutyaEXvhdTs","flags": {},"type": 0,"text": "A book presumably telling the story of a lost civilization. Nobody knows how to read it, though, and magic doesn’t help either.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "pUj0WgZQ8ktYvRT6","flags": {},"type": 0,"text": "A wooden statue, depicting an old god.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "DB8EssdefjJbqLGe","flags": {},"type": 0,"text": "A blue and white abstract painting. Made when a royalty member got drunk for the first and only time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "kCukdRFTPiDZ3hlJ","flags": {},"type": 0,"text": "The bloodstained drawing of a family.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "JOUi12a3XzEze8zh","flags": {},"type": 0,"text": "A childish drawing of a kid, offering a crown to a man in the sky. Made when the old king died, leaving the throne to his son.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "o1xIMzWwn8GODCcT","flags": {},"type": 0,"text": "An etched copper plate depicting a dragon and its horde. The detail is such that it seems as though the artist was proximate to the subject of the painting, the color of the dragon is unknown.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "op35offmvP8DF96c","flags": {},"type": 0,"text": "The coral crown of a long forgotten Sea Elf kingdom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "Wbbbb32Uacj2avZx","flags": {},"type": 0,"text": "A pair of ancient fishing lures roughly carved from bone. They look like minnows and magically swim in circles when placed in water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "Uu8KtkhoDVjHPyrw","flags": {},"type": 0,"text": "A porcelain claw-foot tub inlaid with platinum designs. It’s halfling-sized.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "JqQhzYT0JUGrE0ZG","flags": {},"type": 0,"text": "The ornate walking cane of a Cloud Giant lord (with a dueling sword hidden inside).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "l7H5jjG8gDB05Egz","flags": {},"type": 0,"text": "A mirror of regret. It’s not enchanted, it’s just very, very overpriced.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "VEQdTZ6WdBzXhA8x","flags": {},"type": 0,"text": "A fancy feather bottle stopper, held together with gold wire, that would be ruined if it got wet. Something that useless has to be worth a fortune.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "lKZxfaoajVtC8xyz","flags": {},"type": 0,"text": "The original laws of the land, etched in gold letters onto glass. The glass is easily broken (hard not to break it), but the next time you look at it, the glass is whole again with no signs of ever being broken.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "Kff2i1dG2uFhlOoz","flags": {},"type": 0,"text": "A small chest with spaces for four cups, but you only see three. One is a beer mug with “life” written on it. One is a clay mug with “love” on it. One is a goblet with “control” on it. One is a shot glass with “applesauce” written on it. Which of the four you can’t see is supposed to tell something important about you, but nobody will explain what it means. (Also, it looks like everyone can see the ‘applesauce’ one but nobody talks about it because they think it’s probably not supposed to be there, but can’t be sure.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "NdnjheBHj6iz047H","flags": {},"type": 0,"text": "A small bronze automaton set with many small blue diamonds. Light blue feather motifs cover the piece. The limbs and head can pivot in place and be put in various poses. Whenever it is found, it’s on its tip-toes, looking straight up at the sky.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "Svuq0tOxQZriEPNI","flags": {},"type": 0,"text": "A huge, but incredibly cloudy, hunk of topaz. A drunkard said staring into it will show you your demise, but what does he know?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "HU6TBQU6uEER2xWH","flags": {},"type": 0,"text": "An acid etched sword. Was made by a black dragonborn who made a living using his breath to etch symbols and runes into things a local blacksmith made. He is long dead, but his magnum opus sure tells a story.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "mlu9v69RyZfdmRy3","flags": {},"type": 0,"text": "A mask made of solid opal. There is no mouth or nose holes, but breathing is surprisingly easy due to it being so light. The mask attaches with several large facial piercings into the cheeks, chin, and brow. The mask was made for a wealthy prince who contracted leprosy and wanted to hide away while still appearing beautiful. It might be clean, but I wouldn’t take any chances.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "RfBG04lHeniUgjHA","flags": {},"type": 0,"text": "A long, braided dwarven beard made of solid stone, with gold accents. Nobody knows how it was made, but it would sure as hell hurt to get whacked by it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "FPq0YP9FsTnGTsfK","flags": {},"type": 0,"text": "A petrified pixie. Poor little thing didn’t stand a chance. I mean, it’s a cute paperweight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "XDPFGhyQgn8YNE0u","flags": {},"type": 0,"text": "A scroll case that’s inlaid with rubies that seem to emit light. Really, they’re just super, super shiny.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "EtfBm1kvBRgANRfV","flags": {},"type": 0,"text": "A large piece of chitin, with a map carved into one side and runic language carved into the other. When translated, it’s a recipe for soup. Nothing special, but the title of the recipe is “GHHTHJSK’S SPECIAL STEW!!!”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "XXJH8hJHWuG2XufM","flags": {},"type": 0,"text": "A small golden monkey idol. Weights about as much as a bag of sand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "b8CEXmYJC9fcCzkU","flags": {},"type": 0,"text": "An ornate tower shield which has a small compartment near the handle. An empty flask is found here, engraved on the bottom with the letters H and D. The shield is flawless, either being made recently or just never having been used.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "r6IJ7gu9XTRlNAZv","flags": {},"type": 0,"text": "A palm sized piece of obsidian. When squeezed, glows on one side for a few seconds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "YvwZpsQhtFAQGIUS","flags": {},"type": 0,"text": "A crown meant for a pixie. It functions as a ring that screams “rob me”, or can be attached to a necklace for the same effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "fqjqBnLp70TM4PsQ","flags": {},"type": 0,"text": "A face carved of stone who’s visage resembles that of a screaming woman. Supposedly, anyone who sleeps near it is said to attract death and have horrible nightmares of a woman whispering about their own personal hell. This is really not the case. It just so happens that the previous owner is stupidly paranoid. It’s just a creepy looking rock. Still pretty though.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "1UTDQge3eE5jWG7K","flags": {},"type": 0,"text": "A wistful portrait of a singular dark mountain on a broad plain, trees covering the top third of it and nowhere else, far higher than trees ever normally grow on a mountain.  The middle of the mountain sports two large overhangs of rock above deep depressions, not quite caves.  A stream flows down the bottom third of the mountain, splitting its flow around an overhang that shelters a massive cavern entrance that goes who knows how deep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "dokGZr1bxkWWaiyZ","flags": {},"type": 0,"text": "Statue of a Puking Gnome – One of the last sculptures of the great Reeve Rowan, it depicts a presumably very drunk gnome vomiting. It’s carved into a lovely soft pink sandstone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "wfYPYBBVxNn42H0T","flags": {},"type": 0,"text": "A beautiful, multicolored glass sculpture that seems to take different shapes depending on the angle it is viewed from. From one angle, a mother and child, from another a proud warrior, all in vibrant color and exquisite detail. There are eight distinct scenes visible, one from each cardinal direction. It was retrieved from an old kings tomb, and now stands in the grand hall of the local museum. The work is approximately 8 feet tall, and 4 feet in diameter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "U62QqUhT6kTdmqNI","flags": {},"type": 0,"text": "A black pipe that doesn’t reflect light. It produces heavy clouds of darkness that obscure vision.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "Al03pPxm8Nct5A1l","flags": {},"type": 0,"text": "A multifaceted glass pipe that changes the color of the smoke as you use it (like a prism)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "39ClbEdyuLiu8YxI","flags": {},"type": 0,"text": "A pewter pipe whose bowl is shaped like a mint leaf that turns cold when you fill it with water. It vaporizes the water into a cool steam that leaves your breath minty fresh.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "6TIohF3BidJToyen","flags": {},"type": 0,"text": "The Green Fairy – A hand-carved Jade carafe in the shape of a pixie gazing over her shoulder. The opening for pouring is invisible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "TQA7pOwNksB6O05l","flags": {},"type": 0,"text": "A superfine doublet of incredible intracacy and beauty, with a pattern of nymphs playing in a garden along the back. Three of its owners have committed suicide the night after wearing it. A close study would reveal their likenesses frolicking with the nymphs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "MdU3CDNVIOMOIUvv","flags": {},"type": 0,"text": "A piece of Quivering Quartz – this beautiful stone is carved in a strange but unclear style. It is perfectly still until a certain tone is played near it; it then begins to vibrate and move, gyrating sinuously. The carving causes the moving rock to resemble a lithe dancer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "gzqgHOtr1FL0YjQo","flags": {},"type": 0,"text": "This a steel statue of Dwarfs. All craftdwarfship is of the highest quality. The item is a masterfully designed image of dwarfs and elephants in steel. The elephants are burning. The dwarfs are laughing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "RNwBpDwTe3RdVKSG","flags": {},"type": 0,"text": "The Pike of Ammenrye – a long spear made entirely of wrought iron, with magical runes etched in silver through the entire pikestaff. The final third of the shaft and the head are shattered and splayed out in every direction, creating a chaotic and yet pleasing appearance. It is said that the great hero Sean Ammenrye used this magical pike to slay an evil Titan who terrorized the countryside, stabbing it into the Titan’s vile heart. When he did, the Heart exploded, killing the Titan and shattering the pikehead as it remains today. According to legend, if a true hero needs the Pike to defeat another great evil, he must grasp the pikestaff, and he will learn the way to reweave the pikehead and restore the magic of the Pike of Ammenrye. Whether this is true or not is unknown; the Pike has become a coveted collector’s item and a work of art.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "iigCOzoN4pCL32OK","flags": {},"type": 0,"text": "The Orcish Goddess- A full-body portrait by Solviar Recrunti, a master human painter who had clearly never seen a real orc female when he created this work.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "Tn7KgQ8uSxnqNOkY","flags": {},"type": 0,"text": "I Reinoa Aenil – A 4 foot square piece of pure glass, in the middle of which is the golden print of a slim bare foot, indented into the glass.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "xCUAT8FlcLCfA5pF","flags": {},"type": 0,"text": "Victory of Elora – A large and intricate tapestry showing the life of a great human cleric named Elora. A piece of the tapestry has been ripped out- what it held is unknown, although Elora is shown with child in the next panes, so some theorize it to have been censored by an overzealous inquisitor. The tapestry is very valuable- the missing piece would make it nearly priceless.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "lXOZQI78tLEd5P3S","flags": {},"type": 0,"text": "The Painter’s Face Upon Viewing a Rowan Work – A self-portrait by Duns Valimar, a contemporary and rival of Reese Rowan. The painter, a somewhat portly human with thick black hair, has a lip curled in disgust. Juxtaposed with the painter is a caricature of a Rowan piece- an elven maiden scratching her bottom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "BA8N6BZSsYjbQApx","flags": {},"type": 0,"text": "The Gift of the Peat – A lizardfolk statuette made from petrified wood and snakebone in the shape of a scaly hand emerging from water holding an axe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "u5DIJfNjHP9qOsOf","flags": {},"type": 0,"text": "A plain-looking wooden bowl of water, which remains unnaturally still while inside it. Looking at one’s reflection in the water shows an idealized version of oneself, in accordance to the viewer’s ideals. It is said that by lowering one’s head into the bowl for long enough, one can gain insight into how to become the self seen in the bowl.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "YhGm6kRrw6e7kl1h","flags": {},"type": 0,"text": "A figure made of metal scraps, shaped like a dog, and enchanted to pace back and forth across a 5″x11″ slab of stone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "IcM5OpElv763Sf9X","flags": {},"type": 0,"text": "A fireball petrified in the act of exploding by Master Wizard Artoum. It is about the size of a grapefruit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "xGoIkhEv8ZueeRUO","flags": {},"type": 0,"text": "A small oak sculpture of a wet brain, with “Intellect Devorer” in Undercommon eched into it in several locations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "WPOBpecU1w0yHHun","flags": {},"type": 0,"text": "A tiny, beautiful bottle made of diamond filled with unidentified tears.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "hVYE7edMj4EdXWPU","flags": {},"type": 0,"text": "A painting of an ancient god not worshiped in the last few millennia.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "fPwrIkwGFEQaVYN8","flags": {},"type": 0,"text": "A granite statue of two completely identical human women standing back to back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "IUI7MSFP0IlclbzW","flags": {},"type": 0,"text": "A porcelain doll with hair made of gold wearing a plain looking dress, it’s expression is one of great sadness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "XuKPPRnJvrL8UwSq","flags": {},"type": 0,"text": "A bust of a great emperor from the distant past.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "J9ijLcksauAFwawd","flags": {},"type": 0,"text": "An ancient wooden carving of a coiled snake, it was carved by one of the first druids.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "2hyhKL7CGkPRXeog","flags": {},"type": 0,"text": "A perfect replica of a newborn dwarf, asleep in his father’s arms. Carved from alabaster. Extremely rare, as dwarven domestic art is almost never seen by non-dwarves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "8aBdoDppD6nnIajy","flags": {},"type": 0,"text": "An amber carving of a bear, about one inch long.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "TfDoTONXXYJRn0bs","flags": {},"type": 0,"text": "A finely lacquered black box with silver hinges and latch contains a carved jade puzzle ball with seven layers resting in silk cushioning. The outermost layer of the ball has an intertwined leafy branch motif.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "am9hVfwjVy0Kr0tX","flags": {},"type": 0,"text": "A chess set made of ebony and ivory, the pieces are carved to look like famous people from two rival kingdoms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "LrgIPFr0FVYLXZ7z","flags": {},"type": 0,"text": "A silver mirror with a woven gold wire frame and an ivory handle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "daPKnxKVou04bXJa","flags": {},"type": 0,"text": "A delicate tea set made of beautifully shaped glass. Each cup has been blown to look like a pair of child-sized hands clasped together, and the tea pot itself has the appearance of a cloaked human female kneeling in offering. Her hands reaching outwards act as the spout for the pot, and her pulled back hood acts as the lid. No liquid ever flows out of the teapot unless one of the cups in the set is directly beneath the spout.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "jcyobQk0ZHWBA5zE","flags": {},"type": 0,"text": "A beautiful painting of a late autumn lake in the forest. The longer you look at it, the more mesermizing it becomes. As you stare, the leaves on the trees seems to jostle in the wind, the lake seems to breathe as water, and the clouds seem to drift ever so slightly into the sunset, like a portal into a perfect glimmer of peace. The only curiosity is a sad old man with a gnarled crown sitting upon a small bench, not quite in the foreground though impossible to ignore. He seems to loom over the lake, and is vaguely familiar… He seems to weep, giving the painting a sense of loss and sadness, as if this world so perfect was dying with him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "TrV2uW1MdL1XgZc0","flags": {},"type": 0,"text": "A miniature ivory elephant with ruby eyes. One of the eyes is missing. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "IwmKCqKsn2Gi7QJP","flags": {},"type": 0,"text": "A small figurine of a dragon, however as it is studied it is remarkably well crafted. From the scales to the tail this dragon looks completely real, and would be frightening if it wasn’t 6′ tall.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "FzgkpKHJ95sZk6C2","flags": {},"type": 0,"text": "A delicate chain bracelet apparently carved from a single huge emerald.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "5hknb323SgHh9k6R","flags": {},"type": 0,"text": "A petrified basilisk’s egg carved into an elaborate diorama of a strange but beautiful landscape. Faint aura of evil.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "iy2XSvoqVZBwHL8w","flags": {},"type": 0,"text": "A glass sculpture of a 4 dimensional object. May induce mild motion sickness or vertigo in some viewers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "Na6viZSgtPmakqOn","flags": {},"type": 0,"text": "A single drawer, side table, with inlaid vines that creep up the legs, barberpole inlay that goes around the edge of the top, and two ornate large, brass pulls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "YxE73LapwaO8LQFy","flags": {},"type": 0,"text": "An ancient scrimshaw with a well carved boat labeled, “The Mourning Hag.”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "4ITpCbjZu0OWQg4Q","flags": {},"type": 0,"text": "An ostrich’s egg, drained of its yolk, and dyed a deep violet. Studded with gold and jewels in an elegant, if somewhat ostentatious, manner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "qtxjUqeDfq1ZrYG1","flags": {},"type": 0,"text": "A ceremonial, blunted sword. The blade is made of pure gold, its hilt of silver, and the pommel studded with different gems. Platinum inlay runs the length of the sword in a flowing, meandering pattern.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "E5cQy9xgGA6dnCBP","flags": {},"type": 0,"text": "A piece of exotic wood, carved to look like a quill, with a gold tip. Largely ceremonial and used for signing important decrees or documents, as it is awkward to write with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "IC7htGQNi7TObLYq","flags": {},"type": 0,"text": "A flying insect preserved in amber that has been carved into a very fine pseudodragon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "UuBCJ0IEorNJpElf","flags": {},"type": 0,"text": "A stone sphere encrusted with a variety of precious and semiprecious gems.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "2QtfR0a58AUf8ujs","flags": {},"type": 0,"text": "A wooden arrow of elvish make, it is so thin and stylized that it would surely brake if shot out of a bow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "LFfpWVzzEpjhQ3kH","flags": {},"type": 0,"text": "A gnomish music box that plays an elvish song.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "f21Lrn0tE7k3OTQb","flags": {},"type": 0,"text": "A medium sized hourglass fashioned from dark walnut and brass. Inside, the sands shine in a variety of iridescent colors. There is a slight tinkling sound as they fall, almost like the sound of a music box, carried on the wind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "NSJcXtPBNgu9jrak","flags": {},"type": 0,"text": "A priceless crystal lantern.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "tOEL7poDXa6VyyFO","flags": {},"type": 0,"text": "Morv’loor’s Finest Door – Displayed prominently is a crudely carved, freestanding, wooden plank with what appears to be a horribly etched Dragon on the front. When questioned the owner will only say that it’s the artists finest piece and they won’t take it to down, in case he ever came back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "09I4iqie1fUVGzJZ"}
