{"name": "Interesting Pirates","description": "One hundred of the most interesting, saltiest dogs to ever sail the seas.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "0hKcB0GJKzUz3lKY","flags": {},"type": 0,"text": "Captain Bronzebeard II – Following his father’s legacy, this dwarf has been scouring the seas looking for the medallion that was stolen from his family. He is getting close to pinpointing it’s location, and may hire the players as mercenaries on his quest. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "xLRFWks9Hs1mUtc9","flags": {},"type": 0,"text": "Cap’n Flint ‘the Squint’ McGint – A surly fellow who’s been plying his trade since afore ye was born, now shut yer gob and come aboard fer adventure and loot! (Also, due to his condition, Squint can’t see worth beans and is essentially incompetent in all things piratey aside from the talk. But his crew is outstanding.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "riL3oIsCNYCZyduC","flags": {},"type": 0,"text": "Herman the Scar – A very young, good-hearted bard; he won the captaincy of his ship, now named the Encore, in a dance competition. Much more ‘adventurer ship’ then Pirate ship.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "hHx0oAG7t34aYHTu","flags": {},"type": 0,"text": "Gozze’ch – A lizardfolk with a huge chunk bitten out of his tail. Refers to himself as ‘the old Lizard’ and likes to act foolish, but is actually quite cunning. Bit the hand off Simon McGurk in a fight over docking rights.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "Lg4RN0TcBtlsXmIz","flags": {},"type": 0,"text": "He Sails – A tabaxi pirate captain who hunts for treasure but really doesn’t like water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "9VB423c7g0CGxaUg","flags": {},"type": 0,"text": "Simon McGurk – A sallow-looking man with a collection of prosthetic hands. McGurk is greedy and clever, but extremely lazy and always coming up with intricate plans and labor-saving devices. A children’s song about him includes the refrain, ‘Simon McGurk, scared stiff of work!’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "EFmmtDqLL82F0pxx","flags": {},"type": 0,"text": "Thorkhomtam, The Everraiding – a mummy king who when awoken took to the seas to build an eternal empire on the waves. His ships are fashioned after Egyptian river boats and are manned by skeletons with mummy captains. He pelts ships with flaming arrows before raming and boarding and refuses to use cannons.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "IuOgYEwutAWhXI7y","flags": {},"type": 0,"text": "Gold-Thumbed Lizzie – A pursor and quartermaster, so named because ‘she holds on to coins so tight they become part’ve her thumb!’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "dsHZEwxqwWHCXAw4","flags": {},"type": 0,"text": "Jem the Angel-eyed – A half-elf with a beautiful, serene face and a strange penchant for murder. Jem is quiet and eerily calm, even in the middle of a battle. He once slipped into a city port and killed seventeen guards and a customs official, put all the bodies in one room, then left a pile of gold equal to the bounty on his head on top of them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "5GTX4ubRmtYlabi9","flags": {},"type": 0,"text": "First mate Crumblefist – A grey dwarf pirate whose crew was lost following a river out of the underdark and now seeks a crew to take him back through the dangerous waters to return home.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "XN6qVr8INbMiKli7","flags": {},"type": 0,"text": "Captain Durango Black – Tiefling captain of the Daring Demon. This terrifying swashbuckler is also famous among cutthroats and low lives for being a talented Bard, often telling stories of the devil captain so scary, he can harm men with insults.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "qXPrBR4Vv9OeSHs5","flags": {},"type": 0,"text": "Captain Syrian Blackhand, human captain of The Ocelot – Made a pact with the god of the seas. His ship is the fastest in the world, but every year he must return to the temple where the accord was struck and cut off one finger. His left hand has only the thumb left.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "7HYEIOAslH2qFdJl","flags": {},"type": 0,"text": "Pennington Pugwash – a human fighter with wrinkled, scrunched up face. Doesn’t have real athority on the ship but will still bark orders at people when they’re slacking off. Spends his time eating hardtack biscuits and cleaning muck out from between his skin folds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "STAUDOV5ZGeS6Gh5","flags": {},"type": 0,"text": "Leon – once a very young boy traveling with his parents on the cheap via cargo ship. When the ship was attacked by pirates and his parents were killed he was taken in by the pirates as they couldn’t bear to kill him. Now a young man, he has a complicated relationship with piracy and the captain he serves under. It’s the only life he’s known since he was young, and the crew treats him like family, but he can’t help but feel a bit resentful, and wants something more from life.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "oNdjp0Cv8ot8amAW","flags": {},"type": 0,"text": "Annie the Red – a young halfling woman with bright red flowing hair. She is as beautiful as she is ruthless. She may not be the strongest of the crew she is part of, but she is the lightest on her feet (And the lightest with her fingers). A girl who will charm you for an evening, steal your coinpurse, and still leave you wanting more.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "vbTT2UI6ir57gnLG","flags": {},"type": 0,"text": "Half-Blood Harry – Huge and hulking, with impressive tattoos and scars, Harry is someone who makes himself known the instant he enters a room. Largely silent, one could mistake him for a stupid man- in truth he is shrewdly clever and prefers to listen. No one is really sure what his other ‘half’ is… goliath? Cyclops? Giant? Who knows? He is not telling.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "Be01zSvaOfRmHVeT","flags": {},"type": 0,"text": "Laurabelle Lee – a woman of refinement as well as class. She runs the tightest and most efficient ship possible. Every uniform is starched, every button is shiny, even the brig is clean. Laurabelle herself is a stately figure in beautiful high-low dresses with tall leather boots and tight curls on her head. She is charming, but demands respect- and her crew love her as much as they fear her.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "mg0ohjr101ej6ZTL","flags": {},"type": 0,"text": "Quartermaster Berrick – a gnome who is as ruthless as he is small, rarely leaves his office aboard his ship and has mounted a large crossbow pointing at his door in case of disappointing news. While he avoids going into battle himself, his bravery and cunning is unparalleled when he’s once again in the thick of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "koFylFuKYlHZ4M4k","flags": {},"type": 0,"text": "Dragnet – a ruthless goblin captain who’s rise to infamy came with his acquisition of a cursed fishing net. His crew is an assortment of loyal goblins and men and women who have been captured and enthralled by the net. He is clever and quick to start a fight, though quicker to use his expendable crew to save his own life. The colors of his ship depict a crescent moon with a net strung over the bottom tip.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "oVhtf0GpqwLaXQ8e","flags": {},"type": 0,"text": "Captain Barnical Horn – a tiefling captain who was keelhauled for so long that barnicals grew from his horns now he runs in search of all of his past crew.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "y9ObBEDYJ3xeOAf9","flags": {},"type": 0,"text": "Rubidoo – the outgoing triton jester of a large pirate crew. Since the crew hates bad puns and witty jokes, they tend to often throw her overboard to get their laughs. Because of this, she has a clockwork arm, replaced after a shark bite. Rubidoo tends to put all sorts of prank hands on her cybernetic limb, including one that lets go of its index finger when you pull it. Despite the torture from the pirates, she tends to be all fun and laughs, believing her sole job in life is to be comedic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "t7Mnd7oDb1D80O36","flags": {},"type": 0,"text": "Captain Sjondeil Darhringur – A stoic faced captain who’s been on a boat since he was born. His heritage is unclear. He captains ‘The Watcher’ a bleak storm gray galleon with grey sails. He is almost always found staring out to the horizon waiting for something that only he understands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "BeQbT1vjvyWQ8Sqw","flags": {},"type": 0,"text": "Gulliper ‘Gully’ Blackwater – A festive halfing raider of the coastal swamps and the last son of the cursed Blackwater family. He is an amicable enough sort, willing to spare those who surrender, though he has a habit of killing any he suspects of holding magical artifacts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "6AA7AAQlwsBek4YJ","flags": {},"type": 0,"text": "Honorable Captain McQuane – A former naval officer who was captured. Instead of being ransomed or killed, he led a mutiny and rose through the ranks to captain. He found piracy to his liking, but runs the tightest ship on the seas. Legend has it his crew get only an hour of shore leave a year. He’s more than willing to accept surrender or do mercenary work, and is remarkably civil and polite. He insists on being referred to by his full title.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "kCX3rruf9bvcGxUf","flags": {},"type": 0,"text": "Decker – a young teen in loose fitting clothes that swabs the deck. Eager to learn the trade of being a pirate, he’s often given the work that the other seamen see as below them. He escaped a life on the street in big town and seems appreciate having a place to sleep and food to eat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "YGx8E52LLsxLxVUA","flags": {},"type": 0,"text": "Loud Tom – A boatswain with a voice like a bull and a vocabulary that is truly impressive in its creativity and range, Loud Tom hurls profanity and insults at his crew and everyone else nearly constantly. The one exception is when he is truly angry- while his verbal abuse is mostly good-natured and verbose, his wrath is nearly silent, accompanied by a facial expression that can freeze grog. ‘Loud Tom is quiet’ is a whispered warning that goes through the ship like fire and leaves everyone desperate to stay out of his way.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "zjE4Bcpb2rVHRz4D","flags": {},"type": 0,"text": "Broadwick the Penitent – an Aasimar Swords bard with the gleam of hatred in her eyes. She killed her angelic patron in a fit of passion and sails the seas in search of a place the guilt cannot reach. Carries a Wand of Smiles that she uses on her victims just before she takes their lives.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "5EicI9lJN4rpW516","flags": {},"type": 0,"text": "Gelionexxitrus – A beholder that lives below deck on a fleshy, living, aberration boat. Chuul patrol the deck, twitching warped humanoids work the sails. It’s hard to tell whether Gelionexxitrus and the boat are the same being.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "KSz5uoMXVtlE0KYJ","flags": {},"type": 0,"text": "The Silence – A thousand year old mummy lord who travels in a bubble of silence hundreds of feet wide. Wrapped around her neck is a pendant that allows her to speak and cast spells.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "0fod1hjHQZsJnIwr","flags": {},"type": 0,"text": "The Beekeeper – A friendly half elf druid. His ship is loaded down with apiaries. He steals to support his bees. If asked any questions about his motivations he replies ‘Bees are dying at an alarming rate.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "UdGme0uCxPYXSwq3","flags": {},"type": 0,"text": "Arianis – A mad fey satyr looking for the best partiers on the material plane. Invitations to their week long hedonistic boat parties are more akin to kidnappings. If you fail to impress, you become the centerpiece/victim of the last night of the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "vTk317ULYgLe2F42","flags": {},"type": 0,"text": "Revar the Fallen – An arrogant fallen Aasimar, who is easily enraged. He hates the Gods and every Culture, that still devote themselves to them in some form or fashion. He likes to especially raid temples and holy Cities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "MHWVZ3rkS0GNgvOP","flags": {},"type": 0,"text": "The Dread Pirate Jazeera; Captain – A dusty skinned, half-elven woman of breathtaking beauty, with black hair and supple frame. She can convince most anyone of most anything, using either intimidation or allure. She captains The Indomitable, a large ship constructed of ebonized woods. Started her seafaring life in search of the pirates who press-ganged her father into servitude, and chose piracy as a (somewhat ironic,) means to an end. Several years on, and with no leads in sight, she has all but abandoned hope of finding her father alive, and has instead turned her focus to attaining power, often through morally grey means, and plans to take revenge for her loss.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "WpsHkU9olceVsWt9","flags": {},"type": 0,"text": "Garrett; First Mate – A halfling with sandy brown locks of shoulder length hair, and an emerald for his left eye. Originally a stowaway, Jazeera saw his quick wit and cunning to be a useful trait, as he seemed able to talk himself out of nearly any corner, a fine ally to have. After sailing with her for several years, they went their separate ways, as Garrett, trained as a rogue, longed for the stage, rather than the shadows. After several years training as a bard, fate brought the two back together, and Garrett, who had lost his eye during his adventures without Jazeera, was re-instated as first mate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "i0XWycaXeQVX6ciC","flags": {},"type": 0,"text": "John; Quartermaster – A towering human male, with a few arcane tricks up his sleeve, John and Jazeera have a seething distaste for each other on the surface, but there is a mutual respect for the two in battle. John tends to err on the law and good when moral questions come up, which can often run counter to Jazeera’s plans. While the two often get into it, Jazeera recognizes power and quality when she sees it, and knows that her ship is better with John as her tactician and enforcer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "wNPk9pq3rqZsRqRz","flags": {},"type": 0,"text": "Varic; Lead Gunner – A half-elven sorcerer with an affinity for lightning, Varic knows all about how to calculate the trajectory necessary to decimate his foes. As such, he was an obvious choice to lead the gunning crews. When casting spells, his veins surge with arcane energy, visible beneath the surface of his skin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "GepqOEZNTIoQ1TOB","flags": {},"type": 0,"text": "Puddles; Powder Monkey – A dwarven barbarian with a fire red beard, who follows orders and has no fear, it’s natural that he’d take on one of the most dangerous job on the ship. Powder Monkeys are responsible for carrying the gunpowder for the gunning crews, and as they often had explosives in their arms, were often in a very dangerous position, should something be mishandled or dropped.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "Vuw5N7e0F6KmH3pn","flags": {},"type": 0,"text": "Ragnar; Cook – An older man who questions his purpose and existence in life, but has a taste for food. With a long white beard and a barrel-chest, Ragnar can often be found snacking on his favorite food: chicken. Despite his aged appearance and apparent senility, Ragnar is a capable fighter when the chips are down; doubly so if his chicken is threatened.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "ZQGgXJ2oLjSuWhYf","flags": {},"type": 0,"text": "Captain Longhorn – A Minotaur pirate captain with a peg leg, long horns, and a grand, flowing beard. He carries the ship’s wheel on his back and uses it as a shield. If he’s not at the helm, the ship doesn’t move.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "qmnujSNjVXfVsFMW","flags": {},"type": 0,"text": "Smeagle – A conniving, craven bo’sun of a disreputable ship, this stunted aarakocra’s wings were clipped when he was exiled from the sky.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "wxPuRTVBcpKK1rHw","flags": {},"type": 0,"text": "Elondrith the Puppeteer – a shady looking mass of dark rags, sporting a mask of ancient porcelain. The crew is said to be immortal, even after being hit by countless arrows and heavily woumded, they run fearlessly into their enemies arms flailing their weapons. Strangely though, they always try to aim for the arms and legs to only incapacitate their foe. Noone has ever heard elondrith utter a single command, only gestures. This is the reason they call him the puppeteer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "FAIDXknudL8QhgZH","flags": {},"type": 0,"text": "Broggy the Vile – a half giant that assembled a crew of demihumans. Minotaurs, half orcs, goblins, you name it. Hes said to be ruthless and cruel to his foes, but fatherlike to his crew. His main weapon is a huge spiked iron ball on a chain. He is said to have sunken a pitatehunters ship by throwing his weapon once, destroying the mast and ripping a hole into the deck of the ship.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "zdK62wsnFXTHIJeo","flags": {},"type": 0,"text": "Joe, no other names, just Joe – He had joined the ship as a boy, seeking fortune and fame. Over the years he toiled on deck, in the rigging, on the guns. He knows every single board and nail on this ship from bow to stern. Joe had seen his share of action, losing two fingers on his left hand in a sword fight when he was 20, his right ear in a deck fire at 25, all the toes on his right foot while sailing around the cape at 30, yet he carried on. Through his time on board, Joe developed a rigourous discipline. His white hair is kept short, cut with his own knife, and he is clean shaven despite the deep wrinkles on his aging leathery face. ‘No sense being pretty when you’re dead!’ he would say. When drunk, Joe tells stories of his time at sea, all 50 years of it. Each story has a tattoo to go with it, his skin a veritable tapestry of his life etched from his knuckles to his neck and down to his ankles. As for rank, Joe never cared for it, command was not his thing. Still, he often takes youngsters under his wing, teaching them the ropes, keeping them out of trouble. Even the captain looks up to Joe, often taking his guidance on the more complicated nautical and tactical matters. Joes advanced years did nothing to diminish his fighting ability. His ability with a cutlass is second to none and twinned with his knowledge of ships he can turn an advantage in any fight at sea. And pray you never meet the loud end of his flintlock. Nobody has ever seen him miss and lived to tell the tale.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "J0Jckso9R1K5KR7U","flags": {},"type": 0,"text": "Captain Mangan – an old long-bearded man with a lot of scars. He doesn’t own a ship but claims to be a former leader of a smuggler guild. He has hidden his treasures in a secret place. He is a bit crazy and forgetful. A lot of statements where to find his treasures contradict themself. He is very proud and brags about it all the time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "TLxo6jrNAkd9AWId","flags": {},"type": 0,"text": "Jebadiah – A cabin boy who thinks himself much more important and sometimes threatening than he really is. He hates whenever someone brings up his lowly position, and thinks that he deserves more. Jebadiah tries to avoid danger whenever possible, but when his reputation is on the line will rashly leap into it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "Wt86q08kYV8bu6A3","flags": {},"type": 0,"text": "Left Shoe – A quiet, gnarled dwarf who slurs his words and drools slightly when he talks. He is clearly sick with something, and has lost much of his feeling. This has led to his killing people ‘to feel their lives.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "4HfhEVLHawnEew3P","flags": {},"type": 0,"text": "Jim The Barber – A Captain, originally called James the Barbarous. Got tired of correcting people who misheard it and took up a pair of clippers out of curiosity. Now runs a very profitable side-business haircutting and beard trimming; it is fulfilling enough that Jim is considering giving up piracy altogether.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "ktSSx1ow7CXtARCR","flags": {},"type": 0,"text": "Molly the Red and Captain Crookshanks – Molly was born on a pirate ship and has developed a fierce reputation as a daring and fearless captain. Byron Crookshanks, the second son of a minor Duke, joined the Eirinie Royal Navy and quickly rose to prominence as a fair and punctiliously honorable naval officer. Their rivalry was marked by close escapes, heated battles, and chases over half the known world. When Eirin was overwhelmed and swallowed by the Chriam Empire, Crookshanks and his crew refused to bend the knee, and found themselves a ship without a country. The two rivals became partners during a firefight with the Criamen Navy and were wed almost immediately thereafter. Now the parents of a half-dozen children, the two run a small fleet of privateers as the Eirinie Navy-in-Exile.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "mPWHjecnW9S5Ggfu","flags": {},"type": 0,"text": "The Lost Fisherman – possibly just a legend that pirates tell to scare each other, The Lost Fisherman is an old Dwarf in a fishing skiff, floating out in the middle of the ocean. They say he can see your soul. There was a ship, Sharkey’s Devil, that ran across him once- three hundred blackhearted pirate veterans. Another ship found the Devil a week later, floating aimlessly. The captain and crew were dangling from the yardarms, gaffed and strung together; like a grotesque fish market, they said. The only survivors were two prisoners and the grommit, who was crazy with fear, and never left land again when they got him back- a cobbler, he is now, and a pious man. But he’s just a story, a way to get scare pirates away, right? Right? I mean, there are other ships that have supposedly had similar fates, but it is probably a story. Yeah, that’s it. A story.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "ksjdHmexuq2unxl4","flags": {},"type": 0,"text": "Captain Scrack – The goblin captain of Scrack’s Scuttler (see the ship section). He has ‘VERMIN’ burned into his cheek like a brand. Scrack is a Chaotic Good captain who is well liked by his crew. He doesn’t discuss his past, but seems to take some joy in defeating haughty nobles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "erJIUPy9z41y8Lbl","flags": {},"type": 0,"text": "Vileem Crabshanks – A goblin pirate who would gladly avoid any search for treasure, yet adventure seems to find her. Has honest aspiration to become a merchant, but faces prejudice and misfortune.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "FZkQLb7e7o5sHctQ","flags": {},"type": 0,"text": "Koros the Black – A (Krynn) minotaur, who aims to ravage a town and personally loot the local Duke’s Manor. In truth, he’s only after a treasure lost by his grandfather to the Duke’s ancestors, but the Code of Honor demands blood must spill as well.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "XOR4rbH3pTeU5slt","flags": {},"type": 0,"text": "Sharonogue the Trident — Few know his name, but Sharonogue is the clever and ruthless Sahuagin captain of a submersible with a fully amphibian crew. The submersible has a wreck of another pirate ship strapped to its hull. Sharongue scouts out his target with a pod of sharks, then when the moment is right, his spellcasters summon a thick fog. Out of the fog, the submersible rises, looking to the opposing vessel as if a ghost ship encrusted with mollusks and water-logged has apparated before them. The above-water portion can soak up the cannon fire from their desperate quarry but the submersible inexorably approaches until Sharonoques merciless crew can board.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "aOiinWcaG8Su5mBd","flags": {},"type": 0,"text": "Gatsi Shrinemason – A Dwarven Cleric of Zeboim, who builds faith and worship among all sea-goers. You can find him at work in towns or the wilds, building shrines, alters, obelisks, spreading word; or maybe just bullying his way onto a ship to go where he’s called.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "umXZ1N6K52edZOTp","flags": {},"type": 0,"text": "Crablegs – a human deckhand that always walks sideways.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "jHblVxSI4QJmzRIJ","flags": {},"type": 0,"text": "Amir-Sual – Once a wealthy sea merchant of the oceans of Osad, he turned to piracy after it was discovered he had used privateers to sink his competition. He has managed to bind 2 jinn to his ship so as to conquer the opal sea: A wind jinn for his sails, and a fire jinn for makeshift cannon","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "L7fWDnWRue5LMBV8","flags": {},"type": 0,"text": "Rimmarie, first mate – Once a prostitute of some nowhere costal town, her life was saved by Amir when he was still just a crooked merchant, she stands by her now husband’s side on the opal sea. She is said to have made a deal with a dark jinn who wanted who helped bind two others to the ship.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "BTYzY2na8MEkoOkU","flags": {},"type": 0,"text": "First Mate Shaw – a classic sword n’ board fighter with a few spell scrolls at his disposal. Shaw has a few dialogue quirks, if anyone bothers to talk to him. ‘I’m Shaw of it’ ‘How can you be sure? I’m Shaw!’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "npuNM1safiqTLU28","flags": {},"type": 0,"text": "Dashu – A long term priate deckhand. An impressive climber and prefers small sharp daggers. Very competent and finds places on crews easily. Secretly he is a wererat who is first to leave his crewmates to their fates the moment things go wrong. Even if it means living as a rat in the bilges of a military vessel until next port.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "kZW4GCYlfO5RqCQk","flags": {},"type": 0,"text": "Deathskull the Man Killer – This pirates real name is Phill, he’s a kind man who has bad luck all around him. If he helps out other ships they end up sinking and burning down, nothing good happens around him. He is known as a man killer even though he tries to be very kind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "pB6lrzkZAekAMUYS","flags": {},"type": 0,"text": "Captain Merriatt, Elven pirate of the Azure Sea – He hunts at night, catching ships completely off guard on moonless nights. His brutal reputation is totally manufactured, he hates bloodshed. His ship, The Death Night, a dark-hulled and black sailed schooner has an enchanted brig that creates a Duplicate of its prisoners on deck. Once a ship has been taken, Merriatt takes the captain below, then returns to ‘execute’ the Duplicate in front of the captured crew. After ransacking his victim’s ship, he lets the crew go on their way. The capture captains are let off at the next safe port, warned never to to reveal the truth, or risk the lives of every other captain on the Azure Sea.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "buHVTgJmSJBFAz7N","flags": {},"type": 0,"text": "Rat-Faced Bill – Bill had a vision problem ever since a bully splashed boiling water in his face when he was 9. He squints to see and he looks like a rat when he squints. Unfortunately Bill had to squint a lot. He was bullied for so long that when he turned 16 he kidnapped every single one of the 13 people that bullied him and put them in a small dinghy with no sails and no oars and pushed them out to sea. Bill then decided to become a pirate as a way to support himself and to see if he could find the dinghy. Bill rules with an iron fist but he is always fair and so his crew has much respect for him. His favorite punishment is forcing prisoners to build a dinghy out of their former ship and pushing them out to sea.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "FMOdiUteBDmOVReP","flags": {},"type": 0,"text": "Arfinkle – Arfinkle is a crafty wizard with a wicked sense of humor and even more wicked spells. His entire crew is odd bronze contraptions, fueled equally by steam and twisted magic. His favorite one is a teapot with legs and a sleep dart shooter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "aZTSL0proY0zLmvl","flags": {},"type": 0,"text": "Last Mate – Last Mate is a sailor by trade and probably among the worst to ever attempt it. By the time he calls out ‘Land Ho’ from the Crow’s Nest, he’s already forgotten in which direction it is by the time he’s scrambled down to the deck. Last Mate also happens to never really quite recall any nautical terms whatsoever and has to be constantly reminded what port and starboard mean. However, Last Mate’s relentless enthusiasm and deep respect for the Captain helps make him a tolerable, if not slightly detrimental, member of the crew.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "g5Z795aN58qw4llm","flags": {},"type": 0,"text": "Obum the Breaker – Former naval captain. Charismatic and popular, but mostly inept. Relies heavily on his First Mate Ideen (a warlock serving the Devil Osouro) and his boatswain Hwonk the Vile.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "CZJOuUz2c4iR8hIl","flags": {},"type": 0,"text": "Mourning Dove – A tall and graceful captain whose husband, a sailor, was seduced by a woman on his ship and disappeared. Mourning Dove wears a white eye mask and kills all adult females on the boats she takes. Her crew is all male.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "UVWbUcdqWoi49Cm9","flags": {},"type": 0,"text": "Powdermonkey Conrad – a small halfling boy. He is an agile climber who was found on a piece of floating boat wreckage as a child. He is full of optimism and often pulls tricks on his crewmates, but is fiercely loyal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "haHmjue1HRAAkzSE","flags": {},"type": 0,"text": "The Flamedancer – a goliath captain with the ability to create fire. He commonly attempts to throw fire at the sail of an enemy ship to immobilise it before getting close enough to burn the rest of the ship to surrender. Works with first mate Johnson, a sorcerer with the ‘Create or Destroy Water’ spell who control flames that spread too fast or put out a captured ship. He brutally burns any dissenters and enemy captains who fight in front of his crew, as a show of force, while Johnson stands by.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "nkiiVR5VSARmKWdl","flags": {},"type": 0,"text": "Rosie the Rivener – A well built and fiercely independent woman who pioneered a form of maritime execution in which the victim is lashed between two ships that then sail apart, ripping the victim in half.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "xTp7DtB9ESSQMplp","flags": {},"type": 0,"text": "The Dead Pirate Roberts – A skeleton that resides in the captain’s quarters of a pirate ship called the Death Jester. He’s not animated or anything, he’s really just a skeleton. The First Mate is a spellcaster who can speak with the dead, and frequently consults Roberts for advice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "xiMjlS2HeHtET3mS","flags": {},"type": 0,"text": "Dastardly Dave Deadbeard – Elderly human retired pirate. Usually found in the corner of a tavern drinking rum and telling stories of his plundering days. Mildly partial to a glass of bison milk. Has no beard.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "xPuDLVHWRd1ZC0rU","flags": {},"type": 0,"text": "Toruvah Hullfinder – This man’s body ripples with muscle, and his hands are like oyster-hammers. He fights bare-handed, leaping into the water and tearing holes in enemy vessels. He has an odd penchant for collecting bits of driftwood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "JpzanR3E6AOb12zC","flags": {},"type": 0,"text": "Bertha Redbraid, the Dwarven Sea Lass – Captain of the Dread Drakkar, a longship of dwarven construction. She loves looting and sinking vessels of Elvish make.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "a5cVYsE11oOXS7Jp","flags": {},"type": 0,"text": "Captain Koskinen – 6’7′ tall, 320lb tiefling with dark purple skin and a great many scars. He is barrel chested and imposing, with a deep and raspy voice, but he is actually a very warm and friendly host to guests aboard his ship, which sails the great desert at the head of a fleet of lost ships driven by a great sandstorm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "yAE8aw7GIBAFS84P","flags": {},"type": 0,"text": "Shivering Sally – Just what this pirate is is unclear, since she is always heavily bundled up and complaining of the cold. She clearly has some magical connection to ice, which makes her a dangerous opponent, but mostly she is notable for the betting pool on what race she is, and who will get a look to find out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "PUc8O3sO86Stz8jB","flags": {},"type": 0,"text": "Reversal of Fortune – A Goliath with a prominent burn scar along the right side of his face. Reversal of Fortune is a powerful swordsman and cunning captain. He is also subject to a powerful curse; every two years, he is destined to lose everything he owns. He is unaware of the curse, attributing his sudden biannual losses to bad luck or twists of fate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "m65Lw1g5nsyLT6eD","flags": {},"type": 0,"text": "Captain Bismuth Von Hart – a green tiefling swashbuckler in search of a way to remove the curse he has obtained. Formerly a Halfing, Captain Hart sacrficed his own appear, gaining tainted blood in exchange for a magically item/secret from a haunted island far to the east.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "ybX0Azm0glgi5DSy","flags": {},"type": 0,"text": "Marquis de Lafayette – a human sailor on his way to deliver news about the war effort of [insert country here]. On the weekends he does acapella with his crew. He loves whiskey, revolution, and women.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "MjDjczr8IuM5K0JA","flags": {},"type": 0,"text": "Brinetusk – Orc captain of the Crackin’. Large and imposing, with a number of tattered jackets and hats taken from other captains he has defeated. His ship reflects her captain, with a number of masts and armor taken from Brinetusk’s victims grafted on to the hull. He attacks other ships on sight, crashing into them with the weight of the Crackin’ behind him, with his shamans upon their war drums, summoning storms of vengeance and destruction. Expect a great deal of plunder if Brinetusk is defeated, though some of it may be more trophies and skulls rather than gold or gems.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "Fo9LyBlIoJdL5fIt","flags": {},"type": 0,"text": "General Taylor – once a high ranking officer of an empire (current or destroyed) he and his crew were sunk in an ambush (either pirates or an enemy kingdom) and woke up as an undead crew at the bottom of the sea. He continues to sail in his rotting galleon behind enemy lines, attacking anyone that looks like those who killed him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "yWhcJqFlxEnSgSke","flags": {},"type": 0,"text": "Archerd the Twice Drowned – A former pirate captain whose ship was destroyed by a great sea monster. Now he is back as a revenant and he and his crew will stop at nothing to kill the great beast.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "4qUJvfzKOEbIAGSm","flags": {},"type": 0,"text": "Ghingumuff Goldtaker – A clever and merciless goblin captain who boldly leads his crew to wealth and glory.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "V5yC5xXoYQoue3nt","flags": {},"type": 0,"text": "Tavis Startoe – A human who lost an arm to a shark. With his remaining arm he wields the rapier like no other. He often mocks his foes as he duels for their inability to defeat a cripple.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "b46YGlNb0voWM4z0","flags": {},"type": 0,"text": "Topiary Fritz – a halfling man covered in new tattoos and wearing a captain’s robe several sizes too big for him. He was once the servant of a large military ship, but once the ship changed hands he just continued to work. He is incredibly kind, hardworking, and an incredibly competent chef and servant.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "UpDi5tEclWCHivFE","flags": {},"type": 0,"text": "James Rothschester (Great Old One warlock) – is a human pirate captain with short, shaggy black hair, and sunken spectral green eyes. He is less interested in treasure than he is information. He and his crew go to ancient ruins and underwater caverns in search of information about his patron. He only takes enough treasure to keep his crew happy and willingly gives up much of his share in return for their compliance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "xtL7B8c663QSTa9X","flags": {},"type": 0,"text": "Elara ‘Forester’ – a druid torn between her love of the land and the sea. Her boat was grown of an ancient Riverside yew that wished to travel as much as she did. She hates the other ships that roam the ocean, those perverted abhorrations glued together from hundreds of innocent trees. Her ship, the ‘eldest pride’ is crewed exclusively by tree ents.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "0PaE40ZVOh3R0vop","flags": {},"type": 0,"text": "Barnaby, The Barnacle – Widely believed to be the crustiest, oldest sea dog still in the business, Barnaby is an incredibly old human pirate that has made a name for himself by being the most experienced and well-traveled pirate still alive. He has been a crew member of a whole fleet of ships, having held the positions of cabin boy and captain at different points in his life, as well as everything in between. He is a knowledgeable sailor, having spent more of his life on a ship than off one, and is one of the most competent crew members a captain can hope for, with any counsel he provides consistently proving the worth his wealth of experience in piracy. However, it is worth remembering that a pirate doesn’t grow old unless they’re the cream of the crop, and The Barnacle has spent his whole life as one. He has a cunning mind that has only sharpened with age, and a vicious streak as long as a ship when the time calls for it. Many a raid has been planned with his help only for the captain in charge to disappear amidst the fighting, leaving Barnaby as the man to look to, and he has earned plenty of loot from his long years of work. The moniker ‘The Barnacle’ was not earned because of his fondness for them or their presence on his body, but because much like a barnacle, Barnaby is impossible to be rid of and will likely remain long after his foes are at the bottom of the sea. All this history has earned Barnaby a degree of infamy among the underground community, and any captain who brings him aboard treats him with the proper respect, deference, and fear to which someone in his position is entitled.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "HiazmmE5nlLYEWvI","flags": {},"type": 0,"text": "Breaker of Ships – A Warforged gunner, BoS was created to serve as a living weapon for the (random country) navy. BoS slowly grew to hate this life, and when their ship was sunk in a squall, they walked along the bottom of the ocean, until they reached the infamous pirates haven, Shattersail Bay and enlisted with a crew. Now, when they are not blowing up (random country’s) ships, they are studying the occult, using their share of the booty to acquire dread occult artifacts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "i9lFVDhNwxpgN9Pj","flags": {},"type": 0,"text": "Lady Aliana Ismal – When the Hallowed Empire collapsed in the fires of revolution, the loyalist sailors and marines of the 2nd Hallowed Fleet found themselves without a cause or a leader. The former was fixed when Lady Aliana Ismal, a human warlock, arrived and seized control of the fleet with the aid of eldritch monsters, and her connection to the former royal family. Now the Unhallowed Fleet ravages the newly independent states out of a desire for loot and revenge. Rumor has it that Lady Ismal seeks to use the loot to acquire an army fit to restore the Empire to its former glory.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "scDdn4Rl6ZQfXMGj","flags": {},"type": 0,"text": "High Priest Kandi – Kandi ( a dwarven priest) and his band of followers are disciples of the Ocean God, Leviathan. Kandi’s home island was once invaded by a ship full of greedy adventures, who were only repelled at great cost. In order to prevent future attacks, KAndi and a group of his acolytes were ‘blessed’ by Leviathan with the ability to turn into weresharks and sworn to protect the people of their island from future interlopers. Kandi’s crew maintains a small gallon in order to fool incoming ships, but this is a distraction to allow the weresharks to get close to the enemy boat and board. Most of the time Kandi is content to scare ships off, but sometimes he is forced to destroy ships with all hands aboard, in order to protect his home.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "tW6kodfHz0FGU3ym","flags": {},"type": 0,"text": "Squabbles – a seemlingly timeless elf-ish man, though it’s hard to tell he’s an elf. His hunched back, yellowed fingernails and eyes, and wrinkled leathery skin almost looks monstrous from a distance. Speaks in a slurred Primordial that, even when understood, is not properly understood. He’s never been asked on the ship, and he always complains about ‘poor spoils,’ without ever asking for them. At port, he gets off the ship with the rest of the crew, and wanders back onto another ship, with no regard for loyalty of crew. Mediocre at washing, but entertaining, unique, and most importantly: free labor. However, captains are cautious of him, and some seem to listen exceptionally intently to his ramblings, sometimes even going so far as to invite him to sleep his ship duration in the captain’s quarters. Occasionally after a long night of slurred ramblings, captain’s may abruptly change their course, asking advice from the old crouch. Rarely do they find anything… that they speak of…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "hC3U2JStKTkcdpwW","flags": {},"type": 0,"text": "Seeker Malorie – a halfling Deckhand with a badly scarred face, extending to the top of his head effecting his hair growth noticeably (think scraggly). he has a Flase eye that seems to just look around on its own, but quickly snaps into line with the other eye when someone mentions treasure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "hvAcVM5WAQqFGjgC","flags": {},"type": 0,"text": "Rigmonkey Soliel – a half-elf girl who grew up in a traveling circus and was taken up by pirates after it burnt down. She dances up the rigging of the ship, keeping balance in the fiercest storms. She has a quick tongue and a fiery temper.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "7oLelIgSIAgPHZO3","flags": {},"type": 0,"text": "Slick Willy – An enormous, intelligent eel who signs on with pirate crews, accompanying their ships to attack other craft from beneath the waterline and defend against aquatic threats in exchange for bodies thrown overboard.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "VXakmR8Ea9fU6uil","flags": {},"type": 0,"text": "Teth-Makina – A githyanki pirate slumming it in the Prime Material, stealing gold on the open ocean rather than godflesh on the Astral Sea for a change of pace. Her ship’s figurehead is the actual head of a zombiefied dragon which breathes necrotizing green flames. Way overqualified for what she’s doing here.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "PnzCAETRYWewT7Ay","flags": {},"type": 0,"text": "Deephost Margot – An aspiring pirate-queen who sought power through symbiosis with a creature of the lightless depths. She must consume alchemical drugs regularly, both to make her body an amenable environment for the creature and to sustain her organs crushed by its occupation of her torso, and in return gains access to its abyssal magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "c9243Vxk1YjtoQuo","flags": {},"type": 0,"text": "Ulixes the Tidesworn – A sea-priest who pirates not for wealth, but to ritually enact the supremacy of water over land. A peerless navigator who finds his way by revelation rather than reason.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "wZExbAiiH14HsoTl","flags": {},"type": 0,"text": "Long Don Clamber – Born to a port whore and raised in the shadow of Jolly Rogers, has always dreamed of becoming the most infamous pirate the seven seas had ever seen. Has had impressive exploits as part of the crew of several notorious pirate captains, but never managed to afford a ship of his own due to blowing his earnings on magico-surgical alterations to make his form more piratey. Has a hook-hand that can fire off a grappling hook, gills and an organ that lets him drink seawater, a liver that can handle any amount of grog, expandable peg legs, a monkey’s tail attached to his back, and so on.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "4r8t8Z7tAfkwd5af","flags": {},"type": 0,"text": "Gurglesploosh – A water elemental playing at being a pirate, as it seemed like the most entertaining thing mortals did on the waater. Gurglesploosh doesn’t really understand important (to mortals anyway) concepts like “crime”, “ownership”, or “death”. Starting to enjoy the feeling of blood diluting within its body.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "hGAgwdmqzpmXAxTo","flags": {},"type": 0,"text": "First Mate Jeremy Jenkins – His captain has been dead for 5 years. Despite sailing with and leading the remaining crew, Jeremy hasn’t taken the captain role out of respect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "2hHrmO5TDI1HwEPd"}
