{"name": "Interesting Desert Locations","description": "One hundred amazing landmarks and locations that your players will stumble across while traveling through a desert!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "Z8sXBMUsCdrJATlk","flags": {},"type": 0,"text": "A massive ribcage that once belonged to a gargantuan creature is creeping it’s way out of the sand. Rumor has it that a strange group of desert-dwelling natives have hollowed out some of the bones, and use them as protection against the elements. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "6pLrYmwF8Ndj8Bg7","flags": {},"type": 0,"text": "While walking the party steps on large sandstone slab, that’s actually the roof of a sandstone building completely buried in sand, if they manage to get inside, there are clay urns filled with mummified jackal parts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "rnVwh1G0TkmnjEna","flags": {},"type": 0,"text": "A massive gaping hole in the sand, 30 feet in diameter, shoots downwards endlessly into darkness. Tiny glimpses of radiant color shine from deep within. Legends of this forgotten land spoke of a titanic flying worm-type creature, which is rumored to burrow deep in the sands for a place of rest, often revealing secret ruins and ancient treasure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "nGY5H7IEjPS7rnLc","flags": {},"type": 0,"text": "An ancient tree stands alone, twisted by time and the wind. At its base are several large boulders and a dry well. Inside the well is the jagged opening to a narrow tunnel. The tree is dying.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "NBKWimJkgokOIViv","flags": {},"type": 0,"text": "Desert Druid Garden- a hidden valley full of cacti and succulents being taken care of by a hermit Druid. She offers travelers cactus juice that will make them trip out if they fail their constitution save.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "5fPcCrxjDn9eOSDZ","flags": {},"type": 0,"text": "A 200 by 200 ft. square. Some parts of the sand seem normal. Other parts seem to flow, almost like a river some of these sections converge, and usually they send you back to the safe/still areas. And at the center is a stone and metal platform, about 10 ft. by 10 ft.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "Z8ThmIuQiQ7CHx6j","flags": {},"type": 0,"text": "A circle, 100 ft. radius, where the consistency of the sand always changes. Sometimes it is soft and flows between the fingers easily. Other times it is rough. Other times it feels like mud. Other times it is as though it makes up a brick of sand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "44oFQ3YpOzkAlAWT","flags": {},"type": 0,"text": "An archway made of polished stone. Speaking of a place allows a character to view it through the arch, but they must pass a check to resist becoming entranced by the sight. Digging near the archway will reveal the bones of adventurers who failed the check, wasting away in the desert sun while looking at distant lands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "OMTEj9Ww2GtpOrub","flags": {},"type": 0,"text": "A seven hundred foot tall cactus with a city inside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "jSPPZveHblHkpJWU","flags": {},"type": 0,"text": "The shifting sands in this area seem to take the shape of eerie, tortured faces.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "k1B8hISeb3ialg8T","flags": {},"type": 0,"text": "An extraordinarily deep saltwater oasis. A genie’s lamp is at the bottom but can only be seen if a player is underwater in the oasis and cannot be removed from the water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "ry1tMg5w3jKlUGGx","flags": {},"type": 0,"text": "A small outlaw mining operation in a medium sized crystal cave network. The crystals are energetic and unstable making them prone to explosions and dangerous to move.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "0MLyhrxX7TuSgJQd","flags": {},"type": 0,"text": "A merchant sand skiff powered by an air elemental.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "d871sFNMQWAKASAK","flags": {},"type": 0,"text": "A death race where anything goes. The players meet a race sponsor that lost their last crew during the last race. They have a spare sand cruiser that needs a crew. Very dangerous, large cash reward.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "BK3UwqrwlDBWxAAp","flags": {},"type": 0,"text": "A player stubs their toe on a large stone. The stone turns out to be the top of a worn out castle buried in the sand. Digging deeper reveals an entryway into the castle. The castle is haunted by a ghost king and his royal guard. Completing some “unfinished business” quests for the king will be rewarded with a bone ring that allows the players to summon him and his household guard once (the ring vaporizes on use). Killing the king and his guard will yield a large treasure stash somewhere in the castle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "IDzTNffQ0qlukJch","flags": {},"type": 0,"text": "It’s night and the players see a shooting star. But instead of disappearing into the night sky, the star keeps going and impacts the ground nearby. When the players investigate they find a large hollow meteorite out of which is climbing a human-looking person. The person explains that they used to be a God but the other gods collectively decided to demote them to a lowly demi-god.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "OwmteCIagaXPO9C7","flags": {},"type": 0,"text": "A gargantuan forge powered by a series of lenses stretching into the sky and focusing all that sunlight to a single spot. Currently home to an evil necromancer. The necromancer is using the forge to create powerful weapons for his mummy army.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "TJf69XADcINKMbx4","flags": {},"type": 0,"text": "A giant stone stead laying face up making a horrified expression with huge cacti growing in each eye-socket.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "nwFHH6trqTU1u8g6","flags": {},"type": 0,"text": "A large expanse of very tall rolling sand dunes. A sand storm comes, and when it passes, the party sees that all the dune hills have shifted, and they roll to see if they’re lost.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "aJhySENtuUnCufaN","flags": {},"type": 0,"text": "A gigantic dinosaur skeleton stretches out into the desert. There is a town inside the dinosaur. The resident’s religion is very strict and any violation of it will result in sacrifice in the church inside the skull.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "4XmQCQwVwCwmlJAL","flags": {},"type": 0,"text": "A strangely isolated merchant stall. The Merchant sells general goods and a few more interesting items and, despite no obvious sings of shelter or agriculture anywhere nearby, seems quite content.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "0oPELxLKSQp53Uds","flags": {},"type": 0,"text": "A long time ago, a comatose Marid fell from the elemental plane of water and landed in the middle of a desert. Where they fell, a great oasis began to flourish, and this source of unlimited purified water became a relative metropolis in the barren wasteland of the desert. The streets are really just canals, with the furthest away from the center having only tiny streams, while the more affluent districts towards the center having the widest channels. At the very heart of the city lies the opulent house of government. An at the center of that, in a room strictly off limits to anybody without permission, lies the spring where this purifying water comes from. Deep below the surface, somebody is starting to wake up.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "etcDeF2bK85JH2uD","flags": {},"type": 0,"text": "You find a glassmith’s workshop. The glassmith has set up shop in the middle of the desert due to the rare sand found nowhere else in the world, where the glass that results has the perfect material properties to support viable glass weapons. All of the melee weapons that she produces are +2, but shatter on critical failures and critical hits. However, when determining critical hit damage while using the weapon, add an additional 1d12 to the damage. No refunds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "QqBJZfY5SCQ6Kt9r","flags": {},"type": 0,"text": "You find a massive wooden ship, half submerged in the desert sand. The sails are heavily tattered to the point where they almost aren’t there, the color is faded almost entirely save for the sand that caught in the fabric, the wood is rotting and cracking… but in the middle of a desert, how could something like this have gotten here in the first place?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "UBrz9p0MJVwb8j97","flags": {},"type": 0,"text": "You’ve stumbled upon a large mound made of some type of rock. It looks like an upside down teardrop, only staying balanced by a small point. It looks like there might be something at the top of the giant rock, but you can’t see it for certain…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "23oodp7bueFrSSHP","flags": {},"type": 0,"text": "One night, you see a glowing light in the distance that turns out to be small campsite with a few camels tied up for the night. Seated around the campfire are a couple of foreign dwarves on their way to oversee the new desert mining operation. They’ve gotten a bit lost and are trying to figure out which direction they should head in the following morning.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "ENrYKtgoHFm95sUT","flags": {},"type": 0,"text": "A single pillar jutting up from the sand that leads down into a buried mythical library. It is tended by spirits and filled with books and scrolls of immense and ancient knowledge. Optional: add an astrological chamber that helps the heroes discover when the fire nation will be at their weakest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "ldXYMrDG5351MkGN","flags": {},"type": 0,"text": "A small town, which if found can be entered. However, after entering it is very difficult to leave, with all roads and exits merely looping back into town. Locations within the town: 1. A library, which is rarely used as books are banned by order of the local government and anyway, all the librarians are ravening ghouls. 2. A walled park, clearly marked as off limits to both man and beast. Dark hooded figures, whom the locals will not speak with and which refuse to speak with the locals, can be seen entering and leaving the park. 3. A waterfront, complete with docks and beaches. But with absolutely zero actual water. The town includes several important NPCs: 1. An old woman living near the edge of town. She is helped around the house by a group of glowing black being with wings who are definitely not angels. 2. A city council, which runs the place. It is comprised of a group of wizards who at one point wore robes and soft meat crowns, before a magical accident merged their bodies into a single, horrible being. 3. There is also a town crier who stands on a corner and narrates the adventures of the party, no matter how epic or mundane, as they reside in the town. Just before any boss fight, he steps down for a break and is replaced by a band, which reports the weather.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "VBfgwMnY7mujtyEC","flags": {},"type": 0,"text": "You find the camp of a nomad group of goliaths. The elders are completely unwilling to deal with any outsiders, but the younger members are willing to talk and trade. The younger members will explain that they are the third generation of a tribe that was captured and sold into slavery before eventually revolting and escaping into the desert. While not native to the desert, they have found that their natural resiliency has granted them with the strength they need to survive this inhospitable land.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "Q7XafY5VRngYvB4h","flags": {},"type": 0,"text": "A giant black glass crater, formed eons ago when a meteor hit the desert. Sometimes rare minerals can be found there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "zFrAzDwLFDSUGg8E","flags": {},"type": 0,"text": "A fortress or city built on top of a large mesa","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "OkLaVatiTXm5KGCR","flags": {},"type": 0,"text": "Cliff or Cave dwellings built into the side of a mesa","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "lH9ul8H26UZAGR9B","flags": {},"type": 0,"text": "A large tree that seems to be flourishing despite the heat and lack of water","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "VEhayMlDBJlCG54P","flags": {},"type": 0,"text": "A giant continuous sand storm. The storm never ends and it never moves from its location. Anyone who manages to find a way through the storm to its center finds clear skies & ruins of an ancient city, fortress, or temple.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "vyUZaQNlkJlVgBht","flags": {},"type": 0,"text": "The great cisterns of “x”. A huge underground water reservoir with intricate designs carved into the wall and stone pillars. The cisterns are a marvel of architectural design. They collect, filter, & store rainwater.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "0iaakDzxrzZewPgi","flags": {},"type": 0,"text": "The black sands desert. An ancient volcano covered the area in many minerals. The desert has ground most of it into miles & miles of coarse black sand. Occasionally you might find rare metals, geodes, or crystals","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "seeybCKBfk1rHO5M","flags": {},"type": 0,"text": "Town of monster hunters. Most of the buildings are created from monster bones, scales, & giant insect carapaces. The town mostly consist of hunters & craftsmen. The hunters learn how to kill, capture, or domesticate monsters. The craftsmen lean how to build nearly anything from monster parts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "ybZHCicU4Fjk1YAH","flags": {},"type": 0,"text": "Strange ruins that get unburied exactly every 20 years. Every 20 years a storm clears away the sand covering the ruins. The ruins remain uncovered for 1 week, and then another storm buries the ruins for another 20 years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "RvWSBMvR6Xwzw6ZL","flags": {},"type": 0,"text": "Wandering Oasis. A strange magical oasis. It contains crystal clear fresh water & it is surrounded by many edible and medicinal plants. One can even find edible fish swimming in the waters. The oasis can be found at random locations in the desert. It never stays in any one place for more than a few nights. Anyone at the oasis when it moves will see it slowly fade away and be replaced by desert sands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "kqpODdJ2Z4YbT6EX","flags": {},"type": 0,"text": "Giant insect mound (giant termite mound), inhabited by Thri-Kreen. The mound is the size of a small town, and also contains vast underground tunnels.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "VrIewNnjGFhImkIt","flags": {},"type": 0,"text": "Desert of Devouring. Some creature lives here below the sand. When it senses prey on the desert surface, it causes the sand to vibrate. This causes anything on the surface to sink into the sand. Very few desert travelers have managed to escape to tell the tale.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "RTVOJh6s71Aicqa5","flags": {},"type": 0,"text": "Ice Mines. A town has formed around a rocky area in the desert. In the center of the town is a mineshaft that goes deep into the earth. In these mines tunnels of ice with large ice formations was discovered. The ice tunnels lead to a large frozen underground lake. The town’s people use the ice as a water source. They also use it to make very rare cold drinks and frozen foods & deserts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "R802uM97jXZHgfZd","flags": {},"type": 0,"text": "An ancient desert city built into a massive crevasse thats been hidden by the rolling dunes around it","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "6ygxolkNA4tTDhc2","flags": {},"type": 0,"text": "A waterfall of sand that originates from… high above the clouds? What could be up there?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "FevHOpQfGipozSlt","flags": {},"type": 0,"text": "A small cave hidden within the dunes that, upon further inspection, is a dwelling of some sort. This is the dwelling of someone who walks the dunes alone. Garbed in face wrappings and protective gear this individual does not fear wading through a vicious sandstorm and will often spend entire days wandering, searching. This individual may be magic based or not. Their purpose can relate to any other interesting desert locations on this list. This is Sayied The Wanderer (M) OR Ameera The Wanderer (F).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "Fwev64WT0un9aheS","flags": {},"type": 0,"text": "A portion of the desert whose dunes have been utterly LEVELLED. Unfortunately, this expanse of flat sand is the result of the largest sand worm in existence that takes this part of the desert as its own. Its hunting grounds extend for miles upon miles, and while it curbs its hunger on the rich fossil fuels deep below it will quickly make a beeline for any flesh that steps foot into its realm. If you hear its tremors, its already too late for you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "pWqA1z1RdEuXFJIp","flags": {},"type": 0,"text": "A sleeping Storm Giant, but not just any Storm Giant: a Sandstorm Giant. It is the last of its kind. Birthed when the planet was still in its infancy along with the others of its kind who are long dead. It seems this individual is on death’s door also. What will be its last words? What does it want to pass on to perhaps the last individuals that see it alive?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "z0zemFcc3vimyh5F","flags": {},"type": 0,"text": "A forest of up side down trees. Above the surface, it is clear that all these trees have their roots pointing to the sky and the rest of the tree part buried beneath the sand. This small forest is a secret magical portal. Will you take the plunge and bury yourself beneath the sand upside down?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "klAhUdK8tEANTHJa","flags": {},"type": 0,"text": "The Roc Loft. A small sized mountain stands isolated amidst the dunes. Its exposed stone is hot from the beating sun. Reaching a solid mile into the air, a nest of dead trees marks the dwelling of a 160-foot wingspan Roc. Getting into the nest may not be too difficult, but once you’re in, getting out could be tricky. There’s probably a lot of high quality bones within the nest. Perhaps a secret passage hidden under the bark leading into the mountain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "YrroAXZnp1odM6os","flags": {},"type": 0,"text": "A swarm of bloodthirsty locusts is crossing the desert looking for new lands. Figure out a way to not be eaten alive as they pass. Bury yourself maybe?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "DgAPE5wlYKW8Rbf5","flags": {},"type": 0,"text": "Moonstone deposit. A 3×3 foot chunk deposit of moonstone juts out of a small stone outcrop. At night, this stone will emit a beautiful pale glow as it laps up the cooling moonlight. The light the stone re emits has magical properties, but some are only available in its natural unmined state. Unmined it can: have a calming effect removing madness effects, revitalize the body removing exhaustion and sleepiness, repel evil and remove curses in its vicinity, and grants a +1 to all checks, saving throws, and attack rolls for the next 24 hours. Mined chunks of it can: be a source of dim light, be used in crafting to make Magical Melee weapons (silvered property), repel evil spirits from entering the body and it has a very strong affinity to be enchanted with radiant damage from any capable enchanter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "u0qT0j46nLb27xS8","flags": {},"type": 0,"text": "Blood-Moonstone deposit. A 3×3 foot chunk deposit of Blood-moonstone juts out of a small stone outcrop. At night, this stone will emit an eerie red glow as it laps up the cooling moonlight. The light the stone re emits has magical properties, but some are only available in its natural unmined state. Unmined it can: have a maddening effect on others causing them to make saves for short term madness, absorb life energy from others causing one point of exhaustion every hour (minimum 1 point), mark individuals to be cursed and targeted by evil spirits in the future, and grants a -1 to all ability checks, saving throws and attack rolls for 24 hours. Mined chunks of it can: be a source of dim red light, be used in crafting to make Magical Melee weapons (silvered property) that can potentially cause the frightened status on hit, easily take on curses and it has a very strong affinity to be enchanted with necrotic damage from any capable enchanter (though they would utterly hate to work with the material unless they were a necromancer).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "de5luxAFtqrxeFbb","flags": {},"type": 0,"text": "The Lake of Stars. This lake of pristine water ONLY appears at night, during the day it does not exist. It is so still that it mirrors the billions of stars overhead perfectly. It does not have a single ripple in it, and looks like a literal portal to the cosmos. Seeing such a thing of natural beauty grants inspiration. Note that what this lake mirrors is not merely the stars as we see it, but the cosmos throughout the astral plane as well: you can see passersby from the astral plane by looking into the lake (astral dragons, celestials, godly beings). Beware, for bad luck will haunt those who disturb the lake.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "LWyj2XwYAfFdh7ai","flags": {},"type": 0,"text": "Two vast and trunkless legs of stone / Stand in the desert. . . . Near them, on the sand, half sunk a shattered visage lies, whose frown, And wrinkled lip, and sneer of cold command, Tell that its sculptor well those passions read which yet survive, stamped on these lifeless things, the hand that mocked them, and the heart that fed; And on the pedestal, these words appear: My name is Ozymandias, King of Kings; Look on my Works, ye Mighty, and despair! Nothing beside remains. Round the decay, of that colossal Wreck, boundless and bare the lone and level sands stretch far away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "rSMmgXKLk5hDM3MV","flags": {},"type": 0,"text": "An ancient druid lives on a blank obelisk with seemingly nothing around. He has no protection from the elements, and though his skin is leathered, it is never burned. He will answer any questions honestly, as well as give the minimal amount of food and water needed to reach the next oasis, but all only when prompted. If he does not know an answer, he taps his ancient walking stick: headed with the skull of an animal no party member can access, onto the obelisk, which will showcase the answer in Primordial. The answer is etched in, is always easily readable, and fades after 10 seconds. The obelisk can only answer 1 question per party member, before a sandstorm kicks up, vision is obscured, and everything vanishes. It is impossible to trace this druid.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "mnpD6HWIAL2B2lGK","flags": {},"type": 0,"text": "A series of heat lightning strikes has caused a bowl of natural glass to form. The glass can be taken, broken, and has a rippling effect in it, but is otherwise only pretty and useless.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "2hNqGf7gAkj7X81w","flags": {},"type": 0,"text": "A rippling of black sand that is hotter than the white sand desert. It can be buried, though cannot be uncovered. Lizards often stand on it for greater warmth. If the party can get an aerial view of higher than 60 feet, it points in the direction of treasure, an enemy, or civilization. Otherwise, it is decorative.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "6gNuwUVPqYkwiqgx","flags": {},"type": 0,"text": "5 foot wide, 5 foot deep holes with horned frogs sitting in the middle of the bottom: like spiders in a web. It is designed to catch insects and small reptiles for the frog’s consumption. The party can easily step in and out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "hpOjy6dVp5RUHlTg","flags": {},"type": 0,"text": "A bottle with a message inside, clearly once sent out to sea, now in the middle of the desert. Inside is a beautiful love letter from a sailor to his betrothed. It is ancient, and begins to crumble to the touch, obscuring a majority of the message.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "X5SYMiPt1345JpSi","flags": {},"type": 0,"text": "A cliff jutting out from a hillside, looming over an old a vast expanse of an old dried out lakebed. Under the cliff, a hidden cave entrance reveals a broken down old sailing vessel sunken halfway into the sand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "tCRsOwJsB4QnD7Lx","flags": {},"type": 0,"text": "A small circular stone pad lined with stone chairs facing inward in-between some sand dunes and partially covered up by the sandy winds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "IUKR9CJLGOGdAsFO","flags": {},"type": 0,"text": "An oasis that, on one side, a steady stream runs off down into a small cave opening and singular broken down track sits at its mouth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "JFamtLrda3DZKoA8","flags": {},"type": 0,"text": "An up crop of rocks breaks out among the soft sands with the skeleton of an ancient tower leans half ready to collapse and be swallowed by the ever breaking tides of the sands around it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "iD2hUfzHRZ0le0s2","flags": {},"type": 0,"text": "A small cactus field that slowly moves along the desert ground, throwing travelers off and often in circles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "ogfKB2H3UoOOnd6k","flags": {},"type": 0,"text": "A massive canyon cut into the dunes of the desert. The rock on the inner walls is jagged and torn, seeming as if it’s trying to break through its own confides, while slow sweeps of sand closely resembling a weak waterfall fall into the canyon from above. Dark brown bare trees stretch and contort up to the sky from the canyon bed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "VuNnrFaAykCHXQfh","flags": {},"type": 0,"text": "A perfectly stocked bar, tended by an immaculately dressed bartender, with a black vest and British accent, even if British people don’t exist in said setting. Is capable of providing any drink, all masterly crafted, but asks for favors in return, usually to obtain rare drinks, fluids, utensils, glasses/drink receptacles and ingredients, but can also include assassinations, clearing out of creatures from an area, and rare artifacts, to name a few.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "FkjHX3I2rBaWscIj","flags": {},"type": 0,"text": "A large pit in the middle of nowhere, with sand constantly flowing towards the middle. At the center of the pit is a large antlion-like creature that eats all that gets sucked into its trap. Hard to spot from a distance, with many falling into its pit while thinking that they were only climbing over a dune.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "RKhAdF9cnm7cKbNg","flags": {},"type": 0,"text": "From afar, it looks like a small pond, except there is no vegetation around it. Once you reach it, you find out it’s solid─a pool of glass, as if sand had been suddenly melted and then cooled over time. And then you hear the roar of a fire dragon in the distance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "oU8zz1fmDowaVKYv","flags": {},"type": 0,"text": "Cresting a dune the shiny copper of a metal contraption sticks out of the sand. It is the arm of a gigantic metal automaton of unknown origin and unearthly construction. It appears that long ago this enormous creation sunk into the sands and couldn’t escape and was slowly swallowed by the desert.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "Gfc4efnHZ1ImxtOK","flags": {},"type": 0,"text": "The wandering oasis stays in one spot before magically relocating every 30 days to another part of the desert. Nomads that call the oasis home have mapped the oasis’ track over the years and pack up and relocate each time in an event called the wandering.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "DETVSaSFNxje7HFt","flags": {},"type": 0,"text": "A patch of luscious green grass with a giant, calming willow tree in the middle with strange fruit hanging down from the high limbs of the tree. When someone touches a piece of fruit the massive tree aggressively stirs from it’s slumber. The whole patch of grass is the tree and it’s roots. The tree is a traveling, carnivorous predator; it has come to the desert from much greener lands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "LIjL52Sgce4RWImo","flags": {},"type": 0,"text": "An old abandoned shop on a stead, at its front is attached the corpses of two massive sand worms. It’s infected by desert creatures using it as shade, but holds the abandoned stock of a shop.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "0APl1r2ZfXowf3tf","flags": {},"type": 0,"text": "A terrible sandstorm is approaching. If the PCs do not take shelter, a successful perception check will spot a banner flying from a wooden pole over the dunes. As the players watch, it will be revealed to be a large sailing ship riding the leading edge of the storm. It will pass by the players, and ropes will thrown down to bring them aboard. The Captain is a stout, imposing tiefling with many scars and a deep rasp to his voice, but a surprisingly gregarious nature. He will introduce himself as Captain Koskinen of The Kotka and Commodore of the Hukkunut Fleet. He will take the PCs to the bridge of the Kotka and gesture behind the ship, into the storm, where a vast fleet of lost ships are following, in increasingly poor condition the deeper into the sandstorm they ride. The entire fleet sails the desert as if it were an ocean. Occasionally another ship will pull level with the Kotka, allowing the players to swing across, Errol Flynn style. Many of the ships still contain treasure, though their crews are seldom willing to part with it, and are not often friendly to boarders. If the hull of one of the ships is breached, it begins taking on sand, and eventually sinks into the desert and is lost.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "PoetgYf5y8Kv06sB","flags": {},"type": 0,"text": "This rocky area of the desert is lined with erratically placed tall spires, like colossal termite mounds. They are lined with hexagonal cells near the base, some of which lead into deeper, explorable caves and tunnels. As the spires ascend, the cells become less regular and more erratic before ultimately degrading into abnormal shapes, twisting helixes, and ultimately into non-Euclidean geometries. What creatures dwelled here and built them? What madness led to their destabilizing constructions? Did it contribute to their disappearance?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "0tNz50Y9bSOCTq8C","flags": {},"type": 0,"text": "This area of the desert is lined with dunes of black sand and chunks of razor sharp obsidian. Smoke wafts from fissures, and nothing grows. Anything buried within the sand rises again as an undead husk with the next full moon, and every creature you come across, such as tarantulas and monitor lizards, are zombified.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "CzWhaucR1lHx1b5t","flags": {},"type": 0,"text": "Three jade statues, appearing as arms stretching from the sand, stretch nearly twenty feet from the sand. They are thousands of paces apart, but can be clearly seen. Digging reveals they are simply part of even larger humanoid sculptures. Touching them is painful and can cause visions of an apocalyptic event… from the past? Or in the future?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "zZ9NYoYIUlak1V0U","flags": {},"type": 0,"text": "An eccentric wizard studying the bones of ancient creatures excavated from under the sand hates the heat with a passion, and has built a twisting tower made of never-melting ice bricks. There is no clear entrance – only those he thinks might be interesting can gain an audience.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "FyRtTzWiyNVr7pp3","flags": {},"type": 0,"text": "A picturesque and unassuming oasis. At night, orbs of light appear and chase each other across the surface of the pool.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "7ZtBZS7UfaIXAeYW","flags": {},"type": 0,"text": "A patch of delicious and spicy smelling organic growth. If disturbed, the party is attacked by a large carnivorous worm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "l1O6VLgnyODqzl5l","flags": {},"type": 0,"text": "An Earth Elemental guarding a cave in a small canyon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "rG2ix4uZoTrs8Mhj","flags": {},"type": 0,"text": "A small pool of water at the roots of a gnarled old tree. The water contains a psychoactive substance which causes vivid, but not traumatic, dreams/hallucinations. Buried within the visions are directions to an abandoned bandit hideout nearby.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "WMaLnzjMUEvixXrt","flags": {},"type": 0,"text": "A cactus maze covering nearly an acre. No one knows where it came from; it simply appeared one morning several months ago. The arms of the saguaro-like cacti reach in at the top to make a solid ceiling, so attempts to map the maze from the sky or scale the walls are unsuccessful. No one who has ventured in further than the second turn has returned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "t4GtPPrYeCGmA5mR","flags": {},"type": 0,"text": "A mesa juts up out of the desert, visible from miles around. Atop the Mesa is not just an oasis, but a rich forest surrounding a spring the size of a pond. Locals have constructed a city on the steep sides of the mesa, the buildings carved into the rock wall and connected by bridges, pulley operated elevators, and rickety wooden planks and stairs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "dVsVJI6fwlA9V2Da","flags": {},"type": 0,"text": "Four tents in a depression in the desert, surrounding a decent-sized pond that has formed in the center of the campsite. Each tent is occupied by one individual. Residing in a light grey tent with blue ropes hanging from its canopy is Abu-Nazim, a conjurer who specializes in creating water. In an act of defiance toward gods of nature, Abu-Nazim has decided to create and expand his pond using his magical prowess. Abu-Nazim’s opposition to gods has attracted three other figures to the location, who all oppose gods in one shape or form. Among resident is an old human druid who lost his faith when despite all his efforts, the grove of oaks he tended to died 5 years ago. The druid packed what little possessions he had, along with all the acorns he could find and set about finding a new place to settle. He has yet to try planting his acorns in the desert soil, but he is afraid of losing the few acorns he has to the hot climate of the region. Also among the residents is a fugitive inventor who had to leave town after he burned down a temple with one of his giant mirrors. He claims that the incident was an accident, but a successful Insight check will reveal that he is lying. In reality, he burned the temple to appease an extra-planar entity (a demon). The inventor’s tent is surrounded by scrap metal and roughly polished sheets of metal. The fourth resident is an elf who has settled in the camp site no more than 2 month ago. He stumbled upon the tents while looking for a rare beast, and reasoned that his prey would visit the pond to drink water. He spends the day resting and keeps watch over the pond at night hoping to catch his prey.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "bgsdLNGcCznFqubA","flags": {},"type": 0,"text": "A vast city lies in the center of a desert, no source of water to be seen. The five priests powerful enough to control the weather bring rain, and are worshipped as gods among the people.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "KzbfDSh4yhdlENt1","flags": {},"type": 0,"text": "An old halfling runs a sand-surfer shack an hour march into the desert, where the dunes are just right. Lessons are five gold, plus rental. Other desert goers are surfing, including the local champion, an orc woman missing her left forearm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "pFXQ1lPLp2SNpZ2s","flags": {},"type": 0,"text": "A mad cleric sits in a hide hut, surrounded by hundreds of camels. He spends his days creating water to grow them a long lawn to eat from, and simply says that he enjoys their company. If pushed on what deity he worships, he’ll fall silent and the questioner will feel the eyes of all the camels begin to stare at them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "FWggrUoefcIzDVGp","flags": {},"type": 0,"text": "A ladder sticks out of the sand and goes straight up, as far as the eye can see. What’s at the top is up to the GM but it takes at least Two days of climbing requiring the design of suspended sleeping arrangements.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "JYaCiKUcORqh00ts","flags": {},"type": 0,"text": "A half finished giant art piece made using different coloured sands. Created by a desert druid as a form of meditation, he controls the winds to protect his creation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "jPoDEu6INsJIuSO5","flags": {},"type": 0,"text": "A partially buried giant stone hand, standing 80 feet tall and 50 feet wide. It is unknown how long it has been there. Rumor has it that an elderly Elf first saw it in his youth with the fingers in different positions. It is cold to the touch and feels just like stone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "mzFQIwDG9kktZyiD","flags": {},"type": 0,"text": "A long dead and mummified corpse of a frost giant. Infernal script is carved around it’s neck, detailing the name of the demon the giant was property of to anybody that can read the script.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "PGjliclkdszd9Buy","flags": {},"type": 0,"text": "A band of 1d8 hobgoblins exhausted to the verge of death (4 levels of exhaustion) stumbles upon your party and immediately surrenders, begging capture if it would mean salvation or a quick death if it would mean an end to their pain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "gn6jIrQzGCqh8QS1","flags": {},"type": 0,"text": "A once lush and inviting oasis, now corrupted by a dread necromancer. The plant life here is withered and dead, what little water remains is grey and poisonous, the sand is black, and there are most certainly zombies wandering about. The local nomad tribes banded together to storm the necromancer’s compound and burned it and its owner to the ground. The necromancer is not dead in the slightest, and is slowly being regenerated in her secret warren under the remains of her compound, along with her cache of magical artifacts. The nomads would probably be happy if you killed her again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "NudP9dhjmPLKNB2i","flags": {},"type": 0,"text": "A group of Desert Fey, riding wind elementals, chase a group of travelers across the shifting sands. This is the desert version of the Wild Hunt, and the travelers (a rich merchant and his associates) are the prey. Interference may be unwise, but also rewarding if the party is successful at driving off the Hunt.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "C4015Ip0VNIqntzI","flags": {},"type": 0,"text": "A metallic ruin in an ancient crater, around which a village has developed, known as Voyager’s Landing. The townsfolk are unusual in their appearance and custom. They will not permit outsiders to examine the ruin, which they claim is the “sacred vessel” of their ancestors. An alchemist or artificer might learn a thing or two from the devices and alloys in common use here, and a psion or other attuned person will detect presences within the wreck: several hundred dormant souls and a vast machine-like intellect filled with ancient secrets.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "w1Pt6bjkRPhwrbed","flags": {},"type": 0,"text": "A pair of stone legs and a shattered face rest on the dunes. On the pedestal half worn away by grit and time is etched the name of a tyrant long forgotten and a hollow boast: “Behold what I have wrought, and weep…” Nothing beside remains. Around the decay of that colossal wreck, boundless and bare, the lone and level sands stretch far away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "mTi57fGdGyT0703d","flags": {},"type": 0,"text": "A field of static electricity. When the party walks through it, they feel a tingling sensation and their hair starts to stand on end. If they inspect the ground more closely, they notice that the sand around them is vibrating ever so slightly. Something barely perceptible zooms past the group from behind. It stops and hovers in mid-air before the party’s vanguard. It’s a dull brass orb, weathered, dented and about the size of a human fist. It buzzes once, then pauses. Then buzzes again. After a brief delay, it starts to move again. The party follows it about 100 ft., where it stops abruptly, and drops straight down into a hole that must’ve been specifically made for it. The static intensifies…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "Sw3ti9QLwpGwgAUy","flags": {},"type": 0,"text": "The players come upon a trading post owned by a desert nomad. The nomad seems friendly enough, but all the items he sells have been enchanted with a scrying spell, so he will know the location of the item at all times. Within a few hours of the players leaving, he sends out thieves into the desert to find them and rob them blind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "97QEoiy8hfRrAGfb","flags": {},"type": 0,"text": "A large beast that hides beneath the sand, snake like in its form, and covers itself in sand, becoming one with the dunes to protect itself and be unseen by its prey. It uses its camouflage to confuse potential prey into walking in circles, by making them see the same dunes/landmarks around them. When the party reaches X location in the desert, if they roll a high enough nature/perception, they will notice something is off, though the longer they don’t, the higher the DC goes up. This can result in a battle between the giant desert snake and the party, or a way to guide the party to a certain area using the giant snake as a spirit guide.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "wDsRnIloL7hqGQpX","flags": {},"type": 0,"text": "An ancient stone village is peeking out from the sands. The buildings are all at least halfway buried. It is rumored that the clock tower in the center of this deserted village leads down deep into the sands, and a horrible creature lives down there; the same creature that consumed every living person in the village!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "BXEftKvcbATdEMJs"}
