{"name": "Secrets A Hamlet Or Village Conceals From Outsiders","description": "One hundred secrets that a village tries to hide from outsiders.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "XWjibrRgR59xA2bF","flags": {},"type": 0,"text": "They are harboring a fugitive from the law, someone who has won the trust and respect of the community. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "RrNpXMXSwRcWiK4K","flags": {},"type": 0,"text": "They are harboring a political refugee, either a person or their heir who was displaced by a coup or an attempted one. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "1mJaG6oOvNEep8mE","flags": {},"type": 0,"text": "A number of their community are lycanthropes, grudgingly tolerated, but fiercely defended as their own. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "qVvJ0MkgW6RIy8uR","flags": {},"type": 0,"text": "All but one are impersonating the majority species of the region when in fact they belong to a race of shapeshifters. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "80uY1ceQwggVNQmb","flags": {},"type": 0,"text": "They all recognize that their famous local delicacy is awful but continue to serve it on request by gourmands or polite visitors, though they really wish they would stop. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "OGoBAw4Ha0gIuPM2","flags": {},"type": 0,"text": "They are collectively responsible for a massacre orchrestrated by a malign fey creature. The fey creature is no longer present and they have made a pact never to speak of it. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "h2sxHyFCbIaEsgJq","flags": {},"type": 0,"text": "A curse inflicts a random child every generation causing it to transform into an aberrant beast. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "crcY2bjcepzEmOvR","flags": {},"type": 0,"text": "A hidden spring confers miraculous benefits to many who imbibe its waters, but its location and properties are jealously guarded. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "KbgamuWCEHoEDuhc","flags": {},"type": 0,"text": "A magical creature that is feared or outlawed is sheltered, protected or otherwise shielded from outsiders. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "mTn5CXR9eQPOP9sm","flags": {},"type": 0,"text": "A creature that is revered or protected in the realm is secretly poached and consumed for its meat. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "d4RqBWaYefzHOR7B","flags": {},"type": 0,"text": "One well in the village is a portal to a demiplane which young people explore as a rite of passage. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "bgood2GV4jRk73Wc","flags": {},"type": 0,"text": "The most infamous villain in this world is a native son. Some still hold hope for his redemption. Some are secretly proud. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "lKMiwX1VCl9H9Wza","flags": {},"type": 0,"text": "They are friendly cannibals. Usually consume folks who had it coming. But sometimes, visitors just look so delectable. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "nNhprC19LjKpBZEh","flags": {},"type": 0,"text": "They have imprisoned an insane immortal being and extract its essence to heal the sick. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "QJY8IufANDHdlbrh","flags": {},"type": 0,"text": "For generations, they have faithfully passed down the four of the seven words of power that will bring upon the End Times. And one of the community has discerned two others. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "M47YkCYmJ2G70sGb","flags": {},"type": 0,"text": "They possess a heretical text whose veracity is ironclad but contradicts the most strongly held positions of the reigning faith. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "PUjlMs2obE0IJK3q","flags": {},"type": 0,"text": "They worship a demon lord faithfully. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "MkeBU484yOnRW96U","flags": {},"type": 0,"text": "They have enslaved a race of highly intelligent but easily dominated diminutive fey creatures. The fey creatures remain invisible to most outsiders but are capable of feats of incredible magic. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "eviYq9JCm6vPA5GN","flags": {},"type": 0,"text": "A rite of unspeakable violence is performed regularly. Calamity is threatened—and will come to pass—if the rite ever fails. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "8EDCoz5u3ayjjSwW","flags": {},"type": 0,"text": "They worship a religion outlawed or abhorred by most, despite the general goodness of the population. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "qxPc33vrpOtWIPI2","flags": {},"type": 0,"text": "They are all related. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "lTibEbn5fJ7ghBqI","flags": {},"type": 0,"text": "All the villagers are actually just reanimated corpses being controlled by a powerful necromancer who does this to conceal his experiments. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "B9F1cmFR7bxJWndE","flags": {},"type": 0,"text": "The entire population is a series of illusions and disguise made by one mad fey who uses them to pretend the village is populated. An elderly drunk rambles this fact to passersbys. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "aFxVPkUadejEBv1M","flags": {},"type": 0,"text": "They made a deal with a hag to avoid famine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "JrHTqQy5o0Sv2bHv","flags": {},"type": 0,"text": "Once a villager goes into maturity an enchanted lock is cast into their chest. This lock prevents them from wandering too far into the wilderness and thus, exposing them to most of the outside world and makes them dependent on an official royal escort as a punishment for a crime generations passed. All keys are kept at the royal family’s treasure in a specially assigned chest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "YPQDDsD5mlla2UVp","flags": {},"type": 0,"text": "The people are all actually doppelgangers, and when visitors aren’t passing through they “let their hair down” and go about their business in their natural form. Some insist that they shouldn’t have to change for outsiders, and always stay in their natural form, igniting fierce controversy in the community. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "fxfQ0HE3323UQjeK","flags": {},"type": 0,"text": "The village is actually hiding its existence from the local baron, and hasn’t ever paid taxes as a result. This leaves them vulnerable to predation and banditry, but the villagers consider this worth the risk. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "OlxIdPvpLm0m4HiH","flags": {},"type": 0,"text": "What at first appears to be a village of unusually slim dwarves that wear long, dragging capes turns out to be a village of humans all walking on their knees. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "LXRAlX5DSKZIVacZ","flags": {},"type": 0,"text": "On the first visit, all of the adults are middle-aged with several children in each family. On the second visit a couple of years later, all of the villagers are young adults with no children. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "J4rhEnIYfKX4OWT7","flags": {},"type": 0,"text": "The village elders are in cahoots with a local bandit clan, and many of the bandits are native sons of the village. The alliance has brought ill-gained prosperity and riches to the bandits and the village, at the cost of declining commerce in the region and increasing poverty in surrounding villages. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "S112DAFZdkIZKlwp","flags": {},"type": 0,"text": "They are all unageing as long as they stay within 1 mile of the village. If they go beyond the 1 mile point they rapidly age and die. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "luoR7VpMMFhLKbjr","flags": {},"type": 0,"text": "They are a secret clan of demon hunters. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "8G9i8uD5dUMwAZBu","flags": {},"type": 0,"text": "They are a secret clan of ninja. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "s09Phn53VJetxLp3","flags": {},"type": 0,"text": "They are from a world with advanced technology. When their ship crashed landed on this world, the survivors attempted to blend in with the natives. The wreckage of the ship is buried under the village. The villagers occasionally use it to perform “miracles” An extraplanar outsider (angel, demon, or another powerful entity) sleeps under the village. Power radiating off of it causes all the crops to grow bountiful. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "xU07PphDbsc0fuZK","flags": {},"type": 0,"text": "They are part of a massive drug cartel which is their main source of income. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "5dTTQBn9O5IbeDJQ","flags": {},"type": 0,"text": "There’s a large tree in the center of the village. Climbing or otherwise disturbing the tree is cause for execution. The large tree is actually a dormant treant. The village is very careful not to disturb his rest because he has saved the village from marauders in the past, and they rely on his favor to protect them. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "qvkfXheCETJ0fwAu","flags": {},"type": 0,"text": "There is a giant creature that lives in the basement of a local manor. Once a month, they must satisfy its hunger.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "WMEjw3jIsSSfzsq0","flags": {},"type": 0,"text": "Last year, a few of the town’s eldest houses conspired and murdered every last person of their rival families.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "wOm1yAV2yrwrqN4j","flags": {},"type": 0,"text": "A seemingly peaceful village with almost no crime. They actually turn the criminals into sheep with the rest of the herd and eat them. The whole village knows but accepts it. There’s a slim chance that isn’t mutton you’re eating… ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "Z7F1FjOPeMJpEE5D","flags": {},"type": 0,"text": "Every single one of the villagers secretly believes they are a shapeshifted clone of Manshoon (or someone similar). They’re correct.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "g6SgfFeDecSRALri","flags": {},"type": 0,"text": "The village elders are redeemed devils, trying to live a life of peace and good.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "DKYP4600aGkhronK","flags": {},"type": 0,"text": "The village has a secret recipe for peach pie. It’s really good pie.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "jbRwN2bYLWJ7v7pU","flags": {},"type": 0,"text": "Ant Farm – There is no village. It’s all a very elaborate illusion created by a very lonely and slightly deranged demigod.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "9r3lDsZnZ3gWhPrJ","flags": {},"type": 0,"text": "Xanadu – by outward appearances, the village is a normal, thriving, bustling village. On a very high perception check, it becomes readily apparent that there are no adolescents. Children and adults, but no one between the ages of 11 and 16. Investigation ultimately determines that during those years, the children are sent into the underdark where they are trained in languages, stealth, forgery, poisoning, disguise, and assassination. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "3wB2KQCiOEINUW9A","flags": {},"type": 0,"text": "Haven – They’re all shifters just trying to live normal lives without persecution.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "XdKuUtuCAotPOF03","flags": {},"type": 0,"text": "It’s secretly a town entirely made up of runaway youths with illusions on making them appear older. They will go from 0 to Lord of the Flies in about 2 seconds. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "wNv0CavYSHqKabks","flags": {},"type": 0,"text": "The village leader is actually a powerful good-aligned vampire. He has protected the village for a number of years. The villagers prefer one person pay a pint of blood every other week than half of everyone’s income every month.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "IPUBsL5SLGgyXJFK","flags": {},"type": 0,"text": "The town is made entirely out of mimics and shapeshifters. The buildings, the people, everything you see and hear is made up on the spot. The moment you turn your back, the building that you were just in disappears, and is now that well down the end of the street. None of its inhabitants and objects are evil, they merely want a life without conflict, and disguising as a village seemed to be the best way to achieve this.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "oy2X9OIoZ1gRxqPk","flags": {},"type": 0,"text": "A medieval hamlet, that seems a bit too advanced to be medieval. The villagers are crazy efficient at everything they do, and each one of them seems is really intelligent. Upon closer inspection, or being a close friend of everyone in the hamlet, they will reveal that they are a group of time travelers who ended up in the wrong time, with no way back home. As such, they decided to replicate a medieval village from what they’ve learned, and they’re working on a time machine in an underground lab beneath the village.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "n1ejBzhbm5pmwk0l","flags": {},"type": 0,"text": "Once a ten-day, they have a massive orgy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "QbbXJfsVvd0n8nuo","flags": {},"type": 0,"text": "The towns people have started to develop laughing sickness (kuru) from eating the towns most coveted dish with the most secret recipe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "R0YNgfqgLp40jpvC","flags": {},"type": 0,"text": "No one in the village has died for 20 years. This hadn’t been noticed at first but now the eldest of the village are getting old enough to draw attention. The villagers don’t know why, but see their secret as sacred and fear it’s revelation will lead to it’s ruin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "m7ufrql6iZgq1mWr","flags": {},"type": 0,"text": "There are no birds within the limits of the town. No sparrows or chickens or hawks or pigeons. In every house above every bed there is a dream catcher with feathers on it. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "9HGavcRzPBDyO4W9","flags": {},"type": 0,"text": "The old town mayor, and wealthy noble, is mad. Absolutely bonkers. But all the townsfolk humour this madness because he can be very generous with his gold when appeased. (Possible twist: He is a cunning trickster fey, all the gold is fools gold that will disappear outside town limits). ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "vPUUdiYO4oh5KN0k","flags": {},"type": 0,"text": "The village of Aton is famous for the entrance to a deep and dungeon filled with powerful creatures. Many adventurers have gone in and not come out, and their items are added to the loot the dungeon denizens create on their own, much of which is stored in a secure treasure room. But the village of Beton, a halfling village several miles away also has an entrance to this dungeon. The villagers that know about it (the local Smith, the elder chief, a gnome artificer, and a pair of halfling thieves) jealously guard the secret. Because their entrance secretly goes directly to the treasure room. A hidden artificer device lets the thieves know it is safe to sneak in. What they steal goes to the Smith who markets the items to passing adventurers as his own work. Every one gets a cut of the money made. The elder looks the other way when the thieves are caught in other heists. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "EsrdZ4xq51jPEezK","flags": {},"type": 0,"text": "After an incident with some wandering magic caster and their local livestock, the villagers now have an unspeakable, deep-seated fear of chickens. The very mention of the animal’s name causes them to break out in a sweat. Mimicking the sounds they make has been known to cause bouts of screaming, fainting and hysteria. In addition, if they eat anything unknown they liken the taste to crocodile instead of chicken.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "yTmuzvPFdqj54aob","flags": {},"type": 0,"text": "The hamlet has a hive mind, and plans to take over the world… the fact that anybody born in the village who leaves loses their connection to the hive & dies, as well as outsiders being not effected, is lost on the poor thing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "ftfz8B9lDiQIuXul","flags": {},"type": 0,"text": "The village’s sheriff/law enforcer was murdered recently. As the PCs arrive to assume the role of new law enforcer, they find the townsfolk very pleasant and forward in trying to integrate the new arrivals. The Secret: The sheriff was murdered by the village folk who are quietly anarchists who despise all authority figures. They pretend to be nice to the PCs in order to gather information about them… to make them easier to kill later.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "qEWZmMEZtN5lQpAm","flags": {},"type": 0,"text": "Through a strange quirk of magic and geography, the village you find is actually another village three hundred miles to the west. Fearing the interest this might bring to their village, the locals attempt to discern which of the two villages travelers are expecting, and pretend to be that village when in their presence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "bFmCLSi6nKQlrrTE","flags": {},"type": 0,"text": "A god once died here, and its blood is pooled beneath the town. It grants them peace, good crops, and safety… but those with greedy intentions would slay every inhabitant there to possess such a treasure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "0YUZzO8cSmJrVnNR","flags": {},"type": 0,"text": "An ancient demon came here to live out the final three years of its life and has become attached to the town and its people. When a rival town came to attack, the entirety of the town was reported as missing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "EuoCGcZOJCS86e8c","flags": {},"type": 0,"text": "They’re a part of a interplanar underground railroad, for slaves trying to escape masters on other planes, ie a lot of Genies of the various elements keep slaves. They plane hop to cover their tracks, and this town is near a place where the barrier between worlds is thin. Strange happenings occur if the escaping slave is not native to the Material plane…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "YAnaZqZjL7MLcJ2w","flags": {},"type": 0,"text": "There is a colony of advanced elves living in the tree canopy next to another village. The elves observe people in the lower village, and do social experiments on the townsfolk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "UdhwOdLe9pDkFPUg","flags": {},"type": 0,"text": "A powerful archfey has enclosed an entire town in massive overgrowth until someone confesses to stealing her favorite spork. It has been 21 years…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "NYgcK3yPOvA7pYul","flags": {},"type": 0,"text": "The hamlet’s somewhat famed ale is made by a misanthrope that takes a good long piss in every barrel they export from the hamlet. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "CdxXdy6v0CJspaM5","flags": {},"type": 0,"text": "It appears to be the perfect image of a quaint fantasy village, known for having the lowest crime rate in the region. It has even won “Village of the Year” multiple years in a row. However, the local “Village Watch” seems suspicious, and there are a surprising number of “accidents” that seem to happen in the village, usually involving people or creatures that were seen as a threat to the quaint charm of the community.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "Nh6Buq9c4A7EOG71","flags": {},"type": 0,"text": "They once lynched a 4 year old girl for being a “witch”. She lies buried in a well below a storage building. They were proven wrong since her death did not lift the curse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "B4kBklyfVEUiTnCK","flags": {},"type": 0,"text": "They sacrifice children to a dark power. Everyone knows it and no one talks about it. The elder selects the offers in counsel of an old wizard.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "hInUoVjUyYYiT6XW","flags": {},"type": 0,"text": "They control tourists in their sleep to dance a rite that controls the weather, preventing hurricanes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "yJ8pkivtPQmDg45g","flags": {},"type": 0,"text": "The village supplies the local assassins guild. The gentle herbalist actually creates deadly toxins, the simple blacksmith has a under the counter line in all manner of concealed weapons and the local seamstress seems only to have cloth in various shades of black.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "HlMcSt7F79r6KZK0","flags": {},"type": 0,"text": "They take in/consist of old extremely powerful lawbreakers/murder hobos that are done with that lifestyle and just want to retire and live the rest of their days in peace and quiet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "m16SKNKi5Qv7ovpS","flags": {},"type": 0,"text": "The shop in town sells a suspiciously good selection of high quality magical equipment. For a small fee, the shopkeeper will send his assistant to guide the party through a nearby dungeon. What people don’t know is that the assistant’s job is to get the party killed, and loot their corpses to restock the shop. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "ZQ0qBXeRwGgdiFRB","flags": {},"type": 0,"text": "A cave nearby houses a massive hoard of gold. This belongs to a dragon, and anyone that the village members dislike are told about the secrets that await them in this cave.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "9CKl8tSo5JrTaB0m","flags": {},"type": 0,"text": "The villagers live in total symbiotic harmony with the nearby fae, and forest, with many even being part fae from previous unions. They all have some small level in wood shaping magic, and do not use iron. They justify this to the local top dog religion, to whom this would be very heretical, by saying the village is cursed and all iron disappears inside the bounds (it is merely phased into another plane and returned to you outside the city bounds). ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "wdXl8zN3KjxubGYk","flags": {},"type": 0,"text": "There is a sign outside the village proclaiming that murder is allowed under law. There are no guards and everyone is peaceful. That is, unless somebody breaks the law or acts too far outside of the social order. If that happens, the entire village will take up arms against the culprit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "Nxn6EmnK1qqOCh7J","flags": {},"type": 0,"text": "They are highwaymen who kill travelers and fucked up once by killing a noble which is not so good. The bodies are in the cave.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "OG3RQSxcQgae2jq1","flags": {},"type": 0,"text": "The whole village is actually a haunting, when the party awakens in the morning, they are in the ruins of an inn, and all the buildings in the village are similarly aged.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "paJgmYLlg19WA49d","flags": {},"type": 0,"text": "The villagers grow their young in the fields, pick them like watermelons and bring them home. When cut all the villagers bled sap.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "yY9cobCf0Nl71exJ","flags": {},"type": 0,"text": "All the villagers are animals turned human by a lonely old wizard, who has now passed. They live out normal lives expect for a few odd behaviors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "FJ8G9uheoY4VLYHL","flags": {},"type": 0,"text": "Several villagers robbed and murdered a small party that passed through town a decade or so ago. Among the stolen goods was a sentient weapon, which remembers everything and is just bursting to snitch on them. For lack of a good way to destroy and/or silence the sentient weapon, they buried it in an unmarked location out in the sheep pastures. Sometimes, when the wind is just right, you can still hear it calling for help.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "ysS1ppFwBejUjMYk","flags": {},"type": 0,"text": "The true heir to the throne is being kept in the village, under the effect of a permanent Feeblemind or Amnesia type spell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "otuI9KQ8KFNvWTS1","flags": {},"type": 0,"text": "The village gets most of its food by stealing from nearby farms and making it look like a blight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "KEYlM1XPktkIR87V","flags": {},"type": 0,"text": "The entire village is a single organisms (such as an advanced mimic or powerful illusioner) attempt to lure in and trap wanderers. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "ReHj8W8dqnwtSn7Y","flags": {},"type": 0,"text": "Everyone in the village is sterile. Because of this, they take an unusual route to grow their population. They transform local wildlife or objects into more people ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "QAvdQJagtxslKqeA","flags": {},"type": 0,"text": "Everyone in the village is sterile. Because of this, they take an unusual route to grow their population. They clone or kidnapping wanders. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "ispzxuG07lRJZvwD","flags": {},"type": 0,"text": "Everyone in the village is sterile. Because of this, they take an unusual route to grow their population. They raise the dead and just pretend they are alive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "IiLxpIu8zEFcM8SJ","flags": {},"type": 0,"text": "The entire village is just a front for a organized crime group.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "njMvNbpJETlcbPdm","flags": {},"type": 0,"text": "The local well’s water makes the town’s residents eternally youthful, and they will protect that secret at all costs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "4QTKoDeEOGLT0SvZ","flags": {},"type": 0,"text": "They secretly support a group of outlaws or pirates.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "K61289IDQhQ4nt2z","flags": {},"type": 0,"text": "The king of the realm sent one of his heirs to live in secret in this town. Most of village folk are bodyguards.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "sneLGcBZOWeIPNId","flags": {},"type": 0,"text": "The village randomly hops between another magical realm. The townsfolk are natives of both realms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "ImF6AOWvnpVMRtyy","flags": {},"type": 0,"text": "The village is the creation of a wish of dying mother giving birth alone by a genie “I wish my child will be safe and loved.” The wish summoned powerful spirits to build and maintain a village to raise the now orphaned child. The village is slightly quirky, even more antiquated than a normal isolated village, but friendly. The village will turn overly protective when anyone seems overly interested in the child.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "X9kABtM6HjY7gPi0","flags": {},"type": 0,"text": "An odd quirk of displacement magic shifts the shops locations in town at random at dawn, causing the villagers to build all buildings exactly the same to be able to house all the different shop requirements. The villagers try to pass this off as the local food “doesn’t agree with outsiders” and causes the confusion. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "CinqAYbojQWP3bIC","flags": {},"type": 0,"text": "Once a month the village is visited by an incorporeal entity to collect a ‘soul tax’. The villagers lure in adventurers to serve as the sacrifice. The village all appear helpful but are ultimately working against the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "c1oyhbsO0kg0n71Z","flags": {},"type": 0,"text": "All the people in the village are actually polymorphed dragons, their houses are just filled with stuff, like they belong to hoarders.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "3xwiGbcpGuJhAAYe","flags": {},"type": 0,"text": "The mayor of the village was selected by the king, the population didn’t like him so they all got together and murdered the mayor, they elected a known changeling to replace him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "0m683AylCM92cgXQ","flags": {},"type": 0,"text": "The village potter is a secret hag that has made pots connected to the lifeforce of each villager. If the pot breaks, the villager dies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "P0sSR1gK2n3RHit9","flags": {},"type": 0,"text": "As you spend time in the village you begin to get the sense that something is off. Try as you might you can’t shake the feeling that you don’t fit in. It’s as if the whole village is set up to work ever so slightly in a way that you’re unfamiliar with. If you roll a high enough perception you notice….. they are all left-handed. Burn them, burn them all!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "wrspiKmD9dFJgmfs","flags": {},"type": 0,"text": "Unusually quite a few of the villagers are blind in one eye or both. No one dares to talk about it. They are also afraid of chickens. The village is secretly governed by an awakened chicken and her brood. Justice is harsh, anyone caught stepping out of line has an eye pecked out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "ON64gcI4uCbUD5Jb","flags": {},"type": 0,"text": "This village is just an ordinary village. Ashamed of their ordinariness, the villagers cover up this self imposed secret by acting towards outsiders in a variety sinister and menacing ways.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "7SWzLlEOnzFdYbdy"}
