{"name": "Royal Family Drama","description": "One hundred different dramatic situations for any Royal family.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "w2Ds6Ys5UsXpaPC6","flags": {},"type": 0,"text": "The king’s son is in love with a peasant girl. The king is furious! (The peasant girl is actually a Doppleganger trying to assassinate the prince!)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "zbtnTLUu8Hch2s1M","flags": {},"type": 0,"text": "The king is depressed and wants to retire, but there’s no precedent for a king retiring.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "RjQ0hE6yJYqMMyom","flags": {},"type": 0,"text": "The royal children like to sneak out without their bodyguards. The king has received an anonymous kidnapping threat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "3cKuspQAEz9UXCAS","flags": {},"type": 0,"text": "It is revealed that due to a mistake in the royal records, the king’s twin brother (who they thought was 10 minutes younger) is actually 10 minutes older than the king.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "HtTQXaAeJhFsVegv","flags": {},"type": 0,"text": "The human king and queen are having a baby. The queen gives birth to a half-elf.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "HoHWMIIRvbyKkou8","flags": {},"type": 0,"text": "The king is an only child and finds out that he cannot have children. There is no clear heir.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "gbp4AJ2gYPSX6fYY","flags": {},"type": 0,"text": "The Queen (who is loved by the people) has publicly announced that she wants a divorce, but royal divorce is illegal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "WsvJO2NBSV7LmJrz","flags": {},"type": 0,"text": "The prince’s cat dies and he demands a full funeral. The king didn’t even know the cat existed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "VvmA8M7nWNBAnjQd","flags": {},"type": 0,"text": "There is a book that automatically writes the name of every future great king or queen when they are born. The book hasn’t written any of the princes or princesses names and the king is on his deathbed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "l2WX4Amn8fDYWTX4","flags": {},"type": 0,"text": "One of the siblings has fallen in love with the eldest’s fiance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "ekaF9N2eEKsOyGQ5","flags": {},"type": 0,"text": "All but one of the royal family has come down with a fatal disease.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "xhretXCD44hiYizg","flags": {},"type": 0,"text": "A witch has cursed the children to only speak the truth and they’ve all been mute for weeks to guard a horrible secret.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "Zn2oaYfOyLt7x0ER","flags": {},"type": 0,"text": "It’s been discovered one member of the royal family has dyed their hair all their lives to hide the true color.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "9kPj7jdXGEDarN1G","flags": {},"type": 0,"text": "A fierce debate over who owns the kittens of the family cat has erupted shortly before one family member is due to move away forever.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "l4LuR1PI7ABmpdJ1","flags": {},"type": 0,"text": "The middle child’s dormant sorcery has finally awakened.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "r5txT0XF5kciUrfd","flags": {},"type": 0,"text": "The king’s exotic pet is becoming troublesome to take care of, but he refuses to part with it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "QEWB3frX9JJuRwnn","flags": {},"type": 0,"text": "Two royal siblings are incestuous, and everybody knows it. Possible twist: they’re not.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "DYwS4lau0sPRKu9t","flags": {},"type": 0,"text": "The tapestries in the palace are forgeries; the previous king pawned them all off, and the current one couldn’t find them, so they had to be replaced with replicas. Possible twist: the actual tapestries are hidden somewhere on the castle grounds, and the royal family would be grateful if they were retrieved.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "rf0XPMxMMWxTe0yR","flags": {},"type": 0,"text": "Count Doogeston’s mother was a horse. Possible twist: his mother was an actual horse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "UqeT6xWSlIgQ39J1","flags": {},"type": 0,"text": "The peacocks in the youngest prince’s bedroom are his harem, kept transfigured by some odd magic. Possible twist: he just likes peacocks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "UZUQ4LTsbXy4SgRz","flags": {},"type": 0,"text": "The prince, in a fit of anger, leaves the kingdom, only coming back to find the king has died and an imposter is claiming the crown at the same time as the prince does!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "3rKTYtvE98DVKwFj","flags": {},"type": 0,"text": "A shapeshifter has infiltrated the palace, taking the form and nature of objects, livestock, and inhabitants, and is out to backstab the royal family. It is suspected that he dumps all his victims into the river, so he can take the form of secretly deceased servants. The only way to identify him is that he coughs up blood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "5indSDckYplL4ya1","flags": {},"type": 0,"text": "A demon-possessed (undead, looking the same as when he was tombed) body of a former king arises when the kingship is to be passed to his younger brother. This body is that of the new king’s dead father. Not sure whether the king is himself, an imposter, or – Heaven forbid – demonic undead, he requesting all manner of people (religious, educated, business, peasant, fighter, doctor, and so forth) to come and look at him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "TYtBm0sgFGsWyQPI","flags": {},"type": 0,"text": "The prince is found out to be insane at the age of a young adult, calling every flower ‘his princess’ and demanding a funeral every time one dies. If anyone makes the horrid mistake of picking at least one in the royal gardens, then the strolling prince takes one of the many swords hanging on the wall charges at the cast, intent on killing everyone (killing every sentient and non-sentient member, except those plant races who have flowers on them).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "RloEYibFsIThO75x","flags": {},"type": 0,"text": "The court wizard and the heir apparent are involved in a blossoming relationship and everybody else is more than a little uncomfortable with it (wizard is pushing a century, maybe unnaturally long-lived, heir is early 30s).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "QGFCjS88WPUD6VoD","flags": {},"type": 0,"text": "The queen is sick of all her spoiled children and is eager to disown them all and adopt someone else as heir. She hands out a mildly-dangerous quest to retrieve a family heirloom, and when the adventurers bring it back she tries to make one of them the crown princess/prince.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "UGRnrmOAWQiDRCaU","flags": {},"type": 0,"text": "Rumor has it that the king went gray years ago, but he keeps dyeing his hair.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "F2xbmrYTSq7iBIIg","flags": {},"type": 0,"text": "Several of the court’s mid-tier advisers are in a polyamorous relationship. They enact complicated (but benign) plans to hide this, but everyone in court already knows — they just don’t care. (Possible complication: a deception becomes not-fully-benign and someone gets hurt or dishonored)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "WpuiS7PpRvA8oMZw","flags": {},"type": 0,"text": "The royal family seems like a hot mess from the outside, but they’re all faking it to hide the true extent of their power and influence. (Could be for benevolent national-security reasons or malevolent, oppressive reasons.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "x2YOg28Zqif1ddWK","flags": {},"type": 0,"text": "The crown prince finally had his coming-of-age birthday party, and the Queen was going to abdicate as is custom, but the prince suffered some great dishonor at the party. The nation’s customs dictate that he must resolve the slight against him before the Queen can pass her crown to him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "mXUJTDj7I2Q7TiFM","flags": {},"type": 0,"text": "Rumour has it that the king has gone mad, and that the queen is running the kingdom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "Svz3YSeCS3gWI94k","flags": {},"type": 0,"text": "I’ve heard that a Lady of the court was seen fraternising with the prince, and is now with child. The king wants her killed, but the queen wants the prince to marry her before the baby is due.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "gNZTVBZLX4SbgLh0","flags": {},"type": 0,"text": "Don’t tell anyone, but apparently the Duke has been spotted fornicating with the Queen, and his enemies are blackmailing them both.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "3UgH7WbKndfDD7ef","flags": {},"type": 0,"text": "The king has died, and the heir and only remaining member of his ‘family’ is his former queen’s illegitimate half-orc son, who has no idea who his stepfather is.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "fEKFh0kvqwHhU5Q0","flags": {},"type": 0,"text": "The king has been captivated by a Rasputin-like advisor who has a chicken he claims is oracular. The advisor has persuaded the king to carve a great mandala of arcane symbols on the throne room floor: wherever the chicken sits determines the king’s decisions. Thing is, the kingdom is having a great run ever since the chicken came along.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "q48o9g1INjqKHgt8","flags": {},"type": 0,"text": "The new court chef sold his soul to an agent of an archdevil of the Nine Hells who has now come to collect his fee. Only by poisoning the royal family can he delay his doom and continue to enjoy the fruits of the material plane.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "5K0X1WSKShgcKY3b","flags": {},"type": 0,"text": "The prince fell in love with a lady of a rival noble family, the king is furious until he dies of natural causes. The prince takes his place on the throne but the new queen is really calling all the shots. She begins putting her family in power until the prince finds out that his father didn’t die of old age, he was poisoned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "A3Aj8oh1ZBJlKVjv","flags": {},"type": 0,"text": "The king has two children that are both equally qualified to take over his throne. One would use the throne for good and is upstanding, but wishes to become a travelling bard. The other wants to send the country to war and is a real jerk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "OS2k8R5lotDdsTzX","flags": {},"type": 0,"text": "The king, against his family’s wishes, marries a peasant girl who appeared to him as sweet and pleasant. In reality she is huge manipulative, puppet master who manages to rule everything through him. It only gets easier as the king’s mentality deteriates with age, and its up to his family members to expose her actions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "9AG28H4iwFWijCLA","flags": {},"type": 0,"text": "A female noble follows through an arranged marriage to successfully form an alliance. Her brother, the heir, and her husband, the heir of the other kingdom, are not only head over heels for each other, but also completely useless as rulers. So now she must not only help cover up their affair, but manage two lands on her own.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "2RgYqyiGqcmuPMiM","flags": {},"type": 0,"text": "Everyone wanted great aunt Hilda’s stuff upon her death. She however felt none were worthy with their corruption and greed, so she turns to immortalizing herself until the family finally produces a worthy heir.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "K59Mv7T6yeJKYkV1","flags": {},"type": 0,"text": "The heir to the kingdom has chosen to abandon his inheritance and live a life of piety. The head of house has convinced him to take a year to reconsider and make the correct decision.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "R8vcAlFcNOxjEuZE","flags": {},"type": 0,"text": "The lady of the house is known to have fits and visions. What is not common knowledge is that they have stopped since an attractive young priest has come to town.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "gxNai7GL1D2WlARa","flags": {},"type": 0,"text": "The head of house was sent to this area as a ploy to prevent him from siezing the throne ahead of the rightful heir. He’s furious and taking it out on the smallfolk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "WmVHYCe7GTOhDRU5","flags": {},"type": 0,"text": "The child of the family keeps throwing away his expensive toys, much to the parents dismay. Their latest attempt is a warforged marionette to entertain him. He didn’t want them either.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "8yfbFxJ7bSnuMzFj","flags": {},"type": 0,"text": "The royals have been getting incredibly sick lately, and nobody knows why. Each one of them has a different illness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "3PlqBY5jmY06WjgW","flags": {},"type": 0,"text": "The former queen, the current queen’s mother, has passed away. Her will is incredibly bizarre.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "si7UYYpnfYK0xYl4","flags": {},"type": 0,"text": "All the royal guards quit at the exact same time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "nK5r5yM9oIBaeeIS","flags": {},"type": 0,"text": "The family is trying to get their portrait painted, but they’re so picky that nobody has been successful in meeting their standards.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "jlblILoXpNMWVOJa","flags": {},"type": 0,"text": "The prince is going bald and is doing his best to hide it. He’s not doing a good job.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "nIgviTIyNStayE4t","flags": {},"type": 0,"text": "The princess is going through the dreaded ‘terrible twos’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "NAmep25U0ocXqkpB","flags": {},"type": 0,"text": "Somebody vandalized the palace, and now the king is personally seeking revenge. He’s far too old for this.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "TjH4uyXmzOQHPPbJ","flags": {},"type": 0,"text": "Good news, a new baby is on the way! Bad news, nobody knows who the father is.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "rydy9xfI5tPsEcl8","flags": {},"type": 0,"text": "The (family member) wants a taste of peasant life.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "1HkQEixQcwxNcP8h","flags": {},"type": 0,"text": "The King and Queen are utterly corrupt and the prince knows he’s the only one who can save the kingdom. The only problem is, he was never properly educated or trained and is completely inept.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "p0W5fWVG8PFW90VL","flags": {},"type": 0,"text": "The King or Queen has a soft spot for small yappy dogs. S/he collects them and the Royal household is overflowing with the beasts. They bark incessantly, bite everyone, and the maids are nearly ready to quit due to all the extra cleaning necessary. In addition, the whole palace seems to smell like urine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "McUbLpUyWaZTM1Yz","flags": {},"type": 0,"text": "The King / Queen is a budding horticulturist and spends a lot of time gardening and trying to breed new fruits or other crops. An entire section of the Parade grounds has been turned into a vegetable garden, and the royal flower gardens are now a small orchard. The rest of the House Hold feels as though that is beneath their dignity and would love to have the Royal Gardens under the care of a ‘proper’ gardener and the Captain of the Royal Guard wants ‘his’ courtyard back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "ayHNAwML2pSxZcRK","flags": {},"type": 0,"text": "The Princes Royal have harbored a grudge ever since they were toddlers and are always fighting. Stemming from a time when the elder brother struck the younger over the head with a wooden soldier he was playing with, they disagree on everything. The King is aging, and many wonder if the Princes will also fight over the succession…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "p26DEA8w3bCnUkzO","flags": {},"type": 0,"text": "Someone in the royal household has been discretely stealing food from the Royal Larder. The Head of the Royal Staff is looking intently, but has found no evidence it was any of his staff. Secretly one of the Royal Children has been giving food to the poor late at night hoping no one would notice a few missing items.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "JB0jaZNCi41or1Y2","flags": {},"type": 0,"text": "The King and Queen are both from rival houses that married to settle unrest in the Kingdom. Fortunately, they have grown fond of each other and are truly willing to let the past be the past. However their plethora of uncles, aunts, nephews, and nieces are not. It seems that early every day someone must bring up a wrong done to them in the past and seeks righting of said wrong. These petty complaints range from a hundred year old duel to the death all the way who has the rights to next weekend’s retreat in the hunting lodge (it’s really just a shack in the woods and no one really likes it, but it’s the principal of the thing).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "gTorCKZdbBo7Hmze","flags": {},"type": 0,"text": "The Queen Mother (current King’s mother) threw a party for her favored courtiers and the young princes not only refused to show up, but also insulted her parties calling them ‘dry, boring, and serves terrible tea’. Many monocles were popped and many ruffs ruffled. Now the Queen Mother is lodged in her rooms and won’t come out and the young Princes are being forced to stand in the hall ways holding buckets of tea at arm’s length. Everyone is in a foul mood and the servants are stepping lightly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "89qrqXZwV7OJlWes","flags": {},"type": 0,"text": "A noble family in a bunch of debt marries off their daughter, the dowry serving as a last resort to pay debts. Not long before marriage, the daughter’s face is disfigured on a horrible accident, and the groom to be calls the wedding off.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "wshTEFeswiba3S25","flags": {},"type": 0,"text": "The prince/princess is being forced into an arranged marriage, but they are gay.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "2wVk0uPQGxufkt7B","flags": {},"type": 0,"text": "There’s been a number of rebellions that have risen up recently, little does anyone know that it’s in fact the current monarch that’s been funding them, as they don’t want to be King/Queen anymore. The Monarch has been funding the rebels in exchange for allowing them to live a simple life after the rebellion has succeeded.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "ZjyrJFGjwjj3D22y","flags": {},"type": 0,"text": "Traditionally, the heir to the throne is the current monarch’s eldest child, however the current monarch decides that they want another one of their children to become heir, instead of their eldest. The family and their advisors are split as to whether they are allowed to do this.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "FJXpY7jc0v2RFKn2","flags": {},"type": 0,"text": "In a night of drunken commoner-style revelry, the prince gambled away the crown jewels at a village tavern. All he can remember about the jewels’ new owner is that they were merely traveling through the kingdom and would be gone by daybreak. With each passing day, the chance of recovering the jewels lessens…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "A8JsLIbjlXMnjjpp","flags": {},"type": 0,"text": "The royal family was lost at sea. The dead king’s younger brother and wife find themselves and their children as the sudden and unexpected new royal family.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "EHbLivEg9mG578Bn","flags": {},"type": 0,"text": "The queen has gone mad with grief. Each year she selects a new child from among the townsfolk to live a princes life, in place of her long lost son.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "k8OxTleRxagw311d","flags": {},"type": 0,"text": "The king refuses to stop starting wars. It’s like he never wants to hangout around his family and court.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "wNXN6mSck0vNeMU4","flags": {},"type": 0,"text": "The current king sits on a precarious throne, having usurped it from his predecessor in a coup. He now lives in paranoia that the same fate will befall him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "IqJCtkJ4IaH5OWhJ","flags": {},"type": 0,"text": "The daughter of the king has completed a rite of passage to earn the throne after his passing, but the eldest son has not returned from journey abroad, or even heard the news of the kings passing. His looming return casts an ominous shadow over the new, possibly temporary queen.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "FTsnx6eoEEy82zad","flags": {},"type": 0,"text": "To the people, it is clear that the king has no power and has been puppeteer by his council. These council members are routinely found guilty of corruption and mismanagement and tried by the people—sometimes even executed. In reality, the council holds no true power, and the king rules through his close relation to the commander of the guard. He purposefully blames the council so the people do not suspect or overthrow him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "txddpXKVfcDHYSaR","flags": {},"type": 0,"text": "The king is in fact no true king, however only a man so delusional that he walked right in and proclaimed himself as such. The people, being too polite, have not bothered to correct him and allow him to parade about town. No one seems willing to break the joke to the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "lxShHpwFaQPXMt90","flags": {},"type": 0,"text": "The previous monarch died and left no direct heir—instead, only four rival houses each loosely related to the royal bloodline vie for power. The regency council has been too distracted to choose a true successor, for it fears the retaliation of the others if it sides with any individual.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "LY2tR2JzjKWaN3JW","flags": {},"type": 0,"text": "The king believes in the justice of chance above all else. Whenever he is told of a crime, he demands that the criminal is tried in an elaborate gauntlet that effectively boils down to a coin toss—are they innocent and let free, or are they guilty and punishable by death? The people vary in their agreement with this; some will falsely report enemies in the hopes of killing them, while others refuse to report any crimes as to not carry that burden on their backs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "K3t7n1avuR3gc1C8","flags": {},"type": 0,"text": "Having suffered a terrible accident in battle, the king has been mutilated beyond human recognition. He threatens any who dare to mention his deformity with execution but refuses to cover it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "nwjYz8BPrvAY6PYJ","flags": {},"type": 0,"text": "The current king isn’t a king at all, he’s a very good lookalike who has been forced into this situation when the old King disappeared. Or something","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "bLsUiIeB709e7nMs","flags": {},"type": 0,"text": "Two neighbouring kingdoms frequently use commoners in a giant game of chess and the people are becoming sick of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "dJTIlVOauKSJIPq9","flags": {},"type": 0,"text": "A special flower used in the anniversary of the Queen no longer grows and the date is coming up soon. The court haven’t told the King yet and they fear what will happen if there aren’t any of these flowers at the celebration.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "SmBjQi1TrZpDwZ30","flags": {},"type": 0,"text": "The Queen is unable to bear children, a surrogate must be found but also the Queen must look as though she is pregnant to keep up appearances.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "M4hbZvIBXisTLhEE","flags": {},"type": 0,"text": "The Queen has not been seen in weeks and the King is adamant that she is ‘working hard on her work’.. It is suspected that he has killed and eaten her to gain power through some ritual.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "zHhjjE9MOU7zszIP","flags": {},"type": 0,"text": "The Prince did something and thought he got away with it but believes his sister may have seen it. You need to read her diary to see if she knows what he did. There can be no witnesses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "OqEoyGE1FlVdc23c","flags": {},"type": 0,"text": "The second Prince’s firstborn is a bastard, legitimized the day before the first Prince and his heirs all die in one day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "XKhu5BkFqzYfCce6","flags": {},"type": 0,"text": "The current King is toying with the idea of Democracy, his heirs are divided on this issue.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "94AQ5iS3qVeXRjp2","flags": {},"type": 0,"text": "The Queen has been captured by the ruler of a nearby kingdom. For the eighth time this year.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "R3C9Rp8Fi6OLz6si","flags": {},"type": 0,"text": "The princess has been captured by an evil (insert evil stereotype here) and they have fallen in love.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "76Zn9JlWTMZQkFsD","flags": {},"type": 0,"text": "The king is actually an impostor who has been effectively hiding who he is.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "0HbPwOHqbOs0w7DU","flags": {},"type": 0,"text": "An evil usurper took the throne and killed all the heirs except a baby who was valiantly rescued … now that heir is gathering an army to take back the throne. Except, it turns out the baby actually was killed, and a random child was substituted to give the resistance legitimacy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "uE3ZkQhq9sJZadS2","flags": {},"type": 0,"text": "The old king died without living children. There are a couple of reasonable claimants (e.g. one for each alignment in the party or something, plus an obvious antagonist), but they could really use a lost McGuffin to cement their claims … but when the party finds it, it is in the possession of a petrified (and thus revivable) better claimant.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "r1oCNzR1itvTZBJu","flags": {},"type": 0,"text": "The king’s older brother turned down the throne and disappeared into a life of adventuring. Now with the king in ailing health, a young adventurer approaches claiming to be the child of the older brother and rightful heir to the throne. The king’s offspring are worried about this outsider taking their kingdom from them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "pAv2Ii33pYJLSd2J","flags": {},"type": 0,"text": "There are rumors that the king’s oldest son isn’t his. The queen had become pregnant surprisingly soon after being rescued from a rival kingdom/ barbarians. The king had never questioned it, having raised him as his own. However, rumors continued to be spread among the kingdom. The other princes see this as an opportunity to bring doubt to his claim as heir to the throne.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "X1pDWWmWJkAkYe70","flags": {},"type": 0,"text": "The Princess is a fashion trendsetter! She accomplishes this by having everyone else that tries to oppose who fashion trends assasinated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "ZuGeQFF6AhulQh0Y","flags": {},"type": 0,"text": "The Queen has undergone a sudden and dramatic personality shift. She has ordered the execution of her youngest daughter, and the King seems to suddenly be too scared of her to interfere.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "bITYgeCTPbsyqaL0","flags": {},"type": 0,"text": "Rumors of the Virgin Queen Velor being pregnant has been confirmed by the presence of a new swaddling in the court. While the birthing was traumatic, the mother and baby are reported to be very healthy, and the energetic Queen appears to be doubly revitalized pushing her ambitious reforms with a new verve. Of course, the Queen is quick to take offense to any hint of slander related to the baby’s parentage, something that is difficult to ignore given the child’s… fiendish appearance. The priests of the Temple of Searing Light are scrambling to properly address the Royal Legatee in their next homily, with hardliners threatening to withdraw their support to the crown, but the Queen’s loyalists on the street appear willing to squelch any grouse with staunch speechifying and fists if necessary.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "i07DD2gO9U93CDis","flags": {},"type": 0,"text": "The King was widowed recently, he feels so sad that he has recluded himself in his palace and he has lost any interest in his family or the kingdom. His councelor is taking advantage of the situation and is making the king pass any ruling he wishes to under the excuse that is to honor the deceased queen.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "dW0oeocbwFiKjIUH","flags": {},"type": 0,"text": "There are worshippers of the old faith within the courthouse, the queen is one of them and she is instructing the heir prince in the old ways, this is unknown to most people including the king. Meanwhile the youngest prince is studying to become a priest of the new faith with the King’s brother, the bishop.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "FfNFa8cVUcnkfI0z","flags": {},"type": 0,"text": "Nobles are pressuring the King to pass a ruling that will hurt commoners. The only person that seems to be holding the king back is his mistress, a commoner herself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "RnOGLOZGh0q8GBKX","flags": {},"type": 0,"text": "To build his way to the throne, the king had to poison his older brother and his son, faking a church’s permit to marry his cousin and even betray his own father. He could have kept all his sins in secret but he has been talking in his sleeps and some night servants had been spreading his words as rumours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "rEslW6WT7Ft6zqGV","flags": {},"type": 0,"text": "The second prince has gotten into a shameful new habit that is embarrassing the rest of the royal family. The practice, which involves inhaling Drakevapor through a strange magical device before blowing it out, is highly frowned upon by most of the kingdom, and these “vapers” are exposed to silent condemnation by everyone else in the nation. The king is desperately trying to stop the young prince’s unbefitting behavior, but the prince is persistent in his “passion” and his general unpleasantness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "sAZBouu4ILvrlcum","flags": {},"type": 0,"text": "During court, a glamor fails a member of the royal family revealing the individual to be a grotesque extra-planar creature, threatening to cause a panic. Unbeknownst to the populace the entire royal family are actually an alien race that are largely responsible for five centuries of a halcyon age that this recent incident might end.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "0294BAY7sl02r4TT"}
