{"name": "Uncharted Islands","description": "One hundred different uncharted islands that your players can discover.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "WQ3fuWZlgTTZVrPf","flags": {},"type": 0,"text": "A half-mile wide floating glacier; a shallow ice cave on the south face holds the remains of a failed exploration party. Among their gear is a tube which, uncapped, produces continual light.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "ml6ryrb9UKg2vUFy","flags": {},"type": 0,"text": "A coral reef projecting twenty feet out of the ocean, yet is only about ten feet wide. The solid surface on top is pockmarked with pools containing rainwater fresh enough to drink, and the base of the column under the ocean’s surface is covered in tasty crabs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "z7T4mUDBDPLHECmN","flags": {},"type": 0,"text": "An island about a thousand feet long and a few hundred wide, in a high mountain lake. The water is very cold, largely sterile and devoid of life, and only birds live on the island… Birds, and someone seeking solitude who has built a shelter there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "5fEUvjmOlPHuyBvs","flags": {},"type": 0,"text": "This quarter-mile island in the tropical seas is a classic deserted island, complete with palm trees, coconuts, sand, and buried pirate treasure marked with an X made of stones. Unfortunately, the treasure is a trap prepared by a crafty pirate to punish rivals. The brass-bound chest is trapped with a poison needle trap, easily detected and disarmed by those able to, but the gold inside is in fact gold-clad lead, and coated with a deadly contact poison. A faint acidic smell may tip off the wary.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "9H3FCYydYB5aOokn","flags": {},"type": 0,"text": "This island in the northern oceans, almost three miles across at the longest bisection and shaped like an egg with a curved tail from an aerial view, is almost completely ringed with harsh thornbushes, rocky outcrops that prove to be very tough climbs and treacherous quicksand. In the center, however, there is a patch of pleasant, temperate forest with abundant fruit and nut trees. It was designed to be the private sanctuary of a druid who has since passed away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "AWvdkJCvx91Q7LPu","flags": {},"type": 0,"text": "A black sand, crescent-shaped island formed by a volcano that went critical.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "JrfjpELUP2K9VSZ1","flags": {},"type": 0,"text": "A somewhat lush island about 3/4 of a mile in diameter and is somewhat oval shaped. At the very center of the island there is a spot with no plant life, merely gravel. Walk into the gravel and it will all collapse into caverns below.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "vs2fkxQv2carv9KP","flags": {},"type": 0,"text": "A rocky column a not even fifty feet wide and several hundred feet tall. It is craggy and featureless save for the very top. At the summit is a gateway seemingly carved from the stone of the island. The gateway has arcane runes along its edges.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "SZ2nx4GT2CdtR3MY","flags": {},"type": 0,"text": "A giant white island. It has no sand, no dirt, and no plants. It’s actually a giant skull with the top of its head poking out of the water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "gvLsPOaeXorrfmrR","flags": {},"type": 0,"text": "A small island with nothing but a single palm tree.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "M8LoydxPCrncJqTo","flags": {},"type": 0,"text": "A small island that has tunnel entrances covering its surface. A race of neutral good sentient crabs live on this island and will offer information about the island if asked.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "HnfNWM8gtQTokXrD","flags": {},"type": 0,"text": "An island where there is only dead plantlife. If a person stays on the island for more than 5 hours, 2D4 zombies will attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "iGtFroU2bOG7qlo9","flags": {},"type": 0,"text": "An enormous obsidian shard , about 800 meters in length and 250 in width, that fell from the sky thousands of years ago, sitting on a shallower area of the sea. Half of it is submerged in water and the rest of it sits out of water at an angle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "mqCNElM9F4U2CDds","flags": {},"type": 0,"text": "This island seems to be in constant movement… Turns out it actually is a tiny island that sits on top of a enormous turtle that roams the surface of the ocean. The island is a patch of sand and dirt that sits on it’s shell, a single, tiny tree sits on top of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "mAQL8DitUeYRZZib","flags": {},"type": 0,"text": "This elusive place shifts in and out of existence at regular intervals. At the start of very week, the entire island and everything within it is transported to the Astral Sea or back to the prime material plane. The island itself is made of a strange soft rock that is less dense than water. It has no plant life except for a single tree, made of solid amethyst with emerald leaves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "5kXhwgB83tLmmFJE","flags": {},"type": 0,"text": "An island in the tropical climate, 4×5 miles and formed by a huge lit vulcan in the center of it. The vulcan is spouting ashes and and a thunderstorm engulfs the island. Apart from the rumbling of the storm you can make out a misterious screeching from time to time, a bird like figure cannbe seen from time to tume between the clouds. (A flock of storm crows have made this island their home) On the shore of the island, ruins of a destroyed village can be found. The water is slightly acidic, the plants seem to be on the verge of dying.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "99FtiYmbPm6D5zoZ","flags": {},"type": 0,"text": "An oceanridge that was pushed above the sealevel aeons ago. Ancient rock pillars with dense vegetation are whats left of this ridge, some higher than 50 ft. There are hundreds of these towers and small islands forming some sort of maze, the perfect hiding place for pirates.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "24mQFkPU3ufkNeEQ","flags": {},"type": 0,"text": "Surrounded by jagged rocks jutting out of the sea, this island is little more than a rock pile with stretches of sand. The only vegetation is sporadic grass and knee high bushes. The fauna is dominated by large crabs that inhabit the shallow rocky shores and seek refuge among the rocks inland during the worst of the storms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "jieIWVA39GNUAwxI","flags": {},"type": 0,"text": "Floating mountain, desert island with an enormous ancient ruin in the center, island of only dragons, barren island with a vast subterranean network beneath the surface, seemingly snowy island with constant storms along the coast but a few hours of travel within is a tropical paradise, and/or island with vegetation and/or animals that died (or is dying) under mysterious circumstances.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "KKQoENXpICj1pbro","flags": {},"type": 0,"text": "A relatively round, heavily vegetated island stretching roughly 10 miles from end to end. Brief but heavy rainstorms are unnaturally frequent, passing overhead at least twice a day but never lasting more than an hour at a time. While traveling through the miniature jungle composing the majority of the island, conventional methods of tracking or finding direction are impossible, with the plant life and terrain manipulating themselves to create entirely new layouts many times throughout the day. All but the most potent of pathfinding or similar spells fail to take effect within the boundaries of the greenery, and any attempts at teleportation or planar travel are instantly shut down upon casting. It is only during the rainstorms that the trickery of the jungle is suppressed, allowing both conventional and magical means of entering and exiting the vegetation. During the rainstorms, a fortified treehouse can occasionally be seen high in the trees, light emitting from its windows.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "xldSrHGDmkVettEP","flags": {},"type": 0,"text": "Triangle Island: This temperate island is shaped like a perfect equilateral triangle, 10 kilometers a side. The island is made of columnar basalt. Random columns jutting from the seabed are a risk for approaching ships. After navigating to the lone patch of beach, one must climb a column cliff to reach level ground. From the top, adventurers can descend into several hidden maze-like caves and grottos. Prehistoric peoples have left cave paintings, but no natives remain on the island. Unusual minerals disrupt divination magic with their aura.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "Bv1LQ4Exz8rkvJrg","flags": {},"type": 0,"text": "Active twin volcanoes creating a giant causeway of hexagonal stone pillars.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "9RVTl7FsYbUHbX2W","flags": {},"type": 0,"text": "Large floating island with griffon roosts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "Ik32KsMzRQipKdSg","flags": {},"type": 0,"text": "Lone tropical island that has one castaway and his stalwart pineapple companion Watson.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "k6saxVysMwoKw7ic","flags": {},"type": 0,"text": "The atoll forms a circle with a diameter of about 3 miles. There appears to be the remains of people that escaped a shipwreck. In a journal they mention som surrounding islands and how they came to be on the island. About the island, they have notes about a giant shark that lives in the lagoon and a hidden clue about where they hid their valuables.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "MfYlAfstfdX2px71","flags": {},"type": 0,"text": "A small island inhabited by a village of sentient coconut people. They worship a giant baobab tree that gives life to their people. They have basic tools such as spears and dugout canoes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "TpotJ86V4oaDVKqM","flags": {},"type": 0,"text": "An island nearly a mile long and half a mile wide. It is flat and shallow, with the entire western half of the island submerging several feet below the sea at high tide. This half is almost entirely made of soft white sand, while the dry area consists of a single, massive red rock. The island is only a mile offshore, and quite close to a small port. It is a common meeting place for sailors and merfolk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "BO75ObyWvSJadQKh","flags": {},"type": 0,"text": "This island consists of a heavily forested sandbank, winding along snakelike for nearly thirty miles north to south, but rarely exceeding 100 yards east to west. It is surrounded by jagged corals that make it dangerous to sail near. A local sailor claims it has moved slightly in recent years, and may not be an island at all…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "poQqL9E4oR7rUAjd","flags": {},"type": 0,"text": "A small atoll with a diameter of 100 feet. In the center of its shallows lies a massive treasure chest. It is surrounded by swarming sharks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "hc4kV0XtXpy1bMbk","flags": {},"type": 0,"text": "This loosely rectangular island is about a quarter mile in every direction, with many thin projections of shoreline at each ‘corner’. At its center is a massive, jagged stone nearly 70ft tall and 100ft wide. The island and the waters that surround it are unseasonably cold. It is full of fresh fruit and cool streams, but lacks any sort of bird, reptile, or mammal. The island is bountiful in clams and snails. The whole place is eerily quiet. At night, you may be able to hear a strange sloshing, like saggy meat being dragged along wet sand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "M1H34x2NSX70PEDl","flags": {},"type": 0,"text": "A natural rocky spire stands in the middle of the ocean. The island is barely 200ft around, but coarse rock juts straight of the water and reaches a height of 430ft. Gulls and other seabirds swarm around its pocked surface. The edges of the place are caked in feathers and bird droppings. At the top stands a hulking reptilian creature of great intellect, and she humble implores any passing ship if they could please find a way to get her down and back on the mainland.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "wbOJPqtG6WbDTe8B","flags": {},"type": 0,"text": "This ‘island’ is some kind of masted ship, made of a strange wood which does not rot, is very buoyant, and is difficult to cut. The sails and rigging have long ago rotted away. It has been stoved in and lists heavily to port, and has floated as a wreck long enough to accumulate enough dirt, algae, plant life and sea detritus to be called an island. The hold is completely packed with earth and no goods are on board.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "NiFJImef7oOClqeU","flags": {},"type": 0,"text": "This fifty-foot long island is a rocky outcrop completely covered in bird feces. A ‘cave’ on the east side consisting of a crack big enough for a human to crawl into and lie down in is the only useful feature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "N1q8yiIZ66tzb5z6","flags": {},"type": 0,"text": "This small island is covered in dense tropical jungle. Natives use it once a year (1% chance per three days that it happens to be the day) as a rite of passage in the ritual test of manhood and say it is haunted; in fact, the spirits are conjured by the villages own witch doctor and are harmless illusions. A small hut concealed in the jungle and protected with primitive illusion magic (easily dispelled, 80% chance to miss hut if passing by it in daylight) contains the shaman’s dried food supply, some hide blankets, and 1d6 random spell components.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "MydeQ1NfgElHQxGC","flags": {},"type": 0,"text": "A few hundred feet wide, circular island. The ground is out of stone and covered with wet moss. Broadleaf trees and bushes are growing very dense. The island is somehow moving. Its a giant sea turtle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "cpce3AMFNAIprV2e","flags": {},"type": 0,"text": "An island in shape of a crescent with a diameter of 1000 feet. The dense palm forest is surrounded by a sand beach. In the bay in the middle of the island is a bigger hut with a landing stage for a ship. The island is used as a hub for slave traders.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "Mkqpuxby852dcVol","flags": {},"type": 0,"text": "A tropical island in the shape of a potato. The island is huge with a lot of hills, a river and a big variety of animals. Nothing dangerous however. A few dozend years ago a man stranded on the island with only his wife. They are dead by now. Their 24 children want to get away from the island and visit the civilizations their parents told them about.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "b9QJeXK6qmfiCh6B","flags": {},"type": 0,"text": "A pear shaped island has a steep rocky mound on the wide end and a sandy beach protruding outward to form the narrow end. At the top of the mound is a small fresh water artesian spring. On the top of the mound a single ancient tree stretches its roots into the pool of freshwater. The tree is a dormant treant who has decided to take a very long nap. You can wake him up, if you dare, but you’d better have a good reason to do so. If woken frivolously, he may be viscously angry with you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "s6B9tnUngfvxnEZK","flags": {},"type": 0,"text": "Fuadach – A rocky three mile square Islet, only sparsely vegetated with spindly grasses. There is an abandoned, crumbling, stone compound at its centre, rumoured to have once been the place of exile for a deposed King, who’s ghost haunts the ruins.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "2B4ficK52SA3lQcg","flags": {},"type": 0,"text": "Cuna de Auga – An islet roughly circular in shape about 6 kilometres in diameter, which encloses a lagoon approx 3km in diameter. Its heavily vegetated with palms and other trees, with dense undergrowth, and narrow sandy shores. It has a population of about 157 whose main income is derived from the fish and crabs which breed in the reef that almost surrounds the entire island.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "0BMlhrWR9tjL7t2O","flags": {},"type": 0,"text": "Mut Lagoj- A densely wooded island about 6 km long and 4.5 km wide. There are more than 10 small lakes on the island. It is home to a clan of Lizardmen.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "XsQEXW1RQECsv1qk","flags": {},"type": 0,"text": "Cara Atras – A long narrow island with a slight crescent shape. It’s approx 8km long by 1km wide at the summit, with sheer cliffs reaching about 1200m on the north side and a steep grassy slope on the south. A steep narrow path winds up the slope to a large stone tower. A few stone buildings also sit on the ridge.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "61Z54vYP0f7FtTuj","flags": {},"type": 0,"text": "Waterfall Island – A beautiful tropical Island which includes a cascade of waterfalls running through its center, eventually spilling into a sheltered bay. Unfortunately a green dragon has made it his home, driving the native population into caves around the base of the mountain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "8J9YXeK7mv3etFOA","flags": {},"type": 0,"text": "Skull Island. No literally, it’s an island that is the result of thousands of years of time for life and vegetation to overgrow the skull of a massive humanoid creature. The island is almost 4 square miles large.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "wqVZdShAjk1uXQ8t","flags": {},"type": 0,"text": "A barren island, small enough that you can see clear across shore to shore, is littered with skeletons and discarded weapons and equipment. In its center is a grey stone platform with a pristine Chest untouched by time and the weather. Sitting on the Chest rests an ancient warrior wearing tattered rags and a bloodstained battle-worn weapon. This undying fighter has been magically compelled to stay on this island and protect the chest it sits on They will attack anyone who approaches the stone platform, and the chest carries a irrisitable treasure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "ffv4sTmJ56i3lk97","flags": {},"type": 0,"text": "Two islands sit connected by a large iron bridge. the larger one is about three miles and in the rough shape of a fishhook. Both islands have rocky soil, bluffs, and are covered in pine. Windstorms constantly sweep the islands from the north and cause the trees to lose all but their southern branches. for some mysterious reason, up to three feet of snow will occasionally cover the smaller island, a stark contrast to the islands tropical location","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "bW7Ivo2zfJWnZTGS","flags": {},"type": 0,"text": "A large barren sandbar located near [important coastal port] about half a mile long and barely a few yards wide. A noxious black soot covers the island and the bodies of fish that swam too close to the shore. Occasionally the island erupts with green lukewarm flames.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "HftX8cywJ0z9fq2Z","flags": {},"type": 0,"text": "20 years ago a group set sail for this desert island where they swore that they were going to create their own society where they can live life without any government to rule them and truly be free. Nothing but rotting half built houses and bones remain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "aqhLXFgRjBFcNgNe","flags": {},"type": 0,"text": "A roaming island that seems to move around a lot, nobody knows why, and is covered in thick jungle that seems to sway. In truth, is a small race of mutant dragons that grow plants on their bodies, the island is the ever-submerged progenitor swimming around his children.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "YqlGISdQYHE3eYJl","flags": {},"type": 0,"text": "A small sandbar out in the middle of nowhere. The sand is a strange, black stuff that is coarse and jagged. There are no features upon this island save the sand. Below, however, lies an ancient, nameless city ruled by a titanic bipedal frog creautre and peopled by a vicious, primitive group of merfolk who worship this creature as a god. The sandbar is the very tip of the creature’s temple, which has a roof like a ziggurate the is held up by massive basalt pillars. At night, the followers surface and howl at the moon praises to their god below. Once per week, they claw their way to the center of the island and sacrifice one of their fellow worshippers along with any intruders.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "VJpnFqQKsXq4DOXH","flags": {},"type": 0,"text": "A change of winds can be felt around the island. The wind seems to warm for the climate and it feels extremely humid. Mist starts to spread, a mist with the stench of rotten eggs. The island seems to consist of one big mountain, surrounded by a beach. On its shores you see dead fish, birds and monsters everywhere, mostly small ones. As time passes and the tide comes in, the sand is covered by water and you see water flow through cracks into the mountain. Some time after the tide is at the highest point, a deep grumbling sound can be heard and felt. A huge cloud of water breaks free from the mountain. A wall of steam threatens every living thing to be cooked alive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "kPFrujxpVfDMQXBB","flags": {},"type": 0,"text": "An island that’s just below sea level, inhabited by fish-like dwarves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "8UrddUrDKHRFC58X","flags": {},"type": 0,"text": "Undecayed island – an island made up entirely of flotsam and waste of previous civilizations caught in a current’s eddy. Poisonous but full of trash that might be valuable if identified.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "fKGCFxCk3lfwwxFv","flags": {},"type": 0,"text": "A seemingly normal island for it’s climate, and with no distinct features. In the center though, there is a well that seems to go down forever, and radiates warmth. Turns out it’s a portal to a hellish plane.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "VtJRzyYWO3IE44rs","flags": {},"type": 0,"text": "This island is completely surrounded by a tall stone wall, with no door. Within, there is a city with a population that doesn’t know about the world out there. They might be fascinated or terrified by the party, but they will certainly refuse to believe in the existence of the outside world. They will attribute the adventurers’ origin to some unique deity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "8tSca4w9b2EN1IL8","flags": {},"type": 0,"text": "An island filled with dead, dry trees. The soil is covered by a thin layer of ash. Magic users can detect a strong source of dark magic underground. If the party decides to dig down, they will find an old, rotting wizard den, with some valuable loot, but that might give them a disease or insanity if they stay there for more than a couple minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "ZyLoMUrXcVCbcsSx","flags": {},"type": 0,"text": "A transparent bubble surrounds this island, that seems to have an isolated atmosphere. Inside, there is tropical vegatation, and a large wooden building. If the party decides to get in, they will meet a friendly elven couple. They claim to have built this house hundreds of years ago, with the help of a mage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "sebbZemAjeX7Kr8r","flags": {},"type": 0,"text": "This mountainous island is extremely large, and is filled with massive trees. Odd, oversized birds fly around, and there are several ruined buildings, including a dock. Should the players investigate, they will find various dinosaurs, and discover that the island was home to a dino zoo, that clearly ended in a dinosaur outbreak.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "DdmXJ9UCuoM4XTyB","flags": {},"type": 0,"text": "A desert island. No, wait, I mean a dessert island. The island is made of sweets, cakes, and other things that’ll rot your teeth out. Even the flora and fauna are edible and full of sugar. Legend has it that they’re a caramel dragon on this island, who’s breath is molten chocolate fudge.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "bkFxZqqM5zl8gbXc","flags": {},"type": 0,"text": "The palace of a cloud giant that fell from the clouds and into the sea. Untold riches line the halls, but nobody’s ever returned to cash in on their fortune.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "UOg08msOE1AzrjDA","flags": {},"type": 0,"text": "A seemingly normal island that a lot of people have visited and have been to. Though, nobody remembers their visit, and not even where it actual is. Any maps drawn find themselves turned to ash the next sunrise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "K1ZiVfacFywoKBXm","flags": {},"type": 0,"text": "A giant mass of eldritch tentacles, eyes, and other body parts. Whether or not it’s actually alive or not is a mystery, as it never moves. A giant gaping hole is in the center of the island, presumably the mouth of this beast.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "Ci4Y3cnBMmD6tWku","flags": {},"type": 0,"text": "An island that’s been flipped upside down. It floats in the sea, resembling a giant mass of dirt, roots, tunnels, and the occasional boulder. Underneath is the actual island, completely upside down and underwater.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "HJrqH3NTfvH2KOGE","flags": {},"type": 0,"text": "In a cave, through a series of tunnels and ruins, lies an underground ocean. Islands are here, covered in alien flora and fauna. There’s no sunlight, no wind, no weather. This entire cave and its ecosystem were forgotten by time itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "42mYPFUml8eMjqmn","flags": {},"type": 0,"text": "In the Elemental Plane of Fire, there’s a huge chunk of obsidian in an infernal sea of lava. Volcanic glass covers the floor, resembling grass. Who knows what resides here?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "TAUFyzlYs6F6c4aV","flags": {},"type": 0,"text": "A tiny piece of dirt in the middle of the ocean. Maybe two people can stand on it if you try.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "GqZW1uQtIKnfOvAr","flags": {},"type": 0,"text": "A perfectly ordinary island, with a beach, and a forest further inland. At least it would be ordinary were it not floating 100 feet above sea level, kept aloft by unknown magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "yWgKUZ4pwLqxiFv0","flags": {},"type": 0,"text": "A small rocky island with a huge gilded lighthouse dominating its highest point. The cliff faces have been carved into neat terraced gardens, and a cove contains a small but nice harbor that appears to be well equipped for repairing ships- all in all a nice place to restock, resupply, and perhaps do some trading. Ships that approach, however, will discover that the murky waters around this island hide a veritable minefield of shallow reefs, rocks, and shipwrecks, all of which are nearly impossible to spot and avoid. Fortunately, the island’s inhabitants are a friendly tribe of kobolds who will happily make skilled repairs to the party’s likely sinking ship… for a rather large fee. The local inn offers a small discount to those staying during ship repairs- bringing down the rates to a mere ‘extremely high’. These kobolds are excellent craftsmen, so there are a wide variety of (somewhat expensive) goods available at the trading post. Lastly, the kobolds also charge a fee to show the party the safe way back out to sea when the party goes to leave, which may vary depending on the party’s behavior. Should the party complain, the kobolds point out the giant lighthouse they built to warn people. (Brilliant scam or reason to facepalm, it’s up to you.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "FXJ7RkFKlvuJWyuG","flags": {},"type": 0,"text": "A medium sized island that is perfect for a settlement, there’s houses and a small town but it is completely abandoned. Food was left sitting on the counter, dishes are half washed, clothes were hung out to dry, there simply isn’t any people.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "khuN20nrqVeLKCdI","flags": {},"type": 0,"text": "A small island that is completely blackened by fire. No evidence of inhabitance but the trees that were located here are now charred and reduced in some places to charcoal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "LCZyvORb87ntHcXC","flags": {},"type": 0,"text": "An island naturally split into two separate islands, a bridge connects them and each side is home to a village that is convinced they are better than the other. They don’t fight and they aren’t violent to anyone or each other but they are extremely petty and residents will tell rumors about the citizen’s of the other town.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "1MB8gWNjJWlRnVkW","flags": {},"type": 0,"text": "An island with the sole use of providing a place to rest for sea goers, there is only a large inn for visitors to eat and sleep, a blacksmith to repair weapons, and an herbalist with basic potions (potions of minor healing, anti venoms, cure poisons). The island is restocked by those who visit and the few people that live here are eager for new people to talk to.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "2koracHf8O9l06wv","flags": {},"type": 0,"text": "A tiny rocky island with a large tower, the top is illuminated by a very powerful Light spell. This is used as a lighthouse but there isn’t a shore nearby, the lighthouse keeper is elderly and doesn’t remember why they are there or who sent them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "UFBfvLs0NDuCrhGw","flags": {},"type": 0,"text": "An island with only one inhabitant, a crazed artist trying to find his muse. He will paint portraits of all who visit him but will destroy them hours later as they did not meet his standards and do not show his inspiration for art.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "nf70sH4tW5XI4Hu3","flags": {},"type": 0,"text": "A large island that changes location frequently, it is actually a huge dragon turtle that people have settled on. They feed it and maintain it, watching its health and ensuring it is happy, and the dragon turtle returns the favor by keeping them safe and allowing them to live on its back. Both parties are very satisfied with this arrangement, though it’s a nightmare for map makers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "fJJXcdvRC0NQgx7q","flags": {},"type": 0,"text": "A medium island home to only rabbits and enough foxes to keep the rabbit population in check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "JdAynVohCrw3dZEM","flags": {},"type": 0,"text": "An island used as a shrine to a storm goddess, all who visit the island are encouraged to leave an offering to her for safe travel. Optional: the goddess is only satisfied with an offering of deep meaning to the party, they must care more for their lives than an object or suffer her wrath.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "7O55wyKJamBabKl7","flags": {},"type": 0,"text": "A group of small, black, rocky islands. The rocks always feel cold to the touch, no matter the weather or temperature of the surrounding environment. A group of large, harmless, scaly lizards live on the islands eating fish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "o1Wmz7ap9Y4rthpj","flags": {},"type": 0,"text": "A dormant volcano covered in dense forest. In the crater of the volcano is a lake with oddly clear water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "BnnofAYG3S2USj69","flags": {},"type": 0,"text": "A giant knot of vegetation. Kelp extends deep into the waters below, and mangrove-like trees are rooted into the mats of kelp.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "OeUL76XHUV5jNDrY","flags": {},"type": 0,"text": "A spire jutting hundreds of feet upward out of the water. Small caves dot the surface of the spire, with sea birds making the alcoves their home.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "5uS2OOorUa3e5ArA","flags": {},"type": 0,"text": "An ugly hunk of rock, 2 miles long, covered in strange plants and fungi. The surface of the island is always oily to the touch, and sea creatures tend to get sick if they dwell near the island.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "bO64GTCGP7trma35","flags": {},"type": 0,"text": "A small glacier no more than 500ft. wide that has frozen a derelict ship inside it. The ship is over a century old.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "tUeCIX4jW9wc57j6","flags": {},"type": 0,"text": "A small rocky island. On the South side, a dock pokes tentatively out of the mouth of a cave at sea level. A long staircase winds up inside the rock from the cave to a temple on the top of the island, long abandoned. The Western side houses a small beach, then a sheer cliff overlooked by the temple gardens, now overgrown. The rest of the island is barren rock, rising upwards from the sea.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "pCUaFMYqlAc0p9Vq","flags": {},"type": 0,"text": "Geyser Rock: This is a stone shape barely visible below the water and close enough to the surface to walk on. Unperceptive sailors may find themselves beached on its underwater shores. The waters surrounding the stony expanse are warmer and more sulfuric than normal due to regular geysers spouting from the underwater stone floor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "RQtiRUPgejYZdqwT","flags": {},"type": 0,"text": "Moss mats: What appears to be a very grassy and very flat island from afar reveals itself to be a free-floating mat of ocean vegitation. It’s home to a complex ecosystem of seaweed, moss, bugs, amphibeous fish, and tentacle horrors, as well as several key alchemy ingredients normally only found on the ocean floor. It’s too loose to stand on near the edge, but further in it’s like standing on a water bed, making it difficult terrain. Don’t jump around too much because creatures CAN fall through.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "I07fNfBIJDkiQyON","flags": {},"type": 0,"text": "Booty Island: This is just a very large and very thickly forested boot-shaped island. From the outside, it appears to greatly change in elevation. In reality, this is simply the trees growing taller and taller the further inland they are. From the beach, the forest looks rather impenetrable, but it quickly clears up as long spaces vetween larger and larger trees appear. This island is primarily home to three types of creatures: four armed simians about the size of a human that live in the trees and subsist on large beetles, omnivorous boars the size of cars which eat large mushrooms and run down any living thing they see and gore them with their large tusks, and amphibious deer-like fish which move in herds and flee the ocean or the island depending on where they are threatened. There are other animals such as colorful birds and cat-like predators as well. The party may find a destroyed village between the enormous trees.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "TJsuzBABGI8jpkHb","flags": {},"type": 0,"text": "Mysterious cube: This island only reveals itself when people are within 1 mile of it, at which point it suddenly appears. Its a perfect cube 100×100×100 feet and sits just above the water line. Made of slightly rusted iron in tetris shapes, its only feature is in the exact center. A square pillar of iron 1×1 foot and 40 feet tall, at the top is a gem that glows bright red. If taken or damaged, the island’s cloaking disappears and the gem loses its power. The lines between the tetris shapes then begin to glow redly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "RkomkBWaT6bQ8NeF","flags": {},"type": 0,"text": "Oasis: This is a near-perfect circle of sand. The sandy shore making up the circle is ten feet wide, and 20 banana and coconut trees are equally spaced around it. In the middle of the circle is a dark-blue pond that is terribly deep despite the surrounding sediment. The pond is fresh water, even if it’s in the ocean. (Their could be a water purification gem in the pond if they can swim deep enough.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "mNjamABL2TNEd9sW","flags": {},"type": 0,"text": "An island 100 ft x 100 ft made of salt. In a caldera with 15 ft high cliffs surrounding it, lies some sort of wonderland of salt in crystaline form. Crystals wary from grains to 3 ft in diameter. This must have been a place where a falling star had thrashed into the earth, boiling away all the water leaving behind the salt. While covered with seawater in heavy storms, the sun always dries the crater back up, forming beautiful crystals. (meteorite ore can be found if searched for) This island ( 20 square miles and oval shaped) has coral reef beaches of white sand as well as three mountains, overgrown by lush dense jungle. It is always humid and each day around 4 in the afternoon, heavens gates open to unleash a downpour of torrential rain, featuring drops as big as a thumb. Plants are beautiful but carnivorous, only birds reside on this island, even those ar not save from the springing vines in the high trees. When searching the island, remnants of an old culture can be found, the mountains are man made(aztec style) and feature a dark dungeon (in the biggest pyramid) with a lich lord controlling the skeletons of the inhabitants). The story can be decyphered on stone walls inside the pyramid. War between two tribes forces the losing tribe create magical trap plants and retreating into the jungle, so the other faction cant find enough food and gets eaten, gruesome sacrificial necromancy is then used against the losing faction until the whole civilisation collapsed some hundred years ago.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "o1VYDRzkRRZPQzwZ","flags": {},"type": 0,"text": "An island shrouded heavily in mist appears once a year not too far off the coast of the mainland. Few have made the attempt to make it to the island, and far fewer have made it back. Those who can see the shoreline from a distance see the spirits of those who died at sea, staring sadly and longingly at the mainland. The island is gone by the time the sun comes up over the horizon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "D90bPDvgwyTTBPuk","flags": {},"type": 0,"text": "A large island that has a lake in the center that takes up most of the space on the island. There is a small dock on the lake and another island in the center of the lake with a small hut and another dock with a rowboat docked at it. A hermit lives in the hut.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "xE2r1ab8Lj1F8uxh","flags": {},"type": 0,"text": "A half moon shaped island with the ruined remnants of an elven temple. But be wary when exploring the overgrown ruins, an undead werewolf stalks in the shadows.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "TDIC7OWHoGlM0m50","flags": {},"type": 0,"text": "An illusion. The island looks like it’s almost there and you feel like you’re getting closer, but you never reach it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "piAj8lLepyPB2dt3","flags": {},"type": 0,"text": "An abandoned resort. This must have been a vacation spot decades or even centuries ago. Now the lasting beautiful architecture is the only sign that it was ever inhabited.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "oNSZCoN21MtL1krb","flags": {},"type": 0,"text": "Not so much an island as a wandering clump of Sargasso that circles around the doldrums. Juvenile fish of all sorts shelter here. Lost floating goods can also be found tangled in the weeds. A peaceful leafy sea dragon lairs in the depths of the clump. It gets bored with its treasure collection easily so its hobby is bartering with ships stuck in the doldrums. It offers trades for something else equal in value.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "svR86srhmQY95o8W","flags": {},"type": 0,"text": "A plain sandbar that appears for only a few months at a time before moving or sinking. A fortune in rare spotted shells desired by many wash up in pristine condition after storms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "2A7aysM3zDbMB1IA","flags": {},"type": 0,"text": "A small, flat island with a single structure surrounded by trees, an almost-ruined stone tower. Beneath the tower is a large network of tunnels created by the former residents, a group of wizards and their families searching for a stone of immortality thought buried beneath the island.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "iLVntmGQohOouLbz","flags": {},"type": 0,"text": "A small, heavily forested island, dotted with the ruins of houses a cult built while trying to make it their perfect society. Although the cult is long gone, the demons they summoned still skulk in the tree’s shadows.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "hc1X7VUpU0nocPZs","flags": {},"type": 0,"text": "An island is floating above the sea, about twenty feet from the top of the ocean. On top of the island is a library run by Chameleon warriors who travel around collecting books for their massive library. You can find information about nearly any civilization here, for a price.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "OzaCrOgCgF7kMuSd"}
