{"name": "Beholder Personalities","description": "One hundred personalities for one of the most feared creatures ever: The Beholder.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "JJpnPfnARhoe7Tj3","flags": {},"type": 0,"text": "I am obsessed with information; even the most trivial of information could be used to turn the tide of any fight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "OBvoITYr0oOnJtDn","flags": {},"type": 0,"text": "While I am all-powerful and incredibly beautiful, I wonder often if something is wrong with me and I just don’t realize it yet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "COUX8yIlw7xA7eOt","flags": {},"type": 0,"text": "I appreciate being asked questions; it makes me feel smart to inform ‘lesser’ creatures. I’ll talk about any topic I’m asked about (even if I don’t actually know it)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "MUjiuGSJDJHqeRDU","flags": {},"type": 0,"text": "I believe anyone worshiping me hates me, anyone who hates me just doesn’t know me yet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "XNKdMBCY7kx0NoiZ","flags": {},"type": 0,"text": "I desire companionship above all else but also believe everyone is just using me for companionship.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "ibbwLwwLpZ7nK4rY","flags": {},"type": 0,"text": "Discussion of any type with anyone with less than an 18-20 INT is enraging.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "klnTZmfn5iThaXSo","flags": {},"type": 0,"text": "Combat is mundane, and the only thing that piques my interest is watching my opponents squirm. I will often unnecessarily (and perilously) extend combat to enjoy the show.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "l4m7Vx1ALWYZBGcH","flags": {},"type": 0,"text": "I actually think the whole stigma of beholder-on-beholder racism holds our kind back, but any time I try and convince my brethren they try and kill me! I don’t think I’ll ever get through to them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "6MqboCGKwgW9Bm20","flags": {},"type": 0,"text": "Obsessedly tries to make its lair luxuriously comfortable in preparation of going to sleep but always remembers one more thing to add just as it’s about to fall asleep. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "LGxJfPxp3uTdo2Gh","flags": {},"type": 0,"text": "I know that any non-Beholders that oppose me are actually agents of a rival beholder. No inferior being has the capability of opposing me.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "gDT8Ag2j0e59nMEj","flags": {},"type": 0,"text": "I am the greatest zoologist in the world and will collect a menagerie containing a mating of every animal in the universe: rat, falcon, drown, hill giant, Illithid, etc.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "9h5yjehJQRCtt4W6","flags": {},"type": 0,"text": "I am the greatest author to have ever graced parchment. You are going to listen to my reading of my 16,732 page magnum opus whether you like it or not.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "P2Lp54CfYOyAwSpB","flags": {},"type": 0,"text": "Physical combat is for non-sentient insectsoids. I only engage in battles through games of strategy like chess.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "G09kj5Ba9NcmlePo","flags": {},"type": 0,"text": "Eureka! After much contemplation, I have reached an epiphany my dim-witted brethren will never find: the smartest being is the one who knows nothing. Thus, I must know nothing. Anyone who attempts to convince or demonstrate my knowledge of anything must be destroyed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "bRQrMtgSEksH34Wh","flags": {},"type": 0,"text": "Beauty is in the eye of the beholder, right? So all other eyes are probably ugly, and really bothering you, so I’ll take them off your hands (or faces). Just doing my part to make the world more beautiful.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "HvKKJvEwFGNYnIEU","flags": {},"type": 0,"text": "I believe that beholders are the only creatures that exist. All my minions? Polymorphed beholders, waiting to surprise me. Assassins? Illusions, constructs, or polymorphed as well. My go to test is dropping them off a cliff so they need to fly!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "6fz4gDefBBMNiYdV","flags": {},"type": 0,"text": "I speak in such annoyingly complex purple prose that every other creature can barely understand me, and I find this incredibly frustrating.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "esMKXrthAX4QTBP5","flags": {},"type": 0,"text": "I speak in the native language of every creature I speak to (regardless of whether or not they speak said language) in order to show off my intellect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "o6nxHqXObislGSo4","flags": {},"type": 0,"text": "I have used telepathy for so long that when I try to speak it comes out as bestial screams.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "yF82R4u32CtpHlIy","flags": {},"type": 0,"text": "I am constantly searching for my intellectual equal, and challenge every creature I meet to a contest of intellect with their life on the line should they lose.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "FuyxKCXDpWhOPiNY","flags": {},"type": 0,"text": "I know that some lesser fools want to kill me. Obviously it’s impossible but to avoid any risk I have created an incredibly accurate construct to act as my proxy in my primary lair that I control remotely from a separate demi-plane.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "xW2fYOR8x6cRBhPp","flags": {},"type": 0,"text": "They’re trying to poison me! Even assassin’s sent into my lair by my enemies are unsafe to eat. I can’t rely on any of my underlings to bring me safe food, so I have my own carefully curated farm. With lots of traps to protect my livestock.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "a2iNQhT0ZXcYIJqw","flags": {},"type": 0,"text": "I am far too big brained to have a physical body. I alone have transcended physical form. I am merely floating consciousness, coalesced Will. None can see me, but I can see all. What I don’t see, doesn’t exist. And what comes into existence is the power of my omnipotent subconscious keeping me from being bored by keeping part of my Will hidden from me. This is what happens when I discover new things. Even though it’s new, I already knew it. It exists because I made it exist, I just tricked myself into forgetting. I hate that part of my all-powerfulness. I must destroy new things to teach myself a lesson.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "ieUMCDnpU55YeZhJ","flags": {},"type": 0,"text": "I make sure everything goes according to my plans. Enemies tripping over a rock and impaling themselves, or falling into a lava river only there for the ambiance, and missing my deviously clever traps just won’t do, so I’ve made my lair one of the safest places in the world. Aside from the deviously clever traps, of course.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "7oSpuRM9dAi03vwk","flags": {},"type": 0,"text": "I am a comedy genius; the only reason one might not burst into tears at one of my jokes is due to their inferior intelligence and form being unable to comprehend the utter brilliance that is far realm humor!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "rRkUofwxsXcc6yNL","flags": {},"type": 0,"text": "I take pity on those of much lower intelligence than mine (mad men, dogs, children) and keep them in my lair as pets.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "8gL8on3weNpVpjKU","flags": {},"type": 0,"text": "I am the single most, brilliant thing in existence, therefore, I am destined to conquer the realm and succeed in all things I set out to do, therefore, why bother establishing myself in a kingdom when it will inevitably come under my control?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "US9JwvjGJI1cbUCI","flags": {},"type": 0,"text": "HA! I know the true power of the world is money! Gold, silver, platinum, copper its all mine! I will slay all my enemies with the power of m… Are you looking at MY MONEY!?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "ukTBTcQLO1QH1U2P","flags": {},"type": 0,"text": "I am far too important to put in harm’s way. I must be protected but no stupid creatures are truly trustworthy. Fortunately I can build an army. A nice protective army of steel and stone. Yes my tin men keep your master safe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "UWmiw1816Y5LGted","flags": {},"type": 0,"text": "Of course! If I fly upside down no one will ever know I am a Beholder and I can kill them easily! I’m a genius!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "6vo9eK78CCdxXnkY","flags": {},"type": 0,"text": "Hmmmm. Oh yes. Don’t you look scrumptious. Why if I seasoned you with devil horn powder and had nice cup of unicorn blood it would be just the most fabulous dinner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "7AePU2FltGwe3AHG","flags": {},"type": 0,"text": "I must have an audience so they can bask in my brilliance, have they noticed that when you blow a ‘C’ the 7th harmonic is intensified to the third order throughout my complex. Did you not understand the music magic of my abode? ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "2cqtHKuaMYvupNwW","flags": {},"type": 0,"text": "I am secretly envious of lesser of the lesser life forms because of their arms and legs. I experiment with different methods to emulate a body for myself (Telekinesis on a suit of armor, dominate person, etc.) ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "k1ZgWxfv5UigpTNZ","flags": {},"type": 0,"text": "The secrets of the universe are held within the stones beneath my floating orb body. I will become the best geologist in the realms by focusing intently on the rocks in my lair.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "EKEAYtuAAqyjhcPK","flags": {},"type": 0,"text": "I have my slaves create puppets of lesser beholders and put on plays that end with them all realizing my superiority and declaring me supreme ruler over all beholders. I am trying to make a puppet of myself for the shows but I have yet to find a way to construct something that captures my majesty. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "CtD9yawHRWpk4hsu","flags": {},"type": 0,"text": "I am aiming to become a powerful bard so that I can enchant and enslave the surface dwellers with my music, and have been kidnapping musicians to add to my orchestra. I am having a hard time finding a suitable instrument for myself to play though. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "ZhPq1dsLUR59TAgo","flags": {},"type": 0,"text": "One of my eyestalks was blinded long ago and I am desperately trying to hide this fact. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "XMBynKPP0LP6SnN5","flags": {},"type": 0,"text": "I live near a cult of mind flayers and am intrigued by the idea of a hive mind. I believe that if I could link my mind to a bunch of younger, more impressionable beholders I could form my own hive mind and our combined superior intellect would be unstoppable. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "5eeMSd9Kl2KBqhcK","flags": {},"type": 0,"text": "Deer are beautiful, and I like beautiful things. That’s why I have spent the last 50 years breeding a herd of over 200 deer in my lair.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "hIP8oMWk1YOT8UxP","flags": {},"type": 0,"text": "I value the unique and rare artifacts above all else, my collection is the envy of would be collectors and treasure hunters the world over. I am so proud of it I will show it off before every meal. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "QaK1OmEBLkWl2p8z","flags": {},"type": 0,"text": "I am a curator of the most beautiful, strange, and dangerous things in the world. None of my employees proved capable of caring for my precious possessions…so I added them to the collection. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "XmF1pYlBJ8OgTvLO","flags": {},"type": 0,"text": "I adore riddles. Riddles are the whetstone of the mind, and mine must always remain sharp. Try your best one on me; I’m certain I’ll be able to answer it. Though I must warn you; don’t ask silly questions, and I won’t play silly games. As long as your riddles entertain me, you may remain alive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "oqDArX0VpheASIf8","flags": {},"type": 0,"text": "Everything needs to be clean and tidy! My home is incredibly neat and the slightest thing out of place will NOT go unnoticed. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "KnckezNdEgumls1Q","flags": {},"type": 0,"text": "I saved the world 1,000 years ago and deserve recognition!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "k9hDLmfRvB8ND6bn","flags": {},"type": 0,"text": "I am overly courteous to distinguish myself from the common rabble. When others do not return my level of courtesy I fly into a rage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "stIrPAZNoYbqkkpO","flags": {},"type": 0,"text": "I was struck by lightning once, now, I have declared vengeance on the sky itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "uNklrjVf8Mpq00Vs","flags": {},"type": 0,"text": "I’m Gonna Blot Out The Sun.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "GLhM8WA6FFPhRv3K","flags": {},"type": 0,"text": "Finally, I have found a medium Beautiful enough to carry my Visage: I’m Gonna Carve My Face in the Moon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "7O9UBo75DipIlPiR","flags": {},"type": 0,"text": "More should know of my likeness and majesty. My minions are writers and artists, bards and singers patronized by my largeness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "FObH86Uc8LVGj2au","flags": {},"type": 0,"text": "The only being that nears me in beauty and elegance is the cat. That is why I have 150 of them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "Bg9wVnVarvvK4p44","flags": {},"type": 0,"text": "Going to carve my lair into the shape of a big pinball table and roll around in it all the time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "UsaZOiaNDceWZGWc","flags": {},"type": 0,"text": "I THINK DOGS SHOULD VOTE.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "8x4aaqbjb7LaJq2P","flags": {},"type": 0,"text": "I suspect every treasure I acquire of being a magical trap planted by my enemies. Often I leave behind or even destroy items of enormous value simply because my gut tells me it’ll be my undoing to keep them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "BUBKEQxLKfT4XcQn","flags": {},"type": 0,"text": "I am convinced that the entire world is an illusory reality created by a cruel god to observe me for his personal entertainment and that everyone except myself is in on it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "zwqG0AiUYQxxXlXF","flags": {},"type": 0,"text": "I am obsessed with the concept of true randomness. I study statistics, collect polyhedral dice, and spend my free time endlessly flipping coins and recording the results; all with a neurotic resolve to prove some superficial concept of predetermination.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "Ue4bJc6hkuU8uqMD","flags": {},"type": 0,"text": "I despise the concept of writing and fly into an incoherent rage whenever I see it, resolving to destroy any material on which there is written text.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "TbJK0Ghigd3JRt98","flags": {},"type": 0,"text": "The sun is large, round, and vaguely eye-like. Obviously it is another beholder, and I must defeat it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "R2qXg7q7E71dfUtm","flags": {},"type": 0,"text": "I have devised five clever proofs for why I am god, and will explain them to you in extreme detail.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "dc2H87EKF5LnYp5h","flags": {},"type": 0,"text": "Obviously got aren’t as brilliant as me. It isn’t your fault. I will, therefore, speak in extremely patronizing terms to you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "yjOMa9bVzroBMtl9","flags": {},"type": 0,"text": "There is only one weapon that can kill me. It’s a mundane item or even a stick or rock. I have found it and keep it safe in my lair. If it is ever in my presence I am terrified and will immediately attack the bearer to kill them and recover the item. If the item so much as touches me, I will believe I’ve died and fall prone. I will remain as such. I’m so convinced I’m dead; I will soon become a Death Tyrant. I will then hound my killer. I will have lost my fear of the item. I will continue to stalk my killer until I am permanently dispatched. If I kill my nemesis. I will target his race of people and proceed to wipe them out of existence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "rxwuTiEDdsItvPj5","flags": {},"type": 0,"text": "My eyestalks are separate entities to my body. Each has a name and personality. Some of them I like, others I hate. I talk to them constantly and I hear them talk back. I’ve even had my thralls make wigs, clothes, and limbs for them. Sometimes the puppets are dead adventurers. When I talk to other beings, my eyestalks constantly interrupt and talk to the beings through my mouth, but I don’t realize it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "G58jcePIXbXPTetU","flags": {},"type": 0,"text": "The world must know my genius, and the best way to do that is by putting on a play. I will be the main character, director, and actor for it while my minions run security. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "iGn7xoiywAvpm9U3","flags": {},"type": 0,"text": "I’m actually a nice guy, but somewhere along the line I learned all my antonyms backwards, and refuse to believe I could have made such a mistake. When creatures show up in my lair and I tell them I am filled with rage at meeting them and wish only for war they keep attacking me, what jerks!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "pIFCplA6zvyJSDOG","flags": {},"type": 0,"text": "I am incredibly interested in other worlds and about 3/4ths of the way through making a spelljammer. If questioned I’ll discuss the subject at length.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "JwswymgS2uD2Lm7V","flags": {},"type": 0,"text": "I pissed off a rakshasa at some point and believe every creature that shows up in my lair is it. My anti-magic eye field should reveal it? That sounds like rakshasa talk!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "4sO0jjM0vyiBykQx","flags": {},"type": 0,"text": "I only want to share my poetry with the world. My poetry that causes psychic damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "m1IIFCamzu39ZeGT","flags": {},"type": 0,"text": "To prove that beholders are the ultimate apex of creation I have been capturing creatures and putting them in competitions (gladiatorial fights, science fairs, riddle contests, etc.) then trying to cross breed the winners. I expect when I finally find the best in each category and combine them in the right order it’ll make a beholder.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "SdKSTMZ0lwMMyBQe","flags": {},"type": 0,"text": "I’m not a beholder; I’m a gnome inventor piloting my beholder facsimile flying craft.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "93lX4jeQt7KbeB8o","flags": {},"type": 0,"text": "I’m an obsessive toy collector. I have a veritable army of tinkerers and my lair is filled with clockwork creations no one is allowed to touch.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "3RbTcsbqDzthKJpp","flags": {},"type": 0,"text": "I’m an obsessive ‘toy’ collector and my lair is filled with unique and rare creatures trapped in suspended animation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "zxfQGbc19I3vFs02","flags": {},"type": 0,"text": "I see beauty in the stars and want to recreate it. I’ve got a perpetual and ever growing fireball I constantly feed with arcane energy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "Vo4Mxz8Zu2T1nwpZ","flags": {},"type": 0,"text": "I fancy myself a fashion designer, creating clothes for lesser races to make them look more beautiful, more like me. Lately this just hasn’t been scratching the itch for me and I’ve started into actual body modification.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "wCONZqgGLoymf9gW","flags": {},"type": 0,"text": "For the past 100 years I’ve had an itch on my back I can’t reach to scratch, no matter what I try. It has driven me into jibbering insanity. I also try to smash my bulk against any creatures that enter my lair in order to get at the itch.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "WIByAtWBVYXDiog4","flags": {},"type": 0,"text": "I abhor the inefficiency of urination and defecation in lesser races and view it as the great scientific problem of our time. I’m trying to solve it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "u2okq5sSuFuzsK96","flags": {},"type": 0,"text": "I am convinced the Aboleth who lives in the river below me is my best friend in the world. He is, in reality, just glad to have someone to talk to since his kids never call, the Drow won’t stop trying to enslave him, the mind flayers keep trying to eat his brain and most adventures go mad and claw their own eyes out when he tries to explain simple concepts to them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "QOPqSRkeszuKCZsD","flags": {},"type": 0,"text": "I consider myself to be a great chef, and serve the finest cuisine to all my guests. Unfortunately, their pathetic palates can’t handle 300-year old pickled rust beast and giant cave fungus tartar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "xNxukp5FR3Wq8L0Y","flags": {},"type": 0,"text": "Alignment-wise I’m actually a good person, to anyone but fellow beholders, who I am convinced are all plotting to brutally murder me. I’m not cruel like they are, so I’ll let them live as long as they don’t attack me first. I spend most of my time tending my herd of gas spores. That way, when they come to kill me, they’ll have to figure out which is the real me.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "yaSmWT3k5xlbV38e","flags": {},"type": 0,"text": "I was once enslaved by an evil wizard, until I bit his head off when he least expected it. Now I’m convinced that every wizard wants to enslave me. ALL WIZARDS MUST DIE!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "FjfRcQXfKumUqbWN","flags": {},"type": 0,"text": "I’m building a working model of Mechanus. Some fool tried to explain to me that Mechanus is infinite and that it was therefore impossible to model it, so I paralyzed him and strapped him to the big gear until he agreed to help.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "EYw5Xt3ikS3ESVIz","flags": {},"type": 0,"text": "There is a beholder who lives in that pool of water who consistently mocks me. I’ve tried to kill me again and again, but he always seems to reform.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "fqk90VGjkdQ8CyKR","flags": {},"type": 0,"text": "I adore sculpting, and have decorated my layer with hundreds of sculptures of the greatest being in the multiverse: me!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "jTyFnTlVSFedflcW","flags": {},"type": 0,"text": "I love mirrors. I have millions of them. Lately though, I’ve been seeing something out of the corner of one my eye. Something is swimming through my mirrors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "OpziURXY7Dn5iufM","flags": {},"type": 0,"text": "I am obsessed with cheese, but have no idea what the process is for making it, as I have no idea what ‘milk’ is and refuse to believe that is what it really is when its explained to me. Babies don’t need to eat special food when they’re born; they’re born with teeth and able to eat normally as soon as they are vomited out of their mother’s mouth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "UiAEJWl4VgZkDRga","flags": {},"type": 0,"text": "I was raised by dwarves, and, consequently, am still violent and insane, but towards beholders and all evil-aligned raced instead of the world in general. I am also an alcoholic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "tmwXIhfHyXbx7Dv7","flags": {},"type": 0,"text": "I was born from the dreams of a dying beholder and because of this I was born half-complete with only enough knowledge to survive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "LcwTACu3WDDYlUqo","flags": {},"type": 0,"text": "I’ve devoted my life to making the perfect poached egg, and have recently discovered that humanoid blood is the best liquid to poach with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "08YsFoIYGBZMsfvG","flags": {},"type": 0,"text": "I have an extremely magical set of gloves and really would like to know how to wear them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "qJwnlYm64DWTxmAs","flags": {},"type": 0,"text": "I know a wizard who casts Dream on me enabling me to continue having more and more children beholders in a dizzying array of mutations of my own perfect self.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "qi8Q49TGk5x0HFoT","flags": {},"type": 0,"text": "I have to destroy my lair and start again whenever it’s least expected. And the least expected time is when I have many visitors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "iPV5FooYXdWGgmWg","flags": {},"type": 0,"text": "The height of society and perfection is genteel hosting. I host balls and soirees to which everyone is invited. I watch from afar though, terrified of what my guests might think of me.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "eHIccKSuVyMcYEIb","flags": {},"type": 0,"text": "I saw a deer once and am consumed with jealousy of its beautiful antlers. My subordinates all wear antler helmets. I wear a headset fashioned out of glittering diamond and gold. If anyone with true antlers comes within my sight. I can’t control myself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "oEujM3Zqtle6Vyn2","flags": {},"type": 0,"text": "My lair is a beautiful incredible echo chamber. Any creature within can hear my sonorous voice in Undercommon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "eGRDUAbfQhxuF1tN","flags": {},"type": 0,"text": "I love my pet goldfish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "mFjJI8HJL5EVScMN","flags": {},"type": 0,"text": "I have a vivisection theatre where I slowly and carefully experiment on all kinds of creatures. Any who would like to are welcome to come and watch. Should any audience members make even a sound during the procedure, they’ll find themselves on the table next.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "ByK6mLvl4huEiWum","flags": {},"type": 0,"text": "I believe that I am invisible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "9w3RYYm0kkCD4pGV","flags": {},"type": 0,"text": "I want to summon a goristro, mind control it, strap myself to its waist as a belt and run around the world doing petty crime.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "UHq4bU3KYyzwhY4t","flags": {},"type": 0,"text": "I’ve developed an emotional connection to a little sickly gnomish boy. He lives in my lair and I do everything possible to keep him in good health but he keeps coughing. No clerics, no priests, no doctors have been able to cure him of his ailment. Perhaps, I’ll have to beseech a higher power.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "aa8niE3Mjg3qQ6d8","flags": {},"type": 0,"text": "I’m going to wake the tarrasque.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "BpZp8Ja8r0s2GR6k","flags": {},"type": 0,"text": "In order to preserve my health forever, I have a stash of dozens and dozens of Mellified Men.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "rRY9cOHgOv5d5pwe","flags": {},"type": 0,"text": "I am certain that there are types of beholders for other mortal senses, and any that disagree are untrustworthy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "IuXY9M2sBan72tfg"}
