{"name": "Interesting Shopkeepers and Merchants","description": "One hundred different shopkeepers and merchants that will bring life to bartering in your game.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "VhFGLFWQJyUzHBFj","flags": {},"type": 0,"text": "A tall and husky Gold Dragonborn, clad in bright colored and decorative clothing, sits on an equally ornate rug. He’s fidgeting with something in his mouth. It’s has a small garnet, chipped by his teeth and covered in spit. He has a small pouch in his vest full of these gross little gems. He sells very beautiful jewelry, thankfully with no bite marks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "1MKvi3NDsn9BLwVI","flags": {},"type": 0,"text": "Two very young Halfling brothers are making dumplings. The dumplings are way too big even for a normal sized person, but they taste pretty good.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "atrABVyljYgLMWPD","flags": {},"type": 0,"text": "A tiefling who’s missing a tooth smiles quite charismatically. He’s selling potions and poisons, but they’re stored in old, reused liquor bottles. Kinda weird, but mostly harmless.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "vRuUcyWFRjc4E0OE","flags": {},"type": 0,"text": "This human-elf couple makes soap. They’re super happy because of their soap, which is always enchanted into putting anyone who uses it into a good mood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "iDK0IcIMFUIVpXZU","flags": {},"type": 0,"text": "This scrawny kobold is making guns. He loves his firearms to death, despite being too small to wield a majority of them. He just loves his craft.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "Z2BsoCT9XhDY1uPw","flags": {},"type": 0,"text": "A bald, female wizard doesn’t actually sell anything, but she enchants items for others. She also has a hairless cat, probably related to the same incident. She has looks that could kill, but she is super sensitive when someone brings up her lack of hair.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "kRtDm68JXM1kfDBK","flags": {},"type": 0,"text": "A young, quiet librarian sits behind a desk reading a book. When the player gets closer, they notice that she’s actually a centaur. She’s quite dainty and gentle for her size.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "H5yiqDIbtxkrNCrn","flags": {},"type": 0,"text": "A disabled dwarf creates small trinkets from bed. His half human daughter takes care of him, but a network of clockwork beasts run his store front, taking care of sales and maintaining each other so they’ll sell for a pretty penny. Rumors about him creating a chair with wheels are spreading, so he’ll finally be mobile again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "VXKF4q2zEf9odC9c","flags": {},"type": 0,"text": "An unlikely pair of merchants run an apothecary, alternatingly with one working on baubles while the other deals with customers. The dwarf is a grumpy old man, nearly unapproachable, and usually berates his half-orc apprentice even when in front of the customers. When asked, he typically overprices and generally shuts down any attempts at haggling. The half-orc apprentice is suspicious and intimidating in appearance, and sound threatening when replying to his dwarf master, but is actually much more cordial to the customers and is more lenient when haggling. Both, however, like their beer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "u2lC9Jfwiil0o61m","flags": {},"type": 0,"text": "A gnome tinker who has all kinds of different scrounged and jury-rigged magic items. He appears on his cart every couple hours until the party buys something.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "2nXqoyZC3GXmlYxC","flags": {},"type": 0,"text": "An aarakocra resembling a vulture who sells things he finds. By ‘finds’, he means he takes stuff off of dead bodies and whatever else he sees lying around. He’ll sell random pieces of armor, weapons, books, and food he cooks himself with scavenged meats and the like. He’s a great cook and a cynical old coot. His coyote & pepper stew is quite popular.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "a157XcvMLYz48VjJ","flags": {},"type": 0,"text": "A thin man wearing a backpack seemingly too large to carry. Inside are various minor magic items which he sells as novelties to anyone with the cash to buy them. He is dressed in flamboyant clothing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "dKbPl6ZETAJFelcK","flags": {},"type": 0,"text": "A homeless man gives advice on the town and strange trinkets in exchange for coin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "9SZgLwyM9JdI6eMr","flags": {},"type": 0,"text": "A cheerful dragonborn who runs a sandwich shop in a tavern. He is obsessed with incredibly spicy food, and tries to push spices on customers to ‘keep the fire burning in their stomachs’. Cooks all of his food with his breath weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "2gDYqTGpkr7k8xKd","flags": {},"type": 0,"text": "A young half elf alchemist selling concoctions out of a small bag. Her accessories include a bandolier that holds different vials, leaf shaped earrings, and a purple headband. She promises that her creations work, however the shakiness of her voice don’t inspire confidence. She’ll get overly excited when she makes a sale.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "nsYoq6UwdlJbwk20","flags": {},"type": 0,"text": "A scarred, brutish orc selling finely crafted jewelry. if engaged in conversation, he reveals that he only took up the barbaric ways of his people because of peer pressure. Eventually he went adventuring and then decided to pursue his lifelong hobby of crafting rings and necklaces and the like. His clan must believe he is long dead by now.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "LjkmqR1901cf275T","flags": {},"type": 0,"text": "A young human wizard, yet to lose his baby fat and with no sign of facial hair can provide advanced spell scrolls, but always refers to customers as ‘youngster’ or ‘whippersnapper’. When asked about it, he becomes very upset, muttering about curses and kids not respecting their elders anymore.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "gbx6Qo5qJX1WTqu8","flags": {},"type": 0,"text": "A old human luthier with a grey mustache and coke bottle glasses. He’s always working on something and refuses to look away from what he’s working on for more than a second. His teenaged son does most of the dealing, however he spend most of his time playing with the merchandise. The son will keep playing when spoken to and will inform everyone that his band is playing at the tavern that night. Before making any deal he will walk over and ask his father if the deal is fair.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "huTf1XEaBBSXfTQu","flags": {},"type": 0,"text": "A slender, well-mannered man sells curiosities in a travelling carriage. He has a pet mimic that has taken the form of a small lockbox, which is somehow very well trained and obedient.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "sQSZmvHe1RDCACsV","flags": {},"type": 0,"text": "A female high elf with shoulder length auburn hair and named Mary Jane sells herbs, fruits and vegetables from a large wagon pulled by a pair of mechanical oxen. Many of the herbs are seasoning; some have medicinal uses and a few have ‘recreational uses’. Her partner, a shy male Halfling named Timmy who barely speaks to anyone, but, if you can befriend him, he can sell you a few herbs and roots that are useful in toxin manufacture.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "gUT7QwU6Xj5xbsLn","flags": {},"type": 0,"text": "A sphinx who sells minor magical items in exchange for new riddles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "A9kxL6gxe0XhLRat","flags": {},"type": 0,"text": "A quick tongued elven female who has a reputation of being a snob. She often wears a colorful dress that’s skirt reaches down to her knees, several different pieces of jewelry, and a small leather bag that has the symbol of her merchant clan on it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "AvQrVp4yvlYDbwJA","flags": {},"type": 0,"text": "A halfling peddler who roams town to town selling wears from his ‘many adventures’. If the party sells him something, say a blanket, they might find it for sale in the next town over. The blanket will have some story such as how hiding below it prevents ghosts and goblins from seeing you, or maybe it had kept him warm in the snow capped mountains and was the warmest blanket ever. He will be selling for three times what he paid for it at the least. If you want to add another layer of mystery. The things he says the objects can do actually happen. Aside from the obvious abilities the goods have, they are clearly the same goods the adventures and townsfolk sell him. Down to a wierd stain or carved initial. He is smart enough not to sell goods in the places he bought them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "W6nnsS7cIHSWJofG","flags": {},"type": 0,"text": "A smith, a ’90s waif who only weighs 90 pounds if she’s carrying hammer and tongs. She’s tiny, the size of a human ten-year-old. She makes big, heavy things such as plate armor, tower shields, pole arms. They’re of masterwork quality. She’s not deceptively strong, either: she can barely raise the hammer above her shoulder. There’s no enchantment or anything else involved; nobody has ever been able to figure out how she does it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "tFdxqGCjPFpePlmN","flags": {},"type": 0,"text": "A kobold sells ‘Enhanced’ potions at a discount from a dingy shop sandwiched between two larger, more reputable stores. The proprietor is somewhat vague on exactly how the potions have been enhanced. They do exactly what the label implies, though (‘Ideally,’ the proprietor insists,) they frequently come with an additional effect. This ‘Enhancement’ can range from enhancing the user’s physical and mental faculties, to making the user’s skin turn blue for hours, to making the user’s tongue taste like bathwater. A particularly intelligent user may be able to determine the side-effect before using it. The rest simply have to hold their breath, drink, and pray.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "2XWLwJXMVGykbXKY","flags": {},"type": 0,"text": "A tall lanky shop owner who can’t seem to get warm. He wears several sets of clothes at once.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "1TvPbPzP2q0txG5G","flags": {},"type": 0,"text": "A very grumpy half-orc who gives customers what they want, but does not take requests. His prices are excellent, but he will only sell one item of his own choosing to each PC.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "flZ8lLdDN3M573GX","flags": {},"type": 0,"text": "A toothless, vegetarian lizardfolk who sells poultices and other herbal remedies. He claims that he was cursed to have no teeth and took up a different diet out of necessity, and he grinds up his food into a puree so he can eat it properly. His scales are a sickly yellow and he’s almost always bent over his table, grinding up and boiling down various common and exotic plants, all of which he grows or buys himself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "ctSEvUe14TBhNnYt","flags": {},"type": 0,"text": "A bizarrely dressed human with a strange beard and haircut. He brews coffee and spends hours perfecting it so he could find the purest, most flavorful blend. In reality, it’s just normal coffee. When being told this, he responds by saying that they aren’t cultured enough to understand the depth of the flavor. He’s incredibly cranky and pretentious for his age, so almost nobody likes him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "OdjPFCYnLierXLs9","flags": {},"type": 0,"text": "A dust genasi who sells a huge variety of cleaning supplies. Brooms, mops, soaps, various scented oils, you name it. He’s constantly leaving a trail of dust around and cleans it up as it gets made. When it’s pointed out that he’s doing a fruitless task, he becomes extremely sarcastic and thanks them for pointing out the obvious. Other than that, he’s pretty laid back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "WU6WewjiBrgi1gOD","flags": {},"type": 0,"text": "A Warforged merchant that sells scrap metal, logs, wagons and parts to assemble your own Warforged bodyguard. Oh, and he has some healing potions at discounted prices because ‘What would anyone use them for?’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "RSKqoXf75e188vSq","flags": {},"type": 0,"text": "This unidentifiable person is clad in a bright blue robe and an opaline mask. Their hands and feet are bright blue as well. They sit on a pretty standard rug, cross legged and swaying side to side. His rug is NOT for sale, because he always mentions it before talking to a customer, along with a large tag that says ‘NOT FOR SALE’ on the side. He sells various items, all with some sort of minor magical effect. He doesn’t say much except for strange things like, ‘What’s your favorite color? Mine’s blue.’ and ‘I like your haircut.’ When the party leaves, he quietly hums to himself and disappears as soon as he’s out of earshot. Nobody knows who or what you’re talking about when you try to mention him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "CKuHLOap4Bogsr3i","flags": {},"type": 0,"text": "A strangely happy man in a cart pulled by horses. He smiles extremely wide and creepily. He’ll offer free items to the party, like food, if they come into his cart and grab it. You probably should’ve noticed this was a highly advanced mimic, due to his mouth not moving when he talks and the walls of his carriage looking kinda fleshy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "snh2frVr2Wb9y4c9","flags": {},"type": 0,"text": "A quiet woman lies lazily on the back of a smooth-shelled ankylosaurus. The anky’s name is Bailey, and she’s just a big puppy dog who likes being pet. The merchant (named Rachael) sells books, and buys books. She also gladly accepts food for her anky. Bailey likes corn a lot.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "ANDEDJsyIEwIkSZ5","flags": {},"type": 0,"text": "A triton fisherman riding the back of a colossal catfish, with a small tent on its back. He has wide variety of fish stored in small barrels in preserving salts. He and his catfish have been friends since they were both born, and he takes great offense when someone insults his fish (both the ones he’s selling and the one he’s riding).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "i8wjrMaBzks4WTO9","flags": {},"type": 0,"text": "A butcher who enjoys his job a little too much. He’s super creepy, but he hasn’t done anything wrong and he is well respected by those who’ve known him for a while.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "47d1pJSzROC9ORel","flags": {},"type": 0,"text": "A huge man wearing sunglasses made of red quartz claims to be the best sculptor in the world. He can prove it too, all his statues are carved from the exact same type of granite and look scarily like the real thing. They always look scared for some reason too. As it turns out, he has a gorgon held hostage in his basement, and he uses her to freeze various animals and people he captures. From raccoons and chickens to cows and people, he’s kidnapping them and petrifying them. Somebody should stop him. He sells his statues for a whole lot of money.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "HaXBLzrugzoJQnZl","flags": {},"type": 0,"text": "Subtle slave trader. The ‘products’ are actually transformed into animals or trinkets. Upon purchase, the trader will give the new owner a scroll or item to transform the trinket into the slave (maybe even back again). A clever way to smuggle slaves through check points and/or through lands that don’t support slavery.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "Bng9K46fYXGFT2ED","flags": {},"type": 0,"text": "A cowpuncher with a heavy accent. She sells common livestock, along with a few exotic things like special built saddles and animal barding. She claims to be from a place called ‘Wyoming’, which everyone knows doesn’t exist. She’s completely sane however.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "UOK5rE7IZJvCmxSU","flags": {},"type": 0,"text": "A bearded chef who’s incredibly skinny despite the fact he’s always eating. He’s a very prestigious chef who’s famous for his dragon egg, orange, and tomato omelet. He has a pouch of granola clusters on him that he’s constantly munching on. He jokes about being cursed by a witch when he was younger, but he’s actually correct.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "Rv3Im4VxdamS8CT5","flags": {},"type": 0,"text": "You stumble upon a giant clam shell placed near a road by the beach. Knocking on it, a sleepy man opens the lid and rubs his eyes, asking who’s there. He’ll sell you things he finds in and around the ocean before closing the clam and going back to sleep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "tAmjAoNW162saCyZ","flags": {},"type": 0,"text": "A painfully average man who sells painfully average things. Any magic items sold to him will lose their properties.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "jiwywX0qktA25jqb","flags": {},"type": 0,"text": "A wandering hunter wielding a crossbow who will sell her wares to the party, or the nearest town. She’ll seem to travel in the same path as the party, showing signs of her travels (new scars, new pelts, maybe even a new friend).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "cq9HydabRpq4YILo","flags": {},"type": 0,"text": "An older human male approximately 60 years old, hulking frame, thick biceps, bald as a bowling ball and wears a gold chain running from earring to nose-ring, nicknamed ‘Bull’ runs a shop with his wife, a delicate grey-haired human woman of medium height, but thin as a rail and speaking with a raspy voice which tells of her advanced age. In this shop, you can find the finest china service sets and tableware in the province. From platters to plates, from pitchers to spoons, from cups to cutlery, everything you need to put out the best spread is available at Bull’s China Shop.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "oKIkJY9DvKL7AKrZ","flags": {},"type": 0,"text": "A figure, roughly 5’5”, covered in heavy winter clothing. His(?) voice can be understood, but is muffled by layers of scarves. In actuality, there is nothing underneath the clothing; he’s a modified enchanted armor. They sell a huge variety of armor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "87enI39bfP6Y2E8c","flags": {},"type": 0,"text": "A half-elf wizard with a crow on his shoulder. The wizard turns his head rapidly and jerkily to look at anything that moves, but stays silent. If a customer approaches, the crow speaks to them, disgruntled by the change of bodies between him and his familiar. They sells wants and books, typical wizarding gear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "spOQoF0cnWmRKXoo","flags": {},"type": 0,"text": "A vampire couple. They don’t feed off humans, instead coming out at night to hunt elk, rabbits, and other game so they can feed. They say it tastes like stale water mixed with iron shavings and beef broth, but they also say the bad taste is more than worth it so they stay in good standings with the mortals they live near. They sell timber as well as high quality furniture they make themselves. They’ll sell other things like knives, small whittled figures, and furniture polish, if you ask. The community loves them for being so helpful and not causing any problems.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "Uz9TCt5D59SUSWaz","flags": {},"type": 0,"text": "A dwarf with insane eyes, charred hair, and a lack of eyebrows. He has an insane look in his eyes, and is attempting to sell gunpowder and explosives to all who walk by. He keeps sizing up the local buildings with his eyes, especially the wooden ones.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "BJo4jD0xoFBGaWnX","flags": {},"type": 0,"text": "A very articulate bald man with glasses. He has an obscene amount of knowledge on the most useless things, like music and technology. He’s a comedian with a small food business on the side. He has a short and sweet wife who makes the delicious food that he sells. They have two long hair cats, who they call their sons. They use strange words and phrases that nobody else understands, like ‘acquiesce’ and ‘get dusted’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "LAJiQkN8bfJYMkzu","flags": {},"type": 0,"text": "Armiton, very calm minded human who sells the crops he grows on his farm. His workers are all homunculi.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "8YoEasy529lwgwEK","flags": {},"type": 0,"text": "A stout burly man with a slightly singed brown beard and tanned, scarred complexion; he’s wearing a faded motley cloak and sells a variety of odds and ends. When discussing his goods, he shows off the mundane objects at his stall as if they were exotic wonders. The magical items however, are dismissed as ‘silly pish-posh’ and he hardly acknowledges them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "6DxQGP09Xi4GFhaT","flags": {},"type": 0,"text": "A half-elf, half-dryad who’s mother was a willow. He has long, flowing hair with flowers scattered in it. His dryad nature shows through, as patches of his skin are textured like wood and his hair is a light green, among other things. He is always sitting down, whether it’s crisscross on the floor or on a nearby branch. Around his neck is a small heart made of amber with a tiny blue flower embedded inside. He’ll sell you various traveling provisions and other useful, mundane things, like shovels and lanterns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "Ok8eu4h5UEaakXEN","flags": {},"type": 0,"text": "A short haired woman with a light voice. She plays the ukulele and sings as a street performer. She’ll play any song on request, for a price. She seems to know every song imaginable by heart even when she has no possible way of knowing it, and she never falters in her performance. She NEVER lets her prized ukulele out of sight. She’s a folk hero for making an ogre run away crying after playing a song that it’s mother sang to him as a baby, among other rumors and tales.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "goXFrh9YM0I192kW","flags": {},"type": 0,"text": "Eddy and Johny’s cabinet of curios A gnome and half-orc couple who sell small nik-naks some of which give off slight magic. (They sell things off the millions of trinket tables you can find)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "tsDL7Aby9e4k5qhi","flags": {},"type": 0,"text": "A young Goblin merchant that is constantly trying to sell the random scraps and knickknacks he finds lying around from the massive burlap sack on his back. Many of his goods tend to be in poor condition or are junk, and a good amount of them were found through more liberal interpretations of the phrase “lying around”. Despite this, he is a hard worker that is just trying to make a living in any way he can manage, and genuinely appreciates anyone who acknowledges that. Those who do usually end up with better deals on more junk, as well as the opportunity to purchase first when he truly finds something of value. Every time someone browses his wares, he proudly proclaims that he’s got the best deals anywhere, despite his tendency to slightly overprice all his goods.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "k6ihQ4G11r1MelOA","flags": {},"type": 0,"text": "A middle-aged Human blacksmith hawks his weapons and armor from the side of a small indoor arena that he owns. The portly man is eager to draw in customers, and is very proud of his works, inviting people in from off the streets to admire their impressive appearances. He is always eager to sell his normal merchandise, but those who wish to purchase his most ornate works must prove that they are capable of handling themselves in combat against a battered set of animated armor, and are challenged to push the construct out of the 15-foot radius arena without getting knocked prone by it. Only if you can do it will he allow a customer to purchase his masterpieces, all of which are beautifully yet practically designed, made from exotic materials that are perfect for enchanting.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "djfQAhaQ8TxLNlUy","flags": {},"type": 0,"text": "A tottering old Halfling woman often found heavily bundled up on the corners of busy streets. Despite being nearly blind, she sews repairs to cloaks and clothing in exchange for stories and tales. She is incredibly good-hearted and refers to everyone she meets as “Dearie”. She insists that she doesn’t need money and that the stories she hears make her the wealthiest woman alive, but her customers always tend to leave her some coin anyway. The repairs she makes seem patchwork and haphazard, but are surprisingly durable in addition to making the fabric much more homey and comfortable. All of the locals consider to be a staple of the community, and are very protective of her.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "ty3N2k6ys0V0gZn2","flags": {},"type": 0,"text": "An Earth Genasi and his cart of cabbages. Only sells cabbages and is mysteriously in every large town you visit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "xmub4V4mmflREqgn","flags": {},"type": 0,"text": "A small iron golem smith, who exclusively crafts razor sharp longswords (crit range 18-20, cost 200 gp, otherwise same as normal longswords). His hammer is actually an intelligent magic item that gives instructions to him in a way the players can’t perceive. The golem always talks about the hammer, not himself (‘he has this for sale, he would charge you that, etc.’) Upon receiving payment the golem throws the gold in a pot in the forge and later, if the party pays attention, mixes bronze into it after hours to produce gold bars, if it doesn’t know the party is watching.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "7DOwYHDg43k63AUM","flags": {},"type": 0,"text": "A blue-skinned tiefling who works as a glassblower. He has a lot of beautiful pots, jars, and bottles, all of which are made in stunning colors and dazzling designs. Aside from these, he also has glass weapons and armor. They’re really clunk, but they’re as powerful as they are beautiful. He keeps these a secret from his teenage female apprentice, named Sydney, to keep her focused on the basic craft. If asked about this, he says, ‘She needs to walk before she can run.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "oyEap8DuMCIWD6fP","flags": {},"type": 0,"text": "A gangling, calm, quiet man who speaks slowly. He drags a cart full of various snails and snail shells. His clothing is adorned with many shells, but otherwise he dresses modestly and is kind-hearted. His name is Escar-Joe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "SEYPVQmnlPi4yhJw","flags": {},"type": 0,"text": "A halfling man who runs the printing business in town. His printing press is unlike any you’ve ever seen, about the size of a carriage and constantly clicking and whirring quietly as it prints like clockwork, and where he got it is a mystery. When asked, he’ll change the subject in an attempt to sell scribing tools, like pens, ink, and paper.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "yr3IQwyUA0TIQaKh","flags": {},"type": 0,"text": "An orc who lives in the overgrown skeleton of a giant, sleeping in the skull. He sells game he hunts and ‘clothes’ he makes out of the bones and hides.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "ECHyUJ4Sx7FFrKoD","flags": {},"type": 0,"text": "A human child, around 8-9, with long, brown pigtails. Her name is Bethany, and she claims to be a healer. She’ll cure curses, disease, and other aliments. She’ll fail sometimes, but she’s still learning. She lives in a local monastery with several other priests. They say they found her as a baby and have raised her since, and she shows great promise for her abilities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "goxLTHHVfGbtBntP","flags": {},"type": 0,"text": "A short, bald, wizened old man who runs a pet shop. None of the animals are in cages and are all free-roaming. Despite appearing to be conversing with the humans who enter his shop, he is actually talking to his real customers – the animals. When he completes a deal, the pets scratch or bite their new owners and pay him in drops of blood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "RTgeMHGexJHbWGPH","flags": {},"type": 0,"text": "A shaggy, humanoid shambling mound imbued with sentience by an unknown master. They can’t speak, rather carrying around a chalkboard around to communicate. They’re wearing loose common garb, but you can barely tell. They sell various herbal teas and remedies, and they’ll give you a haircut too if you ask. They have the ashes of their master in a small vial around their neck.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "900C9bRfUwQrhjoh","flags": {},"type": 0,"text": "A lizardfolk blacksmith who’s obsessed with fire. Her skin is a deep blue, and her neck and frills behind her ears are orange. She’ll cuddle up to her roaring forge at night to make sure she stays toasty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "BGdKIHnxa17Q8NC7","flags": {},"type": 0,"text": "A mute tailor who is a total hermit. The clothes he sells are enchanted to become as heavy as lead if someone tries to steal them. He never leaves his house above his shop, only coming down to silently stock up his wares when nobody is around to see him. Purchases are made by putting the coins into a slot build into his desk, then the enchantment will wear off, allowing you to take your clothes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "IINIydqSMFmo7Qb1","flags": {},"type": 0,"text": "A well dressed woman with a veil over her face pulls you into an alley before commanding you to buy something. A shelf of potions accompanies her, all unmarked. If you try to ask a question, she pushes you out. If you don’t buy something, she pushes you out. Turning around after she pushes you away reveals that there was never an alley there to begin with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "ItY0Xt6r6VdsA9eK","flags": {},"type": 0,"text": "A steampunk dwarf artificer with two crude tentacles crafted onto a small hydrator engine attached to his lower spine. Wears a brown trench coat, bald and grey beard and drinks copious amounts of coffee. Quite friendly and talented with a blunderbuss also runs and operates Loch & Load artificing shop.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "QjEp3R420YRZFxW2","flags": {},"type": 0,"text": "A short woman who makes tea. Her tea is mostly normal, but if you ask she’ll show you all sorts of exotic plants made into tea bags. Banana leaf tea, cactus sap tea, goodberry tea, spicy honey tea, venus fly trap tea… these are getting weird.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "j5w2IkXu75dgJCc1","flags": {},"type": 0,"text": "A fire genasi who’s obsessed with smoke. He sells cigars, smoked meats, and tinderboxes. He smells like smoke, his eyes and skin are a dusty orange.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "DL6nQNHHKDYLVvIz","flags": {},"type": 0,"text": "You open the door to a large shop, and it’s empty. Save for a single table, with a quiche. A singular quiche. There’s a note that says, ‘Pay what you want’ with a smiley face in crude handwriting. You can smell a goblin in here somewhere. Did she make this?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "KHEdjJWTGGSDZZ0p","flags": {},"type": 0,"text": "A man with a pet rust monster buys metal scraps and sells the chitin his pet drops. Maybe there’s a use for it. The rust monster is extremely well behaved, with little bows around its antenna. It’s kinda cute.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "n0RyewKR8pGfgVim","flags": {},"type": 0,"text": "A gruff, stereotypical strongman runs a bar. A normal bar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "RG14zXvxXnyTfwFR","flags": {},"type": 0,"text": "A dark skinned goliath woman who runs a daycare. She sells the arts and crafts that her children make that they don’t take home, and she’ll take care of your kids if you have any. Everyone calls her Mama.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "wuZxpaMX5UMNsBvU","flags": {},"type": 0,"text": "A young witch who smells of alcohol. For some reason, she cursed herself to be constantly intoxicated. She only uses fire magic and anything to get her more drunk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "enboQFw6IawqRUwH","flags": {},"type": 0,"text": "A fat man who yells a lot. He sells mead he homebrews himself. Is he deaf? Maybe he’s deaf.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "RCVBpto03QXI1COz","flags": {},"type": 0,"text": "This kid claims to have an invisible cow, and he sells the milk. When you try and prove him wrong, a long moo comes from seemingly all around you. I guess he does have an invisible cow. Drinking the milk turns you invisible for a few minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "QYtVmKWm2OkcIiOJ","flags": {},"type": 0,"text": "This man sells wagons of all shapes and sizes. From wheelbarrows to horse drawn carriages, he makes them all by hand. He’s known for being very precise when he stains the wood, also by hand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "mwJwBH9xmXqbUgGe","flags": {},"type": 0,"text": "A tabaxi with shaggy fur sells livestock, who are all acting strange and annoyed. She swears they aren’t stolen. Stop asking.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "1SwdrdemekO1Gb47","flags": {},"type": 0,"text": "A royal guard with a scrawny body and weak chin. He’ll give you the latest gossip on the town for a few coins. He’ll tell you regardless, then get annoyed when you don’t pay.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "ANs6bTygirb3EqTg","flags": {},"type": 0,"text": "An aarakocra chicken who sells healing potions. The potions are contained in eggshells and look like normal eggs, if a bit larger than the usual. The merchant will fluff up and squawk indignantly if a PC wonders whether the merchant laid the eggs. She will scratch in the dirt and wave a feathered arm angrily. ‘NOT my—bawk!—CHILDREN.’ The potions all heal an extra 2 HP, but the shells are fragile.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "5SEVxkMpLjXYreU7","flags": {},"type": 0,"text": "Legitimate Larry. He’s so legitimate that his collection of obviously stole items obviously must have just fallen off the back of a cart.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "gTkONAW2RXUboe1m","flags": {},"type": 0,"text": "A Halfling Artificer and Tinker, with a broad smile and gregarious nature. He produces intricate, ingenious mechanical devices for adventurers. The shop he operates out of is built-to-halfling-scale, though. To broaden his customer base, he has fitted every shelf, display, and even the front wall of the building with a complex system of rails and slides, allowing him to do business with anyone, and display anything, all at the customer’s eye level.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "VWtjvaZ30eBxeN2A","flags": {},"type": 0,"text": "What appears to be an EXTREMELY tall halfling woman, but when she walks around the counter, she is simply wearing the tallest pair of platform shoes you’ve ever seen. All she sells is shoes. Some of the shoes are enchanted, but many are just ‘fashionable’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "9kOgpqoPtlcsODEb","flags": {},"type": 0,"text": "A tortle that, when it approaches, it appears the shell has been carved to look like tattoos. When he speaks, he has a deep slow tone to his voice (imagine Johnny Cash). He sells books and scrolls and writing equipment. He is never in a rush to make a sale as he enjoys the act of bartering but always ensures he makes a profit. His stock often holds rare or even forbidden books. When asked, he will just shrug and say something about not knowing or forgetting the book was there. He of course houses lots of spell scrolls at different levels and will even sell a few spellbooks from wizards that gave either passed or given up that life.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "1D0CCHYmYxdXPKY7","flags": {},"type": 0,"text": "Bobbik and Bimbeck’s Curiosities: Mr. Bobbik is a bespectacled Beholder with a friendly and inquisitive nature. A true oddity in his species and as such shunned entirely from polite underdark society. In his travels, he met Mr. Bimbeck, who was exploring caverns looking for interesting rocks and a lifelong friendship was formed. The two of them sell all manner of strange and unique things. They probably don’t have EXACTLY what you are looking for, but they certainly have something of interest. Example Inventory: A potted plant with a bell on it (So it can’t sneak up on you), a warhammer that you can fill with angry bees, Aardvark poison, Aardvark medicine, a clockwork thing you don’t know what it does that has a bell on it so it can’t sneak up on you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "bcIknFKTzdQ3HCGQ","flags": {},"type": 0,"text": "Sister Elma: She claims to be a Nun and sells holy symbols and dubious reliquaries to travelers. Example Inventory: Martyr’s Big Toe on a string, desicrated left testicle of a legendary bard, mostly accurate holy symbols at discount prices, bag of bones from a legendary warrior (or a chicken, depending on perception checks).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "tn668VqscuU7zYMC","flags": {},"type": 0,"text": "Bob and Rob Oblah (And Hobble their Goblin assistant): An Ettin with 4 eyes for values! Not the brightest, but with a natural sense for what things are worth and if they are being cheated or short-changed. The two heads can be played off of each other in the process of haggling. Hobble the Goblin mostly just stares daggers at the customer and polishes the counter. Example Inventory: Magic Items, hand made Goblin crafts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "mLNkzTRfJLff1AMC","flags": {},"type": 0,"text": "A new gnomish invention that automatically dispenses a piece of gum that works as a healing potion if the proper amount of gold is inserted. Roll a d20 when using the machine. On a 20, two pieces of gum come out. On a 1 the machine jams and no gum comes out. Has tamper resistance enchantments that destroy the gum if the machine is broken into.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "mAH9Bwac74TnkEVB","flags": {},"type": 0,"text": "A dwarven barber that uses magical shears. Cuts their client’s hair to be longer, not shorter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "KfvKrKSDkpNL89VW","flags": {},"type": 0,"text": "A Tabaxi merchant sells beautiful glassware and fine china, things that an adventurer would probably never use. Symbols on his shop in thieves’ cant suggest he may also be a fence, although they are confusing, crossed out and re-written. The Tabaxi, a dark-coated young merchant named Many Hidden Knives, is boisterous and eager to gossip.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "ZxjI4k2bWYUzbGF4","flags": {},"type": 0,"text": "The shopkeeper is clearly two gnomes with one on the other’s shoulders, but they will never admit it. The two, Foggi Ysbeten and Grogel Grogelhome, take turns being the one on top, but never acknowledge the difference. They sell ‘human-sized’ equipment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "R7LsPCsUOIpGKyDB","flags": {},"type": 0,"text": "The Broad’s Boards: An extremely tall, stunningly attractive blonde woman named Nyss sells shields of different makes and models. Has some magic shields, some bucklers, and some tower shields too big for the average man.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "cv5LAfa0He1L3f48","flags": {},"type": 0,"text": "A Goliath, considered large even among his own tall people, known only as ‘The Builder.’ He crafts intricate toys, gadgets, and trinkets. Working from inside a wagon pulled by two Clydesdale horses, he hunches over his desk with a lantern and a magnifying glass, working his massive fingers to build tiny, detailed devices. If he meets a child, he always gives them a toy for free. He never accepts gold as payment, only more materials for crafting, or if the need arises, a personal favor. He can be commissioned to build specific devices, but prefers not to unless he knows the person well. He sticks to rural towns and villages and defends himself with a myriad of clockwork like devices that are beyond most people’s understanding.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "Wk4h6x05izOi1eGF","flags": {},"type": 0,"text": "Azaeli, A devilish tradesmen. A man of true evil. Holds some of the best gear around and sells them very low as well, but they come at a cost, Azaeli gives the buyer a quest of true evil intentions. Rather it be spreading a plague, or allowing crime syndicates to florish, a seemingly useless action that has large impact on the nearby areas. Azaeli has a pair of seemingly burning eyes, is often found to be wearing a top hat and very expensive silk clothing. In his backstory Azaeli, was once a normal True neutral, human warlock, until one day Azaeli attempted to banish a powerful demon. It succeeded but as soon as he cast it he was possessed causing a merge of souls. Azaeli became a devilish sellsman who roams the globe causing mayhem.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "ZqjAyQgJ3PQDDQLA","flags": {},"type": 0,"text": "Whilst walking through through the run down boroughs of a large city you spy a strange exchange down one of the numerous labyrinthine alleys. A rather large and motley crow sits upon a busted crate. At the base of the crate an alley cat, accompanied by a scraggly litter of kittens, approaches the crow and drops what looks to be a shiny piece rubbish. You look on as both the cat and the crow seem to converse, the low cawing of the crow meeting the desperate meows of the cat. Eventually some sort of accord seems to be struck, and the crow produces a large half eaten fish, dragging it from the crate and letting it plop down on the dirty ground bellow. Immediately the mother alley cat picks up the fish and darts off, her kittens tumbling along behind her. Those who wish to stay and observe the crow for longer will discover that all manner of strays, ferals and other wild denizens of the alleys approach the crow throughout the day, including one or two beggars and street kids. Each time something shiny is produced, and an item from the box given. Sometimes food, sometimes junk, and at one point even a dagger (given to a street kid) is pulled from the crate. At sundown several more crows gather at the spot in the alley and begin to fuss around the crate. Eventually they all take flight, labouring under a sack clearly laden with goods. They cary the sack high above the roof tops, eventually disappearing from sight, their mysterious trade having officially closed for the day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "jwMAsJapo6ADDvjD","flags": {},"type": 0,"text": "A series of animals who seem to run every magic shop the party goes’s to. They’re capable of communicating via telepathy, but mostly prefer to make animal noises. Probably the familiars of some old mage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "uG2n5COwQshFUblg","flags": {},"type": 0,"text": "A very short wizened old man with a wispy mustache. He runs a pet shop and seems to always be talking to himself. When someone enters his shop he will grab them by the elbow and begin walking them around to all the cages and kennels and tanks. No matter what they say, he’ll respond with things like ‘Yes, he is a bit tall, isn’t he?’ or ‘Now don’t be rude, he doesn’t smell that bad.’ or ‘Ah yes, I remember. You don’t want a single pet, you want to adopt a whole family.’ Finally he gets to one animal and says ‘Eh? This one looks good to you? Excellent!’ He then picks them up out of the cage, hands them to the person – again, regardless of whatever the person is saying – and then says ‘Now there is just the little matter of payment …’. Which is when the animal bites or claws the person and then gives the store owner a single drop of blood. Because he doesn’t sell pets to people, he sells people to pets.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "56MtyLc43MIcoVJ5"}
