{"name": "Weapon Runes","description": "One hundred magic runes that can enhance a melee weapon.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "tMLWrZ7OuE8gqMw4","flags": {},"type": 0,"text": "Rune of the Wind: When an enemy is struck with this weapon, the must make a DEX saving throw or be blown back 5 ft.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "NOl9ojBp8PRtmjFs","flags": {},"type": 0,"text": "Rune of the Squirrel: Grants advantage to the acrobatics skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "btCNRfGIIqpZqjYK","flags": {},"type": 0,"text": "Rune of the Dog: Grants advantage to the animal handling skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "23XWaQ6OtdG4CGzF","flags": {},"type": 0,"text": "Rune of the Raven: Grants advantage to the arcana skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "EPHuXXme15pOmCZL","flags": {},"type": 0,"text": "Rune of the Bear: Grants advantage to the athletics skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "5ryx0HVhJgeiAuQl","flags": {},"type": 0,"text": "Rune of the Snake: Grants advantage to the deception skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "F0ZIucyztUvQiWOz","flags": {},"type": 0,"text": "Rune of the Elephant: Grants advantage to the history skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "X65rEPyTplxSHFKw","flags": {},"type": 0,"text": "Rune of the Owl: Grants advantage to the insight skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "QW6dBEyD7PyQ4xW9","flags": {},"type": 0,"text": "Rune of the Lion: Grants advantage to the intimidation skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "18aEjkq6USpYxchM","flags": {},"type": 0,"text": "Rune of the Crow: Grants advantage to the investigation skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "CYSo8fSEZRc4RV63","flags": {},"type": 0,"text": "Rune of the Lobster: Grants advantage to the medicine skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "JcGCvjMSFRJ0CVeY","flags": {},"type": 0,"text": "Rune of the Elk: Grants advantage to the nature skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "MkZd6llH0oI2g5Oz","flags": {},"type": 0,"text": "Rune of the Eagle: Grants advantage to the perception skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "VmmM1Yg8CArWyItw","flags": {},"type": 0,"text": "Rune of the Peacock: Grants advantage to the performance skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "4FsWBMIuFS9VYMW1","flags": {},"type": 0,"text": "Rune of the Feline: Grants advantage to the persuasion skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "FVdkLoXht0rWCWT8","flags": {},"type": 0,"text": "Rune of the Mantis: Grants advantage to the religion skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "HR0tM84XgZhsGaUe","flags": {},"type": 0,"text": "Rune of the Spider: Grants advantage to the sleight of hand skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "RaDV9g8ovvKG3vRF","flags": {},"type": 0,"text": "Rune of the Chameleon: Grants advantage to the stealth skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "zyBXnPDSzjkYq5an","flags": {},"type": 0,"text": "Rune of the Cockroach: Grants advantage to the survival skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "vJDAjtgGyFHXKPPh","flags": {},"type": 0,"text": "Rune of Orcus: any humanoid creature of size large or smaller killed by this weapon rises as a zombie under your control for 20 minutes. After 20 minutes, the zombie collapses and turns back into a corpse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "4M1VXbL5nO9YK0hP","flags": {},"type": 0,"text": "Rune of Confusion: every time a creature is hit by this weapon, it must make a charisma saving throw against a DC equal to 8 + wielders prof bonus + wielders strength modifier (or dex if it’s a finesse weapon). On a failed save, the creature has disadvantage on its next attack against the wielder. Once a creature succeeds against this saving throw, this rune no longer affects it until its next long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "14L8v9qDrCpneeIw","flags": {},"type": 0,"text": "Rune of Defense Crushing: each time a creature is hit by this weapon, it must make a strength saving throw against a DC equal to 8 + wielders prof bonus + wielders strength modifier (or dex if it’s a finesse weapon). On a failed save, the creatures armor class is lowered by 1. This rune may not bring a creatures armor class below 10 + their dexterity modifier.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "OkfDUcWZvLVEgNMo","flags": {},"type": 0,"text": "Rune of Unjo (Joy and Wellness): The bearer of this rune is able to stave off one level of exhaustion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "P3hWJlxdRgT6LzFS","flags": {},"type": 0,"text": "Rune of Hagalaz (Chaos and Destruction): The bearer of this rune can cast Thunderwave once per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "4dRhqpmTrCfPZaus","flags": {},"type": 0,"text": "Rune of Pertho (Protection from enemies): The bearer of this rune can cast Protection from Evil one per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "XxJSLHqHUpJ3Q5w2","flags": {},"type": 0,"text": "Rune of Ehwaz (Trust, faith and companionship): the bearer of this rune can cast Bless once per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "mEhEqXxvpanrZUXH","flags": {},"type": 0,"text": "Rune of Swordbreaker: If the wielder is attacked with melee weapon and the attack is a critical failure, the player can break the attacker’s weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "g4zMk1Y22qeatKXq","flags": {},"type": 0,"text": "Rune of Leaden Steps: adds 10 pounds to the target’s weight on each attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "tSL5Ws9YjYN4WR00","flags": {},"type": 0,"text": "Rune of Vaporization: Once a day you can submerge the weapon into water and vaporize 1d20 cubic feet of water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "6kXfhcQl6EQnysRs","flags": {},"type": 0,"text": "Rune of Returning: Once etched on the weapon, it allows the user to call the weapon into their hand if it’s within 10 ft.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "pGhrE4B7z7QUrxl6","flags": {},"type": 0,"text": "Rune of Safety: Renders the edges/points of the weapon dull when children touch the weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "NyIWPSg7GIac7qNq","flags": {},"type": 0,"text": "Rune of Green Thumbs: If the weapon to be planted in soil, a 30 foot tall tree will out of it in 1d4 days. The weapon is destroyed in the process.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "x5RJ57NHJCNV69GQ","flags": {},"type": 0,"text": "Rune of Invisibility: Makes the weapon appear invisible to all, except for those designated by the rune-maker.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "QsS8isYkl18nHzAZ","flags": {},"type": 0,"text": "Rune of Poison Detection: If the weapon is dipped into poisoned food, the hilt changes color. The colors return to normal once poisoned is removed from the weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "h7WFbxhPLhH2BhNc","flags": {},"type": 0,"text": "Rune of Screaming: When the weapon this rune is inscribed upon strikes an enemy, the target must make a Wisdom saving throw with a 13 DC. If it fails, the target starts screaming uncontrollably for 1d10 minutes and is terrified of the attacker.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "jMCKz7k7fsMiArk7","flags": {},"type": 0,"text": "Rune of the Cliff: Allows the casting of Featherfall on command.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "oE9bj18uayJWQgTt","flags": {},"type": 0,"text": "Rune of the Worg: This weapon seems easy to hold in your mouth, you don’t know why. You can now use your mouth as an ‘arm’ to hold this weapon – even if it requires two hands. You also know how to run on four legs like a beast (Your speeds increases by 10 ft. while doing so). You have disadvantage to make weapon attacks with your arms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "35RZcRgWjH4p9AlQ","flags": {},"type": 0,"text": "Rune of the Gryphon: When this weapon is swung upward, your jump distance is multiplied per 10. If you manage to hit an enemy while falling, you ignore all falling damage. If you keep swinging this weapon while spinning you might fly…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "0o3QdmB8zEdtnLxD","flags": {},"type": 0,"text": "Rune of the Manticore: The weapon inscribed starts growing 1d10 spikes each day that, if removed, can be thrown as daggers with the range of a Longbow, or used as ammunition for the inscribed weapon. A weapon can have up to 10 spikes if one handed or 30 if two handed. The spikes seem very efficient for impaling or piercing hard surfaces like rock. If you leave a spike grow for a week, it becomes the length of a short sword; for a month of a longsword; for two months of a spear and for three months of a pike. All these weapons can be thrown at the range of a Longbow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "dR4RnEbae1nLSSkK","flags": {},"type": 0,"text": "Rune of Fire: This weapon’s damage type has changed to fire.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "8msqF4Edu61U2ksU","flags": {},"type": 0,"text": "Rune of Ice: This weapon’s damage type has changed to ice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "m9mLqvv3AP8R1TRW","flags": {},"type": 0,"text": "Rune of Mirrors: Once per short rest, as a bonus action, the user can break this weapon into two identical copies of the original. If either copy leaves the possession of the character who broke the weapon in two, the copy disappears and the effect is ended.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "S7EwZERkgzblqFVi","flags": {},"type": 0,"text": "Rune of the Firebreather: This weapon, when slashed, creates a ten-foot line of fire. All creatures in the line must make DEX save or take 1d6 Fire damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "v6UNWIa5SsBGlsdp","flags": {},"type": 0,"text": "Rune of Echoes: The wielder must make a noise into the enchanted weapon. When this weapon attacks, it leaves behind a rune on the target object. This rune continues to repeat the noise that the wielder recorded earlier, acting as a distraction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "APtVcsKiE1oQgRwF","flags": {},"type": 0,"text": "Rune of the Kebab (pike or spear only): As an Action, you cause the weapon to grow outward then retract in a 30 ft. line. Make an attack against every creature in this line.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "VYZpF5pTjuMNwVqu","flags": {},"type": 0,"text": "Rune of Helium: Once in a long rest as a bonus action you can put your weapon in front of your neck and make your voice squeakier like that of a mouse. You have an advantage on performances check and intimidation check against Large or larger creatures that are capable of hearing you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "lejQqsOVFlpmCifj","flags": {},"type": 0,"text": "Rune of Sulfur Hexafluoride: Once in a long rest as a bonus action you can put your weapon in front of your neck and make your voice deeper like that of a dragon. You have an advantage on performances check and intimidation check against Medium or smaller creatures that are capable of hearing you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "NwEpU7bYZdUk5NAE","flags": {},"type": 0,"text": "Rune of Wild Magic: On a critical hit with this weapon, roll on the Wild Magic Surge table to create a random magical effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "mFMLguNdBXQ7ajJ9","flags": {},"type": 0,"text": "Rune of Snail Shell: This weapon or shield is nearly unbreakable by non-magical means, however becomes so dense and heavy that it effectively eliminates any dex bonus the player has to their AC.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "9aSfNXrYdKjyUm8M","flags": {},"type": 0,"text": "Rune of the Bull: Any weapon or shield this rune is attached too gives the player advantage on attempts to shove large or smaller creatures. Shove attempts send the target back 5 feet more than usual.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "bHGPEpPWsLHoZalg","flags": {},"type": 0,"text": "Rune of the Phoenix Feather: This rune provides the item it is slotted in, to turn into flames dealing 1 fire damage per round to players and creatures unless they have fire resistance. The item magically reforms if it is ever destroyed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "eW4c63OobdGC4KgQ","flags": {},"type": 0,"text": "Rune of Absorbing: Once per day, you can spend a minute to change the material of the weapon to any material that it is in contact with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "yYMK9u0gahWU09WS","flags": {},"type": 0,"text": "Rune of the Open Door (any bludgeoning weapon): This weapon deals double damage against structures. Any damage done to the structure using this weapon does not affect the stability of the structure. (For instance, this weapon can create a hole in a load-bearing wall while the rest of the building is unaffected). This structural protection effect ends after 1d4 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "Hon6mFw5LkYGRvXa","flags": {},"type": 0,"text": "Rune of Terran Blessing: The wielder cannot be knocked prone by any environmental hazards (earthquakes, slippery ground, falling rocks, etc.).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "ZXDMz31YZXZYOrzG","flags": {},"type": 0,"text": "Rune of Heaven’s Fan: when this weapon is swung, a gust of cool wind is released, extinguishing fires and briefly turning the ambient temperature tolerable regardless of its previous state. Twice a day, the wielder can slash the weapon downwards to create a 40-ft long, 5-ft wide blast of downwards wind that forces everyone hit to make a STR save or be knocked prone (if flying, they’ll fall out of the air), with DC potentially modified by one’s own eight. This ability slaps most projectiles out of the air, and can be used as a reaction to a projectile attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "1GUx3aRQsccYSLrS","flags": {},"type": 0,"text": "Rune of Time’s Shadow: any attack made with this weapon is repeated by a translucent, phantasmal shadow of it on the next turn at the same location. That shadow attack does the same damage, but can only hit an enemy in the same space as the original attack’s target.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "CNXutrI6ofIisaz9","flags": {},"type": 0,"text": "Rune of Death’s Tongues: any successful hit with this weapon causes hungry, flesh-eating worms to spontaneously appear where the weapon hit. As they burrow into the wound, they prevent regeneration from the damage dealt, and deal 1d6-4 poison damage each subsequent round for 1d10 subsequent rounds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "04aZ6exYGVHNglyL","flags": {},"type": 0,"text": "Rune of Fire’s Wake: things hit by this weapon release a cloud of thick smoke that visually obscures an area of 10ft radius. Enemies or at least partially empty containers hit by this weapon fill up with a thick smoke. Those hit make a CON save as their respiratory system fills up completely with smoke; on a success, they expend their upcoming bonus action to cough out the smoke, but on a failure, they lose their upcoming action to do so.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "8FHd7L6RboDalMnc","flags": {},"type": 0,"text": "Rune of the Journey: any enemy hit by this weapon makes a WIS save; otherwise, they will spend their upcoming movement to double back on the last turn of movement they took. If this takes less movement than their speed, they can use the remainder of this turn’s movement normally. If doubling back proves impossible (e.g. on the last turn they moved, they dropped from a high ledge, but on this turn it’s impossible for them to jump back up onto that ledge) they will still try to go back on that path if a logical alternative (in this example, climbing a nearby staircase to get to that ledge) is obvious to them. If no logical alternative presents itself, the effect is broken.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "sbJmrArmDrgqKdhG","flags": {},"type": 0,"text": "Rune of the Immanence: the wielder may cast Misty Step once per day. With the proper material components, the wielder may cast Plane Shift once per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "yMdplfuEGBFM6eZH","flags": {},"type": 0,"text": "Rune of the Inhabitance: the wielder gains the effects of a short rest on a critical hit with this weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "r1lcAvnznia1oDqJ","flags": {},"type": 0,"text": "Rune of Fehu (Wealth, Fulfillment, Fire): the wielder of this weapon may activate this rune once per day for the duration of one encounter, causing the weapon to burst into golden flames that deal extra fire damage. Successful hits while the rune is active cause 2d10 gp to fall from where it hit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "hIJA9oDzBuQEQGce","flags": {},"type": 0,"text": "Rune of Gifu (Gifts): the wielder of this weapon can freely teleport this weapon into the hands of another creature they can see within 120 feet. This method of transference does not harm the recipient, but will displace any objects they are currently holding. This ability stores three charges and regains one charge per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "S0jUrpI3kEBzhXyc","flags": {},"type": 0,"text": "Rune of Alliance’s Might: this weapon gains 1d6 extra damage of the type it would normally deal per person allied with the wielder in 60ft.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "NIYxMW1zcLhV1alJ","flags": {},"type": 0,"text": "Rune of the Carousel: Causes sentient beings struck by the weapon to spin uncontrollably at a fairly high speed for a few seconds. The affected must pass a DC 7 Constitution check or lose their turn as they try to regain their bearings and not vomit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "ToEJvzyn92Cwwiwl","flags": {},"type": 0,"text": "Rune of Refraction (Melee Weapon Only): The weapon refracts light strangely causing it to look broken (e.g. when observing a straw above and below water-line at an angle) causing everyone but the wielder to have trouble discerning its actual location. +1D4 to Attack Rolls & +1 AC against Melee Attacks to adjust for enemies not being able to block/dodge as easily while giving them mild motion sickness as they attempt to track the actual location of your weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "tE5NvBlWqasn1lZi","flags": {},"type": 0,"text": "Rune of a Stranger: Once per long rest, if you invoke this ability, every creature in the battle has to succeed a DC 10 WIS save or forget your alliance for one round.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "5eDJDINVY9VFGpHl","flags": {},"type": 0,"text": "Rune of Enlarging: When you touch this rune as a bonus action your weapon becomes bulky and now has the Heavy Tag. During this time your weapon deals an extra 1d6 of damage on each successful attack. This transformation ends after 1 minute, if you drop the weapon or if you touch the Rune again as a bonus action. Using this ability on a weapon that already has the Heavy Tag has no effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "07kZ1PYH69ZLpRaI","flags": {},"type": 0,"text": "Rune of the Goose: On your turn, you may reduce your bonus to hit by half when you make an attack. On a successful hit, the target must make a DC 8 + your weapon’s bonus to hit Wisdom saving throw, or become frightened for 1 minute. The affected creature may repeat the saving throw at the end of each of its turns. Once you use this rune, you cannot use it again until after a short or long rest. You may apply up to 3 Rune of the Gooses to gain additional uses of this feature between rests, 1 use for each rune.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "JdWgL6c1UN3whKPt","flags": {},"type": 0,"text": "Rune of the Dawn/Zenith/Dusk/Midnight Shine: During the corresponding time of day, lasting two hours, the weapon shines as under the effect of the Light cantrip, and deals an extra 1d10 radiant damage. (Upon rolling the rune, you may roll a d4 to determine the corresponding time of day.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "ouFkDC6sZYnOhMga","flags": {},"type": 0,"text": "Rune of Bloodlust: While using the weapon, you can enter a rage once per long rest, with the features of a level 3 Barbarian’s rage (minus Primal Path benefits). If you have a Barbarian level greater than 3, you may use your own rage features (including Primal Path ones) while entering this rage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "CatsDFkRgmzg1210","flags": {},"type": 0,"text": "Rune of Melody: In combat, the weapon emits a soft, musical humming. With practice, you may use the weapon as an instrument.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "BafW8RW5JfIEtTd1","flags": {},"type": 0,"text": "Rune of Celestial/Fey/Fiend/Elemental/Undead Slaying: The weapon shines when a creature of the appropriate type is 30 ft. or closer. The wielder is protected from those creatures as by the Protection From Evil And Good spell, and the weapon deals an extra 1d6 damage against them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "pTEpnoLkrjedfDcn","flags": {},"type": 0,"text": "Rune of Foresight: You can use the weapon once to cast Augury as a 2nd-level spell per short rest. Wisdom is your spellcasting ability for this spell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "e4GayBfy2M7ujWSh","flags": {},"type": 0,"text": "Rune of True Strike: Every time you attack, roll a d10. On a 10, you gain advantage on your attack roll and, upon a successful hit, you can roll for damage twice and choose either result.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "9alrIbCMycsHA3xC","flags": {},"type": 0,"text": "Rune of Vampirism: Every time you hit, roll a d4. On a 4, you regain an amount of hp equal to half the inflicted damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "uexxaklZPS1B3NHz","flags": {},"type": 0,"text": "Rune of Arcane Storage: You may store up to 5 levels’ worth of spell slots within the rune. Doing so requires 10 minutes per level, consumes the spell slot, and counts as a ritual. If you are touching the rune while casting a spell, you may choose to consume an amount of stored levels equal to the level of the spell instead of your own spell slots.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "IgxwZ8RTgE5iofka","flags": {},"type": 0,"text": "Rune of Truth: When a creature speaks a deliberate lie within 15 ft. of the rune, the weapon vibrates slightly for a few seconds. Detecting this vibration is no challenge, unless the wielder isn’t paying attention to the weapon’s response.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "7YkUw41dbu0Ufi05","flags": {},"type": 0,"text": "Rune of Speed: While holding the weapon, you can use the Dash action as a bonus action on each of your turns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "rZTc5THov1FAYVHj","flags": {},"type": 0,"text": "Rune of Wild Magic: On a critical failure using the weapon to attack triggers a Wild Magic Surge. Effects that require targeting are directed at the creature closest to the wielder.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "Y2c4bWOVYBhpOlJG","flags": {},"type": 0,"text": "Rune of Aquan Blessing: Wielder’s base speed increases by 10 ft. anytime it is raining or they are standing at least ankle deep in water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "ZYtCnAf1AEJe54dP","flags": {},"type": 0,"text": "Rune of the Primordial: Wielder can speak Primordial, and has advantage on Charisma checks on creatures that understand it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "EFCnEud4BTrxu9dj","flags": {},"type": 0,"text": "Rune of Transformation: As a bonus action, on a successful Intelligence skill check, the wielder may cause the weapon to turn into any other weapon they are proficient with. No ammunition is produced this way. The weapon reverts to its true form after one hour or if the wielder loses hold of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "xW1tI0xGMWM17lvL","flags": {},"type": 0,"text": "Rune of Reflexes: You can use an extra opportunity attack per turn with this weapon, in addition to your reaction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "afe3K6ncjMByjDaj","flags": {},"type": 0,"text": "Rune of Bombardment: You can activate this rune with a power word of your choice. One turn after activation, the weapon will produce a 3rd-level Fireball spell centered on itself. This destroys the weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "6IsqSJU6cGW38GHR","flags": {},"type": 0,"text": "Rune of Vanishing: The last rune to be carved into the item. Upon completion all runes carved into the item vanish from sight and are only visible to the creator of the item.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "bHFTw2iFi2c8H6kG","flags": {},"type": 0,"text": "Rune of Life: This greater rune of enchantment gives item wielder immortality. He will not age, get sick or be harmed by poison. Normal damage and weapons will still kill him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "3qFvq11iCqp4kKzx","flags": {},"type": 0,"text": "Rune of Alarm: This rune will begin to glow (or emit audible alarm) when certain type of creature (Dragonkind, undead, bald men…) approaches within certain range.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "pA7GRdTNB3H63iRH","flags": {},"type": 0,"text": "Rune of Possession: Unless the weapon is freely given or taken from its owner upon their death, this rune refuses to be attuned to another person. In addition, non-owners take -4 penalty on attack rolls if they attempt to use in the first round of combat. Subsequent rounds of combat, the weapon heats up and the holder takes 1d4 points of damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "nVkR9AjSP0xLAW7M","flags": {},"type": 0,"text": "Rune of Sundering: When using the weapon to sunder objects, take a +4 bonus to attack rolls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "jvVFL86Kgoqm6PNK","flags": {},"type": 0,"text": "Rune of Spirit: Grants +2 morale bonus to attack rolls. In addition the weapon gains the ghost touch trait.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "PiSkPrt2lSzVWEF0","flags": {},"type": 0,"text": "Rune of Auran Blessing: Wielder gains advantage on Animal Handling checks against creatures with a natural flight speed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "perpDdL6iBeFglgG","flags": {},"type": 0,"text": "Rune of Returning: When the weapon is lost or stolen, it will always return to its true owner’s side after one long rest, along with one-piece ammunition if it’s a ranged weapon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "LRkqCmEcvFXM7z0L","flags": {},"type": 0,"text": "Rune of the Impersonnel: Once per turn when melee attacking using this weapon you can teleport to the opposite side of the creature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "kUlsbmG7MarK39WE","flags": {},"type": 0,"text": "Runs of Diplomacy: This rune allows the user to cast comprehend languages 3 times per short rest, the rune also gives you proficiency in the persuasion skill, however, due to the rune’s desire for peace, the rune gives -2 to attack and damage rolls against good aligned creatures.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "u6TMhjqVHo1XqNV1","flags": {},"type": 0,"text": "Rune of Stone: Typically engraved on mauls, maces, and hammers, it is found on some heavy swords. This rune, it’s said, makes your weapon unbreakable in battle, and allows you to smash through enemy defenses, and cut through stone as if it were flesh.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "jgPPmamstbADSDUg","flags": {},"type": 0,"text": "Rune of Bees: Once per long or short rest, this rune allows the user to summon a swarm of bees to deal 2d4+2 Piercing or Poison damage as a bonus action. The user also gains a strange fondness for flowers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "xHO90sgtx3UMH5dT","flags": {},"type": 0,"text": "Rune of the Duelist: When targeted by an enemy melee attack, you may impose disadvantage on the attack as a reaction. If the melee attack misses, you may attack the enemy who just attacked you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "LtpQ6QJ8SjJ1da8M","flags": {},"type": 0,"text": "Rune of Ignan Blessing: Natural flames in the area around the wielder glow brighter and hotter, shedding light an extra 10 ft. and dealing an extra 1d4 damage when applicable.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "WsPWEjIFVKuW61lR","flags": {},"type": 0,"text": "Rune of Runes: On a critical hit, the rune glows brightly and an additional rune forms on the weapon. Roll a d100 on this table to determine the newly added rune. On a critical miss, a rune disappears. If the Rune of Runes is the only remaining rune and you critical miss, the Rune of Runes disappears.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "lMqB12BgaoEHJJaT"}
