{"name": "Magic Weather and Storms","description": "One hundred magic storms and weird weather.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "EeUu2crTmrHazsiM","flags": {},"type": 0,"text": "Daggerfall: It rains daggers dealing 1d4 damage / round people are out unprotected. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "E5IO0yd7aS96UU8n","flags": {},"type": 0,"text": "Raven Mists: An enormous bank of peasoup-thick mist rolls in and settles. In the thickest part, it causes a choking cough, but the players can push through as long as they can hold their breath. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "JtXzQb3UoP2WLIKj","flags": {},"type": 0,"text": "Counterspell Damp: An invisible dampness in the air that reduces the effects of magical spells (ranges shortened or stopped altogether). ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "JODq7meB0uVjQ2oL","flags": {},"type": 0,"text": "Psychic storm: Random voices can be heard everywhere, whispering horrible things into people’s ears. People out in it too long may go temporarily insane.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "NPp0rKMB98le6SiT","flags": {},"type": 0,"text": "anna from heaven: Hail that is actually just edible food. Small, dense, hard nuggets of sustenance that can be crushed into water or sucked on like a candy. Doesn’t have a strong taste, but collecting a pound will provide a single meal ration. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "zq5Ock0bN5QHoZ0t","flags": {},"type": 0,"text": "Acid Rain: Literal acid rain.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "eEaXOzs1XTKDrCI6","flags": {},"type": 0,"text": "Peacemaker Aurora: Aurora that has the calm emotions spell effect to those nearby ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "zAZpT0DNppE1fsfK","flags": {},"type": 0,"text": "Watertaker: A tornado that targets nearby water sources and drains them ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "qCjVIclDXWtKGgRb","flags": {},"type": 0,"text": "Elemental Spawning: Each drop of water is an incredibly tiny young water elemental. They begin to crawl to the nearest body of water, forming a huge wave knocking over anything in its wake. As they fall, they may try to swarm the party. No damage will be taken, but those plagued by the minuscule elementals will appear to be covered in a layer of water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "Pp4ugmEmMyl7L5Dl","flags": {},"type": 0,"text": "Fool’s Gold Dusting: A dust storm of gold dust, but bottling or capturing it makes it dissolve. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "LIcis67vhC5yl7Sw","flags": {},"type": 0,"text": "Woodsprout: A lightning storm that strikes wooden objects, making them sprout shoots that grow rapidly in random directions ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "wuRvquvupnpAbiuP","flags": {},"type": 0,"text": "Planar Corruption: Tiny portals start appearing everywhere, dropping critters from other planes. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "jy6zsCYclwijBDQC","flags": {},"type": 0,"text": "Hellmouth: Dark clouds suddenly appear in the sky. Lightning strikes between them, instantaneously making terrifying monster shapes stand out from the flashes. Nothing ever actually happens, though. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "aEpaEkXGZQVOTT26","flags": {},"type": 0,"text": "Cats and Dogs: It rains cats and dogs. They do take damage, though, and most die. Some are under the effects of feather fall. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "nhktLmmdTCBOEs5f","flags": {},"type": 0,"text": "Slow lightning. It only travels at walking pace, but is very persistent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "GpzLG4RNfqq1qegz","flags": {},"type": 0,"text": "Djinni Feud: On closer inspection, the storm is in fact two gangs of djinni locked in a bitter feud. To those who can understand their language, they make wildly generous offers to join their side – but can they be trusted?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "tTkwt5YWeMHbUnme","flags": {},"type": 0,"text": "Judas’ mark: Everyone in the party is wreathed with St Elmo’s fire – except one.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "ulDUbiCydfFAdg4R","flags": {},"type": 0,"text": "Ultrachthonian Downpour: Rain so heavy you glimpse tentacled horrors within it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "jOlV4h8pjgLyKT77","flags": {},"type": 0,"text": "Ion storm: A lightning storm that lasts for more than a day. The air in the area becomes so ionized, that metallic objects randomly release sparkles and small lightning bolts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "eejpc1fZkQLPeRCM","flags": {},"type": 0,"text": "Skeletal sleet: Skulls and ground up bone powder fall to the ground ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "g29PEy4i4Zldoys4","flags": {},"type": 0,"text": "Wild Hunt: Snaky bolts of magic dart parallel to the ground. Those struck become afflicted with a persistent Hunter’s Mark. Most people and wildlife caught outside tends to be marked.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "CTpAvf9vaAZm7KI0","flags": {},"type": 0,"text": "Upside-down rain: Puddles form on the ground. Then the puddles then become rain falling upwards, until the puddles are exhausted and the ground is dry. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "KthBvYyMqtKm5Qmz","flags": {},"type": 0,"text": "Fishnado: It’s raining fish. The fish start small and harmless, but gradually become more bothersome (electric eels, puffer fish, sharks) and followed by massive and outright mythical creatures.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "ofycoh1WoBAc8FFi","flags": {},"type": 0,"text": "Cometfall: Magic Missiles rain down causing 1d4 force damage ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "ZufzmzKasQdWgpnH","flags": {},"type": 0,"text": "Olympus passing: A storm appears and the clouds rend, revealing Olympus. This becomes a gate to that upper plane. The storm stays in the area for 3d4 hours. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "WLlIuMupntE5UDKi","flags": {},"type": 0,"text": "Marimo drop: Glowing moss falls from a clear sky. They can be collected and put into globes to be used as a light source similar to Continual Light. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "ZCfNPZ6VqcmE3XRc","flags": {},"type": 0,"text": "Rain of Blood: Classic rain of blood. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "bjPUcgelGShtHwP3","flags": {},"type": 0,"text": "Rain of Fire: Classic rain of fire from a typhoon of magic magma.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "dafVoB4YO89Ny5u8","flags": {},"type": 0,"text": "Sandcloud: Sandstorm, but it falls from clouds of traveling sand rather than blown from the ground as usual.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "zUsPxMOURYSffDsP","flags": {},"type": 0,"text": "Hitchcock’s Omen: A ‘storm’ of migrating birds passes through. Small birds flood around you, run into you, and occasionally claw at you. It ‘rains’ feathers and birdpoop.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "8UR9YXa74hveD31Y","flags": {},"type": 0,"text": "Darkmarch: An enormous column of traveling darkness rolls in and passes through for several days. Sounds like thunder or marching emanate softly from within.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "PtG5skOCYgP7rMrI","flags": {},"type": 0,"text": "Celestial Passing: A huge cloudbank of scintillating puffy clouds blows overhead. They give off thunder-like booms but no lightning, only sprays of light. It rains holy water, accompanied by copious rainbows. Sometimes celestial feathers fall.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "zuTklqwM0iOxIGmL","flags": {},"type": 0,"text": "Pixie weather: It rains beautiful bubbles. A faint laughter of pixies can be heard as they pop.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "qXhlsQnY3DufPixj","flags": {},"type": 0,"text": "Arcane rain: It rains paper in strange languages with unknown diagrams, runes, markings. It also rains droplets of various colors of ink. Most pages are quickly blotted out by the ink, but collecting 200 or so may be enough to decipher a secret. Collecting in the middle of the storm is better, but anyone showered upon risks gaining a temporary form of madness, is temporaily polymorphed, or otherwise affected by some other unpredictable effect. The ink is useless when mixed together but usable as expensive fine ink if individual droplets are collected and mixed with like kin. Articles of clothing left outdoors become tie-dyed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "KOR4QLAvCC2HTOTF","flags": {},"type": 0,"text": "Bloodsucker Swarm: Fell winds blow in bothersome biting creatures from a far away land. You can’t sleep soundly unless you find a way to keep the biters off.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "O0aU2v1ZX5ak1vMR","flags": {},"type": 0,"text": "Negative Thunderstorm – Skies darken. Waves of purple energy crackle across the sky and all color seems to fade. There is a shrill screaming noise, that gets louder and louder for several seconds until a blast of supernatural darkness shoots up from the ground. Creatures struck take negative/necrotic damage and are silenced for a while. Creatures killed by this rise as undead 2d6 hours later. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "CO8ornRgIeb9Pwrr","flags": {},"type": 0,"text": "Flowerfall: A cloud of beautiful delicate petals makes a rain that blankets the surroundings. The storm has a nastier cousin: the pollen cloud.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "QBb8blen7PODeYYt","flags": {},"type": 0,"text": "Gelatinous rain: A gelatinous cube rains down over a certain region, and will form into its cube shape in some time if not dealt with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "1ihvnsCbZYbsePf1","flags": {},"type": 0,"text": "Rain of distrust: Long exposure will make the party fight itself for 1d6 turns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "ftRbZ1SYm38mINni","flags": {},"type": 0,"text": "Cackling thunder: The skies let loose a maniacal laugh that frightens all beings that are outdoors on a failed will save ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "HH1R79qY1JQrOSl3","flags": {},"type": 0,"text": "Rain of animal growth: Any animal caught in the rain will grow by a 1d4 growth modifier.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "RPpEbdSHBZI6sI6U","flags": {},"type": 0,"text": "Doppelganger Rain: The party caught in this weird rain is forced to fight a doppelganger of themselves. The duplicates disappear when the rain ends, so running is an option.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "6ZYVsCAoPUyXFDzO","flags": {},"type": 0,"text": "Furnace Snow: Snow that is unusually hot, and burns people.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "PK4wBh7NKa8TkZR1","flags": {},"type": 0,"text": "Golden shower: It rains little bits of gold, a few put together can equal a gold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "we0bvYca9xNnhVU4","flags": {},"type": 0,"text": "Apathy Rain: Textureless, grey clouds begin to form, stretching further and further across the sky until they touch the horizon in every direction. The air becomes damp, and soon a light drizzle begins to sweep across the land. An observant onlooker may eventually notice that the rain seems as gray as the sky it fell from, and that bodies of water become unnaturally opaque as they are rained on. There is no imminent danger from being exposed to the light shower, but as time goes on, people who are exposed to the drizzle gradually become increasingly apathetic and weary. Being exposed to the rain for a half hour induces feelings of mild tiredness and lazy irritability, while being exposed from 1 to 2 hours leaves a victim uninterested in most stimulation, and unmotivated to do any for of physical activity, even moving. Being exposed for any amount of time longer than 2 hours leaves a person without the will move out of the rain, and with a fading will to live. Exposure to the rain for 4 hours or more will put the victim into a deep coma that requires magical healing to fix, and after 6 hours of exposure, the victim dies as their heartbeat slowly grinds to a halt. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "yLdpGW5qzW6o5SNG","flags": {},"type": 0,"text": "Dancers Rain: White clouds billow unnaturally as what was before a gentle breeze begins turns to sharp gusts. Within minutes it looks like there is a bulging mountain range in the sky, small cloud-puffs reach towards the ground and are tossed back, and strands of cloud are molded it into chaotic patterns and designs. At the storm’s zenith, the cloud wisps touch the ground and resemble dancing humanoids whipping the wind around them. Those that stand within the clouds that touch the surface can hear joyful, rambunctious laughter in the howls of the wind, as though the spirits of the storm are inviting them out to play. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "p7ADjnahtsoVk71M","flags": {},"type": 0,"text": "Ascetic’s boon: Really nasty sleet, but someone who exposes themselves and withstands the bitterness of the whole storm finds all their weapons, clothing, and armor granted a temporary +1 buff.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "wYwTISbz9DbNIk7I","flags": {},"type": 0,"text": "Ghost rain: It’s raining, but the rain seems to pass right through everything. Careful inspection reveals the rain is splashing against and forming puddles on surfaces that don’t exist. It turns out the rain is falling in a parallel plane, or is a memory from the past falling on the land as it was long ago.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "jsX1cKyz7mnpJf1P","flags": {},"type": 0,"text": "Scentwind: A whole bunch of odd smells are blown in on the breeze. Each gust of wind changes the smell entirely. One moment you smell strawberries and creme, then iodine, then fresh bread, then decaying leaves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "c3vGSe0ZKPq8z9iT","flags": {},"type": 0,"text": "Drunken Deluge: It rains mild alcohol. Staying out too long will get you buzzed from the vapor alone. Wild animals become incorrigibly drunk, even the magic ones.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "3YtqyOIpV7nNThj6","flags": {},"type": 0,"text": "Cleansing rain: the rain cleans the clothes of those in it. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "jFj4ykmSAGIih83X","flags": {},"type": 0,"text": "Radiant Light: Bright yellowy white clouds cover the sky. They emit a powerful light, dealing radiant damage per round to whoever is standing unprotected outside. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "uCxZRmbhFr8dGE2w","flags": {},"type": 0,"text": "Oven bubbles: Bubbles of superheated air form. Plant life and untreated wood may spontaneously combust. The bubbles are difficult to spot, and are best spotted by looking for the heat distortions of objects behind them. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "dpWF7CadrXjCxMgl","flags": {},"type": 0,"text": "Underground blizzard: Interior spaces, underground passages, and caves frost over and a light snow falls inside. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "n1jb1uHzXyrWGVOt","flags": {},"type": 0,"text": "Friendly breeze: The air causes people to be friendly to one another as if charmed. People must roll wisdom saves to not hug each other in the streets. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "0S0j0WeLvUJ6himF","flags": {},"type": 0,"text": "Blood Flood: All the blood of the dead crawls from the ground and runs in rivulets towards a pooling location. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "iKkL5b0rlq9xlkyI","flags": {},"type": 0,"text": "Night Plague: Dark clouds cover the sky completely blocking any light from the Sun, the Moon or the stars. Night monsters react appropriately. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "RWkS7bQ8heopyQyq","flags": {},"type": 0,"text": "Out-of-season Autumn: Leaves all fall from their trees regardless of the season and fill the sky with an obscuring field of leaves making flight all but impossible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "oPuLXt0GApjdAcKM","flags": {},"type": 0,"text": "Cyclopes Workshop: A seemingly typical thunderstorm, but each roll of thunder is accompaniment by the silhouette of a mighty creature striking a great anvil behind the clouds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "VSpdpuyJQA5ubRq9","flags": {},"type": 0,"text": "Minegas Mists: A bank of flammable mist settles over the land, igniting the mist burns off a clearing 50ft across. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "4gSQnVbH2Eyo0sJh","flags": {},"type": 0,"text": "Blood Moon: The sky turns a deep red, and 2D6 undead rise from the ground. This involves skeletons, minotaur skeletons, crawling claws, zombies, orc zombies, and beholder zombies. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "XSEzfK0Ij5QjQdiN","flags": {},"type": 0,"text": "Blobdrop: Raindrops from the storm fall short of the ground, instead forming large amorphous blobs of water, they are burst easily. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "zO3VP2ydrraVjWnb","flags": {},"type": 0,"text": "Antigravity storm: A red cloud lightning storm with pink bolts. Wherever lightning strikes, be it earth, a tree, or building, the object or area begins hovering and slowly rises up towards the sky. This effect lasts for 1h, after which all the objects slowly descend.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "s4WjuGhniVYzxQx7","flags": {},"type": 0,"text": "Seedstrike: Seeds fall from the sky, although they do no harm, each that strikes the bare earth makes a might twump, and a fruit tree rises from the ground. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "viNEEcS02m4zM3Yy","flags": {},"type": 0,"text": "War Cumulus: Clouds arrange themselves into imitations of a battle below. After the battle the sky turns a dusky red.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "jSk3FG87Spqi06Lb","flags": {},"type": 0,"text": "Ray-nbow: A local rainbow fires random ray spells in the surrounding area.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "5SjAJLyc2JaUgK8w","flags": {},"type": 0,"text": "Thunderclap storm: Severe thunderstorm. Each round roll a D10 on a 10 all players must roll a con saving throw. On failure 1d6 thunder damage. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "GCJHkOv5KwYRB8zB","flags": {},"type": 0,"text": "Seasonal dysphoria: The weather changes each round between unbearable heat, snow, wind, and rain. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "QRO45fI4oxCdNu0c","flags": {},"type": 0,"text": "Healing potion rain: The sky grows a calming light green. The rain heals at least 1hp per round. Does not effect undead or constructs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "BPY5dFfIOHpDRxeC","flags": {},"type": 0,"text": "Water repellent rain: After the first few drops land on anything, any further drops (of any liquid) are hydrophobically repelled for 1d10 hours. This includes blood the character might spill (minor cuts could become major wounds for example) or anything the character tries to drink.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "UG4HvXF4zEL9cUyN","flags": {},"type": 0,"text": "Summon water rain: Every water droplet is a small puddle. When the droplet lands, instead of a small ‘splt’ you would expect, it ‘splooshes’ into an entire puddle. Tends to lead to massive flooding.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "giZcZn2cSfjWVWiy","flags": {},"type": 0,"text": "Locust Plague: A swarm of locusts of biblical proportions fills the skies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "RS4RdgWjO10e948g","flags": {},"type": 0,"text": "Fog of the Trees: this fog gets you so high that while in it you and everyone else inside forgets who they are. Good times are had, munchies galore. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "qkge1DBN2dfuwCj5","flags": {},"type": 0,"text": "Glass Storm: a sandstorm that is so hot, instead of sand, glass is blown around. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "TMCmeqSLPwprVKyn","flags": {},"type": 0,"text": "Spark showers: instead of water, sparks rain down. Instead of lightning there is either a downward fire spout which never reaches the ground, or bursts of magma. ‘looks like God is welding again’ ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "0TCs2rp3nEkfaj0P","flags": {},"type": 0,"text": "Illusion mist: every creature breathing in it will see other people/creatures , an intelligence or perception check is required to realize if something is an illusion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "qg0md55RUGUpCdrU","flags": {},"type": 0,"text": "Bolt drizzle: Instead of raining water, it rains electricity- but it looks just like falling rain, it’s just little droplets of electricity that steaks down from the sky. Not innately harmful. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "IHyqhvTqHyuN8pPc","flags": {},"type": 0,"text": "Wildcolor Haboob: A blowing wind that changes color of everything it hits – permanently or otherwise. This includes water, skin, hair, clothing, items, etc. The color change is incredibly quick and it cycles through many colors as the wind blows. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "v3LZBgSQx2p8ZnOu","flags": {},"type": 0,"text": "Chaotic Sun: A partial eclipse which can create illusory amalgamations. Creatures who are chaotic recieve a bonus while lawful creatures are penalized. The bonus/penalty does not apply if the creature is in shade. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "JNzs6VyXDGC5I0BW","flags": {},"type": 0,"text": "Time-Storm: A time-storm that freezes isolated pockets space in time, or transports pockets of space backward in time. Also has a slight teleportation effect, you might find you are quite literally beside yourself. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "m3YznV3BJ3NJka7P","flags": {},"type": 0,"text": "Hell Flatus: Sulfurous gusts of wind carry a thick, nasty taste in the air from no discernible source. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "yjUbAG7YmmEy9iT4","flags": {},"type": 0,"text": "Wild magic breath: lasts from 10 to 20 minutes. It’s a strong gust that moves starts by forcing all the creatures 10 ft. in a certain direction. All the creatures in this wind must make a Wisdom saving throw at the start of each of their turns or have to throw a d20 for the Wild Magic Table. If they succeed they are immune to this effect for 12 seconds (2 rounds). ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "B3pZ2kAm3rrFrydv","flags": {},"type": 0,"text": "Lawful Sun: The sun glows blue instead of yellow today. Lawful creatures in direct sunlight gain a bonus to all skill checks. Chaotic creatures in direct sunlight take a penalty to all skill checks. The bonus/penalty does not apply if the creature is in shade. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "vTOKYMpwm0qZ88le","flags": {},"type": 0,"text": "Picturesque Sunrise: All creatures bathed in the light of this sunrise are ‘painted’ with the pinkish-orange glow until the next sunrise. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "Tq3CtXSi2LpCvpTh","flags": {},"type": 0,"text": "Sound-targeted Lightning: Instead of targeting the highest point in the area, this lightning targets the noisiest things in the area. In addition, instead of thunder, the lightning makes a ‘Shhhhhhhh!’ noise. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "7m9S7GeQPOTrjLJ7","flags": {},"type": 0,"text": "Shimmering winds: A breeze flows trough the area, carrying tiny particles of precious gem-dust. Light sources reflect off of it, making the air seems to sparkle. The storm varies by gem type. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "FnhZVd3z9fXHOfsi","flags": {},"type": 0,"text": "Ember-rain: Tiny embers and ash fall from dark clouds in the sky, making the air difficult to breathe, every 2 hours directly under it’s effect applies an exhaustion point. The embers are harmless, and just fade when touching any surface. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "J5C2gv5xltuCg6y7","flags": {},"type": 0,"text": "Kamaitachi’s curse: A sadistic magical dew turn patches of long grass to beds of tiny knives. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "wDPmAO4QPA1ROozM","flags": {},"type": 0,"text": "Meteor storm: An airburst creates a shower of small meteorites. They can be collected. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "hF63dURy9RyUVPrY","flags": {},"type": 0,"text": "Miracle hair treatment: some sort of gel falls from the sky that causes people and objects to grow hair wherever it lands or is lathered. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "b0lRdOZ0r7QZzanT","flags": {},"type": 0,"text": "Silkburst: Billions of high atmosphere traveling tiny spiders were blown off course. They and their silken parachutes fall to the ground blanketing everything in webbing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "IY4cHzPciXDM7Eu1","flags": {},"type": 0,"text": "Silent rain: Anything hit by the rain makes no noise. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "7osZUYxwcN7NPtPB","flags": {},"type": 0,"text": "Invisible hail: a hailstorm which is completely invisible. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "2XJo1UEEfClGk3Ik","flags": {},"type": 0,"text": "Temporal earthquake- a large movie-like earthquake happens and creates an enormous chasm which closes a minute after.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "y0cJ92wwE5nA8HUx","flags": {},"type": 0,"text": "False Scouring: A rain that turns whatever strikes it invisible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "gBpO8nxlGu5PemVd","flags": {},"type": 0,"text": "Ground Aurora: Auroras appear at ground level.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "PonOpFhccvsbfaGW","flags": {},"type": 0,"text": "Fog of Awakening: Temporary awakening spell affects plants and animals in the fog.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "uqC0087fD7XHLTad","flags": {},"type": 0,"text": "Foam Roll: An 100 foot tall mass of foam rolls in across the land. You can still breath, but until it thins out, it’s hard to see.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "pJDiOjR1EekHJShU","flags": {},"type": 0,"text": "Lost River: A wandering river crawls across the land unexpectedly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "JllfUIRp7wEz16zn","flags": {},"type": 0,"text": "Salt Blizzard: A hail of salt","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "bUufZLSlGGTiEOfL"}
