{"name": "Side Quest Hooks","description": "One hundred different side quests for when your players go off the rails!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "3M21QJhZ9VRFKDgZ","flags": {},"type": 0,"text": "A farmer approaches the party and needs help. One of his chickens turns a strange neon green when placed in moonlight, and he needs help figuring out why.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "gMWpWdO9G5N286vc","flags": {},"type": 0,"text": "Your party finds a list of 10 names including someone they are close to. The first 4 names are crossed out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "B4qYEZAIvkpSlGze","flags": {},"type": 0,"text": "A courier catches up to the party. They have been left a run down mansion in the will of someone they have never met. The only condition? It be lived in for 5 days. It is of course… Haunted!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "kygMxtbFhbLjd7Rz","flags": {},"type": 0,"text": "A well known constellation disappears from sight. The village is divided between people who remember it, and those who don’t. The debates begin to spark an escalating series of feuds and fights.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "5Yk4fXkbayB2A4LP","flags": {},"type": 0,"text": "A large river begins to inexplicably stop for 1 hour before sunset.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "IwvnpT6cazetFbkq","flags": {},"type": 0,"text": "You enter a clearing where 2 duelists lash out at one another. The clearing is in a time loop, repeating the duel over and over again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "5Cp2TVz32uePpJgv","flags": {},"type": 0,"text": "Rumor reaches your ears of a traveling merchant peddling sets of cursed sewing needles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "XUSwmPuQIszuvPwU","flags": {},"type": 0,"text": "Old Jeb the farmer claims his sheepdog had puppies, but they all have split tails and he doesn’t know their sire.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "rADK3Bwux4hi8EoE","flags": {},"type": 0,"text": "The sawmill catches fire. The bucket brigade keeps it contained, but it refuses to extinguish after 2 days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "UaX28OTy6c8Q4n1P","flags": {},"type": 0,"text": "For exactly 1 round a day, everyone in town falls sway under the HOLD PERSON spell. Life continues, but everyone is on edge. “Protection” totems begin surfacing in every market shop.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "3DfDXUC6lcahLwiW","flags": {},"type": 0,"text": "Strange, mud-coated animate skeletons have risen in a nearby swamp. They won’t attack unless attacked first and try to speak with anyone nearby, but the coating of mud makes their speech indecipherable.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "4A8uNONBHDTWlqVU","flags": {},"type": 0,"text": "Snowberry bushes only bloom before a blizzard. Collect five snowberry blooms for an alchemist before the storm hits.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "CY7Dj1VD5tpQzXZf","flags": {},"type": 0,"text": "A suit of enchanted armor with dozens of arms has been razing nearby villages. Watch out, each arm holds a hand crossbow, and each one can attack every turn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "CRORxPyqXPz6pQVb","flags": {},"type": 0,"text": "A goblin comes running towards you and yells “he’s coming!” and dies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "7OBgZF3vwxsVRSGj","flags": {},"type": 0,"text": "A small pack of wererats have taken up residence in the city sewers, and keep causing trouble for the locals.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "y094JsSUmEEJHn0i","flags": {},"type": 0,"text": "A farmer says he’s heard strange singing in the night in his corn field, but whenever he goes out to look, he doesn’t find anyone. If that wasn’t strange enough, one morning he found his scarecrows had been moved into a circle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "q5Dzm3VC17UejqPs","flags": {},"type": 0,"text": "The party is told of a local merchant who specializes in Magical items. The merchant’s name is Foezek and is described as an intelligent, compassionate Shedu. But, when the PCs seek out the shop, they find another being claiming to be Foezek and is more interested in them leaving the shop than dealing with them. In truth, this bandit killed Foezek and is dealing his magical items to an adversary of the DM’s choosing. Foezek’s body can be found in the shop (basement, or behind the counter, etc.).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "1Del6KdPM6shVQ4x","flags": {},"type": 0,"text": "The party is walking through a town when they meet an blind old man who is crawling on the ground looking for his ring. A guard watched him drop it and took it for himself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "6fs9e8d2wsQ9977y","flags": {},"type": 0,"text": "The party finds a dagger on the body of an enemy that is much heavier than a dagger should be.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "BELeDmKlQBq3Zb9A","flags": {},"type": 0,"text": "The party wakes up mixed up in each other’s bodies after night of drinking at an inn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "TkoQjghULYrCKg5G","flags": {},"type": 0,"text": "A small chest from the spell Leomund’s Secret Chest falls from the sky. When the party finds a wizard to open the chest is filled with their own equipment, along with a note book keeping track of their actions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "xG2HyBnqRu6XR0D6","flags": {},"type": 0,"text": "The party continues to wake up in the same inn, but different rooms each morning.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "79fIuiXYhkKOarwd","flags": {},"type": 0,"text": "One of the party members is suddenly extremely allergic to cats, the rest of the party members clothes are suddenly made of cat fur. The change in clothing isn’t immediately noticable.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "y8XcyZ6MSY1zn83h","flags": {},"type": 0,"text": "The party is summoned by a king to be his friends for a day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "ai6MDCMucoKg6mDS","flags": {},"type": 0,"text": "There is a bounty out on the dish breaking bandit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "zcTjk1kgW9RNgIO1","flags": {},"type": 0,"text": "One of the party members suddenly starts to sleepwalk, and breaks dishes in his sleep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "5r2LU3LHxztDgbfD","flags": {},"type": 0,"text": "An angry gnome tinkers with the sleeping party’s equipment. Everything now has combination locks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "nN541OOhAMozUHsW","flags": {},"type": 0,"text": "Weird noises have been heard at night coming from an older resident’s home in town. When investigated, you discover a worried old man attempting to disguise his worry at your interest in the noise and his business. If convinced that your aid is genuine, or if more discreet measures of observations are taken, you discover his wife is afflicted with lycanthropy despite having no bite marks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "ns2cZ1FVjHpkgQrV","flags": {},"type": 0,"text": "The local towns people are complaining about a goblin tribe that has set up camp near by. They are acting strange and have begun constructing statues of a goblin with a pointy hat all over the area.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "jzI6nVjGcdUpTe5H","flags": {},"type": 0,"text": "As the party is walking through a road they come across a beggar. He is crippled and asks for some money to help him buy food. As the party continues to walk down the road they find another beggar who looks exactly like the one they just met! When asked he says that he doesn’t have a twin brother or anything of the sort. He doesn’t know what the party is taking about and just wants some coin to buy food. As the party continues to walk they find the same man yet again. He to knows nothing. Upon further investigation they discoverer that the man was once an assistant to a local wizard. And the wizard is an expert in human cloning.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "sBqBuFwaVSEwOhub","flags": {},"type": 0,"text": "The daughter of a local politician/Noble person keeps getting kidnapped by local goblins. The party is hired to solve it once and for all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "Ip4IyBHIuvGiKMw1","flags": {},"type": 0,"text": "A horse with no rider, but fully equipped is walking in the opposite direction of the party. There is a note pinned to it’s saddlebags, “send help!”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "ztKn7aGd2e83aO1r","flags": {},"type": 0,"text": "The party takes a shortcut through a friendly looking forest not shown on their map. It seems oddly silent, and soon notice all the wildlife is deep asleep – including insects and even flowers. As their eyes get heavier and heavier a wild man bursts out of the bushes, eyes propped open.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "d8pgpzU1zmtyCBc4","flags": {},"type": 0,"text": "Traveling through the forest the party is stopped by the sound of a booming voice nearby “Your Wish has been granted!”. Shortly after they come apon a clearing filled red mist and a goblin holding a brass lamp laughing maniacally. The party now has to deal with what stuipd thing he has wished for.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "jE7NsqrfBxuibNGS","flags": {},"type": 0,"text": "You are confronted by a party of identical adventurers, who seem more surprised than you. They have been tracking you down for a long time, following rumours of a party of adventurers giving them a bad name. Worst of all they seem to have been adventuring longer than you…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "I0jZgxynRucpqkKa","flags": {},"type": 0,"text": "Construction of a new museum has been halted when its found that all the workers continue to forget what they’re building, could the new exhibit be to blame?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "WHzmESGscI3frgEF","flags": {},"type": 0,"text": "You’ve gotten word about a logging village up north that has put up a massive reward for any adventurers willing to travel to the village, investigate the rash of disappearances and locate any of the missing persons: dead or alive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "ub2gmHEljdJpUgza","flags": {},"type": 0,"text": "A cranky old man in town complains that his pocket watchers stolen, and he has his suspicions on who the thief is. The townsfolk say that he’s a senile old man who probably lost it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "Nmr9PKmRmicgCw4G","flags": {},"type": 0,"text": "As your party steps through town, you suddenly start to feel the ground shake as a group of Monsterous Centipede’s erupt from the dirt, attacking the party. As they are defeated, it becomes apparent that they were summoned creatures.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "tQPz2dO0Mp4ABsez","flags": {},"type": 0,"text": "One of the party’s magical or valued items has been stolen and is now held in a high security bank in a bustling city. The party must now break into the bank to retrieve their items.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "UC9p3jtA4yg1rJO0","flags": {},"type": 0,"text": "A farmer asks for help. His crops are constantly getting trashed. He wants the group/player to keep watch over the night. It ends up being that the poor farmers’ trusty scarecrow has been brought to life by dark magic. It is optional to buy or make a new scarecrow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "V48kxpP6dBU6KhFm","flags": {},"type": 0,"text": "A PC gets bit by a werewolf. There is a cure for it, however they must convince the mad wizard to give it to you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "poju1jYvbSUtG4MZ","flags": {},"type": 0,"text": "A passing man swears to you that he is a genie who will most definitely grant you three wishes if you return his stolen lamp to him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "sz1URMRFfrxWzmJu","flags": {},"type": 0,"text": "Every town or settlement the party goes to has an outline of a fish stenciled on a main building. The first one is really big and noticeable; the rest are subtle enough that the party won’t see them unless they announce that they’re examining the place. The town where the quest will happen has the WORD “fish” stenciled on a building.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "NCD2yeUpSDA2Ajuy","flags": {},"type": 0,"text": "You come across a trail of blood (unicorn) leading to a spooky forest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "LPYlt0oTWC6kOm7x","flags": {},"type": 0,"text": "The party is followed by an owl, hooting softly, eyes glowing the gentle yellow that might be magic or might be simple reflection. Over the next several days more owls join, until when the group sets down to sleep at night all they can see are hundreds of owl eyes staring down at them. Then, one of the owls scratches a message into the dirt, before flying off into the night- FOLLOW.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "dsxVT9qMsyqd5JRK","flags": {},"type": 0,"text": "An unknown NPC mage has dimension doored into the middle of a fight, after all healing spells have been used by the team. He/She is on death’s door and carrying a note with his/hers killers name. He says a few words before dying.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "LBVnua309L83ZxRw","flags": {},"type": 0,"text": "Graffiti is scrawled on the walls of two buildings in town. It appears to be some sort of code. The messages are marked “1” and “3”. Message “2” is nowhere to be found.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "gMkJeC4Fu8Bk9Fd5","flags": {},"type": 0,"text": "A scrap of paper floats on the wind. It glides on the breeze. Eventually in a gust the paper catches on one of the adventures faces. Tearing it off their face, and looking at the parchment they see it is…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "L8PXlGVLqxmqpOr3","flags": {},"type": 0,"text": "Gold! Adventure! Fame! Cries an elf on a soap box, “the faint of heart need not apply!” (For adventures who need more than obvious plot hooks.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "T6F0OPTJOd52PbfG","flags": {},"type": 0,"text": "Looking off to the distance, they can see a flashing light (similar to a signal mirror). Someone is trying to signal far off. Whether it is aide, is indiscernible to the group as the light stops almost as soon as it starts. There is only one way to find out…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "oHXYVyrYNvxLQDBm","flags": {},"type": 0,"text": "While passing by a pond, you hear a deep bellowing noise, only to see a fisherman trapped by a giant frog. He calls for help.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "qdMJKrbDDUj7sIiX","flags": {},"type": 0,"text": "A paladin with the insignia of a lion’s head on her shield asks you to solve the local pest problem. Turns out the “pests” are full sized orcs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "5Fw2PDPKsljdzKp1","flags": {},"type": 0,"text": "A house outside of town is being circled by hundreds of birds. Upon approaching, the party sees that their beaks are lined with teeth, and the birds are twitching as though trying to escape possession. From the sounds inside, someone is clambering to hide within the building.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "MiLwzJz7znJRgP5o","flags": {},"type": 0,"text": "Kobolds have been attacking the town. All wearing similar regalia and a matching symbol. a raving man claims to have escaped from the kobolds’ lair. He describes a terrible dragon as the source of worship for the kobolds. The dragon is really a pseudodragon with delusions of grandeur, trained in illusion magic and has duped the kobolds into gathering a hoard for him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "yc3dDbkbdzqm6afi","flags": {},"type": 0,"text": "In a large city, urchins are a regular problem. This trio of kidlets, however, has been luring travelers in to abandoned alleyways, where the deranged doppelganger among them eats the human and the other two children keep what was it his/her pockets.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "ZE05GOvt56f2c9la","flags": {},"type": 0,"text": "A dryad clad in wooden armor leans against a tree his side torn wide open. He hands the party a pouch full of tiny leaves. Taking a pinch and blowing them into the air will lead the party to an ancient temple entrance almost over grown with vines. When close the pouch of leaves crumbles to dust along with the vines covering then entrance of the temple.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "7MKF2aCTJTrKWnbZ","flags": {},"type": 0,"text": "You find a small silver coin in the middle of a street and upon picking it up, in your mind you see a small hut deep in the forest. When you come back to reality, only you can see it but a small fae pixie glowing bright blue will show you the way.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "NbC8jSyHbMg2SLM8","flags": {},"type": 0,"text": "The party encounters a man running out from the wood-line, coming towards then. He appears to be in shock over what he has seen, and tells the party that he was attacked while hunting. The man directs the party to the spot were he encounter the creature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "YREZskamZRcVG7ge","flags": {},"type": 0,"text": "A local temple has reported strange events in the surrounding area: beasts attacking villagers, bandit lords more closer to the village, and mysterious lights and sounds that can only be observed from within the village.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "nyBCpjrbgT8onCKX","flags": {},"type": 0,"text": "A bounty hunter asks the party if they known any of the names on a list of his. The list contains about 20 names, roll a d20 for the characters knowing any of the names, 1-10 unknown and 11-20 known. The names on the list can be from characters backstory or names of NPCs the party has met throughout the campaign. The bounty hunter will known what each person on the list as done, and how much the reward is for the capture.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "N6EijRC0XPweCdRT","flags": {},"type": 0,"text": "A seemingly exorbitant amount of gold is offered on the message board to get rid of a ‘house spider’. It turns out that it’s about a spider-like mimic in the shape of a house.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "8KTaENan1yUF0w4w","flags": {},"type": 0,"text": "The moon stops traveling across the sky, and everyone’s time pieces stop working. Word around the continent is a group of warlocks are attempting to gain power from a new patron – the god of Time","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "xAGZE21ySFl8nmhD","flags": {},"type": 0,"text": "More than three people in a given town have all their teeth fall out at the same time","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "4gvsF6ltqwVdX6hg","flags": {},"type": 0,"text": "A nearby civil war is raging, and one of the high ranking officers of one side or the other holes up in a cave. If approached, they will act incredibly defensive. A child is crying somewhere deeper in the cave, and this person refuses to answer any questions about said child.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "D2MDzAgCz52nDM9w","flags": {},"type": 0,"text": "An allegedly crooked officer of the law is found dead in an alley way and only one person in the whole town seems to care about it at all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "Ij0LUvdNIjwkC7YF","flags": {},"type": 0,"text": "The party is on a faire where a magician is performing tricks with a severed head that can talk. Throughout the show the head blinks in weird patterns. The party talks to the head to find out he is kidnapped and begs for help in finding his body back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "iHDbfXov8fKOgwo8","flags": {},"type": 0,"text": "The party comes across an Inn in the middle of nowhere and they decide to stay. They wake up on the ground where the inn used to be and there’s no sign of any building ever being there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "dLGX5Zs6o0bVCOBd","flags": {},"type": 0,"text": "Walking through town, the party suddenly gets surrounded by the city guard. A respected captain was murdered. Witnesses say they saw someone looking similar to one of the party members. Upon looking through their things, said member appears to have lost an item easily traced back to him (one half of a pair of gloves/earrings/daggers, family insignia, one of a kind necklace etc.). Sure enough, said item was found at the scene of the crime. Someone is framing them. Not necessarily a doppelganger.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "EOr9Ifd3SJdW0vXx","flags": {},"type": 0,"text": "The party stumbles across a dead old man. Amongst his meagre belongings is a thick tome with extensive records about everything they’ve done right up till today, with even more detail than they themselves knew.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "ZU91H8uRJ6MlxYpY","flags": {},"type": 0,"text": "The party finds various dead animals with missing pieces, almost torn and shred. As they approach the heart of the forest the number of dead creatures increases. Upon investigation they find out it’s the guardian spirit of the forest who has been corrupted and it’s confused.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "VKMFlN7epYle3SeC","flags": {},"type": 0,"text": "A flyer appears in the sacks of each party member. A mid level demon has opened a store and invites all those with ambitions to visit to make deals.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "0WobYMfdOcDziS93","flags": {},"type": 0,"text": "A rumor reaches the party’s ears of a group of brigands hiding out in the woods. They have a code that is the reverse of Robin Hood and his Merry Men: Steal from the poor, and give to the rich. None of the local nobles seem interested in the pillaged goods of their subjects, and are constantly giving back the loot they keep finding on their doorsteps.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "ZNQGv4xDTgacxeV2","flags": {},"type": 0,"text": "The local apothecary is desperate due to the sudden absence of all the local medicinal plants in the area. All the groves and clearings appear to have been picked clean, and even the owner’s secret garden is now empty. She had told no one of her hidden garden, and so has no idea who or what could have taken all of the plants in the brief period of time between her most recent check and her previous one.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "9dn5fm71iHBDpnyR","flags": {},"type": 0,"text": "A human peasant and a member of the fey came across each other in the woods and, over the course of multiple moonlit encounters, fell deeply in love. The peasant’s family has a deep-rooted fear of the fey, and is actively trying to put a stop to the pair’s relationship. The family is even more fearful that the peasant will leave for the Feywild and never return, and goes to the party to convince them to help break the two lovers up. The human is in love with the Fey’s otherworldly allure and sharp wit; talking to them makes the peasant feel alive in a way that they’ve never felt before. The Fey was originally only interested in the concept of a secretive human lover, but eventually came to love the peasant’s dedication to their relationship despite the risk of alienating other loved ones.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "83jlzIY1iukvWDgR","flags": {},"type": 0,"text": "While at the market waiting for another adventurer to arrive, you pass the time by idly counting the number of stone gargoyles mounted on the town hall. There are fourteen, all with a silly grin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "wcCxTGRPK4xAbu5H","flags": {},"type": 0,"text": "While at the blacksmith to repair your armour, you overhear the blacksmith explaining to his apprentice to not stray off to the hills to see his new sweetheart because he heard from the baker’s cousin’s stepmother that there are kobolds about.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "pdQ4vfwhmqEwEzKO","flags": {},"type": 0,"text": "While waiting patiently for your turn to see the Bishop, you get your ear bent by some local shopkeeper about how the town council is a bunch of idiots, and how they simply wasted all that money on getting 13 gargoyle statues erected on the town hall. Thirteen! That’s an unlucky number!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "z4iKej4PqVgGYmzX","flags": {},"type": 0,"text": "A street urchin attempts to filch your purse, he runs off down an alley. The urchin escapes, but in the alley you found a homeless halfling bum. Clearly dead. Looks like he fell from a great height.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "twdtGzPBfXHYwdid","flags": {},"type": 0,"text": "The price of that foreign wine you like so much has tripled in price. The barkeep mutters something about pirates. The barkeep explains it’s just a euphemism for the wagoneers guild and their extortionate ways.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "lWiYwXATXljD5QfZ","flags": {},"type": 0,"text": "A dead homeless halfling found in an alley had a small bottle of very cheap whisky. The label has a brand mark you’ve not seen before – 4 vertical slashes and 2 short slashes across the bottom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "Jo9IWhCaTvSyEm2s","flags": {},"type": 0,"text": "The pommel of a sword you found on your last adventure rattled loose. Inside you a scrap of parchment with lots of scratchmarks, almost looks like writing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "xgMRBQewKoPQiHpX","flags": {},"type": 0,"text": "A wanted poster has been nailed up – Wanted: Black Pete, for Brigandry.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "kbT6PPMi5RuYHYws","flags": {},"type": 0,"text": "The scribe you made inquiries with last week has got back to you. She says the Tomb of Three Chieftains can be found outside Millthorp.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "guHCAL3J9AGC3Z1l","flags": {},"type": 0,"text": "While at market, you saw three wagons being carefully guarded by scruffy and shifty looking mercenaries. There are barrels of cheap rotgut in the wagon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "EVhRKHBiJOC9FuJp","flags": {},"type": 0,"text": "A pilgrim accosts you in the street. He asks if you’ll be travelling east anytime soon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "kgXvcpWyhoNiJXx9","flags": {},"type": 0,"text": "The bakery has no cake. He explains it’s because there’s a shortage of milk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "h2e42mpdCw2ZccIY","flags": {},"type": 0,"text": "A patrol of the Kings Guard rode fast down main street. They almost ran you over.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "VuUUJnZqDvKi5GnA","flags": {},"type": 0,"text": "There’s a parade of pilgrims on main street, heading for the commons. They appear somber and morose.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "9xJAcOYsGrGZQ0Ha","flags": {},"type": 0,"text": "Southbridge, just outside town, has been closed to traffic due to disrepair. Merchants complain about the 2 hour detour they now incur by first heading east.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "viSiIQJGJJIZdidb","flags": {},"type": 0,"text": "The town guard are seen practicing new drills on the common. Apparently a local bandit has enlisted a wizard, and so training in avoiding fireballs is called for.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "lNEW0xEPDnjAJuQD","flags": {},"type": 0,"text": "The local priesthood is paying gold for water collected from the Opal Caves to treat a spreading fever","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "lzZKNVF0bJm8n5zm","flags": {},"type": 0,"text": "An apothecary will pay for certain herbs growing in the Frog Marches.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "T73EzAVHhOG1cm9u","flags": {},"type": 0,"text": "The local Stonecutters Guild are not petitioning for work contracts; labourers are grumbling.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "LPe0JdjH6yKqx09v","flags": {},"type": 0,"text": "A frost giant approaches the group. The giant politely asks for help. He lost his pet owlbear and needs help finding it. He promises a very handsome amount of gp as well as “a powerful ally” if you find the creature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "N2Xbf1nygmD8SbgU","flags": {},"type": 0,"text": "A goblin in noble clothes crashes through the window and rolls over the ground. The symbol of the king’s guard is embroidered on his half-cape. As he gets up, he panics and looks around, fixing his eyes upon the party. “The Goat-Riders are coming! Please, hide me!”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "tipG7nKyXEuggHlW","flags": {},"type": 0,"text": "A large burly man has started a daily ritual of throwing a goat at the side of a local noble’s house.  He is not damaging the house, so he is not doing anything that will make the local law enforcement arrest him, but the noble wants him dealt with, and will pay you to get rid of him, however.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "VbPtQWyILgC6fFTf","flags": {},"type": 0,"text": "A sword in the stone can be sensed by all creatures in the land with “Detect Magic” but lately it seems that the presence is becoming overbearing.  Magic users are worried that unless the true king draws the sword, proving his lineage, or the spell “Detect Magic” will become obsolete.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "O3fgZRzX0bFXRitq","flags": {},"type": 0,"text": "As the group walks through the forest, one member hears very quiet crying. The crying is coming from a lost juvenile harpy. It is the job of the group to protect this harpy. They can either keep and raise the creature, or return it to its mother.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "M7IZ5eK78zUKm3Mo","flags": {},"type": 0,"text": "The party finds a smouldering crater containing a metal wreck. Inside, they find an eccentric kobold who insists she has returned from the moon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "z4BVwhVxCmIvn3Yx"}
