{"name": "Shadowfell Side Effects","description": "One hundred different side effects from spending too much time in the Shadowfell.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "ySZ2Tctb9oOD1kyZ","flags": {},"type": 0,"text": "You have become albino. You gain Sunlight Sensitivity and Superior Darkvision. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "h4oNwPWuy8tdmR2Y","flags": {},"type": 0,"text": "Your eyes developed a reflective tapetum lucidum and they glow like a cat’s when light comes directly at you. Your dark vision is increased by 30 ft.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "sdHG5L8Dxvb6gQNA","flags": {},"type": 0,"text": "You have honed your other senses living in the bleakness so that you now have the Tremorsense ability out to 30 feet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "gpQcWVEGG2lpLV9U","flags": {},"type": 0,"text": "You can hear all heartbeats within ten feet of you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "0Y4k7AVk7IiefLKn","flags": {},"type": 0,"text": "Your body sometimes stops producing heat, so your internal temperature slowly drops down toward ambient (but never so much that you would freeze). This cyclically reoccurring effect is only slightly discomforting but is liable to make anyone with thermal vision or who makes skin contact with you suspicious.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "YU02jZKeDrRdtYpn","flags": {},"type": 0,"text": "You learned a trick from zombies: if you lose a limb or other body part, your body will happily accept a “replacement part” freshly removed from another humanoid. The part must be very similar to the one being replaced (e.g. a hand for a hand). Replantation may be achieved by holding the ends in place and magically regaining HP or taking a long rest while the ends are held together by tight wrappings or the like. The replaced part gradually changes appearance to match the rest of you. You occasionally suffer from the delusion that another creature’s body part is actually yours and that you need to take it back and stick it on, after cutting off the wrong one you have currently, of course.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "PYeEPuVEXNcqBsc4","flags": {},"type": 0,"text": "Your severed limbs, if intact, will attempt to return you by the best and most expedient means available to them. They will then regraft onto your stumps. Your severed limbs are effectively autonomous creatures capable of devising simple plans that would aid them in returning to you, but they only care for getting back to you, not any other goals you might have. (No, you cannot cut your hand off and expect it to grab the big jewel you wanted from under the sleeping dragon.) You gain unusual resistance to damage and bleeding out that would otherwise be caused by severing your own limbs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "Q9Zq3IwGHp9fTY37","flags": {},"type": 0,"text": "You can easily bend and snap your bones internally and then restore them to their proper shapes without causing yourself lasting damage. Doing this makes loud horrible sounds and absolutely disgusts anyone watching you. You have a better chance of surviving high falls if you land feet first, you can pass through any space your head can fit in, and you are proficient in escaping bonds such as manacles. Any Necromancer who cultivates skeletons covets your body for their research. They will try to take you alive to distill the source of your skeletal power.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "HNpMYTkROElWxHWl","flags": {},"type": 0,"text": "A limb of yours is dead and mummified, cold and bloodless, but doesn’t putrefy. It is animated by mysterious necrotic energies. You can control it but you don’t feel any pain nor sensation from this limb, and you have trouble with precise motion or even knowing where it is if it’s outside of your field of vision.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "ZUuiRCpvWlBfhJYM","flags": {},"type": 0,"text": "Your mouth movements no longer sync up with your speech.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "go5Oh8hG7nvZE52m","flags": {},"type": 0,"text": "Your soul is more loosely tethered to your form, occasionally it will appear as an afterimage around you, and stay fixed for a moment while you move. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "5YBCMZZRs0BQrC7Z","flags": {},"type": 0,"text": "You have grown much thinner, losing 6+2d6 pounds (medium creature) or 4+1d6 (small creature).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "NCM6O7ID2ks7CTjf","flags": {},"type": 0,"text": "The ash of the drained Shadowfell dead clings to you. Like glitter, you can always seem to find some. You smell like ash too.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "Ti9LbQpmvbLvVVPR","flags": {},"type": 0,"text": "Your breath is always visible, like on a cold day, regardless of temperature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "ledYMk3OVtzbQocH","flags": {},"type": 0,"text": "When you exhale, your breath appears as black smog that seems to cling around you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "pJIrmrNzSid9vi5n","flags": {},"type": 0,"text": "You have lost pigmentation to the extent that your skin is now transparent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "FbpUGzHqz1Jr6yAt","flags": {},"type": 0,"text": "Your body has lost all color – your skin, hair, eyes, etc. are all shades of grey now.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "aDylitNDKbA1BCsf","flags": {},"type": 0,"text": "Your skin has become so pale that you can now easily see your now black veins through it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "3WJre7grWe3GAgji","flags": {},"type": 0,"text": "Your head has developed a patch of hair which only grows white. The white patch turns its natural color during the full moon only.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "i4rZ4Ze9LRfMp8hc","flags": {},"type": 0,"text": "Your hair turns into long tendrils of fragile bone and won’t grow back if lost","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "qXSwZV0JRKy6FYzD","flags": {},"type": 0,"text": "When you get angry your eyes turn jet black, advantage on intimidation rolls when someone meets your gaze. and","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "GTVRwAB9dZt2maKV","flags": {},"type": 0,"text": "In full sun your pupils appear blood red.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "RomSUknKKJ19cOR0","flags": {},"type": 0,"text": "You see in monochrome, having all cone cells in your eyes turned into rods.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "0D5zWcKKCI0p7DBe","flags": {},"type": 0,"text": "One of your eyes is now completely black and overly sensitive to light, the other is normal. An eyepatch is recommended.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "Iw08UYb7084rOBRl","flags": {},"type": 0,"text": "You now have black irises, and whatever color your iris was, your pupil is now that color","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "j85bhMu8a3YFaT5D","flags": {},"type": 0,"text": "Your blood is a darker shade of red now.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "RcyXI3sXR7EDj5vV","flags": {},"type": 0,"text": "You no longer bleed red. Whenever you are cut, grey blood flows out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "dMQsUbtoOgNkRe1S","flags": {},"type": 0,"text": "Your blood is now a mild poison. (You can coat weapons in it, it deters bloodsuckers, but may be a nuisance to healers trying to help you.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "Xve5iwMOyW3Oc1OP","flags": {},"type": 0,"text": "You are now mildly sunlight sensitive. You sunburn easily. Unattenuated bright sunlight causes you disadvantage on perception checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "eYLec12cdPePK2JR","flags": {},"type": 0,"text": "When in direct sunlight, your skin starts to steam. It does no physical damage, but it is clear the sun hates you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "hEbZKKEPN1KowVII","flags": {},"type": 0,"text": "Some living beings have shadowy black sandglasses floating over their heads, counting down their time until death. By investigating the sandglasses, you may occasionally be forewarned of impending localized mass deaths or take action to prevent someone’s premature death. You cannot see your own sandglass nor those of your companions, but you absolutely know they are there, counting.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "PGbNcHLXkTad4Tvl","flags": {},"type": 0,"text": "When downed and while rolling death saves, you see no light calling to you. Instead you see the Shadowfell waiting to finally claim you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "EaKlbIDoswXA6LCZ","flags": {},"type": 0,"text": "Whenever you are at 0 HP, your body appears bloody and rotten, as if you’ve been dead for a long time. It doesn’t affect your ability to be raised.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "dtORGYsKXEIEaS85","flags": {},"type": 0,"text": "Souls of the dead get confused and head towards you rather than onto their next life. You are easily haunted or possessed, but anyone who died within 60 feet of you has their revival time limit tripled (depending on the spell). If someone died while you were touching them, they have an extra day to be raised.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "16hcX9ECr32Vh33k","flags": {},"type": 0,"text": "Your body is now less detectable by the living, but you are a magnet for undead and creatures of the void, which tend to spot you more easily in any condition.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "Kix73myZy1Pvn5nN","flags": {},"type": 0,"text": "In any encounter with undead, there is a chance they won’t be hostile towards you immediately.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "auKF1l0a5WmLsLnw","flags": {},"type": 0,"text": "Invisible to undead. Undead must make a perception check to detect your presence or else they will simply ignore you. Openly attacking an undead causes it and its allies to notice you as normal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "JEJjJGhta5jNA2Uz","flags": {},"type": 0,"text": "When someone uses magic to detect undead there is a 50% chance that you are targeted by the spell. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "AcK9jzQcG1N14BoH","flags": {},"type": 0,"text": "You survived an undead infection, but it persists within you. During flareups, despite not being undead, you are harmed by healing magic and healed by necrotic magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "8aPKyo0R5Q86LAVF","flags": {},"type": 0,"text": "Your touch intermittently causes a small amount of necrotic damage. This is involuntary, unpredictable, and cannot be turned off. (Example: d20 when you touch someone. On 1, 1d4 damage)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "qdGGVWR3LHcfNgwd","flags": {},"type": 0,"text": "You become an energy leech, siphoning from souls who are within a 5ft radius of you. (Optional: Each round you are within 5ft of a sapient living creature with a soul, you can choose to deal 1 necrotic damage to it and heal by 1 HP.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "c6o2Td8bNIdpbR2X","flags": {},"type": 0,"text": "Whenever you are subjected to necrotic damage the attacker is subjected to the same amount of damage. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "wqsSwYgoj9GJUxdW","flags": {},"type": 0,"text": "You have embraced the Shadowfell’s nature. You are now resistant to necrotic damage and vulnerable to radiant damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "VSA9q4uvqCgf5M0b","flags": {},"type": 0,"text": "While standing in dim light or darkness you can merge with your shadow as an action. While merged with your shadow your movement speed is 50ft, but you can’t take any action besides unmerging from your shadow. While merged with your shadow your movement doesn’t provoke opportunities of attack under any circumstances. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "QeGoVZBPyFp9K9jH","flags": {},"type": 0,"text": "You still have lingering attachments to the Shadowfell which allows you to shadow walk. Increase your movement speed by 5 in dim light and by 10 when in darkness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "1W7hgAZeBZZ8Oxp4","flags": {},"type": 0,"text": "You have been infused with the essence of the plane, giving you the ability to cast Darkness once per day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "eJfQTgMpDqrci6XV","flags": {},"type": 0,"text": "You are a natural with necromantic magic. Make arcana checks about Necromancy with advantage. You also learn one necromantic cantrip.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "XDsDb51AqpGUE7vX","flags": {},"type": 0,"text": "You can shape the stuff of shadows into semi-real objects. Unlike prestidigitation, you can craft small shadowstuff things that move and imitate life, but these normally seek to return to the shadows rather than obey the will of their creator. Shadowstuff crafts are easily identified by the smoky wisps they emanate and sunlight dissipates them. Crafting shadowstuff requires no components other than shadows and your breath.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "77fYWCYp4SbupzLc","flags": {},"type": 0,"text": "When you use any dimensional portal or magic similar to Plane Shift you risk returning to the Shadowfell, no matter your original destination.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "Df1iUclmRZVLie6Q","flags": {},"type": 0,"text": "You are a survivor who developed the skills of a honed monster slayer. Choose a specific monster common in the Shadowfell of CR3 or less as a favored enemy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "HFeELn4HAsX8u7bF","flags": {},"type": 0,"text": "An abyssal survivalist, you are proficient at matters of survival in dark caves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "tcywzIP3UpHjbKVK","flags": {},"type": 0,"text": "You can hear the soft whisper of shadows over nearby surfaces. While this helps you find the hidden, it can deafen you in some cases (such as light through leaves).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "AfAjq6qyMiYtD1Kl","flags": {},"type": 0,"text": "Players now have difficulty differentiating between the living and the dead, and they fail to see why a person should be treated any differently when their body and soul have divorced.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "c91nBiaBtsG1uVxF","flags": {},"type": 0,"text": "Your fashion sense has become permanently disturbed, either for the grim or the exceptionally cheery.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "Wx6kJZ4WyCGlnhcB","flags": {},"type": 0,"text": "You can speak no louder than a whisper.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "Mshwfg3nFgTixYPE","flags": {},"type": 0,"text": "You have depression.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "mvOIocFdHrizvQPM","flags": {},"type": 0,"text": "You have lost almost all sense of taste. You now love spiced foods.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "UU0B67FeIbUXX4Vi","flags": {},"type": 0,"text": "Surviving in the Shadowfell has lowered your standards a lot, you can eat almost anything without feeling sick or disgusted.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "XyYMZyo9PCN3HvQP","flags": {},"type": 0,"text": "You no longer see the appeal in having your meat cooked before eating it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "2uTRlfbCoK2qopii","flags": {},"type": 0,"text": "You no longer hunger and food all tastes the same; like mush. You always either forget to eat or simply don’t care to, your party has to push you to eat something otherwise your body will silently starve to death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "VclYO1ZNazZHikfG","flags": {},"type": 0,"text": "Regardless of your affiliation, your presence tends to cause ominous signs and minor troubles for figures and establishments aligned with deities opposing the undead. All the candles in a church might extinguish when you enter, or a paladin’s button may pop off when you pass in the street.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "YYGEWtMXmLOE9Ps7","flags": {},"type": 0,"text": "Drow, Duergar, and other dark dwelling sentient creatures feel oddly at ease when dealing with you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "pWNEP70FAgGCrGTN","flags": {},"type": 0,"text": "You speak common with a Shadowfell undercommon accent and use undercommon words and sayings characteristic of the Shadowfell without realizing it. You cannot seem to shake the habit even if it is pointed out to you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "5lnwAqnkd8UkQ9Y0","flags": {},"type": 0,"text": "On critical failures to charisma checks you forget common for 1d4 turns and only remember undercommon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "xiYe85tfUns8S8PO","flags": {},"type": 0,"text": "You tend to attract the non-hostile attention of weak creatures of the night. A prowling pack of wolves may idly follow your party, spiders take up residence in your pockets, cockroaches do not flee your presence, mice bring you shiny trinkets in exchange for seeds, moths and fireflies circle you, etc. (e.g. a Disney Princess of the darkness effect)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "vgIFRyVdEx2RAN94","flags": {},"type": 0,"text": "Worms and insects are drawn to you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "Yg1rxV1u2q7njnm8","flags": {},"type": 0,"text": "Wildlife grows nervous around you. Living creatures will attack you less often, but in greater numbers with greater caution.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "F7NwAEcXm7asMpzQ","flags": {},"type": 0,"text": "Beasts do not trust you and you have disadvantage on all animal handling checks. You have advantage on intimidation checks against beasts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "61MAGr5oI8fND5nR","flags": {},"type": 0,"text": "Wherever you touch, you produce shadows that stay there for a few seconds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "9NaCzGUc1RaeIYNp","flags": {},"type": 0,"text": "Your shadow takes on a life of its own when no one else is looking. It may mime murdering your friends’ shadows or shift into horrible visages. It behaves as normal when other people can see it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "haXvyek0qc3KxxMd","flags": {},"type": 0,"text": "Your shadow is much darker and more sharply defined than it should be.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "rQmaixOyk2u9OwuB","flags": {},"type": 0,"text": "Your shadow will move according to your emotions and feelings, even if you don’t move at all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "95K2ycgxIVXE6ji1","flags": {},"type": 0,"text": "Your shadow has not disappeared, but rather it surrounds you and tries to cling to you as a new layer of skin. the brighter the light the darker the shadow (or vice versa, DM’s call) (Optional: +1 to AC in certain conditions)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "rde2g88IJYPReRdS","flags": {},"type": 0,"text": "Your shadow detaches from your body and goes about on its own when you sleep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "draTIWAAsFUEVHPb","flags": {},"type": 0,"text": "Your shadow is replaced with your worst fear, only you can see it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "nj1m9fWjrtqOFL0a","flags": {},"type": 0,"text": "Your shadow behaves differently every day. Roll a d6) 1: Your shadow is missing, 2: Your shadow stretches toward the sun, 3: Your shadow resembles a shambling corpse, 4: Your shadow resembles a young child with a broken limb, 5: Your shadow resembles an unidentifiable horrifying beast, 6: Your shadow resembles the grim reaper, flowing cloak and scythe to match.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "MjHDEN4T0meTu5MM","flags": {},"type": 0,"text": "Your shadow autonomously collects interesting things for you and puts them in your pocket when people aren’t looking. It especially likes looking in forgotten dark places. Most found items are worthless or low value: stray copper, mice skulls, broken glass, dead beetles, dropped beads, etc. Your shadow respects other people’s property … most of the time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "LAbQhfdYR5gljMxI","flags": {},"type": 0,"text": "If you sleep with any marking instrument that can write in the color black, there is a chance something will use your hand to write messages directed at you and your party. The GM decides what is written, the frequency, and the personality(s) of the writer(s).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "0ER91xcVqPfQ9C6h","flags": {},"type": 0,"text": "You hear strange whispers when you are around a graveyard or any corpse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "kWJW9yFBqHiKImlm","flags": {},"type": 0,"text": "Whenever you wake up, you hear disturbing whispers: “You are already dead”, “Today you will come home, back to the Shadowfell” etc.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "bt3iKG05oy3MhmJI","flags": {},"type": 0,"text": "You and one creature from the Shadow plane are linked. Sometimes you see what they see and vice versa. Both of you know places that only the other have visited.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "5SlXckQnMH0yJEfU","flags": {},"type": 0,"text": "A being of dark power followed you back from the Shadowfell. It observes your actions and comments on them. It is totally invisible to everyone else and will never interfere in your actions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "kzn5Z0nXbAdzfKG7","flags": {},"type": 0,"text": "You have established a relationship with a cadre of ancient spectre sages during your time in the Shadowfell. You are proficient in Shadowfell-related history checks or gain a bonus if you already have this skill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "9H0Aiew3JbaJw5tJ","flags": {},"type": 0,"text": "You see shadowy figures that aren’t there in mirrors, glass, and other reflective surfaces. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "KEWc22xjqxB1CAkN","flags": {},"type": 0,"text": "Your reflection reveals a small set of horns protruding from your forehead, which seem to grow with each “cruel” act you accomplish. (The reflection only appears this way to you.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "4xQrYm9okpwOEhUu","flags": {},"type": 0,"text": "Your reflection now talks to you and tells you to perform horrible acts of violence onto those around you. Alone? It tells you to murder yourself in any way possible. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "bljh6pc4gNhbHAky","flags": {},"type": 0,"text": "At night, everyone’s eyes appear black and their faces slowly begin to disfigure if you stare too long. (This is only visible to you).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "QggEvNqHj5kToEhd","flags": {},"type": 0,"text": "You have the feeling of having lost someone in the Shadowfell, but you can’t remember anything about this person, not even the name.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "Hfcae5KJlFJ4yPv6","flags": {},"type": 0,"text": "You require a “night light”, or absolute darkness, or a security object (such as a treasured blanket or a knife under your pillow) to gain the benefits of a long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "PV94kvhbK2S4zcPp","flags": {},"type": 0,"text": "You have trouble sleeping at night but feel rather drowsy during the day. You have become nocturnal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "nnmQthdKQxBLSEdc","flags": {},"type": 0,"text": "Your spirit continues to wander the Shadowfell when you sleep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "fuyp8FwCPLN74uiT","flags": {},"type": 0,"text": "You can possess people’s dreams, causing nightmares.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "2ElreuUjaVA64l1A","flags": {},"type": 0,"text": "When you sleep your body functions on a level so low that you seem dead and anyone can mistake you for a corpse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "ZFuPiM1AHQmCM8Ly","flags": {},"type": 0,"text": "You prefer sleeping in graveyards and other places with strong negative energies, since it’s the only cure for your insomnia.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "sPACJ18CVtif2Dcr","flags": {},"type": 0,"text": "Your long rests are 1 hour shorter, you will never have a dream again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "oodnHmEsuTPWppC3","flags": {},"type": 0,"text": "You have a 10% chance of having a nightmare, which results in 8-hour rests having the effect of 4-hour rests.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "cu6AsLk6jQlfYvci","flags": {},"type": 0,"text": "Leaves, grass and other plant matter bend away from you as you pass. (Optional: You leave less of a trail and are harder to track through vegetation, but easier to detect while moving through it)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "WCSvsL2aFwjZ7z2Q","flags": {},"type": 0,"text": "Every time you take damage, you alone hear a distant bell toll.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "Oxuv5tNaEx5DwcjC","flags": {},"type": 0,"text": "At a certain regular time of day (e.g. Midnight), you become ethereal for 1 minute. You are partially connected to the Shadowfell during this time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "ShucH6SRtf95RTk4","flags": {},"type": 0,"text": "When you start a fire or light it only sheds half the light it normally would for a while. Light you create is slow to notice it isn’t in the Shadowfell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "PX6GDQaXxo47Hn9Q"}
