{"name": "Interesting Prisoners","description": "One hundred interesting and deadly prison-dwellers!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "E6RKGDQsdrsnKnbG","flags": {},"type": 0,"text": "Ethel – A Sea Hag that was caught breaking into a home, now disguised as a beautiful woman and awaiting trial.  She is unable to use magic due to the nature of the cell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "g5ZNA5BgihUXANqq","flags": {},"type": 0,"text": "Jojo – A skinny teenage human boy with greasy jet black hair. He’s been here a few times (mostly for stealing. once for defecating on doorstep of the jailhouse), but today he smashed the wheels on 2 merchant carts with a stolen blacksmith hammer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "XZa42cTNtBsgq5aL","flags": {},"type": 0,"text": "Tsaliya de Chaim – eternally grimacing female gorgon with a statue for a cellmate. Takes no shit from anyone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "81POvwfnSW0NfbM7","flags": {},"type": 0,"text": "A male kenku who has plucked nearly all of his reachable feathers, constantly repeating haunting chants in different voices and otherworldly noises. Madness dances in his paranoid, bloodshot eyes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "APjTWcjg6xsspcFr","flags": {},"type": 0,"text": "Derek Creighton – human rogue, able to escape from any cell. All of his limbs are pinned through the bone by metal cylinders connected to full-body restraints, topped off by a gem radiating an antimagic aura. He shrugs off the pain with a cocky attitude and an assurance that the only reason he’s still there is that he wants to be.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "bTh3TfAsXyuq86OP","flags": {},"type": 0,"text": "Ciara Ashling – A heavily attitudinal female tiefling, arrested for arson. Constantly demands to see her lawyer, and will always inform that her dual citizenship in the nine hells makes her immune to punishment this way. Said lawyer is a demon made up of mostly flame, whose method of legal defense is incineration of accusers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "Lf5i9Cftjf5PaSPL","flags": {},"type": 0,"text": "Richard Mason – a once strong human man with an obviously broken spirit. Arrested for the murder of his child’s supposed killer, a constant illusion of his deceased daughter follows Richard and is visible to all. Though this apparition is intangible, it constantly and silently pleads for it fathers’ love and care.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "w4VgDCgACu6D9Zi7","flags": {},"type": 0,"text": "(Name: the sound of his cell locking) – A male kenku who paces his cell nonstop, repeating such lines as ‘you’ll have to take the fall for this one’ and ‘who would ever believe you?’ In the local commander’s voice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "byx801ZPa8toCcUZ","flags": {},"type": 0,"text": "Remina Aedriel – an elven woman of indiscrimanite age, who spends her time caring for the injured and sick of the prison when the guards and medical staff fail to care for them. Is defended by the other prisoners for harm and often asked for advice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "8ZzVPpl6P12wuLQR","flags": {},"type": 0,"text": "Steve – a half-orc built like a tank, steve is convinced that he’s actually a human, is from some place called ‘Ohio’, and reportedly remembers nothing of slaughtering and burning the local tavern before his arrest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "sFncPd8daPWo1O4S","flags": {},"type": 0,"text": "Dhalbrur the Beholder – In jail for killing livestock and crops of a town. All eyes have been covered to prevent escape.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "nXyYk6FVD8Lg2G24","flags": {},"type": 0,"text": "Diamen Stoneton – Stole a piece of bread and a glass of ale from a tavern in the middle of the night.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "WLu9MWa8IhIdlcC5","flags": {},"type": 0,"text": "Regularguy McRealperson – A mimic that tried to sneak into a town to hunt disguised as a human, but couldn’t think of a good name.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "MLf38kociYhH0v9r","flags": {},"type": 0,"text": "Clark Bent – derranged drunk with a backwards ‘S’ tattooed on his chest. Is gagged and chained to the wall. If released he will occasionally jump in the air trying to fly. He insists that he is a ‘super man, once you get to know him.’ Guards will inform you he is a drunk who forgot how to cast fly and went mad as it was his favourite thing to do.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "IOrZhXLuy8oO3PPR","flags": {},"type": 0,"text": "Gordon Bouzaglo – A pasta cart owner arrested for feeding food inspectors fried beef tapeworms in retaliation for receiving multiple unsanitary food prep citations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "uLmSf43HhCl6gBj4","flags": {},"type": 0,"text": "Valerie ‘Val’ Ratigat – Wererat drug dealer to society’s elite. She is nonchalant about being imprisoned; her uncle is a big cheese in town and will spring her soon. The guards don’t seem to mind that her family butler brought a 3 course meal complete with wine service to her cell. Entertain her and she might slip you a fork to pick your lock with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "DY5YEgrgWmHhl0b7","flags": {},"type": 0,"text": "A collection of 11 drunks – The guards often toss all the wandering drunkards they find into a single cell so they can sober up. Most of them are sleeping or too hung over to make talk. Their cell reeks of vomit and piss.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "Me8d0Yp8jeQlYP8l","flags": {},"type": 0,"text": "Gray Shido – Skinny man with a nice mustache who runs an illegal gambling parlor that doesn’t pay taxes. The head of guard patrol in Shido’s territory changed recently and wanted more bribe than Shido was willing to pay. Incidentally, the new head of patrol was just found dead, head run over by a wagon wheel after tragically tripping in the street. Complete accident. 10 witnesses corroborating.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "BqNgW3tdoBbhoaIu","flags": {},"type": 0,"text": "Linda Lockhands – Proprietor of a clock, lock, and fine smithing shop which is allegedly a front store for a notorious thieves guild operation. The guards arrested her on trumped up charges hoping to inspect her shop, but they found nothing. Linda knows more than a high-council of archwizards about rare and unusual arcane items, legal or otherwise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "Mhr2pO18dvGaxGSf","flags": {},"type": 0,"text": "Moaner – Someone wrapped up under a blanket lying on the floor so they aren’t visible at all. They are writhing and moaning like they are having a severe bellyache or some other medical issue. The other nearby cells want this person to shut up.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "Hq8ifePxRF8X5RSz","flags": {},"type": 0,"text": "Blunty Candor – Had an argument in the street and beat her husband with a frying pan. A jailtime frequent flier for domestic violence, but the magistrates keep letting Mrs. Candor out because she always has a young child to take care of.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "LMfqf43cVVvnX3uB","flags": {},"type": 0,"text": "Honey Rosewater – Prostitute. Honey was arrested after soliciting in several stores and restaurants and then refusing the leave. She is addicted to something and having withdrawal shakes. The guards are avoiding her because she lunges at them trying to scratch their faces open.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "xgkDq8FyDI6Gb2QS","flags": {},"type": 0,"text": "Fizzy Bottles – a crazy goblin who swears up and down that there’s an oncoming undead blight and he’s the only one who can stop it. Though, in reality, he’s planning to start an undead blight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "EPzR7EFLWSVxwZvn","flags": {},"type": 0,"text": "Grey – A mysterious and highly intelligent fiend who claims to have come from the stars. He’s actually just a f","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false}],"formula": "1d25","replacement": true,"displayRoll": true,"_id": "9oJYuqym1d4TWviE"}
