{"name": "Travel Complications","description": "One hundred different things that can go wrong when traveling in the wilderness.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "H9BhZ7GCBklZibp8","flags": {},"type": 0,"text": "While traveling on the road, you come across a massive tree that has fallen in the middle of the road. It will take 1d10 hours to clear. Unbeknownst to the party, a massive ogre is hiding in a nearby cliff waiting for an unsuspecting caravan to wander into his tree trap. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "bgXwnt1EuqLKQqxu","flags": {},"type": 0,"text": "The main road has been washed out. Crossing the gap would be dangerous and time consuming. There is an alternate route through the woods which are known to harbour a multitude of threats, but it’s faster than dealing with the washout.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "5gm5ILcYi911ovUe","flags": {},"type": 0,"text": "The party comes across a caravan in distress. Bandits have been known to set ambushes like this to catch unsuspecting travelers, but there are also rumours of a merchant caravan that’s late returning from the capitol. What do you do?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "AU3ur1YYOJ9k4PNh","flags": {},"type": 0,"text": "A lost child wanders the road, heading back the way you came. It’s too late in the day to get back to town before nightfall, and you need to be in the next city over by morning.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "yebegIzj9KPkW2MT","flags": {},"type": 0,"text": "You see a dying man at the side of the road. If you stop, he tells you that [Person]’s guards attacked and robbed him. You are en route to an audience with [Person] to negotiate a lucrative commission, and as far as you know, s/he is a pillar of the community.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "WpxmEn3M8V1RYJAL","flags": {},"type": 0,"text": "A blizzard swirls up, impairing vision and forcing players to make con saves against cold damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "puZVIqFGl4KkGvuB","flags": {},"type": 0,"text": "A white stag/any other big game animal crosses the road and bolts. Do the adventurers pass on this trophy that could be worth money for its pelt/antlers/alchemical ingredients or do they go hunting?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "viGBCDKwfI2C6VwJ","flags": {},"type": 0,"text": "The party happen upon a hoard of coins (usually gold) in the middle of the road. It’s more than they can carry and there’s no obvious way to transport it. A group of level appropriate humanoids are circling around, intent on taking the hoard for themselves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "3ykH1fh2Ff0Q9XXL","flags": {},"type": 0,"text": "You find the last survivor of a zombie/goblin/werewolf/etc. attack. He/she asks you to bring him back to his guild, which specializes in hunting this kind of monster.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "tx6khXk30UiPeM2z","flags": {},"type": 0,"text": "You come across the last survivor of a pack of peaceful werewolves who are being hunted by vicious werewolf hunters. He/she asks you to return him to the rest of the clan.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "ogklAbNcAdtUqeqU","flags": {},"type": 0,"text": "You stumble into the middle of a fight between bandits and evil wizards fighting over a caravan of potentially valuable supplies. Neither party has seen you yet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "cnjlxVB8JV0PRcYQ","flags": {},"type": 0,"text": "A farmer or other commoner is transporting an offering to a fearsome enemy (giant, wizard, orc chieftain, etc.). He/she tells you that the village has managed to remain untouched by offering livestock/goods/gold in exchange for safety.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "w9fSSc8HiZ7PMAjV","flags": {},"type": 0,"text": "You are approached by a zealous group of cultists. They begin preaching to you that the world is going to about to be destroyed by the god they worship, and ask you if you’d like to join their end-of-the-world party (attending reveals that the world is not, in fact, about to end).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "F5fP5X5dmvjxDD72","flags": {},"type": 0,"text": "While passing through an abandoned farm, you come across a scarecrow that psychically whispers to you. It gives the party an “impossible” riddle and claims that if you cannot answer then it will not let you pass. Note: Scarecrow cannot move and players need not answer the riddle in order to simply walk past.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "vKjeyNY2WSCqbE1o","flags": {},"type": 0,"text": "A group of goblins standing on each other’s shoulders in trenchcoats trick travelers into coming to help fix their broken down wagon, and rob them for every copper they’re worth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "bj4mnyQV84FsbO54","flags": {},"type": 0,"text": "The only way to progress is through the aftermath of a battlefield. Many of the traps put in place by mages haven’t been disabled yet, and the party must navigate safely through it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "nfPbU9ygv7XNdjqA","flags": {},"type": 0,"text": "There is an illusory spell over the forest that they are traveling in that causes people to think that the road is taking them in circles. People who pass the save must convince the others that they are going the right way.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "KuujNAiFziD0nJuN","flags": {},"type": 0,"text": "There is a caravan of magical meat traders that are going from city to city. However, they only trade meat for meat instead of trading with gold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "GetGs9eO7XTyYqDm","flags": {},"type": 0,"text": "There is a tiny earth elemental trying to learn how to juggle. If the party tries to touch it, an angry mother will come out of the woods to attack them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "q0y6WCGwvadahxtC","flags": {},"type": 0,"text": "A group of teenagers were smoking in the woods and accidentally started a forest fire. Unfortunately, the party is in that forest and needs to get out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "ZWacGKs2tct2ywqi","flags": {},"type": 0,"text": "The road comes to a large river. A new, high-quality bridge has been built over the river by a goblin clan who are seeking to overcome evil natures and to make an honest living. They are charging what is, in fact, a high if still fair fee.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "C66D9Yl3uodTXyqF","flags": {},"type": 0,"text": "The path and map somehow did not mention a mountain that sits right in the middle of the road. The party did not notice the mountain until it was directly upon them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "5eMzsKR7eExbAJjo","flags": {},"type": 0,"text": "The village that you come to has just had adventurers a lot like your party come through, and have prepared an appropriate welcome. If your party are heroes, it might be fresh-baked bread. If your party is a bunch of jerk murder-hoboes, it might be tar and feathers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "mypnxqMYJKMZfiSD","flags": {},"type": 0,"text": "A large group of pigs are running every which way. A young girl in a ragged dress is trying to herd them together, sniffling slightly. If approached, she explains her father and mother are sick, but the pigs are supposed to be sold at the market, and they need the money for medicine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "p9rF05A4tFUXINbB","flags": {},"type": 0,"text": "A worried-looking half-orc desperately tries to convince your party they are going the wrong way, and that they should take a similar (if slightly longer) trail to their destination. A religion check reveals that he is a cleric of a knowledge deity. If the party ignore him, he tries to convince them for a while, then shakes his head sadly and begins trudging away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "OE2NR0Zps7IlsxyK","flags": {},"type": 0,"text": "A small stretch of woods are petrified in place and time, completely silent and perfectly still. Anyone touching anything but the path in the forest finds it hard as stone and completely immovable. There are birds and other animals in the forest, but they too are as still as statues.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "qpcFxO2YaPJlXeW3","flags": {},"type": 0,"text": "A vicious squirrel begins throwing nuts and chattering at the party. It doesn’t do any real damage, but it is painful and annoying.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "fo7OZZ0aBNaM29ZT","flags": {},"type": 0,"text": "A nest of baby hydras! Kill ’em, avoid ’em, or (with a successful handle animal check) take one with you! Where’s the mother, anyway?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "6EplRcummQ3j5cs0","flags": {},"type": 0,"text": "Someone has left a trail of copper pieces, leading off the road to a cave. The cave is heavily trapped and ends in an empty chest. You hear giggling when the chest opens, but no one is in sight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "j9dutzcv0bSmUbaL","flags": {},"type": 0,"text": "A large group of pilgrims and flagellants are making their way slowly up the road in front of you, slowing you down. They make no attempt to give ground to you and eye you with some vague hostility.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "69DL6IbjfedF10lt","flags": {},"type": 0,"text": "A deep moat has been dug across the path in front of you. Two gnomes on the other side are looking at a map and blueprints and arguing with each other. They make no attempt to help you cross.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "T3WdwVTnhSZCAQV2","flags": {},"type": 0,"text": "An 8-year old boy is peacefully leading a giant pit fiend/ Manticore/ Purple Worm on a chain behind him down the road. If asked about it, he laughs and says, “oh, that’s our cow. She just likes to play tricks on strangers.” He then ruffles the- whatever- and continues on his way whistling.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "mr7AUW6QtlEO2rbA","flags": {},"type": 0,"text": "Your map failed to mention a road inn halfway to your destination. The inn is completely empty with the door torn off it’s hinges. With a local knowledge/geography check you know that this inn shouldn’t even be here, this was once the location of a grave site.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "WYWUtJO31dnI3U8a","flags": {},"type": 0,"text": "An armored retinue of Soldiers and Clerics bearing a King’s/Lord’s/God’s banner have set up an inspection point, requiring all passing through to declare their belongings, allegiances and purpose for passing. Zone of Truth, Detect Evil and Good, and Truesight are in use.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "AN2K5QtCzyFC1Xl5","flags": {},"type": 0,"text": "You come across 2 NPC’s arguing over which one is real, and which is a hallucination.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "dDuC5c1SMLarZbzo","flags": {},"type": 0,"text": "You discover a 50ft wide flowing river crossing perpendicular to your path. This same river can’t be found on any maps.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "rVtBeiL3DoHHnNdN","flags": {},"type": 0,"text": "A great human knight has just died of a heart attack as he travelled down the road. His squire and page have pulled him to the side, and one has gone to fetch help. The knight has powerful magical armor and weaponry which would fetch a pretty penny, and there are robbers about…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "xhUZvDBRvnS8nuhX","flags": {},"type": 0,"text": "The road is completely blocked off as if an avalanche or rock slide occurred. Problem is the area is pretty flat and you don’t understand how the rocks got here.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "ktwolG3Ru0bABW1v","flags": {},"type": 0,"text": "A group of animals have been killed and aligned in a strange formation with weird symbols drawn in blood. Party could find out this was used for a ritual of sorts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "kzHf1f7K9K3Vlg4p","flags": {},"type": 0,"text": "You turn a corner and the road ahead is blocked by a pool of lava. Upon inspection, there is no heat. Futher inspection will reveal it is a illusion spell. Perhaps a silly prank by a wizard. You can walk through the lava.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "F8tAeR8IEJOx9rBp","flags": {},"type": 0,"text": "As you make your way along the road, you come across a rotting dead animal carcass. The smell is horrid, but it is nothing out of the ordinary. As you continue, a few more animal carcasses are strewn across the road. More and more bodies begin to appear along the road the further you go. You eventually come face to face with a 20ft wall stacked full of bodies ranging from livestock, predatory animals, and even people. The wall blocks the road, and the only ways to proceed include scaling a nearby muddied-with-blood slope, backtracking to find another route, or digging through.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "YqQtZw7kzUn4GNrT","flags": {},"type": 0,"text": "The travelers find themselves at a crossroads, then the same going forward, and again. The party is trapped in a magical loop, until they can dispel it or notice the difference in the pattern, such as flower locations or a bird’s flight path.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "nfnXbCE8WvNMRaoU","flags": {},"type": 0,"text": "You were sold bad travelling gear at your last stop – the rations are worthless, the water tainted, the leather goods falling apart.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "c2PiWb91PmqY2Ws8","flags": {},"type": 0,"text": "Flash Flood: A downpour upstream has triggered a flash flood over a low part of the road. Although the water is 3 feet deep, the current is so swift that it will without fail sweep away anyone trying to ford it. Individuals swept away face the risks of bludgeoning, impalement on debris, and drowning. By stepping in it at the shallower edge, it is obvious to even survival novices that it will be extremely dangerous to cross, especially towards the middle. The party can choose to wait it out if they like although it will take a long while.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "JawrchC5PBen2diE","flags": {},"type": 0,"text": "Stampede: A large herd of bison/gnus has been spooked and is wildly stampeding down the road as it is the path of least resistance. Get out of the way or be trampled.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "4YEjB6DTmYGIihnS","flags": {},"type": 0,"text": "Landslide: Heavy rain and a small earthquake triggers a series of small 30-foot-wide landslides. The party needs to book it before a larger one hits.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "aVBdSIJzntulGKsN","flags": {},"type": 0,"text": "Help with wheel repair: A traveling caravan of nomadic folk has a broken wagon wheel. The lady in charge is a seer and offers insight on your fortunes, but no gold, if you stop and help.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "JNvisBdwwoutcDqX","flags": {},"type": 0,"text": "Bad signs: A jerk has rearranged the roadsigns at an intersection so they point to the wrong places.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "6tFo0cmlyxmHONCv","flags": {},"type": 0,"text": "Pulled over by the highway patrol: A peacekeeping army-guard convoy is marching through. They are corrupt and will harass and attempt to search the party and may try to take money or goods they find suspicious or the party cannot explain the providence of. They will also apprehend known criminals. The party may get most of their stuff returned by “appealing” (aka paying a bribe) to a similarly corrupt local court.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "Us24ODKHUM8Ziila","flags": {},"type": 0,"text": "The Wyld Hunt – The fey are out hunting. Beware. They have already chosen a quarry, but don’t stick around, lest one of them choose you as their next.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "Q9hNxlcRuTkQUBfq","flags": {},"type": 0,"text": "After walking for a good few miles along the path down the clear road, you reach an invisible barrier. Then the illusion breaks – this Mirage Arcane made this deep cave look like a clear plains with a nice lovely stone path identical to the one you’ve been following. You are half a mile into this cave, and the fey who have lured you here do NOT want you to leave without doing something for them first.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "wOFRKtnF40U2fj5Q","flags": {},"type": 0,"text": "Modrons: Along the path you find a group of modrons (2 monodrones and a duodrone). These modrons were not given the return order during the last modron march (due to complications from becoming attacked) and are still trying to collect data. Upon noticing the party they harass them for data, doing things like surveying them and mesuring the size of their clothes while they are walking. They continue to do this until they either lose sight of the party or are destroyed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "ZhAH7ALl4iqOWbiF","flags": {},"type": 0,"text": "A fire can be seen just under a mile away in an obviously cultivated field, the wind now blows billows of smoke over the road the party is crossing. The field belongs to a local alchemist who has seeded it with various medicinal herbs. The smoke is highly intoxicating, impressing odd conditions and visions upon the party members.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "bYNCZWN0Xy56veYc","flags": {},"type": 0,"text": "Improper care – the terrain has taken an unfortunate toll on your foot ware. Your soles are falling apart, movement reduced by 33%.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "rnfMfXPbQfQm1ChW","flags": {},"type": 0,"text": "A mounted knight in full tournament jousting gear mistakes the party for his entourage/bodyguard and insists that they escort him to his next competition.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "u9DVpYxGSfMTrKU9","flags": {},"type": 0,"text": "The party come across a revenant who is nearing his target. The target isn’t any one in the party but the adventurers have a chance to intervene.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "89bOmQlax13ZY8zs","flags": {},"type": 0,"text": "Someone in your party has dysentery.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "i2jWe8NUCPPA12Pa","flags": {},"type": 0,"text": "Everyone the party asked in the last town/village/waypoint has said the only safe way to get through the valley is to take the blue path, detailed and maintained by both of the communities it is flanked by. The villagers all said the upkeep was mutual, and that they were on very good terms with the other town/village/waypoint.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "XcsjTtFfIORboDLj","flags": {},"type": 0,"text": "Upon getting out of the first town’s territory, they find the rest of the path barricaded and blocked, the barricade older and written in an archaic version of the prime language. The trees and animals all look like they are from a different time. There is a ‘detour’ path but it’s filled with primeval dangers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "V5206BCdgIg4PApx","flags": {},"type": 0,"text": "While traveling the carriage you are riding on hits a rather large bump causing an already weak axel to snap rendering the carriage useless. The party must either find a way to fix the snapped wood so that they continue, or they can try and convince another traveler to help.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "NYCE7aFrdHxQRepk","flags": {},"type": 0,"text": "You find the rats have gotten into your rations. You’ll either need to make constitution saving throws or find new food.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "buBIIvFBXoULIhEB","flags": {},"type": 0,"text": "A massive and extremely powerful dragon ambushes you somewhere along your journey through a massively dense and vast forest.  It is strong enough to slaughter you all without trying, and is upset that you are not aware of it.  Gonna have to talk fast to appease it.  It also desires a rare food item you possess, and will allow you to pass if you offer it the food and an appeal to its vanity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "EhbJDj5Gd6o3VGJy","flags": {},"type": 0,"text": "This actually happened to me in a campaign: An axle on the cart breaks and a druid, in an attempt to repair the cart, accidentally Druidcrafts the wooden wheel or another wooden piece of the cart into a bush.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "EhousxIrQI0XYqEF","flags": {},"type": 0,"text": "There’s been an earthquake, and the pathway is blocked by something. It might be a fallen tree, a crack in the ground, or a piece of land that broke off a mountainside. Either way, it’s going to be difficult to get past it and nigh-impossible to get a cart across.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "j1OJvAqfsBJCkD8o","flags": {},"type": 0,"text": "Jack’s Lanterns – Strange lights can be seen far away, off the path. They hover over pits and quagmire, and will trap unwary travellers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "SgktAdaURlIui5G0","flags": {},"type": 0,"text": "Dimensional Instability – There’s been a small ripple in the planar fabric between worlds. For a few moments, another plane is open. It might be the Elemental Plane of Fire, the Feywild, the Shadowfell, the Astral Plane, or even one of the realms of the gods.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "wxmT8ZDpZsy7vC4U","flags": {},"type": 0,"text": "Mystic Orchard – A large area filled with various trees and bushes, each one covered with different fruits. Food is plentiful, but some of the assorted berries might be poisonous or have a side-effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "5kNr5M67kloiXTXE","flags": {},"type": 0,"text": "Overgrowth – The path is overgrown with vines, grasses, and tree roots. It is difficult terrain to move past, and will take twice as long to cross.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "QIbZBqpARXyOERuL","flags": {},"type": 0,"text": "Oh look, it’s a giant stag. Roll 2d4. 2-4 means the stag charges. 5-7 means it looks at your party and moves on. 8 means it bows before you, granting your party a 2-point Charisma Bonus for the next week.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "yDFw0XPSPhWyYFaR","flags": {},"type": 0,"text": "A felled tree blocks your path, and the way around is blocked by dense overgrowth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "ibBVUQjj98c6VqfU","flags": {},"type": 0,"text": "You come across a large battlefield of some previous encounter with hundreds of bodies laying strewn across the ground and piles of corpses heaped into stinking mounds, crossing around will take a full day but if they cross through they need to make a Constitution save DC 15 or become sickened with rot from fly bites carrying disease which gives the poisoned status for 24 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "zogvRZTswkYCALmp","flags": {},"type": 0,"text": "The next town is roughly 50 days away around the mountain and the only other way is through a tunnel with a REALLY steep fee. (Or a SECRET TUNNEL)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "hDQyiRSB6pYRZJs1","flags": {},"type": 0,"text": "A mating ball of poisonous snakes is in the way.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "lW6a01AI3pnxCfFw","flags": {},"type": 0,"text": "A herd of wild goats appear. One takes a particular liking to any dwarves in the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "irEeZ4Dz7SD85090","flags": {},"type": 0,"text": "The remains of a horse on the trail have attracted a bear. It’s too busy gorging to notice you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "erQZSFBGMHcLhqqA","flags": {},"type": 0,"text": "A forest fire blocks the path after a thunderstorm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "iMBljDwPZjjU5LXW","flags": {},"type": 0,"text": "Snow melt have turned a small creek into a massive raging river. The only bridge is destroyed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "DezD9DpsDEfV8pDW","flags": {},"type": 0,"text": "A recent landslide has resulted in several large boulders tumbling into a narrow section of the river, making it very difficult to navigate in the Dory boat the party is traveling in. The boat has an HP of 13, roll 1d4 x 4 to see if it safely makes it through, without the hull being opened up, which would cause it to sink.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "nlL6G3SDpsnEaqmK","flags": {},"type": 0,"text": "A mess of vines blocks the party’s way. Seems like a sharp weapon will be needed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "1t7ph6uhGehK4FGu","flags": {},"type": 0,"text": "Two bugbears are sleeping off their hangover in the middle of the road. You can try to sneak past, take a detour, or attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "4amq4vJUFjtTcHNG","flags": {},"type": 0,"text": "Part of the path has been washed away leaving a large, deep mud puddle that is difficult to traverse around with the wagon/cart because of the dense bush either side. If the party chooses to forge through it takes them 2d20 minutes, and they end up covered in the thick, sticky, foul smelling mud. If the party chooses to clear a path to the side it takes them 3d20 minutes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "H8AKfh42tvFwa6MR","flags": {},"type": 0,"text": "You notice an abundance of sink holes in the field. Players bust be careful with their footing as well as not grouping up to close together.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "SzPWiKnXYnPMILMV","flags": {},"type": 0,"text": "You find two exact similar dwarfs fighting each other with crossbows and taking cover. Both say the other is a doppelgänger. None of them is, they’re just lost siblings. One is named Thruduanir and the other is just named Greg.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "J33jnlDb7UGSInrA","flags": {},"type": 0,"text": "A small red skinned creature sits ontop of a rock on the side of the road. It waves to you and implies that it wants to play a game with you, to pass his test to get his higher devil horns. If not, he vanishes. Roll a d6. 1-2 the devil vanishes and leaves a small purse filled with coin, around 10gp.(the coins turn to lead in one hour) 3-4 a group of (appropriate) undead appears and will fight for their souls to be released by the devil. 5-6 a (appropriate) demonic being is brought into existence, will attack the group immediately.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "3xk2uMadznXxpbGw","flags": {},"type": 0,"text": "An old sagelike man sits on the side of the road and begs the party for food, water or gold. -If given food, he disappears and gives a blessing to the goddess of wanderers, the party will not be disturbed on their next long rest. -If given water/wine/ale, the old man hands the party an everflowing mug, containing what they gave him in the first place. -If given gold, he asks the partymember what his favorite animal is and then hands over a golden egg. Soon, a familiar of choice (will grow up to one feet tall) will be born from the egg. -If given nothing, he curses you and will stripe your party of half their rations and water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "v6gQ39Fm9q52ACCW","flags": {},"type": 0,"text": "A hangman and magistrate with a constructed gallows are preparing to execute a man for poaching. The man sees the party and yells for help as the hangman struggles to get him in the noose.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "nQz454qaH1dX1OoM","flags": {},"type": 0,"text": "A “very human” child is drawing strange runes in the dirt with a bag of blue sand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "o4wmDSL5e01xoOno","flags": {},"type": 0,"text": "A Traveling circus is coming the other way and they want to practice their act: A mind control/hypnosis performance. At some point the party realizes they have no intention of letting whoever they hypnotize leave the troupe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "kr6bBPkpjruQ89jt","flags": {},"type": 0,"text": "A dozen ogres are playing hide and seek. They don’t really feel like eating you, they just want to play.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "MuEOtb8QIcHR3MRX","flags": {},"type": 0,"text": "You find a merfolk in a barrel of water by the side of the road. You are at least a mile from the nearest water source.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "0h2fKG96CLShgplM","flags": {},"type": 0,"text": "Half a skeleton grabs onto the back of your horse/wagon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "nk9X2uWTEC3Ljrla","flags": {},"type": 0,"text": "All forms of vegetation along a lengthy stretch of the road have been transformed into glass, while the top inch of the terrain has transformed into obsidian. Along the sides of the road are statues of confused, frightened animals made from random rocks and minerals. All organic life in the area slowly begins transforming into various rocks and minerals over the course of one full day, at which point the organisms are petrified. A fully transformed organism may only be cured through use of Greater Restoration or a similarly powerful magical effect. Upon leaving the stretch of the road, any partially petrified creatures have the transformation process occur in reverse at the same rate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "cAqRpmzLOU5a7qwz","flags": {},"type": 0,"text": "A friendly, sentient dust devil comes across the party and follows them around for 1d4 hours, behaving like an excited puppy for its duration. It communicates by swaying forward and back for affirmation, and left and right for negation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "trzkucqGX4TX5eVm","flags": {},"type": 0,"text": "A speaking animal, like a frog or a bird, is passing your way, looking for direction and a way to be polymorphed back into it’s true form.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "M3jx542Fpd4HovBO","flags": {},"type": 0,"text": "A bare piece of plains, with a large stone set in the middle. The still legible inscription reminds of a great battle long ago. Ghosts are said to haunt here in the night.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "EBcIHFo8INGV9weH","flags": {},"type": 0,"text": "A flat corridor between mountain passes has many windmills dotting the landscape due to the constant and unvarying wind flow. One of the windmills lies in the middle of the path ahead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "H76hzKJtqIRxSbng","flags": {},"type": 0,"text": "A large, deep depression in the ground that appears to be covered in smooth, gray-black glass. If one slips and falls in, it is very difficult to get out. At the edges, it fades into the soil, and there is grass growing in cracks in it. If broken, it is very sharp. There are several animal skeletons at the bottom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "mRab5bJUeEnbFz60","flags": {},"type": 0,"text": "A recent landslide has exposed a large fossil in the middle of the path.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "umRnBXqwoX2xGfxW","flags": {},"type": 0,"text": "Two wizards are dueling on the path ahead. They continually cast Ice Wall, making it nearly impossible to pass. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "lYug2eBq54CG7Iqh","flags": {},"type": 0,"text": "A two-headed giant is napping on the path ahead. Do you try and fight, or sneak past him?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "AIdh8E6dwAEnUOZU"}
