{"name": "Mysterious Trinkets","description": "One hundred trinkets that offer mystery and intrigue.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "j8DBWsDLYTaFGoak","flags": {},"type": 0,"text": "A silver dragon scale that glows in the moonlight. It seems almost as if the scale is trying to get back to it’s TRUE owner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "RiiLOXciJAXwjyg5","flags": {},"type": 0,"text": "A silver coin which has been hollowed out and a tiny encrypted message placed inside. An unscrupulous peddler gave it to you as change without knowing why the coin was underweight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "4z0g1eROeReYQVN5","flags": {},"type": 0,"text": "A “hobo” gold piece where the face on the coin has been carved into an elegant skull, a guild symbol etched into the back, and a saying in thieves’ cant carved around the edge. Once you were targeted by a pickpocket who later returned your purse and apologized in person before fleeing in terror.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "2MWtC2qjTf8RienN","flags": {},"type": 0,"text": "A key to a bankbox in a large prestigious bank in a large city far away, and paperwork indicating it has been paid for the next 100 years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "OHhCNuPC95UHki2w","flags": {},"type": 0,"text": "A small leather drawstring bag filled with sixteen beautiful turquoise fetishes. There is a note inside from someone hoping to “meet up for another game soon”.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "uWuBrl4E9S8jC2CC","flags": {},"type": 0,"text": "A strange long black box with many small buttons labelled in unknown language that fits comfortably in your hand. On the back, the box has a cover protecting a pair of pockets that accommodate two small metallic cylinders.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "4jsacXqj89vj3cSF","flags": {},"type": 0,"text": "A curious frogmouth purse filled with many unusually shaped dice. A few small figurines of various people and creatures and worthless coins are also in the bag.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "hkqEAb569i4LEmOA","flags": {},"type": 0,"text": "A little 5-inch gnome statue, if it gets out of view it almost seems like it’s trying to talk to you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "geH3jHBcNcBNNvRN","flags": {},"type": 0,"text": "A board covered with runes and a silver weight tied to a string. Holding the weight over the board causes it to slowly spell the answer to any question asked. Its never the correct answer just the answer the person asking most wants to hear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "9z5uZravwDDC9M9a","flags": {},"type": 0,"text": "A 3″ x 4″ x 2″ wooden box within which is an ink soaked sponge. Touching the sponge causes inky hand prints to appear on whatever that person has touched for the last hour. The inky prints fade in an hour and can’t be washed away. The sponge dries out after one use and must then be refilled with a full vial of ink before it can again be used.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "O7rS8qnygn0Ko2Ql","flags": {},"type": 0,"text": "A small green stone. Or red? Wasn’t it blue just now? No, it is clearly yellow…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "kl62IloCLzfIwaEb","flags": {},"type": 0,"text": "A shard of a mirror which shows your reflection – or rather, what you think your reflection should look like.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "ub0FQY1Njs2VeomW","flags": {},"type": 0,"text": "A spool of string, glimmering in the most astounding colours. String becomes invisible as long as music is audible.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "aUypXV2YMwDImAnd","flags": {},"type": 0,"text": "A white knight chess piece. When the player moves on the battlefield like the knight would move on the chess board it makes a sound of a horse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "6nyeRGCBQvx66DcV","flags": {},"type": 0,"text": "A seemingly normal dagger. Whoever, when it hits an enemy, you can almost hear a faint laugh. It might just be your imagination.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "aWxQUwkl2xtss7lj","flags": {},"type": 0,"text": "A bag of apples, that never seem to go bad. You feel slightly bad after eating one, and that feeling intensifies after each apple. Also, everytime you take a bite, the bag seems to twist in on itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "e3WaqIMi0U1xrZqC","flags": {},"type": 0,"text": "A musical instrument. It’s music gets louder everytime you play it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "PgC8jUbcXdHPTaIj","flags": {},"type": 0,"text": "A coin pouch. You can put as many coins as you want in it, but you can’t take coins from it. The only way to take your coins is to open it with the intention of putting a coin, and then taking as many as you want, except, of course the coin you put.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "Ulxyv9lTLEjGWgZU","flags": {},"type": 0,"text": "A boot. It’s exceptionally easy to put on, but you need to use all of your strenght to take it off. When you are not wearing it, you have an increasing impulse to put it back on.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "d6hYTcS2EDDCBlgk","flags": {},"type": 0,"text": "A cube, with each side having 9 squares with an eldritch symbol inscribed within the rich oak finish. You can slide the cube around to shift the location of each face to match others. Some of them seem to glow when matched together, but so faint that it must be your imagination.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "9iAbTGdYsuzNFk8h","flags": {},"type": 0,"text": "It is a rubiks cube with symbols instead of colours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "zzZRNNz8xoZWeQuw","flags": {},"type": 0,"text": "A fine chain necklace fashioned from links of some strange red metal. The chain retains body heat for an unusually long time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "vgQUdVpWntvw43yo","flags": {},"type": 0,"text": "A pocket notebook with cryptic phrases scrawled haphazardly on most of the pages.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "XT02DZYRtiS12NUi","flags": {},"type": 0,"text": "A 4″ high wireframe model of a humanoid figure, made out of solder. The figure has an exquisitly detailed copper heart inside the dull ribcage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "QwkfhSy0PXit4DHu","flags": {},"type": 0,"text": "A small painting on a necklace chain, the painting is extremely detailed and displays what appears to be a king, when wearing the painting occasionally the vague feeling of not being where you’re supposed to be comes over you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "blKqcuNjW4QzannO","flags": {},"type": 0,"text": "A feather quill. Anything written with this quill will appear in a distinct and unknown handwriting. This unknown handwriting remains the same, regardless of who is writing with the quill.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "ZZnoHmVIgbMWAGeP","flags": {},"type": 0,"text": "A small pouch of glass marbles. Each marble has the abstract shape of a different animal embedded in the center of the glass.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "KlySuMiEqrDUnBMe","flags": {},"type": 0,"text": "A large decorative candle. When lit, it gives off an alluring scent which, while impossible to identify, evokes a feeling of nostalgia in anyone who smells it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "NZCxhNq35Ghf3BgY","flags": {},"type": 0,"text": "A small garden trowel. The blade and handle are made of common, if not poor-quality materials, but the handle is set with a single semiprecious stone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "0ZxsPVRZjbKkWBYB","flags": {},"type": 0,"text": "A sharp tooth as long as your hand, looking at it makes you uneasy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "RejfCvlPRYEjnDJo","flags": {},"type": 0,"text": "A nail molded into the shape of a sword with pommel in the shape of a wolf’s head.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "KGtPQ4JRYobGrQgM","flags": {},"type": 0,"text": "A tiny wooden horse with white hair for a mane and tail, and silver beads for eyes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "oJM5290PrkWQd6rd","flags": {},"type": 0,"text": "An exact replica of your own eyeball, as hard as glass.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "1tUVJSQeMEM9JPkx","flags": {},"type": 0,"text": "A pretty amulet which turns out to be a highly offensive symbol to an alien people.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "gnPLFjm3ZDrfyBuu","flags": {},"type": 0,"text": "A cup carved from horn which swallows any magical potion or poison poured into it. Once per day the cup can be drunk or from and it will produce the last thing that it swallowed, except for 1 percent of the time it will produce a random other liquid it swallowed sometime in the past.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "HqBaJZrOT4YyVMmC","flags": {},"type": 0,"text": "A mirror with another mirror on its back. When there is a being on both sides of the mirror, it shows each being a representation of the way the other sides being sees it. Disgust produces a disgusting image, admiration an idealistic image ect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "a3XzTbXmXJn0wz8F","flags": {},"type": 0,"text": "A document which shows whatever the observer expects to see but with a few errors (misspellings or other incongruencies).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "swnLRsTg6NurPw9R","flags": {},"type": 0,"text": "A glass ball, something seems off. Something should be in the ball but what? Over time the ball fills with a dark liquid and the player has an easier time shaking off ill effects, once full they feel sluggish and find it harder to resist. Going back and forth filling and draining. Treated like a cloak of resistance, reverse when full so like +3 when filling, -3 when draining. Need only be in the players possession.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "1Qu0vHq8kJvuCV12","flags": {},"type": 0,"text": "A small square metal container with d10+5 strange brass cylinders, about a centimetre wide and less than three long. One end of the cylinder is closed, the base encrypted with unknown insignia around a grey round spot in the middle. On the other end there is a small, ball-like metal piece. There seems to be some kind of unknown powder in between, but any attempt to take the cylinders apart results in an explosion, sending pieces flying in a random direction for a couple of metres.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "uQC8cRaG5EKttCKC","flags": {},"type": 0,"text": "A flute that can either [1 on d6] emit no audible sound (makes the nearest animal hostile), [2 on d6] an extremely high-pitched one, [3 on d6] bass strong enough to cause 1d4 damage in a d6 metre area or [4,5,6 on d6] sound like a regular flute. Hide the rolls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "YU9ScCY4ANFsxDjS","flags": {},"type": 0,"text": "A fancy dagger with an eye engraved on the hilt. Whenever the dagger is at the very edge of one’s vision, they can swear it just blinked.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "yzXRYS59eTsfhL6O","flags": {},"type": 0,"text": "A coin pouch. It sounds, weighs, looks and feels like it’s filled with coins, but upon opening it you discover that it is empty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "Obb0IOSWuufpL0Ll","flags": {},"type": 0,"text": "A single arrow. It cannot be snapped, dulled or broken. Other than that, it acts like a regular arrow. The person who found it always manages to find it after firing it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "PceCviPKovQausEm","flags": {},"type": 0,"text": "A tarnished brass kazoo in the shape of a fish. If blown under water it summons one normal fish of the nearest common variety. It will not summon anything monstrous but who knows what might be chasing the fish that is summoned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "ZyKfBi1AhSQVxoka","flags": {},"type": 0,"text": "A compass that at first glance doesn’t work, just keeps spinning endlessly unless the user is close to a mimic at which it points at. If there are more it points at the closer one.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "xiDpcsgDgn3iSX4p","flags": {},"type": 0,"text": "A whip, when you strike anyone the whip moans loudly. Only the user can hear the moan.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "E6C6BBcFDH5Z0mjp","flags": {},"type": 0,"text": "A rope that ties itself into a hangmans knot every time it’s not watched.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "aekZEqgfZtgeir9u","flags": {},"type": 0,"text": "A small statue of a gold frog with one eye and a relatively huge mouth. It knows every language and is willing to translate anything you show it but in turn for translating one word it asks to be fed one fresh [insert race] heart.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "CfBwbjnhX8xpp7fa","flags": {},"type": 0,"text": "A rock that looks like a diamond to anybody touching it. Or is it a diamond that looks like a rock to anybody not touching it? The person that created it forgot and has gone crazy trying to figure it out. The user will over time slowly lose his mind over the same questions, obsessing over it, not willing to trade it or sell it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "7y6ycpghazEgcB8T","flags": {},"type": 0,"text": "A necklace, looks like an inverted pentagram and is made of wood. If it comes in contact with blood summons a demon, over which the user has no control.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "cMD888bZJxtNaEtB","flags": {},"type": 0,"text": "A silver ring with a fly head, gives a 25% chance that a devil will not consider the user as an enemy (unless the user attacks the devil or does something against it), 25% chance that the devil will be hostile and focus the user and 50% of no effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "oW5yL8uD3mZcJoAl","flags": {},"type": 0,"text": "A single earring shaped like a smiling mouth, if worn by a paladin whispers commands and tries to make the paladin break his oath. Can’t be removed by any means (including a wish spell) unless the ear is cut off or the oath is broken. If the ear is cut off the user takes no damage and his/her ear regrows. The cut off ear turns to dust. If not worn by a paladin, none of the effects take place.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "Dpvys8zXteAYwAui","flags": {},"type": 0,"text": "A half gold half silver coin, gold side has a sun and the silver side has a moon image on it. When used in a heads/tails way it always faces up with what the person throwing it said.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "82GBYNQFkNkLcge4","flags": {},"type": 0,"text": "A staff made out of one long bone, ending with a skull which starts screaming when it sees a skeleton.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "9frc8rlCTHrJvNlF","flags": {},"type": 0,"text": "A key that changes its shape after it unlocks something. Beware of railroading as the nature of the key means that certain things will be unlocked in succession.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "b2cK4KNejWAqH5hM","flags": {},"type": 0,"text": "A spoon that alters the contents of whatever being eaten. It varies from person to person, but using the spoon over extended periods of time begins to alter the appearance of the person eating from it…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "ayYCB1bgdZjTcz9u","flags": {},"type": 0,"text": "A crystal ball able to show you your past.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "in6itRCcXAQvxxoD","flags": {},"type": 0,"text": "A three-lobed spinning device with almost frictionless ball bearings in the center. ߷ There are holes in the lobes and the center has a raised disk on both sides so the device can be held while it is spinning.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "BsAhGEkB8AAa49cF","flags": {},"type": 0,"text": "A small pocket watch, whenever someone holds it they swear that they’ve seen it before.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "p236j4g5YGwTQ8UH","flags": {},"type": 0,"text": "A small hourglass, the sand inside of it goes up instead of down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "s6kuSUfBlkobp0Na","flags": {},"type": 0,"text": "A pair of dice that seem to only roll 7s when in close proximity to gold or platinum.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "UPjgIOgL5i5HeCB3","flags": {},"type": 0,"text": "A coin purse that, once a day, will convert all the currency inside to whatever the local common coin is. It won’t add or subtract any, and it will leave change of what it can’t convert.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "j1O0matN6rNmp9ld","flags": {},"type": 0,"text": "A hat with ear flaps that, once ever 1d4 hours, flap as if the hat is trying to fly away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "lZlb1mJAgQ3937G4","flags": {},"type": 0,"text": "A pair of boots that leave tracks of a random creature, within 1 size class of the wearer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "mYms4tpiPWOaxXzz","flags": {},"type": 0,"text": "A lamp whose light seems to slide around when activated, throwing strange shapes on the wall, like flowing lava. Lamp can only be used for 4 hours before it becomes too hot to handle. After 8 hours, the lamp automatically shuts off and can’t be used until the metal cools, which takes 1d4 days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "45im0DULNPEMwzrF","flags": {},"type": 0,"text": "A cutlery set that makes whatever it’s user eats taste delicious, but needs to be meticulously cleaned after every use. The knife will dull, the spoon will shake and spill, and the fork will have tines break off until it is cleaned again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "ZSAesw7woD35hers","flags": {},"type": 0,"text": "Robes that have the origin map to a secret society of mages who control so near by towns and villages. This map appears on the back of the robes when a wizard wearing the robes cast a spell. The fabric moles itself to reveal the hidden map that can only be reed by those who reed Eleven.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "eBA493PX0kznGRKB","flags": {},"type": 0,"text": "A hardy, darkened conch shell with an almost dangerous amount of ridges and points. By holding the shell up to their ear, the holder can hear rushing water and violent waves with an unusual degree of clarity. Continuing to listen the shell causes the holder to slowly begin to experience sensations of seasickness and a pressure similar to being too deep underwater. As the sensations intensify, a muted, indecipherable whispering can be heard very faintly, as if it were coming from the bottom of the sea. The whispering continues to grow louder while the sensations escalate, until the whispers can almost be made out, at which point the holder falls unconscious for an hour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "c1Qqj3J9V7Zr3D5i","flags": {},"type": 0,"text": "A singular, tattered playing card with a very faded face side. When shuffled into a deck being used for a game, it is frequently drawn in the owner’s opening hand, with the face side of a valuable card for whichever game is being played. The card roughly matches the design and condition of the deck it was shuffled into when drawn, though it always is in slightly poorer condition than all the others cards. When pulled from the deck, the card is in it’s normal, faded state.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "co9OOlavDUfCkqo6","flags": {},"type": 0,"text": "A rather large iron pot covered in scratches and scorch marks that can’t seem to be taken off. Meals prepared by this pot are always palatable but in need of salt, regardless of whether the recipe called for salt, the consumer’s enjoyment of salt, or amount of salt that was used in the cooking. Coincidentally, this effect can be nullified by adding copious amounts of pepper to the pot before serving the meal, in which case the food is always suprisingly delicious.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "uM3wqC412adSJuge","flags": {},"type": 0,"text": "A small bottle of clear liquid labeled “Knowledge, only use in an emergency”.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "t2aU3wGSSLaAtvEk","flags": {},"type": 0,"text": "A tiny stone carving of a headless halfling.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "gzIPSxmaIdF3zJGS","flags": {},"type": 0,"text": "A key made of glass.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "OI8LlgRHoeod6nIr","flags": {},"type": 0,"text": "A silver ring with a poem in Druidic on the inside.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "jmpNguxhDlhorI9T","flags": {},"type": 0,"text": "A tiny bronze idol of a goblin carrying a knife in both hands and one knife clutched in his teeth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "NKkPtHmw6jQyoDEA","flags": {},"type": 0,"text": "A simple headband with a clear crystal set in the center of the brow. Can emit a red or white light on command. Last two owners were a (now disgraced) Inquisitor who claimed it was a tool for alignment detection, and a dwarven tinkerer who used it as a hands-free work light.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "z0W0MtD9HmB83vIu","flags": {},"type": 0,"text": "A gnomish cheater bar. A 2 foot long steel bar, designed to mount to the end of wrench handles for extra leverage. Can be used as a club in a pinch, and some gnome combat engineers have modified short swords to fit on the end, making them double as collapsible spears.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "dKKaVkq0vfgCFZ78","flags": {},"type": 0,"text": "A small locket designed for a noblewoman, with small painted portraits of her and her husband on the inside… and an even smaller portrait of her secret lover, in a hidden compartment positioned closest to her own heart.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "dU6x6nGKC19DdCls","flags": {},"type": 0,"text": "A small carving knife. Whenever you use it, you will never cut yourself, but you become extremely nervous about cutting yourself until you stop.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "tbuE4HlPyrIENrav","flags": {},"type": 0,"text": "A figure of a specific person with its mouth open. When you pour a liquid into it, it spits it out and then screams the name of whatever liquid was in it. However, if the person it resembles was unfamiliar with the liquid, it spits the liquid out, screams for 1d6 minutes, and then closes its mouth for 1d4 days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "GgOczLAbak8tXfY5","flags": {},"type": 0,"text": "A mysterious stone that has been shaped to have 20 sides. Each side has a number from 1 to 20. It seems like it’s from another world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "ytiuVNHLIhOUoazR","flags": {},"type": 0,"text": "A tiny plush owlbear. It’s worn and dirty. It seems like the original owner left it here on purpose.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "5Y43iwsxIAX7IuZ5","flags": {},"type": 0,"text": "A picnic basket that seems full of food. Once it’s opened, though, it’s revealed to have a half eaten slice of bread, a tiny cube of cheese, a berry, and one kernel of corn on top of a pile of leaves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "sy8jCDBM6zXy4Fcl","flags": {},"type": 0,"text": "An blue orb that when shaken causes a light snowfall 15 feet around the player who shook it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "rjYUclfvLdoH7pYF","flags": {},"type": 0,"text": "A pin with a picture of a mimic on it. Wearing it will help with stealth checks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "EPNRu2ravWZf1lg0","flags": {},"type": 0,"text": "A egregiously decorated dagger that looks razor sharp but can’t cut through anything. It’s also twice as heavy as it should be","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "rptcjHLfPM2NFlEX","flags": {},"type": 0,"text": "A normal dice that when rolled always falls on six. Everyone but the user forgets each previous roll if a new one is rolled","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "nYBmdkMztCaqCdmD","flags": {},"type": 0,"text": "A blank sheet of paper that cannot be destroyed by anything. If you write on it the words disappear and an answer is written down by an invisible hand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "BUJLT0vsOtqEaKUx","flags": {},"type": 0,"text": "A folding fan with 12 cryptic fortune cookie-like sayings that alternate every time the fan is opened.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "VfKbfRdwfCLfihYr","flags": {},"type": 0,"text": "A mimic ring who will eat a single finger off of any person (but only once per person) will tell a truth that it’s current owner wants to know.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "nfU0XmC9lvWBAAaI","flags": {},"type": 0,"text": "A gold covered sapphire that opens like a locket to form a mechanical beetle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "PNtfPIM02mduzHcx","flags": {},"type": 0,"text": "A whistle that sounds a random note when blown into.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "cqZZhQrJCqvvuT9A","flags": {},"type": 0,"text": "A small hourglass that automatically flips when the sands run to the bottom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "dfE6ae4VS3XOJIc2","flags": {},"type": 0,"text": "A teapot that is always full and piping hot, and whistles sadly if it is ever left alone.(edited)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "DO00BbOGJGjGe55N","flags": {},"type": 0,"text": "A cooking spoon that adds a cinnamon flavor to every dish.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "fdsYgJv5ydlCei8r","flags": {},"type": 0,"text": "A lamp whose color changes subtley with the holders mood.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "sY8jYYp7lIWUvAwZ","flags": {},"type": 0,"text": "A keying that is always in your pocket when you cannot find it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "sXxhU8Gkqu15E92z","flags": {},"type": 0,"text": "An elaborate fountain pen that turns into a snake and slithered around when not being used.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "31xNt74JFqPIImXa","flags": {},"type": 0,"text": "Shards of broken glass that seem to push against each other. You can work out that there was a hammer painted on the glass at some point.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "abWSKyqME8yWXgER","flags": {},"type": 0,"text": "A small smooth stone that seems to hum and vibrate when near a rakshasa.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "sXGaipXznYM4ZSQU"}
