{"name": "Curiosities Within the Cavern","description": "One hundred different interesting sights you may experience in a cavern.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "pYK9YRCgz0EHOixt","flags": {},"type": 0,"text": "A Stalagmite  covered in bent pennies. It looks like passers by have jammed the edges of pennies and other small coins into the cracks and irregularities and bent them down to create an almost scale-effect. Over the years more calcium has been deposited on the pennies, trapping them within. New pennies were jammed between other calcified pennies, and so on, growing the stalagmite over time. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "MlhKchdkxuvIUaNH","flags": {},"type": 0,"text": "The path here has been replaced with smooth stone squares alternating with squares of polished marble and rough stone in a checkerboard pattern. The whole pattern is irregular at the edges, longer but thinner than a true checkerboard. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "RDYOnL7WsLKsCSAf","flags": {},"type": 0,"text": "A vast collection of lamps and lanterns have been hung around the ceiling and walls, some hung from iron rods, some placed directly on the ground. No two lamps are the same, some are iron, some wood, some paper, some ornate, some elaborate, some elven, some dwarven. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "PuAGRnMB4dAMKuP9","flags": {},"type": 0,"text": "A dense fog has settled in this area of the naturally formed cavern, limiting visibility. It is not obvious what is causing the fog. You are only able to see the person in front of you, everything beyond is nothing more than a shadow, or a sound. Every so often you happen upon a skeleton, bowing in prayer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "5xOFkdhC0OEj2xRP","flags": {},"type": 0,"text": "The tunnel widens out into a circular room. At the center a raised dais fountain pours with mirror-smooth water before cascading over the edge. The water supports a single black gazing ball, gently rotating. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "57eAIJYYOolb8QOz","flags": {},"type": 0,"text": "The stone striations and inclusions of the walls and ceiling have all been engraved with small signs, in sturdy print. The signs name the stones, construction usage and religious properties. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "NHvoFBMJBkOrvgfF","flags": {},"type": 0,"text": "The path intersects with a calm subterranean river where a flat disc of stone, about 10′ across, is floating at the water’s edge. The river is causing the stone to rotate but it is caught in place by an outcrop of rock. As the river rotates the stone disc the disc grinds out more of the rock it has caught on. It has clearly been here for years as the stone it is stuck on has a sizable divot formed from the rotation. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "VecbbgSx86mVJIMy","flags": {},"type": 0,"text": "The mushrooms growing in this tall wet cavern reach up to the ceiling on tiny, spindly stalks. The caps are wide, some spanning to 5 feet, and each one is populated by an ecosystem of bioluminescent bugs. The stalks reach up overhead 10 to 20 feet high, but the diameter of the stalk is merely a few inches. Damaging any of these mushroom stalks causes them to collapse under their own fragility. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "fbAHy2FodM1BUc5e","flags": {},"type": 0,"text": "Several glass windows in iron frames have been scattered around this tunnel, leaned against stones and laying on the ground.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "tzsdTlGpA417Uyzn","flags": {},"type": 0,"text": "The walls begin to bulge inwards and you start to notice Large round stones littering the way forward. Continuing on is difficult terrain just due to the sheer number of round stones. After several minutes of struggling you come upon a clearing where several hammers and cracked stones are laid out on a blanket. Each round stone is a geode, able to be cracked with the hammer. They are beautiful, but cumbersome.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "UfN1rzd9CXDDVRNe","flags": {},"type": 0,"text": "The tunnel, once clearly formed by people, is covered in spider web fractures. Each fracture is filled in with a piping of gold, holding the structure together. It seems as though the tunnel collapsed at one point, and then was repaired in this ornate manner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "ZqrrwsUY82VekN04","flags": {},"type": 0,"text": "The path here dips down between an outcrop of stone that is densely covered in mosses and ferns. As the trail moves down, the stones raise up, towering far overhead yet still close enough to touch. At the nadir of the path a wooden bridge zigzags through two massive mossy stones. The railings of the bridge have stone pillars arranged in a fan pattern. Water drips down from the moss onto the passers of the bridge. The bridge crosses a skinny creek before the path slopes upwards again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "O5br9mEsMbmwYqe2","flags": {},"type": 0,"text": "Within a large open cavern the path happens upon a low wall made of loose stones. The wall is easy enough to hop over, but the path follows along only one side of the wall. After a few minutes of walking, a stone arched Moon Gate has been made, which the path follows through and continues onward. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "AE5z8kdda27UWkwR","flags": {},"type": 0,"text": "You come upon an oblong stone propped up vertically in the mosses. At its base, other oblong stones have been placed on the ground in a radiating sun pattern, all pointing toward the vertical stone. As the tunnel progresses two more of these sculptures can be seen, though one of them was a great distance away from the path in a branching tunnel. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "HPIfCsftC1TTpX4h","flags": {},"type": 0,"text": "Someone has carved out a lattice roof to cover this section of path. From it The moss ‘Old Man’s Beard’ grows, hanging down long white tendrils. Small round lanterns have been hung in between the mosses, but they are unlit. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "oAJ1vhgwGKgh421N","flags": {},"type": 0,"text": "The base of a massive igneous inclusion has been decorated with illusory moths, with iridescent white wings. The moths are fluttering while clumped all over the stone so that the rock cannot even be seen. They only cover it in patches, with small trails of fluttering moths reaching up the pillar. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "GvTdlbuui0UNcon5","flags": {},"type": 0,"text": "Perfectly clear glass mushrooms have been placed throughout the cavern around the trail, almost imperceptible but for their odd distortions of the stone. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "Zq5mrBbwvHCTeWAI","flags": {},"type": 0,"text": "Several lanterns have been hung along the trail here. All of them are made of downward drooping blue leaves or flower petals, with the gently hovering lights trapped within the bundle of leaves. The leaves are wrapped with black iron which is then formed into a hook so the lanterns can be easily hung from the hooks above. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "2XC3hgyJpOwFT6Kf","flags": {},"type": 0,"text": "You pass through a cavern that seems to have been darkened by magical means. Any light will only reach out about 5′ from the source, and light from sources you are not holding is invisible to you. From sound alone it is clear that there is a rushing stream, a cascading waterfall, and several winged animals flapping. Your footsteps echo through the black cavern, from the sound of it, the cavern is massive. The path crosses the stream at one point, and the water reaches up to your knees. Otherwise, the path is easy to follow in the dark.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "wQLyjDapViUxHyBa","flags": {},"type": 0,"text": "The path has been lined with hanging wrought iron bird cages. The cage doors are all open and plants are growing  inside, of all different types. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "Pws0duk67yrbjdv9","flags": {},"type": 0,"text": "In this stretch of wide tunnel crystal formations reach from floor to ceiling, from wall to wall and jut out at odd angles, completely interrupting the path. The Crystals span the full width of the cave and are at least 3 feet in diameter. To continue the party must climb over the crystals. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "1IcjcQnghayWuHLs","flags": {},"type": 0,"text": "At first glance the walls appear to have shifted from smooth stone, worn away by wind or water, to layered sandstone conglomerate, almost like bricks. On closer inspection still these are not bricks at all, but books, layered with their pages facing into the tunnel and then carved out to form the tunnel. Each book appears to have been ruined with time and exposure to the wet cavern.    ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "L1kXqXlJrF4xAR2f","flags": {},"type": 0,"text": "The path rounds a turn and opens into a massive cavern. A stepped tower ruin made of stone juts up to touch the ceiling. Where stone has broken down, letting light stream in. The tower is weathered and crumbling, and nothing can be found inside, but the sight is impressive. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "jbzUNqqoKLF3xMfq","flags": {},"type": 0,"text": "The cavern ahead is tall and wide, lined with regularly spaced columns of white stone. The columns are smooth and splay outward into the ceiling or floor in a smooth arc. There are no decorations, rooms, objects, or wide spaces, only regular columns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "ZaYjcsfBgkTi7vYH","flags": {},"type": 0,"text": "A small marble rotunda has been built at the edge of a subterranean river. It seats three comfortably but offers no shelter from the dripping cave as the roof is made of latticed iron. At the center of the rotunda is a small statue of a cat holding a fish in its mouth proudly. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "Mb4Eh1nIJVhEOkv8","flags": {},"type": 0,"text": "Along the low cavern ceiling someone has taken differently colored stones and attached them to the ceiling to look like a clear night sky. Several well known constellations can be seen in their work.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "jT5sd2ZmLTa0EFJq","flags": {},"type": 0,"text": "The path is unkempt, but you happen upon a short wide staircase, regal enough for any king. The staircase is 10 steps tall and wide enough for 5. Carvings of mushrooms cavern creatures decorate the sides. Someone has come through and pried all the gems from their eyes and the gold plating from the staircase in general, but the impressive stonework remains. The staircase connects to a higher portion of the path, which continues on as normal. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "P29YIloNGWtd4SA3","flags": {},"type": 0,"text": "The path begins to steepen, with roughly formed stairs leading the way. It takes a sharp hairpin bend to proceed. At the inner bend of their hairpin is a carefully carved statue of a man, holding a ferret in his arms. Several candles have been lit and placed all over the statue. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "GeXNSN0BXVnd11EY","flags": {},"type": 0,"text": "Immediately the cavern appears off to you, and it only takes a few seconds to place it, the stalagmites and stalactites, usually chaotic formations over thousands of years, have been replaced with some mockery. Tall stone cones, perfectly smooth, reach up and down through this cave. It is like someone wanted to create a cavern without knowing what one really looked like.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "EXCU3q7WCq8J0ifh","flags": {},"type": 0,"text": "The path leads up a set of thin stairs, into a very narrow cavern which continues for ten feet before opening up again. Inside the narrow space many passers by have left behind graffiti. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "d2N6nxui9zIQWWee","flags": {},"type": 0,"text": "The cavern becomes tight and difficult for tall or heavily armored people to pass through. As you squeeze through the pathway you notice that the walls, path and ceiling are all composed of life size, roughly made, doll parts. The heads all appear to be missing. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "1JlQyi2k4jGaPCI1","flags": {},"type": 0,"text": "The crystal formations in the cave are small and colorful, appearing every so often from the stone walls. Someone has come through this part of the tunnel and carved each formation into tiny, delicate stone flowers, without removing the crystal from where it formed. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "CUspKoR6UU74hJ5d","flags": {},"type": 0,"text": "The cavernous trail becomes grassy and lush, though the cave remains overhead. After a few minutes or so of this lush tunnel it opens up into what appears to be a clearing with a single wooden gazebo at the center, covered in flowers in full bloom. Benches all around the gazebo have been placed to support a large audience. The cavern overhead is cracked, and light streams in.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "AouU5dpQETKCCe1C","flags": {},"type": 0,"text": "The path leads along a rocky creek, flowing with crisp water. After half a mile the source of the creek is found, flowing from the palm of a massive hand carved of stone. The hand is recessed in the stone and shadowy. It gently tips water on top of a single juvenile tree. The stones all around the hand and water are thick with dark mosses. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "5rkZDAjq6KsbWa8h","flags": {},"type": 0,"text": "The cavern tunnel has become covered in small crystal points, like the inside of a geode. After some time the crystalline tunnel curves to meet a small river running underground. No moss or algae can find purchase on the smooth crystal, and the water flows crisp and clear among the points. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "fIFFEZSCKPqmPA2U","flags": {},"type": 0,"text": "The path curves underneath an outcrop of blue glowing mushrooms, whose luminescent spores waft down onto the cavern floor. Several bats flitter from wall to wall catching the spores in their mouths.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "en8Ur0tkBttcJ5yH","flags": {},"type": 0,"text": "The path gives way to a long line of wooden discs carved from tree trunks, lined end to end for at least a mile of trail. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "fzKQ3KFJmxVPIyY7","flags": {},"type": 0,"text": "Sculptures of hands can be found along this natural cave path. A series of cupped hands, carved of stone, holding forest plants in full bloom, despite the dark. Several hands protruding from the walls in a ladder pattern, granting access to small cavern rooms and ledges. One giant hand laid against the cave wall with a cavern map painted on the palm. A pair of huge hands, tented together to form a house, or shelter, with some camping amenities below. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "BOwgWukWpSlSKmOD","flags": {},"type": 0,"text": "The trail becomes unnaturally dark, and rushing water can be heard. With meager light you can see that it curves past a waterfall before cutting up through the stone. Right before the staircase begins the stone landing has been carved into a viewing point for the falls, with dwarven cut banisters, but your light can only illuminate a fraction of the view.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "2tmyPiuVXjsZKRtt","flags": {},"type": 0,"text": "Though the path continues to the left, a wide cavern to the right has caved in, leaving a massive circle of light from the surface down. Roots and mosses drip down into the hole, and the floor of the cavern slowly slopes upward, covered in wild plants and fluttering with birds. A small branching trail leads towards the overgrown cave-in. Along this trail, tall thin grave markers have been placed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "eRP2a2tAjTMZKYNW","flags": {},"type": 0,"text": "The path through an open cavern approaches a pond. The pond is perfectly square around the outside, and the path moves over the pond, on a series of rough laid stones covered in mosses, in a curved pattern. Branching off the path at regular intervals are tight spirals of stone. The pond is smooth and several glowing Koi fish can be seen swimming in the clear water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "fygf9ZhTCKaQqXLV","flags": {},"type": 0,"text": "The tunnel opens up into a low, wide cavern, and a strong wind blows through here at odd intervals. On the ceiling, what appear to be naturally formed stone columns have been hollowed out by hand to different depths. The result; when the wind blows through the cavern a deep, haunting drone is made be the ceiling itself. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "OTceGqB9qCeF6rNP","flags": {},"type": 0,"text": "The ground is wet and muddy with dripping water. As you continue on you come upon a deck of cards that has been scattered, some cards in the trail, some in cracks in the stone, some half buried, but all of them are clean and pristine. If the party manages to gather all the cards, they immediately rescatter from the holder’s hand, all over the cavern once again. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "1kGUxnnNHfAcJRuz","flags": {},"type": 0,"text": "A single tree far off in the middle of a huge dark cavern, shimmers with refracted light. On closer inspection the whole tree appears to have been carved from a massive deep blue tourmaline.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "Tyr1yP9osxezZsxu","flags": {},"type": 0,"text": "Someone has put down mile markers along the trail, big slabs of local stone with carefully carved dwarven numbers. They are not evenly spaced though, and don’t seem to accurately reflect distance at all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "b8dMKQWL38Q0LLjh","flags": {},"type": 0,"text": "A statue of an angel with a large stone sword stands in an alcove to the right of the trail. Several small pouches have been laid at its feet. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "9dfoaGTszrUACj3T","flags": {},"type": 0,"text": "From the ceiling a massive root has broken through the solid stone, leaving fissures and cracks as it reaches down. At the same place, from the floor, a root has broken upwards to the same effect. The roots have curled and spiraled around one another in the middle, interrupting the path. They appear to be from different species of tree.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "4VlUOIqpjzSpNXTe","flags": {},"type": 0,"text": "The tunnel path has run into a low, calm creek with a bottom of smooth flat stone. The water is only about calf-high. Walking in the water is soothing and invigorating. However every so often the creek bed is marred with deep (20+ yard) stone holes, perfectly circular.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "b7QtY3LAIbDhlzGn","flags": {},"type": 0,"text": "At the center of this cavern, lit from below by a series of bioluminescent ferns, is a stone sphere. The sphere is of different material than the surrounding stone. Additionally, the inside of the stone has been carved out, a set of stairs leads up into the center, where a raised altar has been carved, then another set of stone stairs leads out of the sphere. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "4KbLIHBm2OtQvHsx","flags": {},"type": 0,"text": "The trail opens up into a wide cavern dimly lit by glowing spheres. The pathway enters into the beginning of a maze. Through the maze can still be followed it looks like someone or something has simply obliterated a straight line right to the other side. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "D9MAWekUpXMRA4gQ","flags": {},"type": 0,"text": "The cavern is immensely tall, easily 100 feet high or more. At the top of this massive cavern wall you can clearly see a single window, lit from the inside. After looking for a while, the light goes out and the window disappears.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "5J2gSeB2VaARlvTS","flags": {},"type": 0,"text": "Someone has placed massive glowing spheres merged with the stone and stalactites nearby. The spheres glow a blue-green and range from one foot to 4 feet in diameter. Some are high up in stone outcrops on the ceiling, some tucked the worn stone path below.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "7rIaKOCTPLcAOQP9","flags": {},"type": 0,"text": "In the wide cavern with a rushing underground stream something vaguely humanoid catches your eye, just for a moment. It is deep beyond the trail but, moving your head slightly, you can just barely make the outline of a person. If the party inspects further they will find a human sized sculpture made entirely of a mirrored surface, to reflect the cavern around them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "sEjvnJ8LnfA127Ka","flags": {},"type": 0,"text": "The tunnel opens into a huge cavern full of massive trees. Broken pottery scatters the ground. Pieces of broken flower pots lay all around the roots of the trees here, giving the sense that these trees burst out of their former containers rather quickly. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "JJUDRJkY1nygBxYl","flags": {},"type": 0,"text": "From far off you can hear the sound of falling water. Light up ahead seems to betray and exit to the cavern, but as you arrive you see that a waterfall has cut through the ceiling, and again through the floor. Peering down, you can see that the waterfall has cut through many other tunnels below, and there is no clear way to the surface.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "NQJ0irhfDmYZfrqN","flags": {},"type": 0,"text": "The natural cavern opens out into a wide hallway, clearly carved from the surrounding stone long ago. The ceiling is now at least 50 feet overhead and massive pillars support it from below. Thin staircases cover the pillars and walls, leading to small alcoves. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "yc9wMRGeL9ef9c9G","flags": {},"type": 0,"text": "A band of bright lit stone forms overhead, lighting the tunnel. Someone has planted a row of rose bushes on either side of the tunnel, the roses are in full, brilliant bloom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "HAaNjl4dQbYO9kje","flags": {},"type": 0,"text": "The cavern that appeared to be naturally formed has shifted toward a man-made tunnel. The floor is flat, and the ceiling is a perfectly curved arch. Every foot or so the stone of the walls changes, from slate, or limestone, to moss agate, to obsidian, etc. Each stone section fits perfectly with those next to it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "M1CV5QutDdez9Qgu","flags": {},"type": 0,"text": "The cavern path dips down under the surface of a calm subterranean lake, it is easy to see it continue underwater and then reemerge on the other side of the lake. It looks like the only way across is to swim. The water’s surface is not calm though, perhaps the ceiling is dripping and disturbing the dark water?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "699K9DiBlX1XFxkA","flags": {},"type": 0,"text": "The cavern here is made entirely of chalk. It wouldn’t be hard to break off a chunk , and in fact it looks like several adventurers before you have done just that. In the tunnels beyond, chalk graffiti is quite common.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "aOmGkfCTfamBcNxZ","flags": {},"type": 0,"text": "Ahead you can see odd crystal formations in the tunnel, they are flat and wide, and reach down from the tunnel ceiling, but none jut up from the floor. The floor remains flat and clear. The crystals force the tunnel to shrink, making the party proceed in single file. In places the crystals come down quite far, and elsewhere they are at least 30 feet overhead. Upon close inspection, or if anyone touches the ‘crystals’ they will realize these are not crystals at all, but pieces of glistening fabric. This was never a tunnel at all, but a wide cavern, completely packed with these hanging strips of fabric.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "fmt9gy26BYXRK5VG","flags": {},"type": 0,"text": "The cave opens into a subterranean room, carved out intentionally, but not cleanly – it is irregular in shape and through the floor is flat the walls and ceiling are not. There is nothing in this room except for a 20′ circular raised platform bearing a wide array of mosses. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "5w6qoUlXG4ZAWE4a","flags": {},"type": 0,"text": "A large red clay pot has been placed on its side at the top of a nearby underground spring. The back of the pot has been removed to let water flow in, changing the water’s course to flow out of the mouth of the pot, giving the effect of constant pouring. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "iEPa5Gz0PJl8Q0qx","flags": {},"type": 0,"text": "In the nearby stone and crystal pillars, naturally formed, are various carvings. Some are plants and trees, some are animals and fish. Each carving is done expertly. In the middle of a large group of carved plants is a carving of a person whose joints appear to be that of a mechanical doll’s. It’s face is a plain featureless mask. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "YBfgfIsgorsfs261","flags": {},"type": 0,"text": "A geyser erupts every few minutes along the pathside in this cave. It strikes the low ceiling, just as it has been for hundreds of years. A sizeable hole has formed in the stone above where the water strikes, and now, when the water strikes the top, the hole forces the water to flow down in a domed shape. The water is hot, but not scalding. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "4e0WIOoxcXVGaDzR","flags": {},"type": 0,"text": "The trail passes through a low, wide cavern which is full of water. Floating on the water’s surface are thousands of large blooming flowers. At the base of each blossom a silver ring fits snugly. Removing the ring causes the blossom to wither and die. You must wade through the flowering lake to continue on the path. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "gljMRTBfOsSX1imw","flags": {},"type": 0,"text": "Ahead the stone tunnel trail gives way down a steep cliff with a descending staircase. Along the way, several man-made turquoise pools of water cascade down into one another from a local spring. The pools each feed into one another and have a submerged bench to seat between 5 and 10. No other people can be seen.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "ivvYnV2Kb6IUhRN7","flags": {},"type": 0,"text": "You began noticing a few spider webs catching drips of water from the ceiling. The webbing becomes more and more common and as it does, the strands shimmer with iridescent color. After a while thick and heavy opal strands drape over the trail like blankets. Eventually the webbing fades like it appeared, and the trail is clear again. The next time you inspect your pack, you find a 30′ coil of strong silken rope.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "RxF70QOGBCde5PDy","flags": {},"type": 0,"text": "The trail passes by a pocket cavern off the main tunnel with a circle statues of delvers in poses of laughter, trade, or rest. All of them appear happy. Each one has a real backpack, though some are rotting off. Many of the backpacks contain small offerings, perhaps left by passing adventurers?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "jMSq2jry1ls5QaOj","flags": {},"type": 0,"text": "The natural tunnel is bisected by a subterranean ice flow. Some time ago, perhaps years, the ice was carved through by some adventurer to continue on to the rest of the tunnel, but the slow moving ice has pushed that tunnel down-flow. The entrance of the tunnel is no more than a foot and a half wide, and will need to be cut to accommodate anyone larger. The ice tunnel beyond is spacious, but the exit, once again, is tight. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "WRtoXl3ZRhQiaM8v","flags": {},"type": 0,"text": "The tunnel passes through an immensely tall skinny hole, leading towards daylight. Bats cover the ceiling, squeaking and fluttering around. Peering outside you see this rift is at least 100 feet up the side of a sheer cliff, overlooking jungle. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "SCjvo5yXSkwCUhgi","flags": {},"type": 0,"text": "You happen across a long bridge spanning a chasm. Glancing to the northeast you see another bridge, made of a massive stone slab, overgrown with moss. A procession of drow crosses the bridge in silence. When they reach the other side you can no longer see them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "CIbolcnkJLDK3hLy","flags": {},"type": 0,"text": "You hear the sound of distant creaking. Perception check to spot, deep in the dark cavern, a structure. Far off the trail is a calcified sailing ship, sails heavy with water. There is a large hole in the hull. Stalagmites have formed on the ships surface and a wet algae has grown across everything.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "HX6fWdi8xzkqElxc","flags": {},"type": 0,"text": "Calcium deposits are prevalent in this cavern, but up ahead an old stalagmite and stalactite have met in the middle of the tunnel. Just before touching someone has placed a smooth sphere of precious stone, and now the calcium has begun to form around the outside, holding it in place.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "ZAI2gZhcTINEhfkZ","flags": {},"type": 0,"text": "A gigantic jawbone is arched over the trail, over the party’s heads with room to spare. Glistening strings with blown glass stars have been hung from various points on the teeth. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "Pbkv9LXv4Hgwkyhn","flags": {},"type": 0,"text": "The tunnel floor comes upon a circular puddle full of dark water. Trying to touch the water reveals the ‘puddle’ is actually a very deep borehole reaching down 50 feet. At the bottom of this hole are several adventurer bones and any supplies not ruined by water. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "HMpoAvcw7SzMeA05","flags": {},"type": 0,"text": "The trail passes by half a stone face carved from a boulder, Just this half of the face is taller than any party member. A mile down the trail, the other half of the face. Farther still, a hand holding a sword hilt and the broken fragments of sword. Then another hand holding onto a lantern the size of a small house, lit by some magical force. The stones around the lantern glow with a pulsating rhythm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "GgStAF8z1Rqiu2eD","flags": {},"type": 0,"text": "While the cave wall to the left is rough and craggy, to the right the wall is smooth, bulging out slightly. As you continue the smooth wall changes pattern over the course of half a mile of perfectly straight cavern. By the end you have an idea of what it is and your theory is confirmed with you see the huge face. The ‘wall’ was a gigantic fallen statue of a person. The only exposed eye, larger than your whole body, appears to be hinged like a door. A small room can be found beyond.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "un7uQtzkoRDBXhWT","flags": {},"type": 0,"text": "The trail passes by a circular mirror which is being held from behind by a statue. The Statue depicts a man in a cloak with an impossibly long neck and the face of a barn owl, peering over the top of the mirror and gazing at itself. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "cuLZZXXjhV6IEOrR","flags": {},"type": 0,"text": "Along the trail are spheres of iron, hollow on the inside about 2 feet in diameter. The iron shell has been cut out to show a forest scene made in metal, each sphere has a different scene. Someone has set a campfire inside each. The fire on the inside of the sculpture backlights the iron cutouts, and lights the tunnel.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "zRtwp1rYSGebPcMp","flags": {},"type": 0,"text": "The tunnel is cut by a fissure in the stone, one foot across, and spanning into the stone an unknown distance. The fissure  is well lit by a magma flow running down one side of the fissure and along the bottom, but the magma is at least 10 yards away from the tunnel and poses no risk. The heat causes strong winds to blow through this fissure and through the tunnel. The jump across is easy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "wo5mv3VAOJfLmXNU","flags": {},"type": 0,"text": "The entire tunnel has two fissures running along it, horizontally. This causes one whole layer, or strata, to be offset from the other walls by a foot. It appears as though a portion of the stone was simply pushed out of alignment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "iDka85owFPIxFb6b","flags": {},"type": 0,"text": "A sculpture of a giant metal key leans against a plain wall. It is labeled “Important”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "jqK22XhZBMTzUdHu","flags": {},"type": 0,"text": "In an expansive cave on either side of the trail Two massive stone wings have been placed, reaching toward a vein of black stone in the ceiling.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "Z1VmkcrnUapxjS3d","flags": {},"type": 0,"text": "A massive circle of obsidian, about 20 feet across, has been placed in an alcove just off the trail. It is elevated off the ground about 2 feet, held up by carved stone legs. Condensing moisture in the air has filled the slightly concave surface with perfectly smooth reflective water. After looking for a moment, a drop of water falls, disturbing the smooth surface.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "KMOIuh4U4o9mlhW9","flags": {},"type": 0,"text": "Rather than building a bridge over the top of this subterranean stream, someone has tunneled underneath. Inside the tunnel is lit by a cluster of luminescent moths.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "JU9no9fidCQSs3ZN","flags": {},"type": 0,"text": "This stretch of tunnel is scorched, as though a fire has recently passed through. In fact, a few burning embers and hot stones can still be found. The mosses here are still smoking. Interestingly the smoke of the mosses is pleasant, like incense, and fills the cavern with flowery smoke.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "kjzo0oDGzyYpDnLI","flags": {},"type": 0,"text": "Several animal skulls are piled along the tunnel. Each one has been delicately carved with an intricate pattern, without losing the structural integrity of the skulls. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "088ri00kc65GnbtR","flags": {},"type": 0,"text": "At a bend in the trail, just off to the right, someone has placed a perfectly smooth cylinder of white marble, 7 feet tall. Walking around to the back of the cylinder reveals a highly detailed face has been carved into a deep crack in the marble.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "ch66I9iA65onSbIq","flags": {},"type": 0,"text": "A massive illusionary koi fish swims through this cavern. Every so often it dips down to pass right through the party. Each time it does, the air smells of fresh mint.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "bkFuaiLmlqIi6cwK","flags": {},"type": 0,"text": "Someone has taken the heads of old broken shovels and attached them at the base to make a huge metal pine cone. Then they placed smack in the middle of this tunnel, for some reason.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "3jWIIt8EAr09AYXv","flags": {},"type": 0,"text": "At first you think perhaps someone has spilled a bag of coins, but you realize that the scattered coins get more and more dense, almost like a mosaic. For about 10 yards the trail is perfectly paved with coins before the trail peters out again. The coins here appear to be from all different regions, in small denominations. Should you leave some coins to further the trail too?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "szRW0h7DjMX1yEGF","flags": {},"type": 0,"text": "Through the dark cavern you can hear the sound of ocean waves, and begin to smell salt air. Rounding a corner, you can feel sand underfoot. Inside this pitch black cave the ocean laps at the shore.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "BQRFZuWepqQ7IwMN","flags": {},"type": 0,"text": "A stray dog wanders up to you on the trail and decides to walk with you. He has a red bandana tied around his neck. After about a mile or so he wanders off again, down a branching fork in the tunnel.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "RTE0saeMLwOckMuj","flags": {},"type": 0,"text": "The trail has become a stone hopscotch board.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "iuwq7UNtzrdgnTys","flags": {},"type": 0,"text": "Passing by a wide stream you spy a cat walking into the water. To your shock the water arcs around the cat, keeping it perfectly dry. With a deft swipe the cat snatches a fish from the water wall in front of it, and leaves the stream, still dry, now fed.  ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "Rlq0sGCX2kgk3udD","flags": {},"type": 0,"text": "Ahead you can hear the clink and jangle of falling pebbles. Rounding a bend in the trail, a cascade of smooth beach glass pours from a fissure in the wall, flows over the path, and continues on down another crack in the wall. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "AKHGA3JBJdD9gUcK","flags": {},"type": 0,"text": "The cavern walls have fossil imprints regularly. Among the fossils you may find; a giant dragonfly wing, 10 feet long. A series of tiny hand bones. The complete skeleton of a large lizard like creature with huge horns. Several hard-shelled beetles, a up to a foot in size. The “bones” of a porcelain mechanical doll, with a mask in the place of the head. One stone crack is filled with spiraling ridged shell fossils.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "Fmogd4XD9KL56ttr","flags": {},"type": 0,"text": "The path opens up into a carved out grotto where several gigantic metal rings support celestial sculptures. The Sun and Moon are represented by colorful and bright spheres carved to resemble the faces of two women. Other planets and important stars have their own rings. It appears that the rings move in time with the celestial bodies, accurately depicting their position from the perspective of someone at the center of the sculpture.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "Hj34WkiQnsbABcoZ","flags": {},"type": 0,"text": "The tunnel slopes downward before ending in a hole, about 10 feet across. Several sturdy metal hooks are in place and at least one already has a rope attached, though the durability of the old rope is questionable. Peering through the hole, you can see the roof of a sizeable castle, with towers reaching up to just under the hole, it would be risky to jump, but plausible. Through other holes in this cavern ceiling waterfalls pour into the castle. The sturdy stonework of the castle has resulted in flooding from the waterfalls. Each room holds a few inches to several feet of water. One windowless tower door was so well made that the full tower was flooded, and now water cascades from the top down the stonework and into the courtyard. Water cascades down the grand staircase to the entrance. The courtyard, surrounded by a low circular wall, is now an algae filled pond, full of cave fish. Outside this castle pond, overflow rivers converge and continue on into the cave.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "n5rCPRYTGLevsgeH"}
