{"name": "Factions","description": "One hundred different groups that can help/hurt your players!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "xa9izJan6O5r4yz1","flags": {},"type": 0,"text": "The Old Lord’s Watch – A group of retired combatants that protect a small village from evil threats. They put up the disguise of an old man/woman, but they haven’t forgotten their training. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "RNHnINJgO6R4J7BI","flags": {},"type": 0,"text": "The Wayfarers – a band of pirates who pilot the seas off Waterdeep. They offer peace with pirates who run the Wayfarer flag. The High Wayfarer is an illithid pirate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "G3Ou4OCinjcSv28U","flags": {},"type": 0,"text": "Compassion Conclave – A conclave of Lawful Good Warlocks who work to promote being kind, helping others.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "km2CPJN3lhAOLa1i","flags": {},"type": 0,"text": "My Eyes are Down Here – Gnomes, Halfings, Duergar, Kobolds, small races of all kinds grouping together for awareness of Shorter races and delivering speechs and information on how to talk to those of shorter stature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "L7i1PdfVzCbFO1db","flags": {},"type": 0,"text": "The Unchained – Mercenary band comprised of former slaves and prisoners. Make use of scavenged or improvised weapons. Often found fighting in rebellions. Have a very loose command structure and usually exist in smaller groups.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "E2c62TrzmLBB5J2E","flags": {},"type": 0,"text": "Society for the Protection of Nature – Various Druids, Monks, Paladins and Cleric of natural domains. Fighting against pollution of natural habitats, deforestation, industrialisation etc.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "74LmcaWbnJYaLYqv","flags": {},"type": 0,"text": "RSPD – The Royal Society for the Protection of Dungeons. A group of fanatics who believe that dungeons are to be preserved and not delved in for treasure or glory, or even to sort out the kobold problem.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "rn8x7udD9ckXeq6b","flags": {},"type": 0,"text": "The Legion of the Faceless – a nebulus organization that practices intense anonimity, always wearing masks when in combat or public settings. They claim to be everywhere and to hear everything, making them excellent at political blackmail and manipulation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "g9KVxWiErYrtLcBu","flags": {},"type": 0,"text": "The Cult of the Clear-Eyed Mind – a small group of dwarves that have sworn off alcohol. They boast of fantastic powers, such as remembering what happened last night.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "mf29fGREIXmQJSFQ","flags": {},"type": 0,"text": "The Jötunn Valkyries – Half giant and half Aasimar these armored shield maidens inspire both dreadful fear and fierce loyalty. Their hair dyed red with blood and their eyes burning with a rage only a fool would ignore sets the tone on the battlefield.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "xa4DqVFMCP6kywNe","flags": {},"type": 0,"text": "The Banner of Pine Needles – A warband of elfish archers known for hunting goblins and orcs. They show no mercy and offer no quarter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "Ia7ym8Rr5fGbTvFM","flags": {},"type": 0,"text": "The Glürgil Tinkerocracy – A Gnomish scientific community that believes wild and dangerous progress for the sake of progress is still progress…only faster.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "K0IUaKndZAOUHwAn","flags": {},"type": 0,"text": "Lords of the Gyre Mountains – Dwarven emissaries, traders, warriors, smiths, and diplomats. Powerful and rich families comprise this clan. Their ancient walls have never been breached.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "F38fEW8ZRw8ioqSd","flags": {},"type": 0,"text": "The Scale – Lizardfolk, Dragonborn, and Tortles known for their ambushes and their proclivity to bed in the sewers of large cities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "Brv9cF2xoqevqalv","flags": {},"type": 0,"text": "Morg Trigal – An abnormally large war band of goblins, orcs, and worgs. The large column of torches and smoke often gets them confused with a fire wurm. A war chief and shaman priestess leads the horde.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "rTNGA7y8o0zrsXin","flags": {},"type": 0,"text": "The Ivory Jacks – Led by the large, mustachioed Rupert Quakesly, the Ivory Jacks are the city’s premier white collar gang. They deal in upper class drugs, underground fight rings, brothels, casinos, and they have their hands in the pockets of most politicians.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "jlQHSiI1jrpxTksQ","flags": {},"type": 0,"text": "The Nobles of Naught – Led by the Crow Prince, a mysterious figure who wears a cloak of black feathers, the Nobles of Naught are everywhere. Dedicated to bringing an end to corruption and the mistreatment of the poor, the Nobles could be anyone, from the city guard, to the baker, to the small orphan on the street corner.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "agRz32g0xAJskFcV","flags": {},"type": 0,"text": "The Sirens – Led by Madame Tuvelle, an elegant older woman, the Sirens are a group of elite spies and assassins around the world disguised as escorts and whores. Their base is in a huge, gaudy establishment known as the Sanguine Songbird, which fronts as an upper class casino/bar/brothel.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "B5VAlMqCfx0y0xT4","flags": {},"type": 0,"text": "Council of the Eight Tipped Star – An order of mages led by eight masters, each focused on one of the schools of magic.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "7S4RCSbCAXRCH09r","flags": {},"type": 0,"text": "The Knights of the Arsenal – An order of holy knights who value showmanship. They stage elaborate gladiatorial bouts as a way to fund expeditions to hunt and destroy evil forces throughout the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "MCQdJUnnWqZp1Wr0","flags": {},"type": 0,"text": "The Deep Corsairs – Vicious pirates, mutated by some elder sea god into half-humanoid, half-fish monstrosities. Usually, they don’t bother with ships of their own, simply rising out of the sea and sending their victims (and their treasure) to watery graves for later retrieval.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "BxN5xRhpVwjEkMLv","flags": {},"type": 0,"text": "The Order of St. Davûm – A holy order, founded by a priest of the god of death, whose priests go with armies marching to war to serve as healers and medics; they perform burial rights after battles for the fallen soldiers on both sides to prevent them from being brought back as undead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "EW9XJoBvSzJBR4xO","flags": {},"type": 0,"text": "The Fraternal Order of the Azure Quill – An organization of sages and spies. Secretly run by an evil blue dragon, most members do not realize that they are collecting information specifically on the dragon’s rivals to help him take them down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "2DmCJJfT96bbdzvJ","flags": {},"type": 0,"text": "The Order of the Archive – A knightly order dedicated to preserving all knowledge, even reprehensible works by demon worshippers and necromancers, against a future dark age, and making sure it stays safely in the right hands. Knights of the Archive train rigorously in shutting down black mages, helping those who have had their minds stolen by evil magic, and protecting and copying ancient writings.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "JjwP8xoWIz6Gfu6p","flags": {},"type": 0,"text": "The Gabbo Initiative – A group of wizards that are convinced they can civilize goblins.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "yJSJhCDUTqP22Eom","flags": {},"type": 0,"text": "The Council of Gears – Warforged, Gnomes, and Dwarves sit on this very public group whose main purpose is to limit the proliferation of dangerous technologies. Their influence spans continents.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "uH8MsLfnThGt3fwA","flags": {},"type": 0,"text": "The Hollow Moon Pack – Lycanthropes, shape changers, and animagi so ancient they no longer change with the moon. They mostly keep to themselves, but when angered their savagery is legendary.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "3HNkUbhdxSYNhYyh","flags": {},"type": 0,"text": "Crone Rock Watch – A group of paladins and clerics that hunt down hags and witches.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "qsfDlLSSXV93tOHv","flags": {},"type": 0,"text": "The Magistari – Five aasimar wizards sent from the east to destroy a great evil.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "RkAXByxVCfbnU7d5","flags": {},"type": 0,"text": "The Silver Woodsmen – Anti lycanthrope, and expert monster hunters. They have all lost family to this affliction and are not known for showing mercy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "H05DqdAi293V81rv","flags": {},"type": 0,"text": "The 50’s – A gang of half-breeds. Half-orcs, half-elves, half-halflings (quarterlings?). You name it. They just want to be seen as legitimate races.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "e1Td1tUpvWJH7gb8","flags": {},"type": 0,"text": "The Order of The White Stag – a group of rangers still loyal to an elven Prince in exile.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "8rXRCdL9rxkI5Vji","flags": {},"type": 0,"text": "The Last Arc – a group of environmentalist who believe that the end of days is coming, and have built a huge raft to ride out the apocalypse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "uoRkL3gxjJ5MYE8L","flags": {},"type": 0,"text": "Fragmented Truth – a faction of believers who think that the written history of the land is a lie, created by the ruling kingdom to control the common people. They seek the truth about history so they can expose the kingdom for the fakes they are.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "F09beBjVW0VhuKeW","flags": {},"type": 0,"text": "Angelic Fighters – a well known faction of warriors who wish to finish to take their last breath on the battlefield. The faction will fight for any side in any conflict for the right coin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "cv1fl83kVaSg5z7Z","flags": {},"type": 0,"text": "Glory’s Treasure – a faction of low rank adventurers, searching for the long lost treasure of the ancient kingdom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "Il1PHohlR0joPsr9","flags": {},"type": 0,"text": "Altered Magic – The faction of dark mages who wish to change magic forever.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "McTHo5bY5p2TmHP2","flags": {},"type": 0,"text": "Librarians of The Kingdom – a faction that seeks the knowledge lost to time. This faction consists of several scholars ranging from Historians to Poets. This faction has one core belief that the blue dragons are the superior creatures of this world, and as such the Librarians can’t harm a blue dragon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "9P9lzKBhAoh35xWM","flags": {},"type": 0,"text": "Shady Ladies – The mysterious faction of ladies who have been cast out of society for various reasons. The faction works in secret to gain enough power to over throw the current kingdom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "LiRFirOyThBDhqrb","flags": {},"type": 0,"text": "Black Bards – a famous group of bards that travel the lands searching for musical talent to join their faction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "3fffeMEIlPHnoBL6","flags": {},"type": 0,"text": "Huntsmen of Grim-Lock – a group of huntsmen that protect the town of Grim-Lock from the unknown evil of the world. This faction is mysterious in nature, and the very location of Grim-Lock is unknown. Joining the faction much less finding them is a struggle of impossible feats.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "W1ZxzMh8wgSt5So7","flags": {},"type": 0,"text": "The Gaia Chain – A massive, world-wide, ancient order comprised of druid circles, dragons, and elementals. Membership is usually passed along bloodlines. However, they have three gigantic temples that are open to the public only once a year.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "wFK6Cj1up2mw1G1e","flags": {},"type": 0,"text": "The Razing Horde – Barbarians, Orcs, and Goblin tribes that united and utterly destroyed a city for tormenting them with necromancy and dark magiks. They diverted a river to wash away the ruins of the wizard filth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "kY1zKe5oBJKVe7ot","flags": {},"type": 0,"text": "The Capellbairn of Craghoof – Mostly scouting parties, traders, farmers, and warbands of centaurs & halflings. Very territorial… and very odd to see.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "j5NnbcePF7QENsWE","flags": {},"type": 0,"text": "The Witchgamut – An order headed by three sphinxes, three LE hags, and three Aasimar that are dedicated to keeping wild magic in check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "v1aTxajsuT562cJ8","flags": {},"type": 0,"text": "The Praxus Inquisitors – Order dedicated to purging the world of magic and their practitioners.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "fwjQcpQk1uC89k2P","flags": {},"type": 0,"text": "Infiltration Unit 42 – Warforged led spy cabal that hasn’t stopped even though the Great War is long over.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "p7IF6I1U1z3G6Pp1","flags": {},"type": 0,"text": "Flumphs for a Peaceful Future – A cloister of flumphs have made a group that encourages peaceful interactions amongst the Underdark.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "ghEu9DShsmB9iPDn","flags": {},"type": 0,"text": "The Green Order – A group of knights that protect a forest. When knighted, as part of their oath to the [forest/diety/whatever] their hair turns a dark forest green. (Shamelessly stolen from Matt Colville’s Ratcatcher books)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "5mIKyvnMVzReLoZu","flags": {},"type": 0,"text": "The Unalloyed – A group of xenophobic Dwarves that want to remove all non-Dwarves from Dwarven lands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "AAFiGrNyOR65qMRv","flags": {},"type": 0,"text": "Order of the Black Sun – a group of monster-hunters, made up of people who have lost family or friends to monstrosities. They are lead by a Knight in dark armor who’s face is never seen. The Order is made up of good people, who aren’t afraid to get their hands dirty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "bpqPlmI5QHSbtXbO","flags": {},"type": 0,"text": "Dragão azul (Order of the Blue Dragon) – A secret organization of agents that handle the less scrupulous needs of the ruling class. They have a set of coded chits they keep on their possession when communicating with each other.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "npKdAIws35004YO8","flags": {},"type": 0,"text": "The Glacial Stream – A mercenary group of made up of goliaths that were expelled from their tribes. They travel the world and take on dangerous tasks that either lead them to glory or an honorable death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "ZsBnFXYxX8EiJyHP","flags": {},"type": 0,"text": "Syndicates – a group of wizards, scientists and engineers who develop technologies to dominate the world. They live and work in underground chambers, protected by runes and automatons, and often attack settlements for supplies and test subjects.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "Bfc8an1R18k6lMYy","flags": {},"type": 0,"text": "Owlbear Team Nine – an elite force of highly skilled combatants, who respond to immediate terrorist threats, and hunt down their headquarters in order to eliminate them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "QqmQApqPPLmVzmMz","flags": {},"type": 0,"text": "The NewWorlders – magic users who believe to have discovered a way to create a new plane of existence. Their objective is to create a realm of pure good, where all races can live happily and safely forever. They attempt to achieve this by the easiest and quickest means, which often involves theft and murder.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "o32TiwEbGu7fWhfy","flags": {},"type": 0,"text": "The Knights of Pi – a group of paladins/druids that live in a big forest, supposedly protecting it from evildoers. They channel their magic using math, that always involves circles, and shouting the letter π.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "L8g0OtJIapUkFHAB","flags": {},"type": 0,"text": "The Scarlet Troupe – a company of tricksters, jugglers, acrobats and strange animals that roam the land delighting the masses with dangerous acts and daring twirls. But that’s a façade, for the Lady —head of the troupe— is a Mistress of the Assassin’s Guild, and she moves the Troupe to where she (and them) must fulfill contracts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "Mx4fYoltSUaabsC9","flags": {},"type": 0,"text": "Knights of Levistus – an ancient group of devil worshippers that use only fire based magic. Their only goal for centuries has been to travel to their master in the Fifth Layer of Hell and melt the ice that imprisons him, and in turn they have been promised eternal life and power if they succeed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "esIAqbzV88ADFLXb","flags": {},"type": 0,"text": "The Sixth House – Members of a dishonoured / forgotten noble family who work in the shadows to destabilize the ruling Five Houses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "MDGnuSERKlivBPoe","flags": {},"type": 0,"text": "The Circus of Smiles – A roaming caravan of performers and clowns which is actually a dangerous cult of chaos and insanity. This roaming band leaves only destruction in their wake, as their charms lure members in with displays of debauchery and madness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "GkNkTFA5puzhFgYP","flags": {},"type": 0,"text": "The Curators – An organization of wizards of several races that have banded together to create the greatest compendium of magical knowledge called Index. They are known to fanatically hunt down and catalogue magical artifacts and tomes to add to their already sizable collection. They have even been known to trade in countries’ secrets and intelligence, running a vast underground spy network.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "XOzlD1Jqjh70rsJ9","flags": {},"type": 0,"text": "The Nighthawks – A group of assassins, under the guise of servants of the local death god/goddess. They are a rogue element, and disavowed by the death temple, as they actively kill, rather than letting death come naturally.  Of course, this is a front for their true identity, a cult of demon worshippers, hunting artifacts of ancient power to fuel the gate spells that they intend to cast in order to allow their demon king to cross to the material realm and claim it.  The most dedicated/depraved members have been gifted/cursed with a charm of undeath, rising a short time after they are killed as near-unkillable vessels of the demon king to exert his will and rage upon the mortal world for a time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "4Wa37PCcluMlbhUU","flags": {},"type": 0,"text": "The Golden Legacy – A terrorist organization composed of the descendants and worshippers of a tyrannical gold dragon. The dragon left behind its naturally good outlook on life in pursuit of greater power, starting a cult during the process. Even though it has been centuries since the dragon’s passing, members of all races can be found among the ranks of those that believe that the dragon will return one day. The organization is led by gold dragonborn who are believed to be of the dragon’s lineage, and are thereby holy in the organization’s eyes. The faction’s main focus is to seize the “holy land”, the capital of a nearby empire which had originally been the dragon’s lair. In addition, the faction is strongly predjudiced against all dragonborn that are not gold, even other metallic-descended dragonborn. They are seen as unholy, and the Legacy wages a race war on all “inferior” dragonborn in order to purge such “blasphemous creatures” from the world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "ogdzAh1erEziAFrz","flags": {},"type": 0,"text": "The Church of the Great Eye – A cult that worships Chezdrur, a beholder.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "2HVhvz5oluysZmXs","flags": {},"type": 0,"text": "The Faith of the Lazer Eye – A similar cult that worships Eloks, a rival beholder of Chezdrur.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "Sbd3ZD4oAWS1QSZB","flags": {},"type": 0,"text": "Anonymouse – A group of anarchistic ratfolk. Known for their foul mouths and horrible pranks.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "zMwuw42GxdRQZAQm","flags": {},"type": 0,"text": "Tiamat’s Teeth – Dragonborn and human followers make up this army. Conquest for their dragon masters is the only thing they know.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "27rMoPoL3V4DNmqf","flags": {},"type": 0,"text": "The Oak Defenders – Mostly comprised of farmers, fighters, and freed slaves they will fight to protect their lands. They have quite the armory from all the foes they’ve defeated over generations. The local nobles are getting scared of their growing political aspirations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "FnKnYiiLh3cX75xf","flags": {},"type": 0,"text": "The Stone Hewers – They built most of the walls in the kingdom. Mostly civilized giants, human engineers, dwarf masons and ogres. They have a monopoly on both building walls and destroying them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "bZP8pmrGsZxc9IrZ","flags": {},"type": 0,"text": "The Tonabi – Hunter gatherers that live in yurts along a coastal mountain range to the north. Their territory extends to many islands and many an intruder has fallen to their arrows and harpoons. Love to trade fish, meats, pelts, and seaweed for metal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "iu2A84TNuTQ8Kvr3","flags": {},"type": 0,"text": "The Yarn Pride – Tabaxi rouges that got tired of being treated poorly by society. They steal anything not nailed down. Scratch that…they just stole the nails. Check your pockets.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "j6VZGF0UJ2NEyzSE","flags": {},"type": 0,"text": "The Sel’drow Heretics – Former wanderers and slaves from the Underdark. These Drow have taken to farming the lands of the surface world over generations. They spread out like ants, forming colonies with underground tunnels that connect to their home caves. They have never forgotten the old ways though.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "yXbY1GNVJKnjRJD5","flags": {},"type": 0,"text": "The Piruaga – Jungle dwellers that claim a large territory and are known for sending out emissaries to trade. Their fruits, bushmeats, nuts, medicines and other exotic goods are highly prized. Their dart poisons, however, are a well kept secret.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "SWnLluLNYQfxrLp9","flags": {},"type": 0,"text": "The Tokupi – Known headhunters. They are experts at water warfare. Their obsidian weapons are meant more to maim instead of kill. They are known slave traders.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "XtlHKTzxfUyY64uY","flags": {},"type": 0,"text": "The Red Thrush – A group of Kenku that splintered off from the local Thieves Guild. An abandoned wizard’s tower is their base of operations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "tQBsdggyDuJUJCsu","flags": {},"type": 0,"text": "The Ainmhithe Triads – Three corrupted druid conclaves that are committed to destroying every city on the planet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "IPHKwupOMCwutklL","flags": {},"type": 0,"text": "Daughters of the Nymph – All female druid-led communes that hunt and capture men once a year.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "nz8p5V3vRbFAgMZs","flags": {},"type": 0,"text": "The Paper Court – A secret organization of scholars, wizards, and other knowledge-seekers. Most librarians and booksellers in the region are affiliated with them in some way. It is said that they have a sprawling underground library under a major city.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "ppQBN88scZib7P3v","flags": {},"type": 0,"text": "The Fold – A very selective organization of efficient mercenaries led secretly by a bronze dragon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "EM0jVl6mMYwrEBXf","flags": {},"type": 0,"text": "The Order of Balance – An ancient mystical organisation of wizards and sages who try to keep the equilibrium between order and chaos. Not much is known about them but they appear to have had their hands in every major political conflict in the past thousand years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "m7bHLVh4mixXiyB5","flags": {},"type": 0,"text": "Multiverse Intervention Block – short MIB, A shadowy organisation that deals with beings from another realm, unknown to most people. Conspiracies have formed about the existence of this group. It consists of highly trained mages and fighters who seem to be wherever some unidentified creatures causes havoc. They always wear black and seem somewhat inhuman to the people they encounter. Unfortunately, nobody ever remembers their faces or what happened after their visit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "FNs6BkJbXyVUnNDY","flags": {},"type": 0,"text": "The Wee Green Men – Gnome farmers that will take over any land they feel they should own, and convert it to cabbage farming. They turn an impressive crop, but since most of it is fermented into alcohol they end up a nuisance for every nearby town a few weeks after the harvest. No town has survived more than one farming season without driving them out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "4tgnaev6fjLALXoc","flags": {},"type": 0,"text": "Madam Maga’s Travelling Brothel – A roaming caravan filled with, for lack of a better term, magic prostitutes. They use magic to charm people into entering and then change their forms to suit the needs of their , ahem, clients. It’s run by a succubus with no real interest in wars or political troubles, unless it effects her work for the worse.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "269m7pPQgyG30iWO","flags": {},"type": 0,"text": "The Rosehills – A traveling family of halfling diplomats committed to making peace between all races and factions. In fact they’re so committed to peace that they are willing to lie, steal, bribe, kill, and in extreme cases commit genocide if that’s what it takes to stop the bloodshed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "bMHrg8fO2R7pa7ak","flags": {},"type": 0,"text": "Cade’s Foundation – An order of wizards who seek to educate the common people about magic and make taboo magical arts, such as necromancy, more socially acceptable.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "fCdDDrOzVb2pxByI","flags": {},"type": 0,"text": "The Dammed – A group of druids protects a forest directly next to a massive trade city. Any time the city attempts to expand into the forest, The Dammed responds by organizing all the beavers in the forest to dam the main trade river that leads into the city.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "FIfulv1rZHQuskDc","flags": {},"type": 0,"text": "The Goblin Crown – They possess one third of a magical crown that can control an ancient army of golden clock-work automatons. Known for kidnapping gnomes and dwarves in an effort to find the other pieces.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "1r5KNHfRpMXCBLHa","flags": {},"type": 0,"text": "The Ancient Golden Dwarves – They possess one third of a magical crown that can control an ancient army of golden clock-work automatons. Known for kidnapping gnomes and goblins in an effort to find the other pieces.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "vTdJbpSstSW1TX5d","flags": {},"type": 0,"text": "The Clockwork Gnomes – They possess one third of a magical crown that can control an ancient army of golden clock-work automatons. Known for kidnapping goblins and dwarves in an effort to find the other pieces.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "oypjNJN5QqAdd49k","flags": {},"type": 0,"text": "The Kingdom of the Blood Oak – A heavily armored and regimented army of elves. Their forest strongholds and forts are found along established trade routes. Their expansion throughout the forest resembles symbiosis more than conquest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "U0hOiHkOU05TxrWT","flags": {},"type": 0,"text": "Eyes of the Serpent – Yuan-Ti Purebloods, Lizardfolk, Tortles, and Dragonborn make up the bulk of this spy network. They trade in poisons and secrets. Their negotiations start with offering you a drink, and ends when they decide to give you the antidote.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "Ar2LKEwWzCxOH2bO","flags": {},"type": 0,"text": "The Emerald Kingdom of Zô – A giant Dwarven stronghold sits on a bed of giant green crystals. These crystals are the size of mountains and run forever in rich subterranean veins. Home to dwarves, gnomes, and halflings they rarely allow the tallfolk to enter their domain. Their crystals release a gas that fuels an armada of air ships.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "N57G3PhWSUHweuBx","flags": {},"type": 0,"text": "Siggi’s Marauders – Vikings, barbarians, berserkers, shield maidens… once they were roving tribes of raiding parties. That was until a legendary shield maiden gave her life to save the entire northern part of the continent. United under her banner, the peace her sacrifice wrought encouraged trade and expansion south. To kill a fellow Northerner is taboo and punishable by blood eagle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "mdhiosHiYN24mMC5","flags": {},"type": 0,"text": "The H’radrome Empire – A hobgoblin civilization based on ancient Rome. They use goblins as foot soldiers and their grand coliseum hosts daily games. The twisted columns leave much to be desired.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "3gYZ4wPovQdehksj","flags": {},"type": 0,"text": "Order of the Shadow Lotus – Yuan-Ti Pureblood royal assassins and alchemists make up the upper echelons of this group. There are whispers of a lich leading them for the last 500 years.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "iww6rb4dPmmHjH02","flags": {},"type": 0,"text": "The Red Kings – An alliance of monsters and villains bent on ruling the world. Currently led by Kaanchiweartoliock the red emperor, an ancient red dracolich.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "SgQkFOjvwLpXwHY7","flags": {},"type": 0,"text": "House of Bjernson – An ancient Nordic clan. Every male is named Bjern Bjernson and seeks some unique accomplishment to use as a Suffix. Founded by Bjern Bjernson the Lightbringer, vampire-hunting paladin. Currently lead by Bjern Bjernson the Darkslayer, monster hunter who has killed over two-hundred shadows.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "noZAdg9xGmLo7ymu","flags": {},"type": 0,"text": "The Halls of the Dead – Reformed undead, vampires, zombies, ghouls and skeletons that just want to be left alone. They consider necromancers doctors and their territory envelopes graveyard after graveyard.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "x0w7PiYS5WurSqXP","flags": {},"type": 0,"text": "The Titan Provincial Government – Refusing the ordning and the inequality it promotes, these giants have established a peaceful, stable community with humans out in the wilds. It is a true democracy, but is known for utterly destroying hostile invaders…and their homes…and their cities…and their countries. One of the last places on earth known to harvest the giantsbane plant. “Humanoids are friends, not food…unless they attack first.”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "xoHLv7uSmeDsoNAH"}
