{"name": "Prophetic Dreams That Mean Nothing","description": "One hundred dreams that SOUND prophetic, but probably don't really mean anything.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "iIdAEElW3Vz1s2jC","flags": {},"type": 0,"text": "You are at your childhood home. There is a dark disk where the sun should be.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "64S7ZC5v2jISbNoC","flags": {},"type": 0,"text": "You see two castles rise in the distance. One crumbles then another. You turn to dust.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "IKiWLG53OjlgEICC","flags": {},"type": 0,"text": "You stand above the idle body of your king. The life has fled from his eyes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "REL3E0qPktNuUZVJ","flags": {},"type": 0,"text": "You are a child. Your mother scolds you for playing with fire. The city burns around you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "5VutE0xPhBG10vME","flags": {},"type": 0,"text": "You and your party stand on an altar in the earth plane. Your metal gear quickly turns to rust. Your mouth fills with dust as you try to speak.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "xNcU0QwxxDGWS8Mu","flags": {},"type": 0,"text": "The sky turns red as you lose touch with your own location. An infant belly laughs; each joyful sound chasing away the light. “All was ash. All was ash. All shall be ash, mother. None shall know sight, father.”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "Yz397k9dpL8ifsan","flags": {},"type": 0,"text": "Her silken skin glides over your own like the wind over a whisper. It’s too early. The sun isn’t out yet. You turn toward, and throw one arm around her. And then you remember that you live alone. “North now,” she sings softly into your ear. You wake to the sound of someone urging your party to go south.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "UjS0pzPzeSPXz7VI","flags": {},"type": 0,"text": "You find yourself squinting against painful, glaring light as it erupts from the hands of a spell caster trying not to become a squid. Behind him, the silhouetted form of a mindflayer dances a jig. “You had your chance,” it mocks, “and now,” arms open wide, “it’s ALL cheese!”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "fhTf3LbtD7Jld6AH","flags": {},"type": 0,"text": "A muscled man in loincloth and fur sits cross-legged before a boulder, palms together, head bowed. From behind you emanates a mournful humming. Beyond the boulder, a lush and fertile valley gradually succumbs to a wave of death and decay. Upon the boulder, your own name.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "VIL28L8ygWUrAfAb","flags": {},"type": 0,"text": "Your face is pressed into a neck; you know not whose. Something hot and thick runs down your chin, and drips in such a heavy stream that you can feel it fall. And you can feel their heartbeat gradually slowing. Beyond, a paladin in shining golden armor emblazoned with an image of the sun raises her crossbow, and aims at your head.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "oPttMPdSNxWIPuyt","flags": {},"type": 0,"text": "You always imagined the clouds would part if ever you met a god, but it’s the bark of a tree parting now. An antlered and gnarled faced is revealed, with great stone eyes rolling until they come to rest on you. Its voice is the song of a thousand birds and all the crickets of the dusk. “You won’t forsake me, will you?”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "j2FM6rYwuhVZqMFV","flags": {},"type": 0,"text": "You see a scarecrow stood in a field, a white crow lands on its shoulder, the scarecrow then looks towards you and you recognize it as insert random PC/NPC name here.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "IgQYj5dGj7KJpHSJ","flags": {},"type": 0,"text": "You are stuck in a cage and a shadowy figure paces backward and forwards laughing at you but no matter how hard you look you cannot see their face and you cannot escape the cage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "khHCHBETsjEUk3Da","flags": {},"type": 0,"text": "You see that there is a blood red moon, you are covered in blood and howling towards the sky, around you are hundreds of bodies, you don’t know who they are.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "qrBTKEEtlWNfknV2","flags": {},"type": 0,"text": "A person visits you in your dreams and tells you that you must make haste, do not fall beneath the waves, do not let the deep take you, the river fights you, the rain must reverse (turns out they really need the toilet).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "SVJY1WLTmpeWXCvt","flags": {},"type": 0,"text": "You look up from where you’re lying to see weeping mourners cast handfuls of dirt at you. Most have their faces covered by veils but among them you recognize people you’ve killed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "IaHR1QxWqzIbjAYq","flags": {},"type": 0,"text": "You feel a faint rocking motion and a cool breeze on your skin. As you open your eyes, you hear a man tell you ‘Hey, you, you’re finally awake…’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "b95NaO1r5LsIOkGq","flags": {},"type": 0,"text": "You are taking a bath in a public temple, when the walls crumble around you and everyone can see you sitting in a tub, they look confused and angry at you for ruining the holy temple.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "wfxf8HamkX7USmaq","flags": {},"type": 0,"text": "You open your front door, but it doesn’t open to the outside world, instead it connects seemlessly to the royal palace, and everyone bows before you as you enter it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "0kB2j3LAzOZ63UaQ","flags": {},"type": 0,"text": "You are in a city you vaguely recognize. Everywhere you look you can see your friends. They are avoiding you. When you talk to them or touch them, they start to cry mournfully.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "Y9HmV9vxdNt15FYQ","flags": {},"type": 0,"text": "A wolf and a sheep walk side by side.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "Mgnxkj3aauB8UCdk","flags": {},"type": 0,"text": "You walk in the abandoned ruins of the town you’re staying in, all alone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "HsI2JGyNXx1lFr4u","flags": {},"type": 0,"text": "A chicken lays an egg. When it hatches, snakes emerge.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "QFgBGRnevyXlWpn9","flags": {},"type": 0,"text": "A king asks you for a coin. You reach into your pockets and hand him something else. He nods, then gives you his crown. Everyone in the room falls to their knees.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "Tiy3jPknllxo1I3l","flags": {},"type": 0,"text": "You begin to write a contract to a demon/fae/etc., with terms ranging from serious to ridiculous, but wake up before filling in their name or other identifying details.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "2myoB6kfSVPdZflv","flags": {},"type": 0,"text": "You are shackled. Your jailer enters, trying to get you to confess to a specific crime.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "o7QgAneexMNbDYWG","flags": {},"type": 0,"text": "As you walk, rats follow you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "jVyHxirlduOhpwau","flags": {},"type": 0,"text": "You walk along a path of very straight edges, and it’s a smooth surface of a material that is neither stone or dirt. You push a strange cart of a metal grate and tiny wheels that want to go in different directions. The path is a strange maze leading through various landscapes of couches, then chairs, then kitchens. Other people wander around the maze too, pushing carts of their own and get into arguments over something called ‘Shower Curtains.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "w2cZaeG4obbSBhNz","flags": {},"type": 0,"text": "A silhouette is fishing in the distance. They have caught something. A monotone humming is coming closer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "eGezWwMlCoOEnITD","flags": {},"type": 0,"text": "A silver dragon sits beneath an ash tree. It looks at you intensely and opens its mouth to speak, but the dragon turns to ash and blows away in the wind (alternatively it could utter something prophetic-sounding but meaningless).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "0nx0FDI5e8sYeQvv","flags": {},"type": 0,"text": "While traveling through the forest you see your childhood dog, and it runs into the trees. You chase after it and eventually find it digging frantically into the earth. It finally stops and looks up at you expectantly. You step closer to see what the dog has dug up but just as you approach the edge of the hole you wake up.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "e1xNpFgGxX3QX0Ez","flags": {},"type": 0,"text": "The dream begins with you inside a church. As you look around you realize it’s the church that was located at the last town or city the party visited. The pews are filled with people wearing crimson robes and jet black masks. At the front of a church is an open coffin and a priest leading a funeral service. You draw closer to the coffin and inside see your own body/the body of the one the party members.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "Zs9ZXpD8ZKy5ZQzv","flags": {},"type": 0,"text": "You stand atop the corpse of the last couatl. As the colors drain from its plumage, you are beset by a feeling of intense despair. What have you done?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "L7lcoMlVKivLpClk","flags": {},"type": 0,"text": "You ascend to the top of (Mountain Name) and plunge your sword into the rock. With your purpose fulfilled, the world cracks in two at your feet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "C4qoy6VywdX77cxt","flags": {},"type": 0,"text": "You wake up to (Friend Name) calling your name. Scrambling to your feet, you cry out: ‘How dare you show your face to me again!’ As you clutch a dagger in your hand and charge, you wake up with a start.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "YlGul5DY41US1uUt","flags": {},"type": 0,"text": "The last thing you remember is a deity older than time itself grabbing you by the throat. ‘You shall accept this truth’, it says in a roaring whisper, opening its other hand in front of you. You wake up before you see what was there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "ldkuXXsZqdk2Omfb","flags": {},"type": 0,"text": "You float to the Astral Plane in a river of souls. You make eye contact with (Friendly Character Name) floating by and feel at peace. What you did wasn’t for nothing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "LXO8ixbuWsdXX1vC","flags": {},"type": 0,"text": "As the last survivor of your party, you are standing before the mortally wounded (Color) dragon. Its one eye stares at you, unblinking. You cannot bring yourself to strike it down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "YHwB5aFhEsxc4cFF","flags": {},"type": 0,"text": "You are walking through a dark forest. You hear a humming song echoing all around. It just barely sounds like the measured chanting of a spell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "24C4Ke7D7chFNROa","flags": {},"type": 0,"text": "You sit in front of seven candles of varied lengths. 1 burns out, 2 are extinguished by a gust of wind.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "RHZrVtUChyEbFtKI","flags": {},"type": 0,"text": "You are in a dark abyss. Out of the darkness you see a tiny fish. It is quickly devoured by a larger fish, which is then swallowed whole by a huge beast. The beast turns its gaze towards you. You awake.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "38VLrKZSqCVYOC9n","flags": {},"type": 0,"text": "You walk barefoot through light snow, indoors. You realize that you are lost, and naked, in an unfamiliar building, and no-one has faces.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "ii0kALebXPW91aGi","flags": {},"type": 0,"text": "Someone weilding a hedge trimmer is chasing you through the forest. You try to escape by climbing a tree, but they keep chopping it down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "9S0EW2gSTETywcYI","flags": {},"type": 0,"text": "Your dentist asks you if you have been flossing and brings out a roll of barbed wire. They ask you this while you are flying though World War I, in an cast iron bathtub.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "3auuUNKqtMavqrQL","flags": {},"type": 0,"text": "You see five masked people dancing side by side. The middle one suddenly falls and a spectator screams.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "YNVC7CTUonUgzbMP","flags": {},"type": 0,"text": "You see a small red fish. It circles you for a moment then fades into the blackness of the ocean deep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "Mvw77i5R2ZnDTydl","flags": {},"type": 0,"text": "You are looking at yourself sleeping. The one sleeping, wakes up and stares at you & says,’ You’re not ready for what’s coming.’.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "0VVAnmbTn47S4Cqe","flags": {},"type": 0,"text": "Across a vast sea, a dwarf class in black tinkers in a workshop. He looks up as it he sees you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "nA1LGkq0O5arp2lo","flags": {},"type": 0,"text": "You see the face of your enemy change into (Party Member). He laughs a friendly laugh.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "WwzUA4ORqBeDl9TH","flags": {},"type": 0,"text": "You see you deity explaining your actions to other deities. They mock him/her.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "A5DCXXPWbQKnTtZs","flags": {},"type": 0,"text": "Your bedsheets become alive, and strangle you, pinning you to the bed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "LTspvJXtdAxS2WfD","flags": {},"type": 0,"text": "A giant insect demon sucks soul out while you helplessly watch.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "zLjDHBr2UfSFOnuz","flags": {},"type": 0,"text": "Your party members sit down for fancy tea. They and everyone around them are on fire. They don’t notice, and say you are a liar.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "5zgmkSil9IMdfaMc","flags": {},"type": 0,"text": "You fight thru a snow storm, battling someone who looks just like you. Someone wins. You wake up immediately after.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "iEnAvWFvdM3zB1UN","flags": {},"type": 0,"text": "A giant pin secures your hands and legs to a board. A label lists your worst insecurity. Your friends are pinned all around you. You dream of taking a luxurious bath. A tentacle drags you under the water and refuses to let go.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "AhSWZQVuvPua4xK7","flags": {},"type": 0,"text": "You have a recurring dream, of taking a luxurious bath in a large pool. The steam forms faces from your past, all of them accusing you of abandoning them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "IPEZQEWeGFK9NxMS","flags": {},"type": 0,"text": "You have a recurring dream, of taking a luxurious bath in a large pool. The dream-You does not seem capable of noticing the undead reaching up from the depths around you. The You that is sleeping, seems to notice, but can do nothing about it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "XNx8PbsTdTioGs7s","flags": {},"type": 0,"text": "You dream of meeting a Ruler or Great Dangerous Beast who is sleeping, and are warned not to wake them, lest some terrible fate befall you. Your friends, who are with you, begin making more and more noise, trying to awaken them. They ignore you, or fight you, for trying to stop them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "cJI5TYFIfp0Axtph","flags": {},"type": 0,"text": "You find yourself in a maze of mirrors, unable to escape. Each time you touch the mirrors, the you in the glass grows a terrible and terrifying appearance and attacks you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "korSehM0ci68gxWy","flags": {},"type": 0,"text": "You dream that a demon is stealing your teeth, in order to build a grand and terrible tower in hell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "vhLGmjnJa5nu03aR","flags": {},"type": 0,"text": "You stand on a set on one side of a set of scales. A shadowy figure stands on the other side. The scales slowly tilt towards them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "gzhS1aplllxOgCh1","flags": {},"type": 0,"text": "You are mounted. You ride in front of an eager army. ‘To arms!’ ‘TO ARMS!’ ‘We ride to death and the great beyond! Cast off your fear and embrace the darkness with outstretched, bloody hands.’","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "9Q0h1SqS7JpACBV9","flags": {},"type": 0,"text": "You stare in to a bowl of thick blood. Ripples appear. Your tears of blood add to the bowl.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "gYcjvxFsddvGpuBc","flags": {},"type": 0,"text": "You dig. Your hands are raw and arms sore.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "HLNAH0gWU2Psesv0","flags": {},"type": 0,"text": "A demonic looking creature dressed as an accountant has you chained to a desk running figures. The paper burns when you get to the names of your friends.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "9z65LsWlJHVEMZyk","flags": {},"type": 0,"text": "You dream that you are injured and reach for your trusty healing potion on your belt. A gremlin keeps taking it away from you, and replacing the potion with vileness.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "rY53IsF4PqAjEXx5","flags": {},"type": 0,"text": "A child that looks like one of your friends is eaten by an alligator.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "64bpNpauYbxIIhnZ","flags": {},"type": 0,"text": "A child that looks like one of your friends is tied up and cooked like a turkey. They are served for dinner with you as the guest of honor. You are given the carving knife…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "k1NxhkdsMt7cIhSE","flags": {},"type": 0,"text": "You and your friends are running along a winding stone path that twists and turns ridiculously. You all reach a point where a comically complicated mouse-trap smashes down on top of you, like the children’s board game.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "C5xdUSB2XFG6CMqN","flags": {},"type": 0,"text": "You walk through the wilderness and see a great fat fish emerge from the ground where it speed out torrents of water, flooding the entire place.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "EOuhDMzO4EyGiiJL","flags": {},"type": 0,"text": "You’re inside a dark, wooden box, you cannot move. You can faintly hear the sounds of mourning people, sniffling and crying. People apologizing. Then a loud thump from above you. And another. With each the sounds grow weaker until you’re alone in the dark box in silence, other than your heartbeat. You begin scratching in the box, trying to escape, but you cannot. You begin to choke. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "gOojdTLnz9kSbTVW","flags": {},"type": 0,"text": "You awake standing in your tent. On your bedroll is . They wake up and stare into your eyes. ‘The king is dead,’ they whisper, ‘and we did the deed.’ ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "Co8gOwvLSocby00q","flags": {},"type": 0,"text": "You’re standing, naked, in a wasteland. Howling wind blows dust over the scene, nothing remains. In the distance you spot a wooden post. Coming closer, you see it’s a sign, one you saw when entering . The name has been nearly wither away but you can see another word has been scratched in with fingernails and blood. It says ‘Qasqat’ .","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "1wIfAqJXwbyNxbwV","flags": {},"type": 0,"text": "You’re talking to  over some dinner and wine in a fancy restaurant. Suddenly everyone stops talking and moving except you. In unison, they stand up if they were not and move outside. You go outside. The sun is fading as everyone around you stares into it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "IBaZWCCxnpyeq08z","flags": {},"type": 0,"text": "You stand atop a rotting beast. Your friends are with you, crouched down eating it. After looking around it looks like everyone you know is there, eating it. This is a really big rotting beast.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "imKIGoECFaGfrAkz","flags": {},"type": 0,"text": "Furniture in your childhood home comes to life and attacks you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "8eGpTeFle2nEPuLo","flags": {},"type": 0,"text": "Your family and friends have all had their eyes replaced with bleeding mouths. The mouths tell nothing but lies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "F05Ap7GeATwGkn8z","flags": {},"type": 0,"text": "A demon has grabbed hold of your friend’s tongues and replaces them with poisonous serpents.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "aUivAImCj6J2HmTy","flags": {},"type": 0,"text": "You are tied to a stake. One of your friends is lighting the bonfire beneath you, cursing your name.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "umNpsydmZPJ4O9ui","flags": {},"type": 0,"text": "You are speaking to a noble indoors. The wind blows, but no one but you seems to notice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "nhy8Tyg9sjzWKWdh","flags": {},"type": 0,"text": "You awaken to the sound of bells. You can’t move. The rest of the party loads you in to a plague cart.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "U71guPRmvI9JCgB6","flags": {},"type": 0,"text": "You are in combat. Your weapon rusts and crumbles. Your armor follows. Spots of rust appear on your skin.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "NYoISxDAE0UeFdrj","flags": {},"type": 0,"text": "You are a gladiator in an arena. Your opponent is yourself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "OcjSnUOEYJtkC5A1","flags": {},"type": 0,"text": "You see nothing but darkness and feel nothing but cold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "klOJPL9pQWGWTu30","flags": {},"type": 0,"text": "You sit stop a throne. A religious leaders places a crown on your head.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "KSPKPUrkOGnWQFS3","flags": {},"type": 0,"text": "Two people argue about keeping a secret. You recognize them as your parents.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "d9vbWtpTN5SgJrBN","flags": {},"type": 0,"text": "A cleric in glowing, fancy robes, places an heavy, ornate crown atop your head. It get heavier and you struggle to keep upright beneath it’s weight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "gfvbsGiowFASbF7V","flags": {},"type": 0,"text": "A flock of starlings and whipporwhills takes flight around you. Your entire world becomes nothing but a swirling mass of flying birds. This is how you knew someone you know died.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "eBz0FvVzjcjJxCAo","flags": {},"type": 0,"text": "You push one of your friends off a cliff. They know you did it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "keWpFOujEglGfwcK","flags": {},"type": 0,"text": "A heavy crown is placed atop your head by your best friend. Then your other friends circle behind you and slash your throat. They all have big smiles and sharp teeth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "ZO5jy1RzSIftZELv","flags": {},"type": 0,"text": "You are at a funeral, but the casket is empty. All of your friends are gathered around, and they tell you that you must get in the casket.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "ewyp5as7KBdlPlYf","flags": {},"type": 0,"text": "You and your friends are at a fancy dinner party. When they open thier mouths to say anything, thick honey drips out and a swarm of bees fly out, stinging you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "A8RwRQiXHPME7hc8","flags": {},"type": 0,"text": "You go to a funeral with an empty casket about to be lowered into the ground. No one is there, but you know you must get inside, so you do. The lid os closed, you are lowered into the grave. You awaken suddenly at this point.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "i8Xanjgukbrc730x","flags": {},"type": 0,"text": "In a dream, you can’t get a song out of your head. You and your friends crawl inside your own ear and enter your brain. The dumbest one of your friends starts whistling the song, and then is killed by something both stupid, and terrifying, from your nightmares. When you awaken, you can’t get the damn song out of your head, and you notice yourself doing something your stupid friend does out of habit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "Xr0pAPwem0lnLV0B","flags": {},"type": 0,"text": "It is midnight with a full moon. You look all around you and see nothing but coarse gray sand. You walk until the sun rises.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "3SLFXOlW6ENP1vX5","flags": {},"type": 0,"text": "You are fighting a (Easy Fight). Your hands struggle to grasp you weapon. You clumsily retreat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "XIamgNDKYBWYsPMw","flags": {},"type": 0,"text": "A powerful mage summons meteors from the sky as you watch helplessly in the distance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "blbaYVue2GrOka7P","flags": {},"type": 0,"text": "You stand triumphantly over a body. The rest of the party smiles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "pvtjYr9No78CEiad","flags": {},"type": 0,"text": "You are strapped firmly to a table. You watch helplessly as a wizard prepares a ritual.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "D7332SqJWKWgB4oW","flags": {},"type": 0,"text": "An hourglass drops sand on you. You stand on a sanddune made by the sand grains dropped by it. It begins to bury you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "Uovu4aVRtcNbv5Wv"}
