{"name": "Magical Landscapes","description": "One hundred magical landscapes to drop into your fantasy world.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "vYJgqpBPQx6BNyrR","flags": {},"type": 0,"text": "In the center of an unforgiving, frigid tundra, lives a tropical oasis, a paradise fed by hot springs and steam vents. Only a few travelers ever see the wonderous sights of this tropical splendor; those that have become hermits. Some species of birds can only be found in this oasis.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "2wrbhI46K3RPdgyE","flags": {},"type": 0,"text": "A cold forest that grows on the back of a sleeping tarrasque. A warlock had put it to sleep and it remains asleep for 500 years. While asleep an entire ecosystem grew on its back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "27pJs58J8MZvqDSw","flags": {},"type": 0,"text": "A dry desert that rains every night but the water disappears every morning. Mages have done many experiments to try and understand why this happens and still cannot understand what is causing this anomaly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "y5DPB9zWniVhkoSN","flags": {},"type": 0,"text": "A forest with trees made entirely of bone. Plants cannot grow there and the only native residents there are undead. The forest is well known for harboring hags since bone is a common ingredient in many of their potions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "VTuW1NVXWT5CGeR1","flags": {},"type": 0,"text": "A mountain range where each mountain is a vibrant pastel color from the rainbow. Occasionally the mountains appear to change shape but that is merely an illusion.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "6m7RQ7N53qdIX5C1","flags": {},"type": 0,"text": "A plain looking valley that looks completely innocuous but if a painter stands in one specific patch of off color grass and being painting the valley then they can change the lanscape through their painting.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "ouOfCMtfhDsFlM46","flags": {},"type": 0,"text": "A small lake with pitch black water. Despite looking disgusting the water is magically refreshing and can neutralize very powerful acids. The lake water is used in many heart medications.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "IBYiATgBb20RCivg","flags": {},"type": 0,"text": "A forest with dead trees and is always covered in an aura of dim light. While in the forest creatures will hear whispers. Each creature must make a DC 16 wisdom save or be unable to sleep inside of the forest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "rAlODYhsZsQfR3lI","flags": {},"type": 0,"text": "A cave that at first looks completely normal until one casts detect magic. When someone uses detect magic blinding light of all magics. The cave is very hot to spellcasters but those who aren’t mages will simply see a normal cave.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "hBND5XSEujI5AXxc","flags": {},"type": 0,"text": "A giant mushroom that’s head is the size of a large city and has a stem coming from a lake. Atop the mushroom head is a biome of other mushrooms.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "kEPgHKMx0mLAyWfq","flags": {},"type": 0,"text": "A plateau that is completely hollow and held up magically by powerful wind. A city was built on top of it and the scholars there are constantly worried about the magic somehow being abjuated and the entire plateau caving in on itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "LCOuLMee2oQag3iG","flags": {},"type": 0,"text": "A river in the Feywild that runs uphill and magically gives youthfulness to those who drink from it. The further uphill the river goes the younger the trees around it are.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "pj3JgkdClhtoi5df","flags": {},"type": 0,"text": "A desert that moves from place to place. Some say it’s a curse from the goddess of plants that she moves onto villages that don’t appreciate her handiwork. The desert has been known to magically move miles, even through entire continents, without anyone noticing. The desert has no set time of staying somewhere but generally it moves once a month.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "89LfnaQYv5fuwDaQ","flags": {},"type": 0,"text": "A crevasse in the underdark where sunlight shines upwards from it. Studies show that the light itself isn’t magical which means the light from the crevasse comes from the sun.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "mJeWnNo8D7grFrrl","flags": {},"type": 0,"text": "A part of a long expansive tundra where the sky has a red streak in the sky. Many tabaxi legends say that it is a scar the sky got when it got too close to the earth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "NYDZtbSW61giP0n1","flags": {},"type": 0,"text": "A swamp filled with floating islands of sod held together by the roots of plants growing on them. Currents twist these islands in an elaborate dance as swamp creatures glide through the murky tangles of mangrove roots.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "eFySuKnhzcHIwArR","flags": {},"type": 0,"text": "An expansive cave network where the length and direction of the tunnel has no bearing on where you actually go. You may walk for a day and end up in a cave 2 miles from where you started, you may walk for 5 minutes and exit onto another continent.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "CC8HAo0rYL6dsu3M","flags": {},"type": 0,"text": "A section of desert where no wind blows. The sand dunes give way to a level expanse and any tracks left in the sand won’t go away on their own. The silence is overpowering.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "RHSthKsjdvAsaVly","flags": {},"type": 0,"text": "A cityscape, seemingly carved directly out of the rock it sits on, with no inhabitants. Every home is sparsely furnished with bare furniture carved the same way the buildings are. Despite containing homes, shops, temples, and government buildings enough for thousands of residents, no one knows who built it or why and no sign of habitation has ever been discovered.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "5ruIWlbfxMOJVt6W","flags": {},"type": 0,"text": "A jungle which every 5 square miles is exactly identical. The jungle itself is 200 square miles and if a tree is cut down in one part of the jungle then 40 identical trees will be cut down as well.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "yAXGykZBe6K7jeTa","flags": {},"type": 0,"text": "A field of wheat that is always in a thunderstorm. Parts of the plains are scorched because of being struck. Some say that a tempest cleric cursed the fields when a farmer insulted him but others believe it was always like this.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "hHF8mQDBMDGM5Tw8","flags": {},"type": 0,"text": "A small grassland that is in the shadowfell. A city resides in parts of it. Life clerics use their power to keep the grass alive with their intent of eventually ridding the shadowfell of undead","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "3C8Ly681E9UsPcWT","flags": {},"type": 0,"text": "A large area where parts are sandy desert and others are icey tundra. The area is like patchwork with parts of sand being extensive or five foot areas. Sone areas are cold, others are warm, and all temperatures in between.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "JlUWn7Kke4EZMqyg","flags": {},"type": 0,"text": "Pandemonium, capital of Hell. Towering spires, sprawling colonnades, and massive domed rotundas rest on a floating mountain, anchored with adamantine chains above the Tartarus pit where a great devil is imprisoned in the black flaming ice of Cocytus lake.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "zyMwGb5s9MbtGn0f","flags": {},"type": 0,"text": "A square mile that changes biome every morning. Many druids see this place as a holy land.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "JxYVP92MqMNAIXsU","flags": {},"type": 0,"text": "An area of deadlands that’s growing every day. Many scholars are worried of it’s destructive path. The area has already engulfed a town and a few forts have been tasked to hold off the onslaught of undead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "s0euMfyzqaf0kBHi","flags": {},"type": 0,"text": "A volcano in Celestia that has a golden shimmer and diamonds jutting out of multiple crevasses. The volcano erupts frequently but instead of molten hot magma the volcano erupts with delicious toasted marshmallow. Every time the volcano erupts a rainbow is shot into the sky.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "62R7fqZ1nBBis6lN","flags": {},"type": 0,"text": "A beach with tall palm trees and dark green sand. The sand is actually plantlife and is often collected by druids as a good luck charm. The green sand can be used as fertilizer for otherwise barren soil or for a potion of growth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "xDdF5q79jOEQLxge","flags": {},"type": 0,"text": "A canyon with a giant tree on the very edge of it that stretches to the other side of the canyon. The tree has many holes in it and when crossing from inside the tree it can be used as a gateway into the Feywild.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "JFgxYkvdHi0owO45","flags": {},"type": 0,"text": "A druid circle lives atop a canopy made of vines. The forest below has trees where the leaves are insead outstretched vines. Druids and others who are attuned with nature are the only ones that can stand on top of the canopy, all other creatures will fall to their death.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "GZ4AuxCZyAWXKx72","flags": {},"type": 0,"text": "A waterfall where a massive spike made of ice splits the water into two streams. The ice never melts even on the hottest of days and immediately extinguishes any fires within 50 feet of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "uqDcZXx3y6bfynN5","flags": {},"type": 0,"text": "A treacherous river rapid where many have met their fate with a peculiar magical quirk. The river slows down time. While the river itself would normally take 8 hours to ride down if it were a normal river only takes 8 minutes. This leads many to use the rapids as a mode of quick transportation if they live to reach the bottom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "O0kHtmQqaXidtJd6","flags": {},"type": 0,"text": "beautiful, multicolored forest. The leaves are every different color of the rainbow, and when inspected, they aren’t leaves at all, but instead thousands of butterflies perfectly still. The forest is very peaceful and seems to have a will of its own. If visitors are kind to the butterflies, they are filled with a sense of peace and are able to pass through the forest much faster than expected. Anyone who thinks or attempts to harm the butterflies is filled with an overwhelming, overpowering sense of guilt that forces them to stop. This guilt can overcome even the strongest and most aggressive creatures.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "E743bSL17yYIrysx","flags": {},"type": 0,"text": "A landscape of flesh, blood its waterways. Can be expanded with all manner of internal organs replacing the lush green of the natural world.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "XsyFcUQLhYBR1aN3","flags": {},"type": 0,"text": "A forest that an ancient society planted. In reality, these trees are part of an ancient magical machine. Energy flows throughout the forest, and when you try and chop down a tree it hits you back for force damage. At the center is a grove with a stump with several contraptions that allow you to change the layout of the forest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "D2MJsi1qiq2lo33q","flags": {},"type": 0,"text": "This lake’s floor is lined with gemstones that iridesce in the dazzling sun. It’s bottom is far deeper than it seems, however, and many divers have drowned trying to reach the just-out-of-reach sunken treasure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "PQoapvvLaVBmUNku","flags": {},"type": 0,"text": "Tradition holds that this forest was once home to the final conflict between a demonic cult and a revered saint: the saint prayed, and their deity answered, instantly petrifying the entire wood. The church of this deity hallows this area, insisting that a holy relic of their saint still lay in the heart of these strange geological formations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "HUVkHNixQQeXE643","flags": {},"type": 0,"text": "In the center of this wintry taiga, three rivers meet at the edge of a cliff. Because of the centuries-long experiments of an eccentric elven wizard living here, the water falls up instead of down, floating toward the sky before crystallizing as snow and falling on a distant village (whose citizens are beginning to suspect that it isn’t normal to be buried in snow year-round).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "4FPKkRy4QL5yuoUS","flags": {},"type": 0,"text": "Above the tractless sea of swirling pink, purple, and gray-white clouds, flock of pegasi cavort with giant eagles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "D08gjXZJgnAWVGib","flags": {},"type": 0,"text": "A field of red flowers stretching for miles. Years ago bloody battles were fought and lost here for valiant and noble causes that were lost to history.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "QEJTrqEriPZzSiQe","flags": {},"type": 0,"text": "A windswept valley is filled with hollow rocks. When the wind blows in the right direction, the rocks whistle a mournful tune.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "kJvnLrmBqAwjudzG","flags": {},"type": 0,"text": "A large crater in the middle of a forest. Inside the crater, the plants are markedly different to those outside and there is an abrupt change in temperature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "4KUMeFwwYzAG5SsM","flags": {},"type": 0,"text": "A large plane of flat glass in the middle of a desert. Cracks appear when walking on it, but disappear once people have passed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "vhYz1jKtUGfoD1Kt","flags": {},"type": 0,"text": "A forest where the dead never rot, covering the ground in thick layers of fallen trees thick enough to walk on. Be careful not to set fire to them, or the whole ground will go up in flames.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "WD6wM6w8cdFbVIH4","flags": {},"type": 0,"text": "An abandoned grove, the air choked with wild magic from wars long gone by. Walkong in the grove during the day is dangerous as the lack of atmosphere offers no protection from the sun, but nighttime is when the city’s ghastly inhabitants stalk prey through the tall trees.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "Da60oG7di7buHdhl","flags": {},"type": 0,"text": "Shadows grow too long on this barren savannah, where scavengers prowl and roost. The inhospitable landscape is scattered with many wide, low tombs of giants, sealed and protected with terrible elemental curses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "xEG4RzJzBMSHtGKT","flags": {},"type": 0,"text": "This hidden beach is the final resting place for the Red Nemesis, one of the most infamous shipwrecks in history, which legend insists still holds its incalculable treasure hoard. Treasure hunters are rebuffed when they discover the beach is also home to a cast of hulking crabs, which now wear most of the Red Nemesis and its treasures as part of their armored shells. The island is always coated in heavy fog.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "TE7wIHGnkrpo6oQd","flags": {},"type": 0,"text": "A large swamp with crimson red water that is soaked up by the red plantlife around it. The water is a powerful poison that attacks the nerves of a creature. The swamp is permanently coated in a bright red mist that smells of rotting fruit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "V6bia2uMScIiIr82","flags": {},"type": 0,"text": "In the middle of the desert stands a towering mountain, composed entirely of black crystal columns. Even for a desert, the total lack of life surrounding “the Pillar of Pillars” is ominous, and the unusual frequency of electrical storms here has drawn the attention of arcanists and alchemists.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "nDKYFeKIxAd9EVCq","flags": {},"type": 0,"text": "This miles-wide lake is only a few inches deep in most parts. Tiny fish and crabs scuttle about while stilt-legged birds with long beaks make their nests nearby. The driest, hottest summers and wettest, chilliest monsoon seasons have little impact on the lake’s depth.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "eitwGTbQiRg9LUwe","flags": {},"type": 0,"text": "Deep into the depths of an ocean lies a small area the size of a tiny city in which there is a pocket of air. The pocket is 30 feet high and never rises to the surface. Nothing is in the pocket except the ocean floor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "nOEoV5aZ76KDuIj0","flags": {},"type": 0,"text": "A snowy tundra in Celestia made entirely of delicious ice cream. A wide variety of flavors spread across the lands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "g0SnRZMNG74RIowT","flags": {},"type": 0,"text": "This sea is a round, vertical column of water down to the impossibly deep seafloor, comprised of five distinct biomes, all stacked on top of each other. Different treaties and alliances have held a tentative peace among the various civilizations found in these layers. But recently the uppermost civilization has begun employing a greater number of their large, photosynthetic foils to harvest sunlight for energy. The deeper peoples are beginning to resent paying the Bright Ones’ higher and higher fees for their food.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "bAVqaricZu4dukAb","flags": {},"type": 0,"text": "This violet-black wasteland is only just recovering from magical holocaust years ago. The few stunted shrubs and twisted trees here are bravely attempting to pioneer life again. The people who wander through these wastes aren’t sure that it’s unusual for plants to be sentient, Or pink.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "eXQ4ztFJpvD7d63a","flags": {},"type": 0,"text": "This plain has been magically cultivated into rambling fey gardens. The orchards and vineyards are kept by a herd of centaurs, and satyrs keep the lawns clipped uniformly. Great, multicolored, flightless birds roam leisurely through the gardens as their personal paradise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "7f3gzeU3oeaiFOpB","flags": {},"type": 0,"text": "A bog with knee high waters home to many species of frogs including the giant green water toad. The bog water in this swamp gently flies upwards when it rains.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "mexyOigYJIVmnDdg","flags": {},"type": 0,"text": "The obsidian sea caves dotting these coastal bluffs are all connected in an expansive, half-submerged labyrinth. This is the home of a terrible sea serpent, as the legend goes. Pirates have used this legend to great effect, taking up the caves as their base of operations in these tropical waters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "fgAwnyciKcLn9seu","flags": {},"type": 0,"text": "This narrow, mountainous cape forms a natural bay in the ocean. No one lives here, though, and good thing: the “cape” is really a titanic leviathan who’s been magically asleep in the shallows for the last era. Visitors here are quickly scared away, as the leviathan’s vivid dreams, usually disjointed vignettes of hunting, wrecking ships, and feeding are psychically transmitted to anyone nearby.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "8jyjgHQd5CFGi6QQ","flags": {},"type": 0,"text": "A grassland with light blue grass that sways gently in the wind. Thunderstorms happen often and the lightning that strikes in the grassland is a dark purple hue. The lightning is also completely silent and does psych damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "543aQWGxNmM9jpRa","flags": {},"type": 0,"text": "A canyon constantly shrouded in dark clouds. Those who try to cross the canyon or fall into the canyon are taken by a gust of air and flown to the other side of the canyon. Sounds of howling wind can be heard from the bottom of the canyon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "ppln3M1qhE0axCrl","flags": {},"type": 0,"text": "A sentient volcano that calls out to all who travel near it to help clear the infection that is spreading within it. The infection are monsters and bandits who have begun inhabiting the caverns that make up the vascular system of the volcano.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "7H9RzUjURVC7vbNn","flags": {},"type": 0,"text": "An endless pit that is pitch black. The holes origins are unknown but many religions say it comes from an evil deity. When a creature falls into the pit it is unknown if they will ever be seen again. Some creatures are seen a day later, some a week later, some years later, and some are never seen again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "CPSaOyYsEhTswF2u","flags": {},"type": 0,"text": "A forest where all of the trees grow eyes at night. The eyes are either red, orange, or yellow. If a creature that can speak to plants walks into the forest at night then the trees will tell them of how they can see through the weak veil of reality.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "VRjOT7DqFCLf0L3n","flags": {},"type": 0,"text": "A tropical jungle with a frozen lake in the center. The lake has been frozen for centuries and leaves a beautiful view in the jungle floor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "sWCm4EXx7Jx3tR6o","flags": {},"type": 0,"text": "This dense aquatic jungle of impossibly huge flora and deadly fauna is at the bottom of the sea floor. Almost every living thing living here exhibits dazzling bioluminescence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "nU7ivkiKC147YwhF","flags": {},"type": 0,"text": "A large mountain that forms a hook shape. The mountain has its own gravitational pull making climbing it very easy from any angle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "PbSI2KE29KmAFBQO","flags": {},"type": 0,"text": "A cave that is completely smooth. All cavern stalagmites and stalactites are all the same size and in the shape of a pyramid. The caves minerals are used in many potions of acid resistance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "YW0n2NMPeENu46y0","flags": {},"type": 0,"text": "A primal forest with a thin straight path of runed gravel and stone that you see light on the other side. In the center of the Forest is a tree with a giant ravens nest which is the size of a hamlet in an overgrown and tree. Stepping off the gravel path while in the forest for any reason will result in a flock of ravens flying into you until you step back on the path. Remain off the path long enough and the Giant Raven will pick you up and drop you in its nest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "lGbPbiLixulVi7mI","flags": {},"type": 0,"text": "A lush out of place garden that seems to have an oasis keeping it alive in the middle of a desert with a collection of small golems tending to it. There is a tomb that is covered in dolls and toys with a bench set not too far away from the tombs entrance. At night, a wisps of wisps give the whole garden a pleasant glow and the ghost of a little girl comes out of the tomb and begins to play with a tiny golem in the shape of a boy no older than what the girl appears to have been.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "LSxJQbpS8KvGamNu","flags": {},"type": 0,"text": "A lake in which a local wizard’s experiment went awry and chemicals were dumping into it. The lake glows like a collection of fireflies are underneath the surface at night. None of the aquatic life seems to be effected, but, all the frogs are now acting odd.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "o7z2mIc5C7MV35JE","flags": {},"type": 0,"text": "A floating ring of rocks and ice levitating 50 feet above the ground. The ring has some small villages and such but most of the ring is barren and cold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "4urHz9jMFfyAPXPz","flags": {},"type": 0,"text": "A beautiful valley with crystal clear water and lush green grass with bushes and trees abundant with fruits. The valley has a strange secret being that all food and water in the valley is poisonous. Anything grown or added to the valley that can be edible becomes poisonous. The poison is neutralized when the food or water is taken out of the valley.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "2ywgCk2Ii5NOxhDS","flags": {},"type": 0,"text": "A mountain completely covered in a variety of fungus and bluish green molds. The mountain is home to many druids and rangers that are usually insane. If a creature spends more than 3 days on the mountain they must make a DC 15 wisdom save or begin seeing hallucinations.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "6tMMJWZg8IOBZ1K2","flags": {},"type": 0,"text": "A depression in a desert that’s 60 feet deep. The depression has 20 feet of water at the top of the depression that is unhindered by gravity. The most acceptable theory is that a wizard had done this so he could protect themself from the heat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "baodCJuhsvRYZQBL","flags": {},"type": 0,"text": "This sleepy fen is interlaced with canal-like trails of vaporous, enchanting mists. Variously, travelers have reported magically falling asleep here, or becoming hypnotically charmed, or losing their way for several days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "a9iwnPoqBjyqNYjx","flags": {},"type": 0,"text": "A part of a reef with plants that have large bulbs with various colors on a tall skinny stem. The color of the bulb is what decides the effect of it when popped. Some examples include red bulbs being charm, green bulbs containing acid, and rare pink bulbs that have a feeblemind effect. The reef also has large red sea slugs that cast random spells due to an untaimable well of magic inside of them. A civilization once tried to use these slugs to create sorcerers unnaturally and parts of their ancient civilization can be seen buried under sand. A greant nation destroyed by unethical pursuit of science.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "BlbKtau9dZwAnvso","flags": {},"type": 0,"text": "A forest where lightning travels between the trees with an atmosphere of charged pressure. The forest has many treasures inside for those who wish to make the dangerous journey into the electric forest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "8hKdcu0oszgEIch3","flags": {},"type": 0,"text": "Above this narrow gorge, the blackened earth is traced with open rivulets of volcanically melted metals so hot they look like streams of liquid light, pouring over the edge into the deep crack in the earth. Within the gorge, these flows of molten metals have dwarves attempting to harness the molten metal for smithing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "mF6yLzMBcUF6nuV3","flags": {},"type": 0,"text": "A large grassy field where the grass is completely rigid. Ths field looks normal but a DC 13 investigation will reveal that the grass doesn’t move with the wind. Anyone that steps on the grass will feel as if a thousand tiny daggers pierced their feet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "e1sKz5TRPAbLguHU","flags": {},"type": 0,"text": "A lake completely void of all life. The lake seems to change from saltwater to freshwater at random. Upon closer inspection the lake transforms from saltwater to freshwater depending on the lunar cycle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "s0vRmFmTdI3zKotB","flags": {},"type": 0,"text": "The underwater civilizations have long shared dread myths about this field of underwater volcanic vents, all belching out their pumice projectiles from the ocean’s depths. This submarine wasteland is a land of monsters, a gateway to the elemental plane of fire, and home to ancient abominations. The several kingdoms nearby have built coral walls and crystal watchtowers as defenses against the terrors that dwell here.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "0ZjEC3CbFsdkKHoq","flags": {},"type": 0,"text": "This system of caves is the setting for a well-known romance story, which is told both as a five-act play and a popular song. The caves themselves are often visited, because they are giant geodes, connected by a winding, luminous path. From above, this region looks like a verdant chain of spherical hills; but within, the crystalline walls and ceilings hum with a strange, ethereal music.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "ULH3pk3FNVXitWjK","flags": {},"type": 0,"text": "This trodden river basin is home to a crash of earth elementals, rolling and rampaging through the many tributary streams, and often sinking into the wide, central river before rolling out the other side. Only the fastest, most agile animals, sprinting birds, blink hares, miniature antelope, and enfields, call this place home.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "ICi4qet8S4lHtHNU","flags": {},"type": 0,"text": "A cursed jungle in the Feywild where bugs that roam there grow to monsterous proportions. This jungle is a contested point in wars. Many factions do what they can to keep the jungle out of the wrong hands.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "SLjTUt6LQHYW79qt","flags": {},"type": 0,"text": "A forest with strange magic placed upon it where travelers get lost and age at twice the rate while trapped in its forever winding maze of bushes and trees.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "Q0rsDe17UP3NITse","flags": {},"type": 0,"text": "A desert with the softest sand on the material plane in the very heart of it. The sand is pink and very expensive. Sought after by many, the bones of adventurers litter the desert in search for this pink miracle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "CorqZEBHPTJxmSDA","flags": {},"type": 0,"text": "An underdark clearing which stretches for miles. What seems like a very normal path is revealed to have copious amounts of traps. The traps are not manmade and will change locations every full moon. Kobolds see this stretch of cavern as a holy land.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "lLWLJzJQgP5C5Jsk","flags": {},"type": 0,"text": "A small area in the tundra with incredibly powerful winds that never cease and always blow directly downward. A DC 14 athletics check is required to not be knocked prone, the check can be remade every hour. The wind makes every part of the tundra magically difficult terrain. The tundra has many steep drops from the constant force of air pushing against the ground.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "YBzKRVPEQZFcpoXn","flags": {},"type": 0,"text": "A normal rainforest where everything seems fine except for the unusually dry air. If more time is spent there it will come apparent that it never rains. Dispute this the flora and fauna look completely healthy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "5mCiqhF2dos1AF2s","flags": {},"type": 0,"text": "A grotto where large clumps of water bounce from wall to wall or levitate above the ground. Some of the water clumps have life in them and others don’t.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "Il2kPPIDS2AMKGrN","flags": {},"type": 0,"text": "A river of oil lit aflame twists and turns through all of the layers in the nine hells. Each layer having a fiery “waterfall” that comes from the layer above it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "Tuqlt6tPVdRY9iFH","flags": {},"type": 0,"text": "A massive glacier glowing with magic. Inside of the glacier is a gigantic fire that doesn’t appear to affect how fast the glacier melts. Scholars fear that if the glacier ever does melt then the fire will be let out of the ice and unspeakable damage can occur.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "yccW8mSA45KytWyY","flags": {},"type": 0,"text": "A dry and scorched landscape where a long stretch of lush grass resides. A DC 16 intelligence save will reveal the grass is an illusion and what’s underneath the grass is a long drop down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "5qJfQY25n2OMZwdT","flags": {},"type": 0,"text": "A frozen cliff to the far north where a primordial rune of strength is carved into the cliffs face. No one is sure of who chiseled the rune into the cliff.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "bxBhtnjxdkmB6c9d","flags": {},"type": 0,"text": "A sun baked cliff to the far south where a primordial rune of courage is carved into the cliffs face. No one is sure of who chiseled the rune into the cliff.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "GwLnLhj4rvq6wcXx","flags": {},"type": 0,"text": "A grassy cliff to the west where a primordial rune of wisdom is carved into the cliffs face. No one is sure of who chiseled the rune into the cliff.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "NLkhc1xA1SAptbTe","flags": {},"type": 0,"text": "A mountain made up of dark rocks. The mountain floats slightly above the ground. Few travel the mountain as it is very dangerous but a couple adventurers every year die up there.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "rUonBA7hsfbsd36p","flags": {},"type": 0,"text": "A river that flows inside a long cavern. Inside the cavern gravity shifts so that a creature can be standing anywhere in the cylindrical cavern. The river flows up its walls as it winds and turns.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "cbH92WxuQxmeDcfA","flags": {},"type": 0,"text": "A stretch of deadland where pillars of necrotic energy come up from the ground and push high into the sky like a twisted geyser. Many warlocks and wizards collect samples here to create nefarious new concoctions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "QGAYBv5Vy3bU1xrE","flags": {},"type": 0,"text": "A knoll that is nestled just between two towns. The knoll is said to have dark magic litter it’s deceptively pleasant appearance. Any creature that wanders into the knoll must make a DC 21 intelligence save or feel like the knoll has a dark secret. The magic that hangs over the knoll is necromancy and its effects cannot be identified by magical means which is a foreboding sign to say the least. In actuality the knoll has nothing to hide and is a regular knoll. The necromancy hanging in the air is meant to induce paranoia.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "Fv7AlcU5I6p31U4c"}
