{"name": "Interesting Boss Mechanics","description": "One hundred different strategies your party needs to defeat that big enemy!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "bJfdyKWDBRhTNxfP","flags": {},"type": 0,"text": "This battle takes place in front of a massive furnace. As the battle goes on, the furnace gets hotter and hotter, to near unbearable levels. Someone needs to tend to the huge furnace while the others battle to keep from melting!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "FM4Bx9YkZbWs3Wgn","flags": {},"type": 0,"text": "The boss will summon enemies that will distract the players from the fact that the boss is healing themselves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "fk7JTg8wlomV278h","flags": {},"type": 0,"text": "The room in which the boss is designed like a long hallway. As the boss grows weaker, they will run further down the long room. Traps cover the room.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "nOiqAe5QExXcHyv0","flags": {},"type": 0,"text": "The boss cannot be close to an object or another boss, or else it will rapidly restore health; keeping it away will make it easier to take down.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "PN7KLomnkI9SLWGc","flags": {},"type": 0,"text": "The boss is blind and takes damage when hit by natural light. Adventurers need to use the boss’s Tremorsense/Echolocation to lead it into beams of light.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "zXUIXixTqZiPHBPd","flags": {},"type": 0,"text": "The boss fuses with slimes to become bigger and stronger, but it can only get so big before it explodes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "iJLAE4Y8tCrF7A64","flags": {},"type": 0,"text": "There are ongoing rituals around the area that must each be disrupted in a specific way within the next few minutes. Each completed ritual empowers the boss with negative energy, escalating the fight and drawing the end times closer.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "Ss4mHNcp4ZxiM14B","flags": {},"type": 0,"text": "Players must fight from the rafters above a stage while trying to stop the villain from sabotaging a performance going on below.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "HneCLxxmOJ3hYwuP","flags": {},"type": 0,"text": "The boss is in a sewer and monsters were placed in the sewer to deal with waste, but they end up attacking both the players and the boss.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "u15juLqLudG3oKNl","flags": {},"type": 0,"text": "There is a massive minefield that has a bloodthirsty invisible stalker roaming around it. Mines deal heavy damage to both players and the elemental, and groups that can’t find the stalker have to activate the mines to either kill it or scare it away.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "Ey4DDBQrmynowXlQ","flags": {},"type": 0,"text": "The villain casts a spell on the players that makes them speak and describe their actions in iambic pentameter. When the villain dies they cry out saying “I am slain!”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "5aksLLWhgvFgbZkA","flags": {},"type": 0,"text": "The party fights a creature that can turn people into lobsters for a turn if it hits them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "wZJ3w2oFLsdMAkVe","flags": {},"type": 0,"text": "The boss is a lich who’s phylactery is a bomb that would destroy the dungeon and everything within a three mile radius. Someone has to disarm the bomb while the other pcs keep the lich busy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "2gtoFw4gDUCSSm9Q","flags": {},"type": 0,"text": "The boss is in a gladiator style WWE ring. Through some hints during the fight, the players realize that the boss isnt actually trying to hurt them, and is instead trying to make the fight look as flashy as possible so that they can all survive another day in the arena.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "AVKmMEKdL6xFBYOF","flags": {},"type": 0,"text": "The players enter a room with a button and a locked door. If they press it, they are all knocked unconscious and dream about fighting a boss 4-5 cr higher than them. If they die in the dream they wake up in the real world, and the door to the next room is open. They can re-enter the dream to help whittle away at the boss or kill their friends to help speed up the process of them getting completing the dungeon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "pCQLVkSKKxW6WxGV","flags": {},"type": 0,"text": "The boss can only be killed by mortal hands. Weapons, magic spells, and any damage type besides fists/natural weapons cannot damage the boss. Immortals and gods cannot damage it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "pOob0LtEASOxBElS","flags": {},"type": 0,"text": "The boss is a glass golem that can hide and heal inside of mirrors. Players can see the golem in the mirror, but must break the glass to force it to come out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "oRqyY1kCMOmtBr6B","flags": {},"type": 0,"text": "The boss is stationary in the center of the room. When it receives enough damage from one if the cardinal directions it becomes invulnerable to damage from that side, forcing the players manuver around the room and minions to continue damaging it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "XYhg9OfqQgXByu1l","flags": {},"type": 0,"text": "While walking through a cave they have PCs have accidentally walked into the open mouth of the boss. Tremors felt during random fights of slimes and cubes or small parasites eventually lead to acid pools. Party can flee or fight their way out. Possible risk of digestion if slow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "65CEJyaET73alu3D","flags": {},"type": 0,"text": "Boss is a wall, slowly shrinking the room and pushing the party to a pit or wall of spikes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "rbPE3CfLlcgKIcMr","flags": {},"type": 0,"text": "Boss is a keg golem. Body is mostly full kegs. Some are filled with beer some are wine. Players can target weak points like corks or bungs to drain alcohol and wound the boss. Once limbs and parts are drained can be burned.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "7vTyBs0dZ3ykHLMq","flags": {},"type": 0,"text": "A village has a pit of ghouls/zombies. When a love one is dying they toss them in to be turned. You have been tossed in as food.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "5BLaHxlIJMotuouD","flags": {},"type": 0,"text": "Boss contains a howling void. No verbal commands or spells work. See if the PCS can work with out speaking or writing to each other.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "sRI8ZkEdDl4CPe91","flags": {},"type": 0,"text": "Glued together: The boss is two deadly bosses inseparably glued back to back. Their movement is halved/thirded. They are not cooperating with one another. Only one of the individuals is dominant at a time, the other is dragged along. On their turn, roll a d4. On a 1, the bosses bicker amongst themselves and fail to take meaningful action (flip a coin to see if the dominant individual changes). On a 2 or 3, both bosses may attempt to attack a target they are facing but do so with disadvantage. On a four, the dominant boss may make an attack as normal, and the subordinate one attacks with disadvantage. If one individual dies or becomes otherwise incapacitated, the other is permanently dominant and attacks as normal, but its speed remains the same.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "1ESjFwEskHKJ3FkY","flags": {},"type": 0,"text": "Bratty halfpint tossing: The arrogant yet naive boss is being carried on a light palanquin by their strongest and fastest minions. The boss refuses to touch the the ground, as it is demeaning … somehow more demeaning than the minions tossing the palanquin between them or using it as a blunt weapon when convenient. The boss is a powerful ranged attacker but spends half their turns shouting confusing orders instead of taking appropriate action. If the boss touches the ground, they have a temper tantrum and launch a very strong AoE spell at the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "ojDTPMGac9ai3Wts","flags": {},"type": 0,"text": "Farty Fight: The boss is afflicted with horrible magical indigestion. Roll 1d4, on a 4 the boss, instead of acting, groans and releases a stinking cloud per the spell. They are unaffected by their own stinking cloud.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "4C9NaVWNcRPJExDw","flags": {},"type": 0,"text": "The boss is a support character. Most of their goons are on the tanky side. Whenever their goons drop low, the boss heals them back up. The tanks protect the boss as well.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "dfQlvnE1rOKRW1sU","flags": {},"type": 0,"text": "Stand in the Fire! – Boss takes extra damage from opponents who stand in a flow of Necrotic/Negative Energy. This causes the player to be damaged too.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "zbh4oKIUsDuKAUL5","flags": {},"type": 0,"text": "Keep him out of the Fire! – There are flows of energy around the room that heal the Boss if he stands in it. You must knock him out of the flows to defeat him.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "U9KTaLtuN1eYANRe","flags": {},"type": 0,"text": "Not-Zs, I hate these guys… – The bosses are a group of evil warrior-sorcerers that are exceedingly powerful, however they become pained and stunned whenever someone uses the letter “z” in conversation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "ciRQQrimWhfOEQnI","flags": {},"type": 0,"text": "Stone fishing: The boss is hiding in the mouth of a giant stone fish who can swim in the earth like water. The fish can’t go outside a sphere of a certain radius, but it allows the boss to appear from the walls and ceilings and try to smash people.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "ZK4TmXg9g1g7j2S1","flags": {},"type": 0,"text": "Shadow Tag: The boss can hold a person with advantage by simply standing on that person’s shadow. The boss has multiple spotlights they can move around the battlefield. Although the boss cannot hold people on a dark battlefield, the boss has keen darkvision.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "M60qFFBnjnAvsgXX","flags": {},"type": 0,"text": "Adaptivity Type A) The boss can only be damaged the first time by each attack, after that the boss becomes invulnerable to it until a they have a long rest. The party must come up with new ways to damage the boss. (Switch weapons, new spells, etc.) Adaptivity Type B) The boss is protected by a shield that reflects damage of the type last used to hit the boss.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "umUxGosPzTRxwbwW","flags": {},"type": 0,"text": "Bug Off! The boss tries to flood the battlefield with an effectively infinite number of tiny, weak, annoying baddies (bats, imps, mosquitoes). They will simply keep coming even if the whole cloud is killed. The sheer number would be lethal if they weren’t driven off by (light, fire, sound, etc) Someone has to keep the antagonistic stimulus going during the boss fight and the boss targets the blocker preferentially.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "Dn6B4kvLcLXSd7SS","flags": {},"type": 0,"text": "Armor Ecdysis: The boss is wearing powerful heavy armor that takes damage instead of the boss, but makes the boss slow. As the armor is attacked, it breaks off and leaves the boss vulnerable, but the boss gets faster and more maneuverable as a consequence. For each stage of armor that is destroyed, the boss takes more damage, the boss’s heavy attacks get weaker/fewer, they become able to perform light attacks, Movement Speed +, Initiative order +, etc.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "ARQpllWcGrXDL1fI","flags": {},"type": 0,"text": "The boss alternates between attacking and devensive modes. During attacking turns, it gains +10 to all damage but has -5 to attack rolls, can attack 3 times per turn but takes 2x damage from all physical attacks. After a certain amount of hp has been depleted (up to the DM) it switches to defensive mode. In this mode it can’t attack or move, however it takes 1/4 damage from all physical attacks, has a 1 in 6 chance to reflect all damge back to the attacker and heals for Xd4 points (where X is the number of players it faces) at the start of its turn. The defensive mode lasts until it loses enough hp (again, up to the DM) or it recovers back to full health. It then returns to attack mode. The golem had five stages, each denoted by it losing a peice of armour after each defensive stage was ended by it taking damage rather than healing. Each time if returned to attack mode after losing armour, it’s AC was reduced by 1 and its max hp by 20 but it gained an extra +1 to attack rolls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "4Eoe0HBclHpt4Lwt","flags": {},"type": 0,"text": "Meta-witch The boss asks the players campaign trivia questions during the battle. If the players answer correctly, the boss loses some hitpoints. Answer wrong and the boss gets to take an extra turn.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "inAnIe1VhcuY8iGz","flags": {},"type": 0,"text": "Every round the boss auto-counters one type of attack at random ever round until the start of ot’s next turn.. Roll a d3- 1: Melee 2: Magic 3: Ranged. If the boss is attacked via melee, it will counter with a melee strike, if the boss is attacked with a ranged strike, it counters with a ranged strike, etc.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "vvp3lEQvdsWBU3rC","flags": {},"type": 0,"text": "Alas poor Yorick – The skeleton boss has no head of its own. Instead it uses the skulls of others as a substitute. When it wears someone else’s skull, the boss gets all of their abilities and their appearance. Taking enough damage causes the boss’s current skull to explode. The boss should cycle through several different classes, helped by minions bringing hidden skulls. Eventually it runs out of skulls and attempts to flee, but like the proverbial chicken with its head cut off, can’t tell where it is going.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "E1jTnmdZp4UjticN","flags": {},"type": 0,"text": "The boss gains resistance to a random damage type for one round, every round.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "gYk3G7dlyh0DGdvO","flags": {},"type": 0,"text": "The boss is controlled by a card-based computer and the PCs can remove and insert various punch cards to change the boss’ strategy or disable some of its abilities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "0vu0QGO0pOwfVX48","flags": {},"type": 0,"text": "The boss is hauled to the center of the courtyard by 3 henchmen. When unloaded, the boss is literally a pile of sentient cinder blocks. His AC is high, but has no movement speed. He can speak and cast magic or use his trusty short sword. If the adventurers investigate his corpse, they find that it just becomes a pile of cinder blocks","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "7TIstEmEbmysYC3F","flags": {},"type": 0,"text": "Pocketcursed: In the lair of the boss, everyone’s pockets, bags, binders, satchels, cases, backpacks, suitcases, luggage, etc become bitey monster jaws. Attempting to retrieve an item or spell component results in (1d4) of damage with a risk of failure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "BclKdsPKbsvYT9sJ","flags": {},"type": 0,"text": "A massive pendulum in the lair reveals the invisible boss when the weight is at its height. The PC’s can attempt using magic or physical means to hold the weight up and keep the enemy visible. The weight can also crash into the PC’s or boss.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "a9ylOlq3Q0Vl4N8k","flags": {},"type": 0,"text": "The boss is a swarm of insects, nanomachines, magic particles, or something else similar. It has a large pool of total hitpoints, representing the amount of mass it has, although this mass can be split over multiple bodies. At the top of the initiative round, the swarm can split into smaller bodies or fuse with adjacent bodies to form larger bodies. For example, for one round they may be a horde of smaller, weaker creatures, and on the next round they may fuse together to become a larger and stronger creature. The DM has a number of stat blocks prepared for creatures this boss can form, each of which has a minimum HP requirement to form. To make things more interesting, there may be stores of additional mass hidden around the battlefield, which the boss will attempt to reach to regenerate hit points and mass. If they want to keep the boss down, the players will have to stop any part of the boss from reaching those stores of HP.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "LEE3C5G7koSiOSoU","flags": {},"type": 0,"text": "A baddie that gains new biological growths every two turns. Starts at like a CR4 with a bunch of health and eventually could be over CR 20. Work fast or PERISH.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "KqkPGvuAb95aTcRk","flags": {},"type": 0,"text": "The boss is being healed by a certain amount, let’s say 5dx per round (x going up depending on how high level the group is) because of healing crystals that are on platforms that need to be climbed in order to break. They each have a certain HP, and after being destroyed they stop healing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "fLNqrl9yJ9NH8VBZ","flags": {},"type": 0,"text": "The boss is completely invulnerable. But that doesn’t mean they are either physically strong or able to avoid, say, being locked up or captured. They just can’t be physically hurt. Don’t give them spells or fighting ability more than a commoner- just make them impervious to damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "swM5DRmxCQ84y86O","flags": {},"type": 0,"text": "The bosses are a dark mirror of the adventuring party from another plane. One of the main questgivers actually travelled from that plane to the adventurer’s plane and gathered them together because he knew they had great power potential- since he knew of their evil might. Make them twisted versions of the characters, and have the player’s aid come from good versions of baddies the characters fought on their home plane. For example- A gnome cleric was a warlock, the fighter was a death knight, the wizard was an enchanter, etc.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "mIEtNxPsR2HCWIAE","flags": {},"type": 0,"text": "The Cult of Six- The Big Bad has powerful hexatic powers. Every sixth attack heals her for twice the damage dealt. The catch-it is any attack, including a poke in the nose. Make sure the characters can catch on to this one.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "lxGvsHeVMCzrSUEw","flags": {},"type": 0,"text": "Lights turn off on rounds 2, 6, 10, etcetera and lights flare on in a blinding burst on rounds 4, 8, 12, etcetera and must make a Constitution save to avoid being blinded. Players can close their eyes to avoid the blinding but make their attacks with disadvantage that round.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "LbdZksAOPSyxNRre","flags": {},"type": 0,"text": "BBEG has a lair full of deadly traps and powerful minions, and always remains one step ahead of the PCs. During the final confrontation, the BBEG is revealed to simply be a clever and well-connected commoner, completely unable to fight head-on with the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "oGhuJITnLBTRym53","flags": {},"type": 0,"text": "Overcharged- A Half-dragon that gets an increasingly powerful and large aoe attack at the end of each turn, but loses his stacks when knocked prone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "DwztsIkQGOZCBM2V","flags": {},"type": 0,"text": "Whilst the party is adventuring at sea, their ship is beset by a dragon turtle of legend named Kiirn. An intelligent and greedy sonofabitch, Kiirn sinks ships for their cargo which he then takes to his nest in a cove on a nearby island. The first stage of the fight takes place in the sea with players on a ship, which Kiirn is attempting to sink. The captain of the ship deems la d the only safe haven and heads for the nearest landmass, Kiirn’s island. Along the way Kiirn may become damaged enough to retreat, but the Captain insists on landing and repairing the damage. Otherwise, the ship becomes damaged enough and sets off on a crash course for the beach. The second stage of the fight is a scramble up the beach as an angered Kiirn attempts to kill the party and sailors. Players may stand and fight, attempt to rescue the sailors or flee. Kiirn is less concerned with the cargo than the people at this point. The third stage follows the retreat up the beach, a chase through the rainforest on the island. The players may chase Kiirn to finish him off as he leads them to his cove, or Kiirn may chase the players, angered by their defiance and the damage they’ve done, or perhaps angered that they escaped him at the beach. The fourth stage is a fight in a large cave that leads to the cove. This is the point at which players and Kiirn alike are likely be exhausted and close to death. FINISH HIM. At each stage, Kiirn has a different objective which can vary based on the player’s actions. You can also spice it up with Kiirn having something akin to lair actions in each of the stages as well as environmental opportunities.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "j0hd7OksnZtZymIR","flags": {},"type": 0,"text": "Each time you hit the boss, and it doesn’t have temporary hit points, it gains 5 temporary hit point. Each time its temporary hit points are depleted, the amount of temporary hit points it gains from being hit increases by 1. A hit that depletes the temporary hit points grants a new set of temporary hit points after the remaining damage has been subtracted from the boss’s regular hit points. You want to use as few and strong attacks as possible against this boss.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "SYiJkMZZRNZT11Oj","flags": {},"type": 0,"text": "Torvin the Backbiter – He is a Dwarf warrior who excels at disarming and using his enemies’ weapons against them. He starts unarmed and tries to take the player’s weapons. If he succeeds and makes a successful attack roll with their own weapon, he deals automatic max damage (or more, or less, depending how you want to play it).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "fJUOBQxwKisPITle","flags": {},"type": 0,"text": "The Midget Cultists of Oun-Bashon: A group of gnomes or halflings who worship a vile fire deity. The party catches up to them in a live caldera or volcano. Each one is relatively easy to beat, but they less attack and more attempt to grapple and drag themselves and the party into the live volcano, seeking glorious martyrdom in the heat.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "JsN6WeHwPN5jbvLk","flags": {},"type": 0,"text": "The boss has a stone that allows him to polymorph at will. If the players steal the stone, the boss loses the ability, but whoever holds the stone is polymorphed randomly every other turn. The Boss tries to get the stone back.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "oz7t0intDAt4zxKY","flags": {},"type": 0,"text": "The Boss is warded against blades and anything with an edge does half damage. Bludgeoning works as normal. Attacks with wood items do double damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "DCal674gUuvObdKH","flags": {},"type": 0,"text": "The boss isn’t targeting the players, but an NPC the players have to protect. Any damage done to the NPC is passed on to the nearest player.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "pGgLWDTAXfUHzJJQ","flags": {},"type": 0,"text": "The boss is a ghost, with a council of 3 individuals. The boss takes turns possessing each council member every few turns, giving them new class specific spells.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "Py9K3tmnaB2a5eTv","flags": {},"type": 0,"text": "Every turn, the boss teleports as a bonus action. Everytime the boss takes damage, it teleports to a random spot in the arena.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "moObUHlD2jfbCc05","flags": {},"type": 0,"text": "A necromancer that rips the hearts out of his acolytes, using them to a.) push thru players, dealing dmg for each heart sent and blooding the hearts b.) pull the hearts thru himself to heal for the amount they blooded c.) push/pull himself into position by using the hearts as anchors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "MLSEDHaS9rGocOLG","flags": {},"type": 0,"text": "Every time the boss kills something, he gains half its max hitpoints. He has a lot of minions and will not hesitate to kill them for a boost.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "BwHofqPxv7wMUlDj","flags": {},"type": 0,"text": "Daughx the Mothtouched- boss can fly and do cool stuff, but is completely mesmerized by the dancing lights spell.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "8o7GCcKNV9Mxy34r","flags": {},"type": 0,"text": "A miniboss found in The Woods, a layer of the Abyss run by Granny Gooseflesh, a powerful Night Hag Sorcerer (the whole plane is a dark and forbidding woods, populated by dark versions of various nursery rhymes and fairy tales): The Piper is a powerful bard who summons rat swarms and sends them at the party. When they finally catch up to him, he has stolen and enchanted the children of a village, and uses them as shields/has them attack the party. The children don’t do tons of damage, but they muck up the battlefield and are difficult to fight (because they are little kids).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "uieAZqqMEnOZnva6","flags": {},"type": 0,"text": "There are three bosses and each one starts with an AC of 15. If the party kills one of them, one round later the other two’s AC jumps up to 25. If the party kills a second one, one round later the last one’s AC jumps to 30. The goal for the party is to kill all three in one round by paying attention to three glyphs on a wall that display how close to death each boss is by how brightly they are glowing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "au11Ne0AjyDbCrmK","flags": {},"type": 0,"text": "The Necro-dancer. When confronted in his dark lair, the lights suddenly go on, revealing the room to be a massive dace floor. At the start of each turn, “zone of irresistible dance” is cast through speakers that line the walls, which the Necro-dancer has the remote to. Each turn, the Necro dancer summons ‘backup dancer’ skeletons, or something that would be comparatively weak for the party’s level. This goes on until the song ends, at which point a giant disco ball is dropped from the ceiling with the intent to crush the players, taking advantage of the disadvantage dex throws and lowered movement. After that, the dancers stop being summoned, the zone of irresistible dance does not get cast again, and the Necro-dancer is left all alone. The song could also stop by breaking the speakers or remote, or escaping the dance floor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "39GoUgkdsAXRiCut","flags": {},"type": 0,"text": "Boss is a low level mage with prototype clones surrounding you. Whenever you kill him, one of the clones wakes up, but gives the mage unique abilities. One clone might lower your AC for the fight, one may have a sneak attack and invisibility, another may cast hunters Mark, and gain the scout reaction to run when an enemy gets too close, all while retaining most of his spells.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "CiLQMLHHqzpNhNgD","flags": {},"type": 0,"text": "A pair of sorcerers who are madly in love. When the first one is knocked out, the other sorcerer, as a reaction, casts an incredibly powerful spell at whoever took them out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "CZlkLFzJMv6Ha80R","flags": {},"type": 0,"text": "A boss duo, with a big enemy who hits hard and has a lot of HP, and a little enemy who can hold his own, but mostly assists the big enemy with healing/whatever. Whenever the little enemy is attacked, the big enemy goes crazy as a reaction, dealing a ton of damage, so the party has to try and focus on the big one without harming his buddy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "3LcTF5jMC2WKGJVe","flags": {},"type": 0,"text": "A boss that is vulnerable only if you can’t see it. If someone is looking at it, it can move around and can’t be harmed. However, if no one is looking at it, its movement speed slows to a crawl and it is vulnerable. Cue everyone with their eyes closed, swinging blindly around the room!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "PgkcqsX4K87wEEyr","flags": {},"type": 0,"text": "The One Who Is Many- Boss has 99 copies of himself. A mob attacks the party, all identical. Roll d100 every time the party attacks. The boss shares a portion of his life force with each copy- when his copies are attacked, he takes damage with resistance. When he is attacked, he takes damage with vulnerability. When he has lost a third of his HP, and again when he has lost 2/3, a third becomes illusory looking.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "6AS2h48oGGzOPl03","flags": {},"type": 0,"text": "A mob boss that starts as several weak combatants, but when one is killed the survivors become stronger.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "XYQdaqgMwmPT7UzF","flags": {},"type": 0,"text": "The boss has a mirror hidden somewhere in the room. Anyone reflected in the mirror takes half of the damage inflicted on the boss. If the mirror is shattered, the boss gains vulnerability to all damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "1WnHqZ4Ht3fHDuMU","flags": {},"type": 0,"text": "The boss is a corrupted holy artifact with lots of HP. The artifact’s environmental effect causes the party to regenerate HP and it also fires healing beams. Healing beyond a creature’s natural HP cap is added as temporary hitpoints. If any creature gains more than twice their HP in temporary hitpoints they die. Important detail: the boss cannot benefit from the regenerative environmental effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "uW5BkbQU4JOKa9eF","flags": {},"type": 0,"text": "Initially weak boss with lots of minions, but as the minions die, buff up the boss bit by bit. Either the players press through enemies to quickly kill them or they cut through an army and fight a big old baddy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "iLt7zMjAYBP8aJwB","flags": {},"type": 0,"text": "A powerful knight is bound to the Bad Guy’s service. He has to obey anyone who says “please” to him first. The Bad Guy has deafened him so he can’t hear, but if you cure that…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "4oRnaU6MauWnB4Bz","flags": {},"type": 0,"text": "A nearly impenetrable (if you dont take him out to dinner first) demon in a human shell, covered in runic tattoos- but if you land an arrow in the circle tattoo on his neck it allows damage to hit the target for the next 10 rounds or maybe however long the arrow is on target. Possible difficulty up- he’s able to remove the arrows by passing a strength save.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "tc9MpKhg47wCTsIu","flags": {},"type": 0,"text": "The Oracle had managed to somehow imprison their (God/Angel), piercing their immortal skin and chaining it up, leaving the weeping deity of rebirth constantly dripping blood. This Oracle uses magic to manipulate this holy blood to instantly heal any injury that they might sustain. The secret to defeating her, however, is to heal the Deity’s injuries, robbing The Oracle of their crude immortality.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "vIcr63wgKMHpKs3w","flags": {},"type": 0,"text": "A Bugbear with armor covered in worthless jewels he has glued and embedded in his armor, knocking them out can be used as a bargaining chip to pacify him from attacking.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "ruvJ2veWcJKemR9x","flags": {},"type": 0,"text": "A towering, ominous obelisk made of steel is guarded by 3-6 Animated Armors, 3-6 Flying Swords, and 1-3 Helmed Horrors. The obelisk is covered in glowing arcane sigils and scribbles that shine brighter when the player’s step forward to confront it, at which point the assorted defenders move to attack. The obelisk manifests a eye-like sigil which moves around its surface each turn to channel a beam that repairs and reanimates fallen defenders. This beam causes the target to regain 3d8 hit points as the components are magically regrown and imbued once more with magical energy, and is fired one time on each of the obelisk’s turns. Any destroyed constructs hit with the beam come back to life at 0 hit points and regain the amount rolled for the beam, though they cannot take their turn until the following round. To beat the obelisk boss, the invaders may attempt to attack a construct targeted by the eye beam while the ray is being channeled, which causes the amount of damage dealt to it to also go through to the arcane entity within the obelisk. The boss also takes 10 damage every time one of the arcane sigils or a significant part of a particular scribble is erased or damaged in some way, whether the marks are gashed deeply with a blade or blotted out with a destructive spell. The arcane entity within the obelisk has a total of 80 hit points, while the obelisk and the magical markings on it have an AC of 15. Destroying the obelisk entity makes it dissipate into the surrounding area without a trace, causing the arcane markings to go dark and all the constructs to fall apart, thereby ending the boss fight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "OQwZHs9fjNPqeT8Y","flags": {},"type": 0,"text": "Some amorphous creature that is under the permanent effect of a mirror image spell that refreshes after all images are dispersed (which could be flavored as overlapping images of the same figure, or many different figures, like nightmares, occupying the same space). The trick is to use area of effect spells, or somehow marking the real creature on a successful hit. For instance, striking the creature with a dagger tied to an immovable rod will pin down the real creature and prevent it from shifting around, rendering the mirror mages useless.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "WT1PgpChmTSTd18N","flags": {},"type": 0,"text": "A troll from Chult that was infused with firenewt blood that gives it resistance to fire damage. Acid does normal damage but no longer disables it’s regeneration, only necrotic damage will stop it’s regen.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "FjlL3VS74NisfSho","flags": {},"type": 0,"text": "Two humanoids (Gladiators, Assassins or Githyanki, for example, depending on the CR you want) whose secret dream is to be an animal. If you polymorph one of them they stop being hostile, and the one you didn’t polymorph will kindly ask you if you can do the same to them. Then they’ll both leave peacefully.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "Gjiq1RillyL5UkSl","flags": {},"type": 0,"text": "A massive Clockwork Golem that needs to wind itself up every so often using the wind-up key on it’s back. If it cannot, it powers down and goes dormant until wound back up again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "aMf9UuR99SVEfVsS","flags": {},"type": 0,"text": "A magic user fights with his pet wyvern. The man is difficult to hit due to a variety of defensive and knockback spells such as Wind Wall and Gust of Wind, while the wyvern has naturally tough defenses and resistances. However, when one moves (including reactions), the other doesn’t. They also share the same HP pool.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "CruADzuKUO12pDLO","flags": {},"type": 0,"text": "A tall thin monk wanders a forest moving with the sounds of nature and attacks with capoeira. He gets +7 to dexterity unless music with no rhythm is being played. Then he gets -7 to dexterity.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "wqa8uWushtnwTvHd","flags": {},"type": 0,"text": "A tall suit of enchanted armor that roams the countryside, gathering corpses for its necromancer master. It has an obscene amount of health and CON and cannot take damage from an attack that does less than 10 damage. A called attack to the head that does more than 30 damage or a grapple check followed by a DC 15 STR check will remove the armor’s helm from its shoulders, causing it to collapse. An arcana check will reveal that the armor is powered by a small gem on the inside of its forehead. A DC 19 slight of hand can remove the gem.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "GBrPSZ7iLXGaHO5g","flags": {},"type": 0,"text": "An artificer that uses a set pool of arcane energy (let’s say 100 mana) to power his magical armor and wand. He uses various spells, each of which take away mana. His magical armor prevents damage to himself at the cost of mana. However, he can spend a turn draining mana from other lifeforms (namely players), so the trick with him is to either break his gear directly, disable the magical effect somehow or run him out of mana.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "CZMBCnwLHLFpBNET","flags": {},"type": 0,"text": "A crystal golem vulnerable to thunder damage fights in a cathedral or other temple. Nearby is a large bell or gong. Attacking the gong converts incoming bludgeoning damage to Thunder area damage. Lure the golem into the area, strike the gong – bingo.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "8D3igA58uCmKCjkk","flags": {},"type": 0,"text": "The Regenerating Water Elemental – A water elemental that heals to full health after each round of combat from the lake in which it resides. Deals AOE damage equal to amount of health regenerated (no other forms of damage output). Must be burst to 0 HP in one turn or somehow disconnected from the lake. (Maybe it’s taunted or charmed into leaving the lake. Maybe the water is frozen or evaporated. Maybe a bubble of air/wind surrounds the elemental.)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "usI4KpFFnaH3Sh59","flags": {},"type": 0,"text": "A singular Flesh Golem that’s body size towers over any medium size creature. The Flesh Golem’s skin has seen a number of brutal battles, and has caused it to become torn which a poor slave has had to stitch up repeatedly after each battle. The Golem often bleeds from the stitches in combat ex-specially when the beast takes fire damage causing the creature to take disadvantage on attack rolls and ability checks until the end of its next turn. The creature often leaves out a loud roar when burned by any source of fire damage. Whenever the Golem’s hit points fall below 50% (207/18D12+90), any fire damage that the Golem is dealt is also half and dealt to the Golem’s creator who is within 90 feet of the battle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "nExUe4zY7AaTJ8rq","flags": {},"type": 0,"text": "A drow beastmaster uses an owlbear to destroy the group. The only problem is that the creature is easily persuaded by food.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "OBh0Rfr1ZtLlxgfn","flags": {},"type": 0,"text": "A goblin boss owns an army of 2D12 clay golems. There is a large crack on the back of each one.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "vdyhjrT8jLbDHwdh","flags": {},"type": 0,"text": "A beholder that tries to argue that the group will lose no matter what they do. If a player argues with it enough, it enters a fit of rage. This makes strength rise, but every other stat lower.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "e6vj2PBctG11Wwtp","flags": {},"type": 0,"text": "Strong fighter type character with a great sword that emanates magic power. Turns out that he’s being possessed by the weapon. When disarmed he won’t know where he is or what is going on and surrender immediately. Just make sure that no one else picks up the sword.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "jgbqtUb4rxpBzF3F","flags": {},"type": 0,"text": "A cyclops that teleports 15ft back every time it’s hit by an attack. The only way to damage it is by using spells/ bombs that affect both spaces at once, stealth attack it, or coordinate multiple attacks, so there are players waiting to strike as the cyclops teleports. Approximate CR is 7, one more than a normal cyclops, even though it’s stats are the same.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "xhsLhs9wLeW5laan","flags": {},"type": 0,"text": "A gargoyle with a big scratch on it’s neck. The gargoyle’s skin is tough rock, making it immune to all but psychic damage, unless the damage is applied to the tissue under the scratch. A character can make a CR 13 STR (athletics) check to keep it open the bruise for one turn, which becomes a CR 18 check if the gargoyle is airborne. Another character can step in to help, giving the strongest character advantage in the check. Approximate CR is 5, two more than a normal gargoyle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "aP5WTV68ANsnjgB9","flags": {},"type": 0,"text": "Blind sorceress uses bird familiar to see. When the bird is blinded, or taken out of commission she will use AOE attacks in an attempt to attack the party. If she has allies, they may be caught in the crossfire. If any of her allies are near her, they can help direct her attacks but she won’t be as accurate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "DuXlEDktcufzf3oV"}
