{"name": "Festivals/Holidays","description": "101 different holidays or festivals for your players to take part in!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "SB805PadyJ9FZiVE","flags": {},"type": 0,"text": "Festival of Returns – Celebrated by keeping one’s door open all day during festivities. In remembrance of the day that countless missing people returned home after an adventuring group of paladins vanquished a coven of hags who had been stealing people away in the night for their rituals","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "rafawjZOTD8GSKBa","flags": {},"type": 0,"text": "Weaver’s Eve – An artful festival for fabric makers. Celebrates the day when the nearby forest’s local spider population came to the townspeople asking for help to safeguard their nests from foraging cockatrices. The local seamstresses responded by making large, sturdy fabric webs for the spiders to hide in until the cockatrices could be dealt with.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "cc7iAys9ejvZNWCq","flags": {},"type": 0,"text": "Day of Stone – Celebrated as a masonry recognition day. Began as a day of remembrance some hundreds of years before when Hunters returned to town only to find that every person had been turned to stone by a roaming Medusa.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "ZVyV3uyVcqSPLO0b","flags": {},"type": 0,"text": "The Haunt – A day when people offload their grievances with one another, lest they be haunted by holding it in. In recognition of the day long ago when a necromancer bestowed a curse of silent aggression over the town until people began killing one another, then raising them for his army of dead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "exzyb0dJIF38pIn8","flags": {},"type": 0,"text": "The Honey Moon festival – Every few months, the moon will rise with a golden glow for two or three nights. In the little town of &amp;amp;lt;im bad at names&amp;amp;gt; they say that the moon does this when someone, somewhere, finds true love. During these days, tables are set out in the streets and people ask others to join them on dates, platonic and romantic, underneath the golden moonlight (similar to real world valentines dates). ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "RGvHhgLesXsleLez","flags": {},"type": 0,"text": "The Barstool Burning – After an incident where a mimic disguised as a barstool bit off a chunk of a poor patron’s bum, the tavern’s inebriated clientele burned all its barstools in the street. An afternoon of drinking and building street bonfires made of barstools and other flammables has since become an annual holiday that has spread to all the taverns in the city. The taverns use the bump in proceeds to buy new barstools. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "yaFS5MfdFWpJlwxo","flags": {},"type": 0,"text": "Monster Parade – Once a year, all the cities in region hold a parade where all the participants wear elaborate monster costumes. Larger cities may employ magicians for special effects and have multistory beasts mounted on wheeled carts with movable parts and participants riding inside. The final attraction in the parade is the “holy paladin” with an elaborate armor outfit and costume weapons who is driving the “monsters” away. The role of the paladin is chosen by popularity contest or some other method, and is almost never an actual paladin. The parade celebrates a plot to deter a foreign attack by making it appear that terrifying monsters had already overrun the streets, yet they were easily defeated and driven off by guards. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "djHPguWEoUERSJwY","flags": {},"type": 0,"text": "The Bath and Swim – This “festival” originated in a region with intermittent vampire problems. When another drained person is found, every man, woman, and child in the territory are ordered to assemble and wade across a shallow river. Immobile people are carried and then submerged. A census is then taken, and anyone who didn’t show up or refused (even visitors) is captured and dunked. Bored youths waiting for the trials to end soon started a now traditional swimming contest in the deeper part of the river. Thanks to a pair of enterprising visiting bards, a recurring comedy act developed. Two bards playing an oblivious guard and a vampire sit in a single large wooden bath and deliver “Straight Man and Wise Guy” skits. The comedy act has an informative end: it addresses vampire powers and weaknesses, and cautions against explicitly inviting anyone into your home, or your bath. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "g6LJT1gNmxdHH0jB","flags": {},"type": 0,"text": "Masquerade ball – An event for the upper classes and nobility. Participants ballroom dance while wear highly concealing masks and costumes. Because everyone’s identities are ostensibly hidden, participants are expected to cut loose. Statements challenging authority, outrageous clothing, lascivious dancing, public displays of affection, impoliteness, crude jokes, and open gossip is also permitted. Many champions of silenced and oppressed factions voiced their first manifestos here. The masquerade ball is a can’t-miss for anyone investigating aristocratic allegiances and doings, social climbers seeking courtly influence, and underworld rogues looking for high level protection and buyers. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "zOfLiFudA80yaHLj","flags": {},"type": 0,"text": "Catacomb Carnival – Once per year in the great cities the citizens head to the catacombs to celebrate another year alive and honor the dead interred in them by properly cleaning and arranging the bones of those that have been in the catacombs for a year into elaborate structures and designs. Any bones that are damaged in any way are burned in a great pyre in the city square and the ashes are used in the mortar of the bone sculptures below. They also leave offerings to the beetles and rats that do the job of stripping the bodies down to the bone. After the catacombs have been cleaned and the years previous dead have been attended to there is a day and night of celebration where revelers light the catacombs and tunnels and celebrate in procession above and below the streets wearing masks of beetles, rats, and skeletons to ward off any dark spirits and denizens that might also haunt the dark recesses below the city. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "KwM4uFY7WuJr43zj","flags": {},"type": 0,"text": "The Minstrel Masquerade – A yearly festival wherein bards gather from every kingdom to enjoy one another’s company. Every bard seeks an invitation to such a jovial event, but only a few will be deemed worthy of winning a “Bardy.” The masquerade’s origin stems from the tragedy of Gerrick the Mad. Gerrick was a loyal jester, a bard of Lore, whom kept his sleepless king laughing for 3 months straight. Unfortunately Gerrick was only a man, a simple bard, and when the king finally gave word for him to stop jesting, he fell to the ground, stone dead. This festival exists to honor Gerrick and other bards alike for their insatiable desire to be the best artistic minds in their kingdoms, and the horrid sacrifice Gerrick made for the price of his King’s smile. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "8NPvN7eBVeO31TcF","flags": {},"type": 0,"text": "The Salmon Bulb Run – It is this time each year that the giant salmon (which dwell within the nearby rivers) finish their yearly rot on the shores of nearby villages. You see, each year the salmon spawn, die, then float to shore causing a special type of psychedelic river mushroom to form on their carcasses (after they rot for approximately a year). These mushrooms are collected and shared amongst the Firbolg community as a right of passage. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "iUDKv2ESeJEQcyhh","flags": {},"type": 0,"text": "Winter’s Ritual Day – To prepare the day before, a branch of the sacred tree is cut and carved into a bowl, in it, runes are scribed asking for what you want come Spring and the next year; fortune, fertility or good health and inside is placed a special candle. After midnight, the candle is lit by a special bonfire created by the temple. A special ceremony is held at midday, where the priest incants a ritual spell ceremony, asking that the city be warded from the Spirit of Winter till next year. After this ceremony, which lasts 5 hours, the people drink ale and sup broth from their bowl cup (candle still lit hopefully), until midnight when they blow out the candle. If your candle goes out beforehand, terrible luck will befall you in the coming year. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "ghqFXrzB7BgYd6MP","flags": {},"type": 0,"text": "Day of Mending – A celebration to better one’s community and strenghten the bonds between townsfolk, this holiday is a day when tailors, crafters, smithies and similar trades set aside their work for a day offer their services for free on small projects for members of their community. As the holiday has grown, it has become a tradition for others to offer their goods and services to the community as well: bakers give away small food stuffs, taverns offer drinks on the house (one per customer!), and musicians and artisans flaunt their talents to all. Many enjoy the holiday as an opportunity to bond with their neighbors and community, while the more savvy use it as an opportunity for self promotion. The primary tenet of the Day of Mending is that old grudges and quarrels are set aside, if only for the day, and folk put the community ahead of the individual before the old business resumes on the following day. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "aaGrtGVllAmiOmNA","flags": {},"type": 0,"text": "The Lovers’ Return – One night each year, it is said that the spirits of a young man and woman return to roam the town where they died, looking for each other. Old tales tell of the young lovers kept apart, until one committed suicide from grief, only to be shortly followed into death by their partner. Now, the oldest townsfolk whisper of seeing the crimson specter of half-seen figures, sometimes a young man, sometimes a young woman, roaming the town on the night of the Lovers’ Return, rapping lightly on the doors of homes to be let inside to search for their lost love. The townsfolk believe that hanging certain totems around their entryways will keep the lovers from coming to their doors, but even so, every few years a young man or a young woman goes missing on the Lover’s Return, presumably taken away by one of the specters mistaking them for their lost partner. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "5c963hbI4ObMjWXF","flags": {},"type": 0,"text": "Winter’s Offering – An old holiday, mostly celebrated by rural farming communities, it serves as both a celebration to venerate the old gods as well as preparing the villages for the winter to come. After the fall harvest, each household is granted a number of bushels of the food grown, while a large portion of it is prepared and sealed in unadorned clay urns to be buried in the ground and kept in reserve for the cold, hungry months of winter. As well, the villagers bury the bodies of their young at this time: the stillborn and the infants who passed in the previous year, their bodies prepared and buried in urns painted black, offerings to the old gods. The old midwives of such communities often keep unruly children in line with tales of how the cries and tears caused by misbehaving children echo into the ground and cause the blackened urns to crack, prompting their buried occupants to crawl their way out to the surface and drag away bad little boys and girls. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "tX0QZ6hxn5byQ8lU","flags": {},"type": 0,"text": "Festival of the Sashes – to commemorate the purge of a despotic royal lineage centuries ago, when the ruling family was chased out of town by the commoners, their clothing stripped of their bodies as they ran through the streets. Groups and families prepare mannequins adorned with colorful sashes, each trying to make theirs the most elaborate and festive. The mannequins are then hoisted on poles and carried through the city. The groups race from Royal Plaza to the city gates. People line the streets and try to grab and tear handfuls of the sashes and ornamentation off as the mannequins pass. The atmosphere is very festive with public drunkenness and groups of young people chasing after the mannequins. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "w3A27rkciReJXKGQ","flags": {},"type": 0,"text": "Week of Rest – Neighbors take turns cooking meals for each other. Based on when a plague swept through the town and some got better while others got sick. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "zIHkuh1NzMomq7JJ","flags": {},"type": 0,"text": "Monument Race Day – It is said that when a near by volcano erupted destroying the old town, after evacuating their families many of the villagers returned to move the stone monument from the old town center to the new town’s location. In honor of this deed, every year on the anniversary of the eruption, the townspeople form teams that carry replica monuments in a race from the site of the old village to the monuments’s current location. Afterwards the town celebrates by having lava soup (a spicy red tomato based soup), with monument shaped bread rolls. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "rZiZfK9rJVtXlE4s","flags": {},"type": 0,"text": "Lamentations of the Cinders – a somber day of reflection on the anniversary of the Great Fire that killed thousands. At third bell after noon, which is when the fire began, people begin silently filing from their homes. Everyone covers their faces with soot and ash. Particularly devout people or older folk who lost everything in the fire may go completely naked and cover their whole body in soot. Citizens keep their faces downcast as they slowly walk a circuit around the neighborhoods that were most affected. A bell tolls every minute for the lives that were lost. At sundown everyone quietly returns home. Recently people have begun to include a great feast of preserved foods, like jerky, salted fish, and dried fruit afterwards. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "0ZMuKNUZjKfP6hf3","flags": {},"type": 0,"text": "Last Tidings – It is said there once was a witchy lass who fell in love with a sailor. He went to sea and for twentyfive years she would wait for him at the sea cliff until the last tide went out at dusk. On the final night of her vigil on the last outgoing tide of the year she received word that her lover had perished. She cursed and vowed to the heavens that nobody would ever have to suffer and wait as long as she did for closure. She performed some unknown ritual and ever since that night, on the last out going tide of the last day of the year, anybody who whispers the name of a loved one on the seaside cliff will either hear the name returned meaning they were still alive or hear the cry of an albatross and know them perished. Two night long festivals have arisen one mourning the other joyous as lovers learn the truth. It is no coincidence that many of the single participants find comfort and more in each other’s company. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "m12DxdOFrULrCFyV","flags": {},"type": 0,"text": "Wall of Melons – A hundred years ago the city was under siege. The invaders climbed a wall to get inside only to be rebuffed by peasants who tore down their own homes to toss rocks down on the climbers. The day is celebrated by a committee selecting a portion of wall up witch a the town’s young men try to clamber. At top are an equal bumber of lasses armed with melons both ripe and rotten. It isbl traditional for the first climber up to ask for and be given the hand in marriage of his choice. The climbers are protected by feather fall spells and blanket carrying elders. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "WHY0lkWgr2KJhpPE","flags": {},"type": 0,"text": "Sweet Night – The orchids of fruit trees in the town’s fields are pollinated by bats from a local cave. This wasn’t known until a hundred years ago when a vampire ravaged the country side. It was tracked back to the cave and burned out, scattering the bats as well. The next years harvests were bad until a traveling holy man told the villagers they must lure the vats back. This was done by pouring syrup and other sweets out on a long path from orchards to cave. It worked and has become an annual event to remind and thank the bats. The sweets used have become candies for children and alcohol for adults. It starts with a barnfire at dusk and culminates in a long hike to the cave. Dancing and costume wearing is common as well as many bat theme toys and souvenirs. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "PEYH5LJxKxZZaUs5","flags": {},"type": 0,"text": "War of the Monsters – An Olympic sports like event with many different athletic competitions and games. The main event is a destruction derby style event where groups make “monster wagons”. Essentially people driven/powered wagons/carts that are made to look like monsters of the world (dragons, dire animals, beholders, etc). The goal is just to disable the opponents wagons, not hurt the drivers. Last monster wagon still able to roll wins. History harkens back to a day many many years, when several large wild monsters wandered into town at the same time. They ended up fighting each other rather then attacking the people, in a territorial dispute. This gave the civilians time to evacuate and adventurers time to gain control of the situation. Contradictory stories developed how one monster (it’s always a different one, since no one agrees which it was) was actually there to save the City from the other monsters. As several monsters actually escaped, this “hero” monster is said to still be out there guarding the city. People in the city are split into groups by what monster they believe is their guardian. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "26ztuWynYAfsr2wb","flags": {},"type": 0,"text": "Day of stillness – No-one goes outside or opens doors for 3 days. Very worrying to newcomers to the huge city. It is surreal to see a giant city completely still and silent. Almost no lights and no answers. In remembrance in how they barely escaped the plague by not greeting any infected during those trying times. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "taJLOclPJucsNrDy","flags": {},"type": 0,"text": "Day of the Hawk – Adepts at the shortbow and longbow compete in a test of skill and accuracy (ex. piercing a thrown copper penny-sized item in the center), hitting fast moving targets from horseback. Gnome artificers, smiths, and other weapons craftsmen travel to the city from far and wide to tout their new inventions and wares. The festival began when the city was a small village and those who came of age had to prove their proficiency with the weapon as part of demonstrating their skills in order to successfully hunt and defend the community. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "DLv3P2Ik92Jp7OGX","flags": {},"type": 0,"text": "The Day of Ribbons – An annual occasion where beautiful ribbons are tied to posts all over town. When asked why, people only give a somber look. Nobody speaks about it, giving the impression that it’s disrespectful and insulting to do so. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "KqOUi9WAWjzDoLyp","flags": {},"type": 0,"text": "The Night of Burning – In memory of the defeat of an ancient black dragon that had kept them in slavery, this town has an annual tradition where they kill, cook, and eat a juvenile black dragon. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "9L15l2d6XVvFW2Pu","flags": {},"type": 0,"text": "Orctoberfest – A yearly weeklong celebration commemorating the defeat of a massive army of orcs that had once besieged the city. Lots of drinking of fermented beverages, dancing, and general public revelry. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "SdHVBIGtJABL6vjt","flags": {},"type": 0,"text": "Market’s Day – A day of great deals and bargains from merchants and vendors. It marks the beginning of the new market year and celebrates when the open trading and selling of dwarven and elvish wares to humans was legalized throughout the land. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "QgzlRErnV3gp25zh","flags": {},"type": 0,"text": "Candlenights – A night when the entire city holds a candlelight vigil until the dead of night, and then exchanging gifts and celebrating with a feast. Groups of families and neighbors stand around the city in patches, while holding their candles up high. This commemorates the time when a group of adventurers killed a nest of gold dragons, relieving many of the farmers of the fear of being killed and their crops burned. The adventurers brought back the dragon’s hoard to share with the town, but because of a raging blizzard, had to be guided in by groupings of torches.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "KGAdHZ7g1CZrnbrL","flags": {},"type": 0,"text": "Day of Snakes – a day literally celebrating the existence of snakes. Vendors sell all kinds of snake-related items, restaurants serve dishes with a bit of snake flair added on, and people release their pet snakes all around town. This goes far back to when there was a large rat pestilence in the town, and it looked like it would never get better until a random snake merchant came to town and offered to begin breeding snakes for them in order to control the population. Disease rates fell, overall cleanliness increased, and the town felt better overall after the rats were driven down to a dwindle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "aA38oP73yH7IfXYU","flags": {},"type": 0,"text": "Propitiation of the Twins – around twenty years ago a pair of shooting stars appeared in the night sky. Soothsayers and astrologers predicted that this would usher in a new age of prosperity. People began leaving offerings in public squares to entice “the Twins” to bless their household. Now, every year on the anniversary, people have continued the tradition by lighting two candles and leaving a small bread cake in a public area at dusk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "lrbSoqUIZrohQczt","flags": {},"type": 0,"text": "Boulder Pushing Day – On this day every year, the town splits into 2 teams (east and west). Using the whole town as a playing field, they attempt to push a boulder sized ball (many years ago they realized that a real boulder caused too much damage to the town)towards the opposite side of town. The winning team must push the ball into the outskirts of the town on the opposing side. It’s a friendly competition akin to a high school sports rivalry. Those who cheat or intentionally hurt others are looked down upon by their peers. The town sits in a u shaped valley that they say the gods carved out by rolling a marble on flat land. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "DnnHvK2RghRhUdlK","flags": {},"type": 0,"text": "The day of Ashes – more of a ritual than a actual holiday. At this specific day of the year, the towns women get dressed in white and their faces are covered behind a veil. They roam the streets in packs singing and dancing, while the men, all dressed in black, try to coerce the women into having intercourse. Women are treated like goddesses, gifts are given to them and they have free choice of taking or refusing a partner. Each woman has a pot filled with ashes with her. After they have found and bedded their man of choice, they empty their pot onto his clothes, so the other women know not to touch them. This tradition comes from ancient times, when after a volcanic eruption the lands were covered with ashes and many people were killed by the initial eruption or starved to death in the aftermath of the event. To ensure the survival of the ancient tribes in this region, the council of all tribes instated the law of reproduction. What the town celebrates today is the day for the gods and the women, who ensure the succession of their lineage. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "yDLYQygNL1pzCRXX","flags": {},"type": 0,"text": "Festival of the Drink – Long long ago, a small group of dwarfs set out into the wilderness to establish a new outpost for the glory of their empire. When they finally settled down, they were quickly able to establish a secure outpost with plenty of food, but soon they realized they were missing one of the most important supplies of all. Alcohol. Without this necessity, order soon began unraveling in the fledgling outpost, until the lone brewer was forced to improvised. Facing no other choice, she ordered everybody to gather as much of any kind of fruit that they could find. Once the gathering was complete, she worked tirelessly for a week straight to make alcohol out of anything the other dwarfs had brought, churning out such strange brews such as cherry wine and plum cider. At the end of this massive burst of brewing brilliance, the anxiously waiting dwarfs were finally rewarded with the finest tasting drink they had ever tasted in their life. In remembrance, the now flourishing Dwarven outpost celebrates this event in it’s history by holding a festival every year where brewers compete to create the best brew possible from the local fruit chosen for that year. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "UH5zrVJBx7xyLfeV","flags": {},"type": 0,"text": "The Sun God Observation Day – On this day all the village observers the sun god. I.e. stare at the sun as long as possible. The people at the village do this because an old witch told them that it would prevent them from seeing the destruction of the village. Since everyone is mostly blind her prophecy seems to have come true. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "wYjbGxViMCtDXZYZ","flags": {},"type": 0,"text": "Wishmore Night – The city holds a festival at the docks, all walks of life are included and encouraged to mingle with each other. Everyone, either individually or in groups create floating wreaths in whatever way they want to present it. At midnight when the water is still, the leader of the city will wade out into the water and release their wreath first, as an offering to the gods. Everyone in turn will release theirs following the leadership, before returning to the festivities which will often go long into the next night. This celebration is to thank the gods for a bountiful year, or even a year of character building (in case of hard times). It is to mourn those lost in the Shipping routes and to pray for the safe return of others. If the water isn’t disturbed except for the wreaths, it is fabled to be a year of easy storms for the sailors. It is also of note that these wreaths never ever turn up anywhere else in the world. They disappear completely.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "A03z1Hy1UoYnHZUd","flags": {},"type": 0,"text": "Celebration of Destruction – The Nine Hells love the awakening of the tarrasque so much that they make it a festivity. The celebration comprises of feasting upon whatever the titan destroyed and watching it as it rampages through entire cities, leaving nothing but rubble and dead life of all varieties in its wake. After the gargantuan beast falls asleep once again, all of devil kind praise the strength and ferocity of the powerful tarrasque. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "ninaxcY8Sp69vBNJ","flags": {},"type": 0,"text": "Ale Day – A dwarven celebration that simply commemorates the invention of their favorite drink. It quickly spread to many other humanoid peoples. Dwarves and satyrs love it the most. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "gPjhdcAVAE2ghDcQ","flags": {},"type": 0,"text": "Owlbear Memorial Day – Elven cities that use owlbears as defense use this day to give thanks to the beasts that have protected their land for decades, sometimes centuries. The whole town offers food of all kinds for the creatures below. It’s very easy to argue that the owlbears enjoy this day more than the elves above ever could. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "j1WV3mdzD6M9gg8d","flags": {},"type": 0,"text": "Festival of Life – A celebration of the Upper Planes where the denizens of the heavens celebrate the good in every creature of the Material Plane. Commonly occurs when large amounts of good, neutral, or unaligned creatures are born. This involves animals and humanoids alike. A huge feast is held with some of the most delicious food in existence. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "YdK7kMcbOcUpSZmM","flags": {},"type": 0,"text": "Day of the Arts – An elven celebration where every form of art is honored. For months before this day, humanoids all across the Material Plane prepare songs, plays, dances, paintings, sculptures, and many other forms of art. A favorite day for many satyrs, with many placing it right behind Ale Day in their lists. Bards of many peoples are particularly fond of this festival. Silver dragons also love to celebrate alongside the humanoids that have arrived. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "CBpuVdlWPGEr9qb6","flags": {},"type": 0,"text": "Beholder Day – A holiday invented by beholders to celebrate themselves. They give themselves presents, and demand that their servants get them presents or they die. If a cult has decided to worship the floating aberration, the beholder will only have to remind its worshipers once and it has a myriad of presents coming its way. Unlike normal holidays that occur annually, Beholder Day happens once every week. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "ghZp5PJ6oafQYvwk","flags": {},"type": 0,"text": "Cliffton Day – Cliffton was a local legend who long ago had defeated a demon water elemental which came upon the small fishing village of Mistwood. They celebrate his triumph every year with contests which correlate to what traits he was known for. Whoever wins any of the contests then participates in a final contest, the winner of which is given the title of “Aspect of Cliffton,” and is then invited to participate in a ceremonial recreation of the famous battle. They are given a costume and Cliffton’s old ax and told to strike down an effigy – a standing effigy of the demon is already in center of town, but underneath the rags which make up the costume is a bound man, the village drunk, being put to death without knowledge of the adventurers. Maybe now that the adventurer is close to the figure, they can hear strained breathing amidst the cheers and song of the villagers. If they refuse to complete the ceremony, the same water demon who attacked the town years ago rises from the nearby lake and threatens to destroy the town once again. As it turns out, the killing of a man in the ritually-prepared town square once a year is part of a ritual that keeps the demon at bay. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "FlLGdvmgY3p83FQA","flags": {},"type": 0,"text": "The Betrothment Battle – Every year on the first weekend after the Summer solstice, the town plays host to a wrestling tournament and exhibition. Hand to hand fighters from across the realm come to the town to prove their mettle, and rings are prepared for non-tournament participants to settle small arguments that have built up over the year. Named for a famous fight in the town at the wedding of the Mayor’s son and one of the prominent merchant’s daughters that saw the merchant, the mayor and most of their families tear apart the public house, the tavern, and a stable in an hours long fight. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "YCu4WkKaqkwCFAqG","flags": {},"type": 0,"text": "The Wardens Gauntlet – In the spring the city’s best and brightest face each other in a series of physical and mental challenges. Some are complex rituals, puzzles and riddles testing mind and spirit. Others are tests of endurance, agility, and strength. Betting and boasts are a much enjoyed portion and the contests themselves are openly viewed by the public to cheer on their favorites. The top three are given the honorary title of Warden followed by celebration where the previous Wardens hand off the mantle to any new Wardens or retain their station from the previous year. These Wardens represent the common people in matters of ceremony and any concerns or grievances to the Crown and city councils until the next years contest. Being a warden is often the path to guild leaderships or council seats and even titles from the crown. The history behind the trials and celebrations is vaguely remembered from the time of city states when open warfare was avoided by settling issues between the Wardens of each city state. There was also a darker reason for the intricate rituals and ceremony. Now considered just a spiritual and mental exercise, they serve an unknown purpose strengthening ancient Runes and Spells against something truly horrific that is ever vigilant and hungry. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "F4iaV6m3Sq3mpHKN","flags": {},"type": 0,"text": "Stabbing Day – Using fake daggers the populace honors the day a group of rouges saved the city from a dragon attack. It’s exactly what you think, expect red dye stains. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "bLIBlLqszPelBFVr","flags": {},"type": 0,"text": "Rom’Chuk – Local barbarian tribes meet together in an unfortunate city and hold a Dwarf tossing contest. Use of Gnomes with fake beards is extremely frowned upon. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "z6KWOmOacmuxyhFu","flags": {},"type": 0,"text": "Siggi’s Birthday – A great shield maiden gave her life to save the city. Women can let anyone they are sweet on know by picking them up over their shoulders and hauling them off. Siggi wasn’t known for her subtlety. Rooms at the Inn are free in her honor. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "oxMQYcK7idjK0Ofg","flags": {},"type": 0,"text": "The Games – A week of festivities that include games of all types under the sun; from dexterity-tests like obstacle courses, to strength competitions such as log-tossing, and even an academia note to it, like a spellcaster’s competition. This week of fun was created some time ago when a tyrant ran the city with an iron fist. Once a year he would force his supplicants to participate in crazy games which usually ended in their death. Once he was overthrown, the citizens opted to keep the week of festivities, whilst removing the “death” part. It helped the community grow closer, keeping those with terrible ambitions out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "u8tIUo5JPH3mLwzT","flags": {},"type": 0,"text": "The Pilgrimage – A day when every person in the city is expected to “carry their weight” and bring their greatest distress out in the open, so that their neighbors, friends and community may support them in earnest. Those who refuse to participate are exiled from the community until they complete a pilgrimage to the neighboring continent and bring back something that will actively make their community better; be it money, food, or magical wards. This is a practice from when the city was still just a fledgling town and every person needed to pull their own weight, and everyone relied on everyone else to support each other.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "RmLeNrpBAJoT2aGt","flags": {},"type": 0,"text": "Lottery Day – A crop fertility ritual where outsiders are encouraged to attend. Eventually someone is picked at sundown and stoned to death by the crowd. Do not take the raffle tickets they offer…but there are prizes afterwards. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "cjoESLvyBnWMUWcj","flags": {},"type": 0,"text": "Day of the Horn – the ceremony draws in tieflings like moths to a flame. Almost hypnotized by the low droll of an ancient obsidian tiefling skull horn being played amongst the music. Dusk brings the climax of the festival where all the spirits of an ancient battle posses the revelers and show them an ancient battle where a contingent of tieflings rebelled against their fiend masters and joined with the townsfolk to drive the demons back to Hell. The leader selflessly gave her life to save her comrades and new friends by blowing a smoldering hole through the chests of no more than 15 fiends…leaving just her skull. “We Remember” is the mantra and afterwards the tieflings are thanked and cared for with the thought “We can be more than the sum of our parts”. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "maSGXTwtjfndfRDH","flags": {},"type": 0,"text": "Madel’s Star Day – A meteorite fell to form a crater where a town eventually sprang up. The 5 meter rock absorbs all hostile magic and steals any illusions. The soothing rhythmic glow is amazing to behold. Only a handful of elders have metal bracelets fashioned from the meteorite that allows them to cast spells in town. Only one new one is awarded every century. In town it allows for casting of spells, outside of town it has a chance to absorb a hostile one (even your own). The properties of the stone also royally mess with any Warforged that come into contact with it. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "iJZThQYItPD7WzBO","flags": {},"type": 0,"text": "Grey Snow Day – A volcanic instability in the area uncovered a ruined fiend city. Excavations uncovered ancient masks that the party goers wear. The volatile nature of the masks grant a limited form of fire manipulation after sun down. The party notices that a vague form of possession is slowly corrupting the crowd every year. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "DGAAfnIwdxJXK77x","flags": {},"type": 0,"text": "Fomarath Day – Laurel and oak wreaths are adorned and offerings prepared for the four treefolk guardians in a nearby permanent druid grove. A group of Hill Giants were about to lay waste to a group of farmers when a druid and his party drove them off. The druid stayed behind for a year to make sure the spell would stick. The treefolk actually love the townsfolk and have attracted other peaceful sentient plants. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "myMpaeHzYd5qJ10T","flags": {},"type": 0,"text": "Craghoof Moot – A nomadic band of centaurs and a nearby halfling settlement have a very intertwined history of one ancestor saving another or one group saving the other from invasion. The most noble thing a member could do is swear an oath to one another to ride together for a year and a day protecting the territory. The amount of high grade alcohol and mead available is mind boggling. Watching halflings in war paint and centaurs in straw hats and vests is quite hilarious. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "xtKHnd9eWOj57jrW","flags": {},"type": 0,"text": "The Druid Chain festival – As a last ditch protection against incursions into this dimension three druids, twelve elementals, and three dragons can unite and merge for a primordial ritual called a Gaia Chain to drag whatever horror that threatens all existence into the maw of the planet itself trapping it within the molten core for all eternity. It kills all those involved and as such the three temple locations became holy places to all forms of life. It is the raw elemental fury and power of the first ones that saved the world are remembered in giant soul crystals that once a year show the images of these lost heroes. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "BqWxbFXlYs0GNPsr","flags": {},"type": 0,"text": "Broken Toy Day – Warforged holiday marking their Independence. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "MmYbYoUZqCQVtNwq","flags": {},"type": 0,"text": "The Anniversary of The Great Mayhem – Recalls the day tribe of barbarians, orcs, and goblins laid absolute waste to a city of necromancers, warlocks, and wizards. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "FiUhEQiHjek4FfIS","flags": {},"type": 0,"text": "Eeling – every autumn as the eel population in the local reservoir grows too great, the Swanmay invite the local village to come and collect as many as they can stock for the year. While fresh eel is on the menu, the festival itself is a community occupation, jarring eels, processing oil from them and otherwise making sure that what they want will keep until next year. Large communal tables are set up in the town square and the locals gather early to get a place at the centre most tables where gossip and ale flow strongest. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "JHQ9WA5J8IodQR00","flags": {},"type": 0,"text": "Digging High – At summer solstice the various dwarven families of the area come to The Kin Hole, where they will mine as one for the three days of the festival. The hole itself is barren of valuable minerals, but the myth that the families’ ancestors divined great wealth for all dwarven kind at its completion still exists. While much merriment is made by the dwarves, the presence of outsiders is an immediate dampener. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "32AF0ncpw76uO2NL","flags": {},"type": 0,"text": "Gluttony – though not a festival per se, the first two months of the year are always eagerly anticipated by the hobbi… the halflingses of Portree. The tradition of the wealthier houses organising lavish bashes during the time as a means of canvassing has replaced a very loose sense of meritocratic governance with a very enthusiastic intoxicracy. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "t6zLylYJeapXfs6o","flags": {},"type": 0,"text": "The Quiet – in the old days, the village of Pertiv was in a most precarious position. Early settlers had grouped to farm an area which they only later realised was threatened by orcs, owlbears and darker things from below. While everyone celebrates the heroes who saved the village all those years ago rambunctiously in Spring, in late autumn the people remember the early days of fear and salvation by drinking heavily together in silence. Any but the most necessary and cursory communication is looked down on, and there are those in the village old enough to remember those times from their childhood. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "6OgPsIkZgmWvim8E","flags": {},"type": 0,"text": "Fyre – The burning of the Winter Witch. They say that the Winter Witch (who is the spirit of winter) is dull and dreary, but can be driven away with humor and merriment. Villagers celebrate by erecting bonfires and once the sun touches the horizon they are set alight. They drink mulled wine, play games in the snow and sing crude songs to drive the Winter Witch away. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "0XW5yybO1taGYQcK","flags": {},"type": 0,"text": "Grimm – Orcish first blood ritual. An orc is a child until they are blooded, among the more civilized tribes of orcs this takes place in a festival called Grimm. Those deemed worthy or are brazen enough to try form a Wog or raiding party then a suitable target is chosen usually small Kobold warren or goblin outpost. All participants must bring back a heart for Grummush (their god) and a head to prove their prowess. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "6AehIxdVqEqTCsOv","flags": {},"type": 0,"text": "Spring Break Wizard Demolition Derby – A popular beachside town is inundated by hundreds to thousands of student and apprentice wizards from several large nearby schools out on holiday break. The wizards inevitably form carousing groups, get absolutely sloshed, and then try to show off their spells to intimidate rival schools, impress potential dates, or simply cause chaos. In order to keep the wizards out of town proper and redirect the damage, the town sets up beer gardens, bathrooms, dirt cheap “inns”, and other sacrificial establishments on the beach. The student wizards naturally make it their goal to destroy absolutely every temporary structure they can, culminating in a massive destruction derby on the final night. Meanwhile, the city residents cower and hope the dispatched army can keep them from invading and burning down the town, again. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "AELkMiwzhhVDktX9","flags": {},"type": 0,"text": "Spring Break Playwright Championship – A popular beachside town is inundated by hundreds to thousands of student and apprentice bards from several large nearby schools out on holiday break. The bards inevitably form carousing groups, get absolutely sloshed, and then try to outdo the acts of rival schools, impress potential dates, or simply make a name for themselves. In order capitalize on their creative output and increase tourism, the town builds temporary theaters on the beach. The student bards naturally make it their goal to claim the most audience. Students create original productions in several different categories, marching band, full orchestra, historical drama, tragic opera, comedy musical, dance, etc. and debut them head to head against rival groups from all the different schools. The one who captures the most audience wins. On the final night, all the student bards join together for an all night jam session. The city residents who aren’t spectating are out cold after over-drinking during productions. (Free alcohol is often used to bait audience members.) ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "BMPPK7CVZUin2XFq","flags": {},"type": 0,"text": "Spring Break Ascetic Training Festival – A popular mountain town is inundated by hundreds of student and apprentice monks who jogged hundreds of miles to sit under cold waterfalls made of fresh snowmelt. The monks tend to be fairly orderly since this location is a prime spot to focus one’s ki and discover new techniques. Some waterfalls have better reputations than others, so the student monks will challenge each other for superior meditation spots. The poor fasting students monks tend not to bring much revenue, but tourists who want to watch them fight do. The town constructs several “arenas” sculpted from natural materials with silenced stands so the monks are not disturbed in their combat or meditation. The town hosts a streetside festival with many booths on the final day with rich foods for the starving monks and tourists to enjoy. Some more enterprising monks also do demonstrations or offer basic self-defense classes to tourists. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "p7vua6voIijSBiC3","flags": {},"type": 0,"text": "The Bathing – Held at the height of summer. A highly respected priest started this tradition many years ago for those who could not afford to enter the elitist bath-houses. Townspeople gather at the calmest part of a great river just outside of town and bath naked. Considered a family friendly event, those who attend forgo their qualms about nudity and know that all are equal in the eyes of the constantly moving water. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "Ut5cxVb0KRw5D7mq","flags": {},"type": 0,"text": "Lock Day – A small town dug up a mountain 90 years ago to make room for a new city hall, but ended up finding a black safe with an unbreakable lock. It can’t be moved or destroyed by any means (even a disintegration spell). Every year, they have a big festival where people try to open the lock. Everyone expects them to fail, but it’s the fun in trying. They amp them up too; an announcer holler their praises…”weighing in a 220 pounds, the scourge of Neverwinter, the axe-wielding monster, [barbaian character name]. But there’s drinking, dancing, a ceremony from the town’s Cleric, trading, cookies and cakes for sale. It’s a wonderful good time. Then…one day…the safe opens by itself. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "IJ2ZcjxPOd4xn4OR","flags": {},"type": 0,"text": "Independence Day – celebrating independence from a former ruling nation. Tons of drinking and local food that other nations think you always eat, but you really don’t eat as much of it as they think. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "r7PHkMpY99apCkIk","flags": {},"type": 0,"text": "Celebration of Armistice – Once a year, the ambassadors of every major city in the neighboring continents bring gifts to all the smaller hamlets and towns around the land. Gifts include anything from supplemental food to last for a long winter, new technologies, mages looking to relocate and can lend a hand to smaller communities… This tradition goes back some centuries, long enough that even few elves remember the origins. Legend says that a great tyrant sought to control the lands around, and a massive war raged for a long time. Eventually the tyrant was assassinated from the inside of his court, and his officers extended an olive branch to the peoples around, before disappearing themselves.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "UdsB67LOo8JgUbgB","flags": {},"type": 0,"text": "Festival of Limitless Water – A yearly celebration in town, where townsfolk race boats, swim, drink locally brew beer and feast on roasted fish. A reminder to appreciate the gifts the waters bring them, and to remember the year a storm tore through the town, destroying most of the crops and buildngs. The boat race is a recreation of the villagers urgent travel seeking aid. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "puCPqzB67Md9AXql","flags": {},"type": 0,"text": "Leatah’s Warming – the town celebrates the anniversary of their religious rebith to the forest spirit Leatah, who accepted the hospitality of the town many years ago. They believe her to be the cause of their town’s good fortune. On those rare occassions she still visits, she assumes that they treat every visiting spirit the same. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "9gjZO6SZaq0LhlJK","flags": {},"type": 0,"text": "Zarantyr – The Zarantyr Drumming Festival – Focus is on drumming and singing. This harkens back to the community’s roots as a marching war band, before they settled in and created their own kingdom. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "oZjNlJXIZeF7P6vk","flags": {},"type": 0,"text": "Olarune – The Rough and Tumble Games – Personal combat and feats of strength. A good old fashioned brawl designed to allow aggressive supplicants to get out their aggressions with one another, ensuring that there can be a peaceful year within the city. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "rTvRfDDtMiPtDpV9","flags": {},"type": 0,"text": "Therendor – The Festival Restorative – Focus is on healing, health, love and renewed. Held by the House Jorasco. When a war raged nearby and people from all sides wandered in, hurting, House Jorasco responded by creating a safe haven for anyone injured, while nearby clerics or apothecaries would come in and provide rejuvenation to those hurt. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "EglTv8cwmZTGvv3w","flags": {},"type": 0,"text": "Eyre – The Thing Extraordinary Crafter’s Show – Focus is on crafting. Held at the western caravan junction. This was set up to commemorate the sudden and mysterious disappearance of a local nomadic people, who would always stop here and hold an exposition for their greatest craftsmen. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "jFfF9n8LEifRkPHx","flags": {},"type": 0,"text": "Dravago – The Dravago Stock Fair – Contests of halfling and their mounts. A large community of halflings decided they wanted to play a larger part in their community, so they created this fair in order to raise funds for the city. It turned out to be a hit, and the halflings have been heralded as heroes to their city from that point onward. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "brxftIDj96x82Bhw","flags": {},"type": 0,"text": "Nymm – The Grand Cookoff – Contests of the best food and drink. It’s held in Gatherhold by the House Ghallanda. The roots here go back a very long time to when the local Patriarch would force his cooks to eat their dish in front of him, to ensure that it was not poisoned. Long after he died, the tradition was carried on, but without the terrible connotations. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "qNYzCigHsE99NRU9","flags": {},"type": 0,"text": "Lharvion – The Costumed Carnival – Everyone is in costume and there are costume games. From a rather scary time in the city when it was invaded by an outsider army, and everyone had to be as resourceful as they could with making disguises to fit with the plethora of monsters that the outsider’s army used. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "tjWoGoXXkmJCACyP","flags": {},"type": 0,"text": "Barrakas – The Hide and Seek Fair – Games of hide and seek, scavenger hunts, treasure maps. Goes back a ways to a deadly cartel that used to torment the people of the city, demanding that they follow maps to find these “treasures” that usually lead to many people missing or dead. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "UNItMFeaLcdWMeSa","flags": {},"type": 0,"text": "Rhaan – The Festival of Letters – A grand book and scroll fair where the halfings get together and have contests of words. It is an homage to the Renaissance of prose int he land, where it is legend that all of the world’s greatest writers were suddenly struck with inspiration. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "nOOBKPFggl3QJJfq","flags": {},"type": 0,"text": "Sypheros – Paint and Lantern Festival – The cultural event of contests of plays, and light and illusions. This has become tradition from long ago, before written history was a thing. All history was passed down via stories, or even play-like things being acted out. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "6NZpvoj4BAa3Auz4","flags": {},"type": 0,"text": "Aryth – The Great Headstrong Races, this is a time of personal speed races; foot races, climb races, mud tobogganing, etc. A festival honoring the legend of Aryth, who is known as the fastest creature to live. Aryth ran a very long distance in order to warn the city of an approaching army, and the entire town survived because of it. They say that he ran so fast, that his soul ran right out of his body, because he died shortly after delivering the warning. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "Fm7fX8jJKapbxIvK","flags": {},"type": 0,"text": "Vult – The Rogues Escapade. A fair about getting into and out of trouble. Teams devise cunning traps that the other team must escape from, then they switch. This stems from when the forefathers of the community all organized an incredible jail-break to escape from a tyrannical leader and set up their own independent state. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "F7dCuWQHnY9DlFQm","flags": {},"type": 0,"text": "Fields of Cabbage Festival – Heads of cabbage are provided to all attendants, wherein they must begin to eat the cabbage. Attractions there include all kinds of ways to prepare cabbage, giant cabbages that have been hollowed out, cabbage stories, cabbage planting seminars. The person who eats their head of cabbage is declared the winner, and the winner must dictate when and where the next festival will take place. This strange celebration goes far back to when the only thing that a nomadic tribe of people had left to eat was cabbage, and some people went insane because of it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "XxP51AQvcyo8ro7x","flags": {},"type": 0,"text": "Day of the Siren – Quite unnerving for a first time traveler to witness. About 1/3 of the city’s population will meet in the square every 3-4 hours during daylight, and only once after nightfall. They will scream, shriek, wail, shout, or otherwise make vocal noise at the highest possible volume. This came about as a defense from a siren who once lured too many of the city’s capable workers during a particularly hard summer. The shrieking was designed to scare off the siren as her song was sung, and after it was confirmed she had died, the city kept it up as a final insult to the dead fey.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "TOa8uKTlbaMBSrxn","flags": {},"type": 0,"text": "Founder’s Blessings – A day when the local clerics hold a vigil in the streets, doling out blessings or healing as needed. Anyone is welcome, but in order to receive such a gift, one must recite the names of the city’s founders. This was made a way to keep the legacy of the four sisters who founded the city alive and well, and to make sure that the community always had a way to remain healthy.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "uKAGijlSLUOkaYTm","flags": {},"type": 0,"text": "Bride’s day – Commemorating the beginning of summer, all the new brides dance with the unmarried women, to imbue to them their own marital fortunes. The dance takes place in the kings courtyard and no males are allowed in. At the end the queen usually tries to set up an unwed dancer with a royal family member. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "YKRNA3FZ67yAqWLM","flags": {},"type": 0,"text": "Maiden’s Night – a night when all unwed virgin girls/women gather with their fathers for a Father/Daughter dance, where the girls will pledge to remain abstinent until they wed. This became tradition after some time ago when an old drake demanded a dowry of virgin girls. The town was once burned down by the drake after it found out that the townfolk had lied about some of the girls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "RhsCA9Xb7DxcMQuq","flags": {},"type": 0,"text": "A Dog’s Day – a day when all collected dogs in various animal control facilities are released. This came about after a group of druids wildshaped as direwolves saved the mayor of the city from a painful death. Before leaving, the “direwolves” told him to make sure every dog has it’s day.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "QefnPAodgp9EkjHN","flags": {},"type": 0,"text": "The Number Crunch – A day when all master ciphers and code breakers have a competition for the favor of being security consultant for major companies. Stemming back years before when the city was settled by a multitude of competing kingdoms, and the entire populace was convinced that everyone else was a spy, while also trying to convince everyone that they were not.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "HmMsu34cFZTm1BBC","flags": {},"type": 0,"text": "Day of the Shouting Stone – local barbarians meet up to scream at a large boulder on the edge of town. In barbarian lore, it is fabled that this stone was one a powerful barbarian who shouted at another, larger boulder until it split in two, and he was then transformed into a boulder himself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "B2oh8FqNaSWx4UCK","flags": {},"type": 0,"text": "Anthem – the proud holiday of the city where a multitude of people gather drunkenly in the streets to sing bawdy songs loudly and obnoxiously. Anyone who asks them to keep quiet is met with a barrage of rotten fruits and/or vegetables. This comes from a long time of religious oppression brought by a cadre of evil paladins. The singing was the first act of rebellion, and the rotten fruits signify when the city folk began attacking to drive them out.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "lbf1azvDeQR7XSG0","flags": {},"type": 0,"text": "Sturgeon’s Wish – people catch wild sturgeon in the nearby river, put them in portable tanks and spend the day feeding them all kinds of crap before sending them back off to the river. Lots of fish due this way. Origins are iffy, but there’s a legend about a giant talking fish that came out of the river and asked for food from the elders of the city.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "mT0GkZVd0Cpm2eIk","flags": {},"type": 0,"text": "Bargaining Day – A day when all villagers have a chance to ask their greater community to help them with something. The community can ask for something in return, or nothing at all. No guarantee of a request being honored, even with payment given. This dates back to when the town used to have an elder dragon living beneath it. They would plead with the dragon for help, and it would make requests of them, sometimes with a promise to honor their plea, but often ignoring them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "xl8b7Zxn0V9DGG1F","flags": {},"type": 0,"text": "The Rain Run – One the day of the first rain after the summer months, the entire town gathers on the outskirts and has a race. Anyone who finishes in the top ten are exempt from the strenuous labors that come with damming up the rivers, or strengthening the embankments around the city to prevent mudslides. This promotes a lean and fit community.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false},{"_id": "khGLX5X2Ox9hAGIs","flags": {},"type": 0,"text": "Silence Peak – A day when no one in the city will utter a single word. All communications are done using basic sign language. Anyone who speaks is tied up in the middle of the town square for the remainder of the day. Going back to when a powerful and malevolent wizard ruled the region, using listening spells to seek out malcontents and squash rebellion before it began. Eventually people coordinated in silence, and he was over thrown.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [101, 101],"drawn": false}],"formula": "1d102","replacement": true,"displayRoll": true,"_id": "zZaIwvyXw7oZibfC"}
