{"name": "Deadly Traps","description": "Fifty-eight of the most deadly traps for your players to fall for!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "cFgwF6JoVyt3OCMt","flags": {},"type": 0,"text": "A pit trap opens up beneath a character. At the bottom of the bit they are falling into is a button that drops a stone block on top of them, covering the hole and smashing the character.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "5thFDZFLh8Ij9L0p","flags": {},"type": 0,"text": "A lever with a sign that says “Pull to open” next to a locked door with an extremely poorly hid trap door right under the entrance. Pulling the lever surprisingly opens the door. If you touch the door without pulling the lever, the trap door opens.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "M1aKmyRZ08C1iwAt","flags": {},"type": 0,"text": "A series of regal-looking interconnected hallways are dimly lit with magical torches suspended in sconces. The entrance that the intruders come through suddenly closes itself off, and the intruders sit in silence for a few seconds. Looking down one of the other hallways reveals a slowly encroaching patch of darkness that snuffs out the torches as it makes its way forward, which relight themselves when intruders approach them while the darkness is not nearby. The intruders must search the various corridors while simultaneously avoiding the patch of darkness, which envelops and leaves no trace of anything that enters it. Any attempts to do combat with the darkness prove ineffectual, as anything that enters vanishes, never to be seen again. The darkness is semi-sentient, and the intruders can interact with it by trying to hide from it or get it to follow them. The key to escaping the hallways lies with the magic torches in the two impressively decorated sconces that the darkness can’t seem to pass by. By removing one of the special torches and carrying it with them, an intruder can hold off the darkness or even push it back. However, confronting it for too long will begin to dim the torch until it eventually snuffs out, forcing the holder to escape the darkness in order for the torch to relight. When the special torches approach the darkness from both sides of a hallway, it condenses and eventually fades, leaving a shadowy door to the outside where the last of it vanished.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "9fB7HnWaoFZQfa2W","flags": {},"type": 0,"text": "A roughly cut gemstone hovers ominously over a crude alter in a cavernlike room while a malicious spirit floats up around the ceiling and out of sight. New entities entering the room causes the crystal turn to face the intruders, revealing that it is actually an eye of some sort, containing a pupil that darts rapidly between the intruders and the spirit. The spirit immediately begins cajoling the crystal eye into destroying the intruders, talking to it as though it were a child in need of guidance. After a few seconds of apparent listening, the eye completely focuses on the spirit and pillars of rock begin to rapidly erupt from the room’s surfaces at points near the intruders. The pillars, while initially inaccurate, begin homing in on the intruders more and more the longer they stay still, and do 5d10 bludgeoning damage on a hit. The key to escaping the room is the crystal eye in the center of the room, which is being told by the spirit to kill the intruders. By being more persuasive than the spirit, intruders can convince the eye to stop its onslaught and eventually target the spirit instead, which will disperse after being hit multiple times with pillars of rock. The eye is very childlike in its considerations and will lose focus if the intruders fail to convince it or begin to act too impatient. Simplistic approaches work well, and the eye responds positively to constructive encouragement when it targets the intruders (That was some very good aiming, I could feel the wind rush by me! Next time though, try to aim towards the mean spirit instead, OK?). Once the spirit is destroyed, a gentle suggestion that the eye create an exit will convince it to pull a slab of rock away from a wall and reveal a passage to outside the room.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "oYgckmyRmTsEFNF8","flags": {},"type": 0,"text": "Walking through an area with “Dormant hives of bees,” there is a queen bee figurine with a stinger shaped like a key in a glass jar at the opening of a room. The jar acts as a seal to keep the pheromones of the queen away from the rest of her hive. Once removed from the jar to unlock a mysterious key hole, the once dormant hives awaken to attack whomsoever holds “their queen.”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "8KdpcK6b0lrY0wEJ","flags": {},"type": 0,"text": "A nearly invisible gelatinous cube encloses an entire section of a hallway/corridor. Requires strong perception check to even see. Will immediately begin digesting any adventurers who walk into it, tinging the clear jelly a slight pink color.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "mt4Zwn2Bu6NqVBA3","flags": {},"type": 0,"text": "A hallway with what appear to be dart traps, or falling spike traps, or fire. There are several different hallways in a succession of 3 (so imagine three hallways one after the other with different traps, with a small room between each that could hold 4-6 people. Each hallway starts with 2 statues. The first hallway deactivates the traps by grasping one of the hands and turning it down. Once the next hallway both statues have hands that turn, and one activates the traps just cleared while the other deactivates the ones ahead (but both can’t happen so if the try to deactivate the traps ahead it will still be active). And finally the last hallway will deactivate the traps but the floor is pressure sensitive. Illustrate this by having the party see the hand start to turn back when a member starts to walk across. Essentially the first two hallways punish groups that don’t follow right behind the rogue and send him forward to handle traps, while the last hallway punishes players who just follow right behind the rogue, and are afraid to make any distance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "jcJTiYM2gvnJo1oo","flags": {},"type": 0,"text": "A map is found on a skeleton wrapped around an old skeleton key. The map shows traps, but all the information is either half right or all wrong. The key is able to open any door in the dungeon, but attracts any undead within 10 miles. Take a hint, maybe the dead guy with the map and key died for a reason.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "qemFgn16A5X7h8ew","flags": {},"type": 0,"text": "When trying to open a door they have to pass a DC x wisdom saving throw to open it. Otherwise they feel compelled to ‘open’ the next nearest thing. Causing them to attack the closest person for y rounds.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "bGE4Wge7Ckmqwtdg","flags": {},"type": 0,"text": "A secret door that leads into a closet-sized chamber whose walls and door are very thick. Detect magic will reveal a faint aura where the walls meet the ceiling. If any character steps entirely inside and the door is not blocked, the door will shut and meld into the stone of the wall. There is a barrier of inch-thick adamantium within the stone of the walls/floor/ceiling: this must be dealt with in addition to two feet of stone. The character inside the chamber will begin to suffocate after one hour and takes one level of exhaustion after each additional hour.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "RVRwdG9lAnyE9Juo","flags": {},"type": 0,"text": "Walking down a hallway, the party passes through a large set of wooden reinforced doors. Beyond these doors is another hallway about 50ft long. In this hallway, there are 10 large sets of full steel armor with varying weapons from daggers, long swords, flails, whips, mauls, glaives etc (all of which are very well made). They’re lined up along the walls of the hallway 5 on each side. If any of the armor or weapons are touched. Every single set of armor will come alive equipping the weapons they had, attacking the closest target immediately. The doors will also be slammed shut, slamming into anything in it’s way. The doors will only unlock if the sets of armor have been killed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "tsiTbmyENeMoxMGQ","flags": {},"type": 0,"text": "You enter a dungeon with an open pit in the middle of the floor, runes that you can’t decipher are around the hole. As you approach you can hear the cries of a small child, and when you look into the pit you can see a human child covered in dirty rags. You’re able to get the child out, but they say they can’t cross the runes and you’ll have to lift them up and over them. When you do, the child (vampire) tries to feed from you, dealing piercing damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "z7eZcEkOq8jKz425","flags": {},"type": 0,"text": "You come to the end of a hallway with three doors, each with a word in Common written on them. The first door has Community, the second door has Feast, and the third door has Companion. If you open the first door a swarm of cranium rats will descend upon you, alerting you to a mindflayers’ presence. If you open the second door three Spawn of Kyuss embrace you. If you open the third door, two Shadow Mastiffs lunge at you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "t3sCFoR4cdpnHhAa","flags": {},"type": 0,"text": "A trap that is very kobold related, but could work for other creatures is this… Walking along a cliff either in a mountain/volcano or on it, a party member hits a pressure pad beneath some rubble, or dirt (depends on the environment). A harpoon shoots out and gets the member in the leg. A kobold who was waiting kicks a weight attached to a chain out and it drags the member down the side of the cliff to about 20ft above the next level (assuming they don’t pass a strength check at disadvantage). The ambush comes and there are kobolds on the lower level trying to reach the member while the party is ambushed and distracted. They will have to decide who is saving their friend and who is fighting, while the member is dangling and until he gets himself right side up is at a disadvantage to all attacks. The weight unless removed from the chain is going to disadvantage his climb (and the pain from a hook in his leg will make the climb a bit more difficult too). For ideas on how the chain looks, think of a fishing hook with a weight on it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "UcjS700K0XanZuxg","flags": {},"type": 0,"text": "Two animate armors standing across from each other in a small room inviting the characters to play racquetball with a sphere of annihilation which the armor can catch.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "I4mKA8bHlXNwRMhZ","flags": {},"type": 0,"text": "A door that opens into a short hall, behind the door is a poorly hidden log tied to the ceiling, but opening the door didn’t cause it to swing, must be a dud. Touching the door on the other side causes the stone slab that was the floor to slide into the wall, causing the player to fall into a pit of brambles, and the false log trap detaches and falls on top of them. Can be solved by throwing a rock at the door on the other side, the log will fall and create a safe bridge across the brambles.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "Pas7pEni0J08xv0T","flags": {},"type": 0,"text": "A cannon with a spear inside, readilly aimed, capable of changing its target.  It has been set to trigger on any new magic being cast (If it was cast before entering its range then it won’t trigger it).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "jqH26elSFBLYhcby","flags": {},"type": 0,"text": "A pitfall trap drops the poor adventurer into a gelatinous cube. Said block of evil Jelly also has animated swords in it that will blend the adventurer. Alternatively, there’s a normal floor trap, but disabling it drops the cube full of swords onto the adventurer from the ceiling.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "EWwbNhRUMYqB5xi2","flags": {},"type": 0,"text": "A room with a large spiky chandelier covering pretty much the entire ceiling and nothing on the floor or walls. Once the trap is triggered, gravity inverts in the room, dropping the occupants up into the spike trap chandelier. Afterwards, gravity returns to normal and drops them back down the room into the ground, followed shortly thereafter by the Impaldelier.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "hVqlqFiJ6727srrn","flags": {},"type": 0,"text": "A large square room, a small maze-like pathway in between pressure plates is on the the floor and leads to the other size. If a pressure plate is stepped on, a giant cube slime falls from above filling the whole room. Players must take 1d4 acid damage every turn of the slime until they escape.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "t5i4uIBHln58MhmX","flags": {},"type": 0,"text": "In a narrow hallway, you have a part of the floor that folds down when to much weight is put on and springs back to its normal position once the weight has been dropped. This obviously leads to a pit, but in the pit is nothing. It simply drops you 50ft leaving you in like a 20ft square room that’s 50ft high.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "5QT1HT3tC05ek58j","flags": {},"type": 0,"text": "A long, narrow corridor that slants downward slightly. A large reservoir of quicksilver lies to your south. Outrun the stream to avoid getting impaled.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "rD2AEg3ZMD9Mka09","flags": {},"type": 0,"text": "A stairway that has a closing metal door at the top and bottom. The top door is a false door and behind it lies a natural flow of lava. When the top 3 stairs detect any pressure, the top door has panels that open and let in the lava. The bottom door is locked, and panels in the floor at the bottom of the stairs open only after the entire hallway has filled with lava and the top door panels close again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "GgHoH3Q3wXkAuXp0","flags": {},"type": 0,"text": "A well with a rope or chain that hangs to the bottom. There is a grate about 100′ down that goes nowhere. The walls of the well have small holes all along its length, possibly from climbing pitons. Once a certain amount of weight is applied to the rope (equivalent to two or three party members) a gelatinous cube is poured from its cell behind the stones in the wall, and seeps through the walls into the well above the players. The gelatinous cube paralyzes creatures when they touch it and fail a save. The cube happily slides down the well and consumes its prey until all organic material is digested, then it seeps through the grate at the bottom and it collected and replaced in its cell behind the stonework.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "GsIWgU2rVVt2G4u9","flags": {},"type": 0,"text": "A treasure chest in a 10′ square pit. The entire pit is clean and smooth stone, making it difficult to climb. If weight is added to the floor of the pit (set to the weight of one or more humanoid adventurers) the pit and 1 foot of the pit walls is shot upward to the ceiling cutting off all means of escape. The walls then close in and collapse all humanoids unless they pile on top of the chest, which is not crushed. The treasure chest is a mimic but is magically paralyzed until the walls fully collapse inward, at which point he mimic is released from its spell and the trap resets in 1d4 days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "SShNYa2qUpHq8sPW","flags": {},"type": 0,"text": "A shield guardian with a stored spell of invisibility blocks a hallway or doorway and goes invisible before adventurers can see it. The Guardian body blocks the path and ambushes the first adventurer to bump into it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "lDUXZZO2OY2k1raq","flags": {},"type": 0,"text": "A pitfall into a pond of ooze. As the adventures move around the pond seems to start moving of it’s own accord and slowly drags anything on it’s surface into it’s depths.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "lVmiaC0Ge5Llm4jl","flags": {},"type": 0,"text": "A pitfall into with a pool of flammable oil. The victims can climb out of the pool into a long corridor leading back to where they where. Along the way are magical swinging candles, mini flamethrowers, and minor fire elementals.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "2WFwR18UOE0vsnpL","flags": {},"type": 0,"text": "A seemingly normal abandoned bathroom. There is a tripwire coming out of one of the stalls, that tightly seals the only door. Then, contaminated water starts coming out of the toilets. The adventurers must break the door to escape, and if they touch the water, they get sick.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "MGlFncNrPd8xPXza","flags": {},"type": 0,"text": "A bedroom with enough beds for the party to sleep on. There are pressure plates under the mattresses, that open small holes in the walls. Slowly but surely, a neurotoxin starts coming out of the holes, and seamlessly fills the room, while the adventurers sleep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "vzn3LLaPjlmNtJ0y","flags": {},"type": 0,"text": "A rickety wooden bridge over a big dark pit, with snakes on the bottom. There is a hole on one of the side walls (requiring a passive perception check to notice). The bridge itself is relatively safe, but there is a thin tripwire halfway through it, that activates the hole, making it spill out a line of fire over the end of the bridge.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "FMNbSSEgR95s5ivb","flags": {},"type": 0,"text": "A wall with three stone doors. There is a paper on it, saying that two of the doors lead to a treasure, while another kills whoever is passing through. Going through those doors is not necessary for the adventure. If a player decides to try their luck, roll a d6 to see what happens.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "aJaCWLzM4YSjEHt7","flags": {},"type": 0,"text": "A treasure room, filled with open and empty chests. There is only one closed container. If the adventurers loot it, the trap is deactivated. If they try to leave without touching it, a loud sound is heard, waking up all of the mimics.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "uqojhGkyfaFrNca3","flags": {},"type": 0,"text": "The adventurers must go through a door. There is a paper on it, with the words: “Be polite”, and a happy face. The door leads to an abandoned workshop, filled with statues and gargoyles. They have to shake the hands of every gargoyle before leaving the room, otherwise they will attack the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "DW6q3XJcCQpu8RXO","flags": {},"type": 0,"text": "This is a standard pit-trap with a twist. At the bottom of the pit, and for ten feet up the walls, everything is coated in pitch. Pitch may be sticky, but in quantity it also acts like any other oil-based liquid – a lubricant. Climbing up a rope becomes extremely unlikely for whoever fell down the hole. But that’s not the worst bit. A couple of rounds after the pit trap is activated, the Kobolds, warned by a bell attached to the pit trap’s trigger, will show up with lit torches. And one of them will start combat by throwing a torch into the pit – igniting the pitch!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "qQ7LqpFSfrIX3HDi","flags": {},"type": 0,"text": "Oil floats on water: You all know the scene. In the middle of the vast dungeon is a lake. At one edge of the lake is a boat. The heroes have to pile into the boat and row across the lake to the next section of the dungeon. Well, this particular lake is guarded by kobolds with spyglasses. And a few barrels full of lamp oil. And a torch. Be sure to wait until the party is most of the way across the lake before the kobolds start pouring lamp oil on the water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "Ocxw6vu9r53Oyrhd","flags": {},"type": 0,"text": "Kobolds are light, and armor is heavy: A well prepared Kobold always has an escape route. And his escape route is generally one only a Kobold can use. While most Kobolds choose to make tight passages that only a Tiny creature can squeeze into (thanks to their ability to fit into unlikely places), some rely on the fact that their pursuers are generally heavier, and in larger numbers, than themselves. Choose a corridor, and undermine it (dig a tunnel under the floor, but with too little material acting as floor/ceiling). Leave it just enough strength to handle the weight of a Kobold or two. Fill the corridor below with something nasty, and have it lead somewhere nasty. As a finishing touch, make sure there’s a collapsing ceiling in the upper tunnel as well to ensure that the heroes can’t climb back out after you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "6nUqn9ckebpLrEGn","flags": {},"type": 0,"text": "Gold melts at a surprisingly low temperature: Did you know that you can melt gold in a candle flame? It would probably take about an hour to do so from room temperature, but you can. More importantly, if you keep your gold coins at a hot enough temperature, they’ll melt very quickly if exposed to a very potent heat source – like say they might melt within seconds if they were doused in lamp oil and lit. This is an interesting thing to note if your chosen method of storing gold coins is in a wire-mesh cage attached to the ceiling. Especially if such a cage is kept at very high temperature, and is trapped with various kinds of flame traps (flame traps that trigger onto the gold). Unfortunately, while the temperature might be relatively high compared to the meltin point of most metal, it’s still more than enough to cook any flesh it comes in contact with (and STICK to that flesh, as molten metal tends to, causing the WORST sort of burns). And of course, the easiest way to get at the gold itself is from directly below it. Be sure to note to the party how hot it is in the room with the gold while they’re standing under it. If they’re clever enough to figure out the trap beforehand, hopefully they’re also clever enough to notice the hidden drains in the floor before all that molten gold runs (very, very quickly) down those drains.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "kTzlEBoNs6Tosa3V","flags": {},"type": 0,"text": "At the end of a hallway is a fake door. When the doorknob is turned, a latch is released, and the spring mounted door flies out at whoever opened the door. Since the door takes up most of the hallway, there is no chance to dodge it at all. The person who attempted to open the door takes 2d6 points of damage, and anyone standing within 5 feet of the door will take 1d6 points of damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "COEqFFd5QhP4KbzS","flags": {},"type": 0,"text": "Anyone weighing more than 150 lbs. will cause a lid to a pit to open. The pit is 25 feet deep.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "jYL6ahNTHNi7hLTC","flags": {},"type": 0,"text": "The character steps into the trap and the gem eyes from a roomful of statues shoots rays at him. The PC is zapped and appears to be disintegrated. A skeleton appears in his place. It’s important that the PC’s don’t get a chance to detect this trap or they’ll quickly find a solution (Search DC30). The character is teleported to a sealed tomb filled with the skeletons of various victims. A black pudding, CR equal to the party, attempts to engulf the teleported PC and turn him into a skeleton with its acid. When the trap goes off, one of these skeletons is instantly teleported to where the PC was standing, making it appear like he was disintegrated. Make a Search DC 25 to notice the skeleton (pile of bones) is not the same makeup as the PC (DC 20 if the size category of the PC is one larger or smaller than medium). After six teleportations, the “living” victims (or their remains) are teleported back to the trap area. Defeat the trap by moving statues into the area so they can be teleported, eventually sending out “victims.”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "BnKgQCNtgHe91Lvm","flags": {},"type": 0,"text": "A room of freezing ice orbs that stick to the skin and slow the characters down significantly. Add monsters/other challenges to taste.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "xd6gTeNn2PX2qvBD","flags": {},"type": 0,"text": "A long passage of murky, depthless water. Two boats are tied up at the entrance- one that looks rickety and has a little water in the bottom, and one that is new looking, gilded on the edges and looks really watertight. Turns out the “new” boat is actually an illusion, and it disappears in a puff of smoke about halfway through.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "ziCeaBBdru6PW6lZ","flags": {},"type": 0,"text": "A long maze of gooey yellow sponge passages just large enough for one person to crawl through. The maze starts to shrink and harden if players take too long to get through.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "tXntbO5hSmVsrEIB","flags": {},"type": 0,"text": "A long hallway of absolute darkness. If the adventurers try to bring light to it the darkness itself lashes out at the party.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "itxTtAWmCbXb3BW6","flags": {},"type": 0,"text": "They enter a room, and there are five doors. They are labeled 1, 2, 4, 5, 6. There is no door #3.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "4Im3VvdIMQSF8oeR","flags": {},"type": 0,"text": "A long, dimly-lit hallway. Candles light the way, and occasionally there are wisps of wind. Occasionally have a player step on a block that depresses a little, and tell them a puff of air just shot out of the block on the wall to their immediate left or right.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "XX72QWz6ESsSJMnh","flags": {},"type": 0,"text": "A seemingly wooden door that says “Knock”. Knock on the door to enter. ALTERNATIVELY: a seemingly wooden door, badly worn; it seems as if it could just be destroyed. Players can see the other side, in fact. Catch? Nobody but the weakest among any group that approaches it, can open it. It cannot be destroyed by anything.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "bI2hgNZiTSXjnHAt","flags": {},"type": 0,"text": "A badly written sign in [the language of whatever people made the dungeon] that says “beware”; the area is somewhat stinky. It leads to a small hallway with another likewise-made/written sign that says “turn back”. It’s getting smellier now, and much more damp. If the party continues, they find themselves at the bottom of the underground shithouse. Bonus: if they made it this far, and if they get clever and can’t smell anything and want to risk being a social pariah for the next several days, they can climb the spout to the room(s) connected, above.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "Eewc9pG6XiAm2sFM","flags": {},"type": 0,"text": "Magic runes that activate when a character steps into and area, casting floor of ice. To move characters must roll dexterity or fall probe and take damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "FhGuODaNZDAnOlrE","flags": {},"type": 0,"text": "While travelling along a path towards a popular location or city, the PCs hear a voice so soothing and enchanting that they are compelled to move towards it. On failing a DC 15 Wisdom check, they walk towards the voice which leads to a hag nest. The voice emanates from one of the hags. On a successful check, PCs can still hear the voice but are able to clear their minds long enough to break free from the hold of the song. Lots of footprints are seen going in that direction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "TbHuKFj1FOZdIs7n","flags": {},"type": 0,"text": "A flameskull is slightly buried underneath some dirt. The soil around it has been disturbed. As a player (or two) steps closer, they fall through the soil into the gelatinous cube below, and the flameskull rises striaight into the air.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "J8IhnGaBKId9Gl4T","flags": {},"type": 0,"text": "While travelling to a popular location or city on a path that is obscured (such as forest or cave), the party hears cries of help from a woman. These cries emanate from a hidden kenku group that ambush the party when they approach the voice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "hLJRnFbdiDxL2hLb","flags": {},"type": 0,"text": "A stone bridge over a section of an otherwise normal river, the “water” under which is actually a grouping of gelatinous cubes in wait to surround any passers, running water hiding their already transparent bodies.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "JOoMgKn38OW8TF0c","flags": {},"type": 0,"text": "A literal CATapult, triggered by a wire. If activated, a Cat is flung at the PC who triggered the trap. This cat will get an attack of opportunity with its claws while being flung, and will enter combat with the party afterwards.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "k5xN8SfYNq3WzOfT","flags": {},"type": 0,"text": "A ceiling trapdoor opens letting out a swarm of poisonous snakes as well as a giant poisonous snake.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "MgZIX8QlegbXufsS","flags": {},"type": 0,"text": "Three chests sit in a room. A sign on the wall reads “DANGER! MIMIC!” There is no mimic, but there is a rug of smothering under each chest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "QLzlVWmjk2lIkL6e","flags": {},"type": 0,"text": "An animated armor using a flying sword. After the armor is defeated, the sword begins to fight.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false}],"formula": "1d59","replacement": true,"displayRoll": true,"_id": "I4MmGxfKXV4P8UNq"}
