{"name": "Scifi Encounters","description": "Seventy-five encounters in deep space!Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "MvEgnyADvvdysokM","flags": {},"type": 0,"text": "Your spaceship comes across an enormous research vessel that seems to have been abandoned. Little does the party know, the crew of this ‘abandoned’ ship have been consumed by creatures with a natural cloaking ability, making them almost invisible. ","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "YqSNY386bg0tpUdN","flags": {},"type": 0,"text": "A mining space station in a planetary asteroid belt (rings?) is having difficulty with small asteroids seemingly ‘attacking’ the station. It is later found out that the asteroid belt as a whole is a sapient creature desperately trying to ‘defend’ itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "xQf1KzM85h912LdF","flags": {},"type": 0,"text": "You see an asteroid moving towards you, upon closer inspection, It seems to be made out of living flesh.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "Nw4DPrD9RchADBcw","flags": {},"type": 0,"text": "You detect a damaged vessel docked with the jump beacon. It appears the ship is absorbing metal from the beacon, risking destroying it and becoming stranded.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "p13HOxUHxSKHVf6e","flags": {},"type": 0,"text": "You find the source of the distress call, a small research station. It appears a small laboratory fire got out of control and is threatening to destroy the station. Their fire suppression system is not responding.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "LbYukoUQkumwur9H","flags": {},"type": 0,"text": "A large convoy of civilian ships appears to be passing through this region. You show no hostile intentions, but they are taking no chances, immediately sending their escort to attack.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "izKjX36lPCPlTlWt","flags": {},"type": 0,"text": "An enemy capital ship is using its gravity generators to make a blockade of asteroids, stopping external attack. This must mean their internal gravity is switched off however, making an internal attack… Complicated.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "XT8tNU86wExyahs2","flags": {},"type": 0,"text": "An enemy ship has rerouted its gravity generators to throw asteroids at you from a nearby asteroid field","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "Rf5Ae4elabbcGfC9","flags": {},"type": 0,"text": "A science station imploded a star during a test of a new weapon, but misjudged the size of the resulting black hole. They are now falling towards the event horizon, signalling mayday and a full evacuation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "027Is2u2x0aiZXe9","flags": {},"type": 0,"text": "You are immediately hailed by a dangerous looking ship. “I’m feeling generous today. I shall allow you to choose your own death. Which do you like least: shields, oxygen, or weapons?” (whichever the party chooses, the enemy ships disable for the duration of the battle)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "ZWEVzfkg2aJh0XOg","flags": {},"type": 0,"text": "You spy two pirate ships lurking in the nebula here. They remain unaware of your presence; You’re able to get your scanners to at least identify their cargo: One is carrying the fuel supplies, the other the ammunition. They begin to drift away from each other in the storm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "nxySCUNc1U4BUlVX","flags": {},"type": 0,"text": "You jump into the middle of a plasma storm. Multiple recently incapacitated ships loom in the shadows, briefly illuminated by the lightning.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "Mq70aJ9vNGiy4VUE","flags": {},"type": 0,"text": "You see a small station nearby and feel the shudder of shots ringing through the ship. You can’t be sure without sensors, but it seems there may be intruders on the ship.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "cRQzH38zHY207TFC","flags": {},"type": 0,"text": "Drifting in space you find a spherical metal structure the size of a small moon, Scanning it will reveal no signs of advanced technology or life forms but it will reveal a small hanger on the structure. If you land in the hanger you find it very plain and without any life support or artificial gravity systems but a small door on one wall big enough for a human to fit through but not much bigger. If you go through the door you will find a cube shaped room 10 meters long in all dimensions. On one wall is an inscription explaining that this structure is a giant mechanical computer but it does not say who built it and when. On the opposite wall to the inscription is a typewriter, a box of paper, a slit to put paper in, and a slit that paper can come out of. If the PCs type out messages on the typewriter and put them into the input slit than the computer’s response will come out of the output slit. The computer introduces itself as Socrates and explains that it simply wants to ponder the meaning of the universe in peace. Socrates appears to be of intelligence on par with a human but his responses take time to process(about 10 seconds for each word inserted into the input slit). If he sees the PCs as threatening to him the walls of the room and the hanger begin to close in.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "4XJfZ4I4PelTMdJr","flags": {},"type": 0,"text": "You find a illegal fueling station with a massive array of solar panels. The station offers the ship a full refuel if they are allowed to use the processing power of the ship’s computer for one hour, and offer to buy any computing equipment your ship may be carrying. Scans reveal that they have a much larger computer system that a station of that size requires. If the crew accepts the offer the ship will be refueled as promised with no negative effects on the ship or the ship’s computer. If they are forced to reveal what they are doing, the will admit that they are a religion that believes that through immense processing power they can calculate the equation that the entire universe is devised from.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "ABl1BmlverA2LFPm","flags": {},"type": 0,"text": "A crew member notices a group of manta ray like aliens drifting behind the ship appearing to feed off the ship’s exhaust. Scans show they are not a known species.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "dSh0YLasBakVnriC","flags": {},"type": 0,"text": "You find the wreckage of two friendly ships that warped into the same space, something technically possible but statistically approaches impossibility.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "dMSTK3avF2eHdxVn","flags": {},"type": 0,"text": "The o2 generator is broken through a spilled drink from one of the party members and they know they have x hours to fix it or find a habitable planet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "M0tAPNgozfQDpYVo","flags": {},"type": 0,"text": "A strange smell starts to emit from one of the containers in the cargohold. Upon inspection, your crew finds that the refridgeration of the alien meat fell out and it started to rot. When not immediately inspected, some sort of worms start to eat up all the food and, still ignored, these worms start to evolve and eat the ship like termites.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "b0E58t4Btz6OqEBt","flags": {},"type": 0,"text": "A portion of space suddenly rips open and unfurls into a mass of tentacles surrounding a great maw. It pulls the ship towards its mouth. The maw is actually a wormhole to a destination of the GMs choice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "LUq1WQS5SbZzxIlg","flags": {},"type": 0,"text": "You find an illegal garbage dump zone at a Lagrangian point. Most of it is trash, but there is some minor treasure to scavenge.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "X4KOL4Pqfl5UJxxS","flags": {},"type": 0,"text": "On a newly colonized tropical pleasure planet, a crew member with an abnormally high Psi Score starts to hear voices. It turns out that the 3000km long coral reef is actually a sentient hive mind and it’s pissed. If the crew doesn’t stop the locals from dynamiting the reef to build hotels, it’s going to start causing brain embolisms in people until there are no humans left. A computer model shows it could wipe out the population of ten million people in five days.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "pzOFpLsaS1LU96hH","flags": {},"type": 0,"text": "You didn’t think much about that shipping container full of alien artifacts that museum asked you to haul. That is, until last night when something inside tore through the container’s steel wall and escaped into the air ducts. Inside the container you find seventy-three one meter long sealed sarcophagi… and one broken open.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "JE8xCQPn3qixhrnL","flags": {},"type": 0,"text": "Those twenty shipping containers labeled “Childrens’ Pajamas” you’re delivering? One of them broke open while moving stuff around the hold and it appears to be filled with very illegal automatic weapons. Oh yeah, and the Space Patrol just hailed your ship for a surprise inspection.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "4RvoImee6BWYdZiI","flags": {},"type": 0,"text": "On an isolated colony, bare knuckle boxing has become popular. So has a locally grown and refined performance enhancing drug that turns its users into sociopathic murderers. Worse, about a quarter of them learn to hide their impulses and instead become highly effective serial killers… and they’re beginning to emigrate back into the galaxy’s general population.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "jpKQjqlbv1RBpiqc","flags": {},"type": 0,"text": "Argus Nine is a fully automated mining facility on the surface of a metal rich asteroid. The crew visits for its biannual pickup of refined ore only to find all the mining equipment disassembled and the supposedly non-sentient robots separated into warring religious factions, one that worships humans as their creators and the other sworn to exterminate them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "ZJq0IpbblVZUkRHg","flags": {},"type": 0,"text": "On a colony, you encounter a scientist with an aptitude for cloning limbs. He asks if anyone would be a willing test subject for his latest project.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "NwcqnVBTxtP3S0gL","flags": {},"type": 0,"text": "The group comes accross a space station, that’s sending a distress signal. There are hundreds of people in there, being slaughtered by giant spiders.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "0BTdpUZ1xhjSmy7F","flags": {},"type": 0,"text": "The ship is hailed by a group of freighters far away. Scans reveal they are being harassed by smaller combat ships. The captain of the main freighter asks for their help in dealing with the pirates, but at some point in the fight, it’s revealed that the pirates stole the cargo ships, and the real merchants are the ones in the combat ships.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "a24nljLauT7dKQGZ","flags": {},"type": 0,"text": "A random guy teleports into the bridge, and offers to be a janitor. If you refuse, he will fight with a small phaser, but should you let him join your crew, he will do his job just fine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "xSc6fJwJmQxhCdpc","flags": {},"type": 0,"text": "The ship receives a message from a nearby moon, asking the crew to come down to discuss a quest. Turns out the moon is a space whale sanctuary, where these creatures breed and grow. There is a small community of warriors, sworn to protect the sanctuary. They know hunters are coming, and need the player’s help.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "D9rRwoGQLDG6pvpD","flags": {},"type": 0,"text": "The players come across a massive trade station. There, they are approachedd by a scientist, who says a great evil from another dimension has awoken within the system, and will soon destroy it. Should the players investigate, they will find a giant portal in a jungle planet, surrounded by bizarre monsters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "0Rb1RhJ2K0KXBMBJ","flags": {},"type": 0,"text": "A monolithic ship, nearly as black as the space around it, suddenly appears out of warp and hails the party in a strange language. The design is unlike anything the party has ever seen. They don’t seem hostile…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "Pw3Fo8hNWFmD3txv","flags": {},"type": 0,"text": "A group of strange, whale-like creatures peacefully pass the ship. The scanner will show up blank no matter how many times the party tries.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "oVcFP8556eKVHSyF","flags": {},"type": 0,"text": "There’s a Wormhole to… somewhere. Your scanners can’t quite figure out where.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "NjNYCUG0jxJvQzUj","flags": {},"type": 0,"text": "An automated salvage vessel mistakenly flags the party’s ship as scrap, and attempts to collect its parts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "DUCh9vl6tBP3xLbF","flags": {},"type": 0,"text": "A strange combat drone engages the ship. It can only move by firing a plasma launcher in the opposite direction.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "RFSMSCwTjOCZT0mS","flags": {},"type": 0,"text": "A supply merchant ship hails the party and offers to trade with them. Declining angers the merchants, and they will continue to ask to trade until either a transaction is made or a fight breaks out. Their prices are fair, though.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "T826LQzwAL7k1ge0","flags": {},"type": 0,"text": "Two automated battleships are in a perpetual battle with each other around a red dwarf star. Neither has functional thrusters, transmitters, or anything besides solar panels, mirror plating, and an assortment of laser weapons. Unfortunately, neither can be damaged by the others lasers, due to the mirrors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "peAE5wYpOdbxSkzg","flags": {},"type": 0,"text": "A small ocean planet comes into view, with a distress beacon coming from its surface. If the ship approaches the planet, they will be warned by a castaway on the planet of an ancient defense system that will try to shoot down anything that enters the atmosphere.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "l1t6vTPCCuNBKYkJ","flags": {},"type": 0,"text": "You find the remains of two nomad plants that fell into each other’s gravitational pull and collided. A breathing view, but ultimately not useful for much other that pictures.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "vdDChvVSB9tHe1w3","flags": {},"type": 0,"text": "A very small moon is home to a small shop of tiny friendly aliens. They sell moon rocks and preserved tiny bugs from their little home as souvenirs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "4WC1V8tomBqoep8b","flags": {},"type": 0,"text": "An unknown species’ equivalent of a voyager probe. How long has it been travelling? Where from and what is the species doing now? Does it even still exist in a recognizable form?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "zN8hn1jfeQviy09N","flags": {},"type": 0,"text": "A gigantic intelligent leviathan creature is drifting between stars at sub-light speed. It contacts the ship telepathically to explain that it rescued some humans/pc race some time ago and has been sustaining them in one of many large cysts on its flanks. It asks you to take them off its “hands” as their presence is physically irritating, like a tick, because they are literally living off its body and fluids. The creature had not realized the difference in lifespans and so had no idea that his passengers are 6th generation inhabitants who have never known any other life except as oral legend and are terrified at the idea of leaving.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "Q7lxrrCffrFlEqTj","flags": {},"type": 0,"text": "Lemon juice rations you brought to combat scurvy have gone missing. An investigation reveals that it was stolen by the janitorial staff in an attempt to brew alcohol.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "MAWk3y9kq7f7X5IC","flags": {},"type": 0,"text": "You find a abandoned small space station near a tiny moon. Scans show something extremely strange: the station is not orbiting the moon, but rather the moon is orbiting the station, which has a mass 10 times greater than that of the moon.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "AMe9pAjPiAniL3Wp","flags": {},"type": 0,"text": "A wrecked cargo ship. Huge weapon damage but it looks like a lot of the cargo remains inside. The only problem is the cracked core which continues to flood the ship and near space with radiation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "UAgVMz3knov3FfX1","flags": {},"type": 0,"text": "A small mining colony on the small moon of an inhabited planet. The planet is middle ages tech level on its two main continents with a couple of areas starting renaissance-style thinking. The colony has mined the far side till it risks breaking up and are fighting over whether to start on the near-side and affecting the locals.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "KmiGIvkFqswEiAq3","flags": {},"type": 0,"text": "Your ship emerges quite far away from the jump beacons coordinates. You see a pirate ship waiting nearby the jump beacon exit; undoubtedly stationed to look for unarmed vessels that fall into its trap.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "MxO9t8LhmP2eT2ax","flags": {},"type": 0,"text": "You follow the distress beacon to a small asteroid belt. You find a small ship struggling to maneuver through the field. They message you, “Help! Our shields are down and I don’t know how much longer we can last!”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "Cdxf5Sg3AZUxNtJu","flags": {},"type": 0,"text": "You are hailed by a small colony on a a planet. A few weeks ago, the moon orbiting the planet disappeared, and nobody knows what happened to it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "w0mI4U96zLGc4ilP","flags": {},"type": 0,"text": "A massive diamond shaped space craft comes out of warp. It seems to be sub consciously beckoning the party to come aboard","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "f33l1Khwbc6avCo5","flags": {},"type": 0,"text": "The party receives a mysterious distress call that comes from a empty system. When they inspect it further, they find an abandoned ship that looks exactly like theirs. When they check it further, they find bodies of people that look exactly like them. They had been sending a distress signal to themselves","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "CJb0DJ21hgdchiuF","flags": {},"type": 0,"text": "The ship’s recycler is on the fritz and your food has started to look more and more like feces","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "fCpMF9G0tamVGqyA","flags": {},"type": 0,"text": "A smattering of high-velocity(missiles, lasers, tungsten slugs, whatever) tear past the ship- analysis suggests they are the remains of a centuries-old battle.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "wVsz0dbtHg8qbG0E","flags": {},"type": 0,"text": "A gigantic mechanical skull drifts through the void of space past the ship. One of its gigantic eyes follows the ship, but does nothing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "eYGHCJEmikbOLMpt","flags": {},"type": 0,"text": "A heavy battleship, long-decommissioned and turned into a spaceport, has had it’s combat AI reactivated and is now firing on all docking ships.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "I66saQF5E3LD9Y8w","flags": {},"type": 0,"text": "An abandoned science shuttle drifts in orbit around a seemingly-empty planet. Analysis suggests the whole crew was killed by the common cold.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "FwOVSH2l5h7FSfpo","flags": {},"type": 0,"text": "Half of a destroyed planet floats through the empty space between stars- a small settlement within the crust still survives, and has sent out a distress beacon for someone, anyone, to help them evacuate.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "ilWUvfXfEpWlifzN","flags": {},"type": 0,"text": "An automated battleship attacks the party","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "Xq4nl58gzA1KIjul","flags": {},"type": 0,"text": "The party’s ship is caught in a gravitational anomaly and forced to crash on an unknown planet","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "iM6KtKl4CAYSuSc4","flags": {},"type": 0,"text": "You come across a damaged ship that is drifting in space. Scans reveal that it is on emergency power and life support is in danger of shutting down. They also reveal that there are 6 people in cryoberths. If the group wakes them they will have no memory of who they are.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "X1jtLL2N3fohPtSj","flags": {},"type": 0,"text": "Come out of hyperspace/jump/warp in the middle of a very chaotic battle in a system that is not the one you were attempting to travel to.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "oin8l28KAuya9yWk","flags": {},"type": 0,"text": "The party is offered a job to escort a delivery to a penal colony on a small moon in the system. When they arrive things seem a little off. If they pry (or are very observant) they figure out that the inmates have taken over and are running the place. Do they join them, try to stop them, or just ignore the fact?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "aiWKWK3Cjg3AOQ2Y","flags": {},"type": 0,"text": "Something went terribly wrong with the last jump. You were in jump space 2x as long as normal and now you come out and are in complete darkness. No stars. No planets. Just void. Turns out they jumped into the middle of an extremely large Dyson sphere (aka hollow planet).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "tznv51YG4VV0BMog","flags": {},"type": 0,"text": "Someone ate all the rations, and you are still a week out from the next destination…. was it a crew member or is there a stowaway?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "ffJkTftfmqQzxIYH","flags": {},"type": 0,"text": "The ships computer gives a puzzling report. Something in your cargo hold has been growing heavier after every FTL jump.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "XMIEg5L67tbMvsfc","flags": {},"type": 0,"text": "You find a research station attempting to breed livestock capable of surviving in the vacuum of space. The experiments have all been a failure, and the station offers you sell you the meat from all the failed experiments at a cheap price.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "IURPy9Ij2ybC9Djo","flags": {},"type": 0,"text": "You see a large spaceport filled with many tourist ships. Apparently, a local star is about to go supernova in a week, and many visitors from across the system have come to witness the event.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "l5ro7yIkIp6WNW9j","flags": {},"type": 0,"text": "The party finds a damaged and disable ship floating in space. Upon entering they find it is covered in ice and many of the crew are encapsulated in it. They find one person alive with no ice immediately around them. They are muttering about how it is still too hot.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "S8yeQgQzYy4yERyO","flags": {},"type": 0,"text": "The party discover that a moderately important drift beacon has an inevitable guarding it, destroying anything that gets nearby","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "0MXPGP00DnFF7i2o","flags": {},"type": 0,"text": "The party finds a library bigger than one that they can remember. It’s librarian is a dragon, who demands a large price to using it’s books.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "52BagX95jN4kszQq","flags": {},"type": 0,"text": "Party discovers a compound filled with undead, and turrets that shoot anyone who tries to harm an undead.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "0cEeee6HZnHjIiFE","flags": {},"type": 0,"text": "In a city the party sees a person openly stealing things, and no one seems to notice or care.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "P0giCACHm6XgTBG8","flags": {},"type": 0,"text": "The crew come across a kilometer wide, dense mass of musical birthday cards floating out in space. As they investigate, a cloud of assembly oozes bleeds out and attacks their ship, nibbling at it and turning it into more birthday cards.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false}],"formula": "1d76","replacement": true,"displayRoll": true,"_id": "J90neAr9MPjn7LM3"}
