{"name": "Art Along The Path","description": "Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "INJrPsyJIVfGPtAs","flags": {},"type": 0,"text": "A tree stump covered in bent pennies. It looks like passers by have jammed the edges of pennies and other small coins into the cracks and bark of this large stump and bent them down to create an almost scale-effect on the bark. Over the years after the bark space ran out pennies were jammed between other pennies, and so on, growing the stump over time.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "W2J1wyxL1jy4Vz9L","flags": {},"type": 0,"text": "The path here has been replaced with smooth stone squares alternating with squares of bare earth, grass and wildflowers in a checkerboard pattern. The whole pattern is irregular at the edges, longer but thinner than a true checkerboard.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "5WnW9jQ4EpGLhiNI","flags": {},"type": 0,"text": "A vast collection of lamps and lanterns have been hung around the path, some along the sides in tree branches or hung from iron rods, some hanging down from above, some placed directly on the ground. No two lamps are the same, some are iron, some wood, some paper, some ornate, some elaborate, some elven, some dwarven. At night they all illuminate on their own, flicking on over the course of the sunset, in no discernible pattern.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "yyWDuEAMSa7yoB2U","flags": {},"type": 0,"text": "Several trees have been cut down along this trail, and their left behind stumps have been hollowed out and planted with local wildflowers and herbs. A few of them boast a single large pumpkin placed right at the stump’s center with vines curled all around the roots.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "dTsKE4lUhqUMSkuE","flags": {},"type": 0,"text": "The path widens out into a circular clearing. At the center a raised dais fountain pours with mirror-smooth water before cascading over the edge. The water supports a single clear gazing ball, gently rotating.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "GZZd2MV3xxHrYNy6","flags": {},"type": 0,"text": "The trees and plants here have all been tagged or marked with small signs, in delicate calligraphy. The signs name the plants and list some common uses. The signs help anyone who is looking to improve their foraging, granting a 1D4 bonus to foraging rolls for the next week.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "OwCGyQlqvukNlPQz","flags": {},"type": 0,"text": "The path intersects with a calm river where a flat disc of stone, about 10′ across, is floating at the water’s edge. The river is causing the stone to rotate but it is caught in place by an outcrop of rock. As the river rotates the stone disc the disc grinds out more of the rock it has caught on. It has clearly been here for years as the stone it is stuck on has a sizable divot formed from the rotation.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "MCAHyWDz6ma81HhH","flags": {},"type": 0,"text": "A small mossy cottage can be seen of a branch in the trail. The cottage is made of red pine with forest green roof tiles. It’s roof is a sharp steeple with a lit coppola. The cottage looks too small for anyone to really live in, perhaps enough space to keep out of any passing rain. Inside the walls of the house are completely painted with a detailed map of the area. A day’s ration for two people can be found in a chest by the entrance.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "ePViTGcD7mHgQ1DZ","flags": {},"type": 0,"text": "You happen across a sheltered bench made of oak with a tall trellis supporting dense vines. There is a circle frame cut from the trellis at the back of the bench which perfectly frames a massive oak tree growing in a field to the west.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "SC65mKnu01lF6yzU","flags": {},"type": 0,"text": "From a distance it looks like this tree is radiating a bright and fiery energy along the ground. On closer inspection someone has taken the fallen leaves of the forest and arranged them around the base of a massive walnut tree so that the yellow ones are nearest to the trunk, then orange, then red, radiating out in a pattern to create the effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "qUbeF5qWXVDlRIbM","flags": {},"type": 0,"text": "Several glass windows in wooden frames have been scattered around this path, leaned against trees and laying on the ground.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "7KTvtqPIyMkFdwTD","flags": {},"type": 0,"text": "The path here dips down between an outcrop of stone that is densely covered in mosses and ferns. As the trail moves down, the stones raise up, towering far overhead yet still close enough to touch. At the nadir of the path a wooden bridge zigzags through two massive mossy stones. The railings of the bridge have wooden logs arranged in a fan pattern. Water drips down from the moss onto the passers of the bridge. The bridge crosses a skinny creek before the path slopes upwards again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "tnNBAyfmRA1rZcBR","flags": {},"type": 0,"text": "The path happens upon a low wall made of loose stones. The wall is easy enough to hop over, but the path follows along only one side of the wall. After a few minutes of walking, a stone arched Moon Gate has been made, which the path follows through and continues onward.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "l7ZHjHjDASSsz8Tw","flags": {},"type": 0,"text": "You come upon an oblong stone propped up vertically in the grasses. At its base, other oblong stones have been placed on the ground in a radiating sun pattern, all pointing toward the vertical stone. As the path progresses two more of these sculptures can be seen, though one of them was a great distance away from the path.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "PiJ11KpgPdgJFV2k","flags": {},"type": 0,"text": "Someone has built a lattice roof to cover this section of path. From it wisteria grows, hanging down fragrant purple flowers overhead. Squat square lanterns have been hung in between the flowers, but they are unlit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "4w9K37719SrXQKrj","flags": {},"type": 0,"text": "The base of a massive sequoia tree has been decorated with illusory butterflies, with iridescent purple wings. The butterflies are fluttering while clumped all over the bark of the tree so that the bark cannot even be seen. They only cover it in patches, with small trails of fluttering butterflies reaching up the tree trunk.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "z4KMQq1qjjGb84TN","flags": {},"type": 0,"text": "The path has been lined with hanging wrought iron birdcages. The cage doors are all open and plants are growing inside, of all different types.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "txCUvV1cyfGOAGEY","flags": {},"type": 0,"text": "Perfectly clear glass mushrooms have been placed throughout the forest around the trail, almost imperceptible but for their odd distortions of the soil.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "uSVp2X6iYj2RmC4Z","flags": {},"type": 0,"text": "Several lanterns have been hung along the trail here. All of them are made of downward drooping blue leaves or flower petals, with the gently hovering lights trapped within the bundle of leaves. The leaves are wrapped with black iron which is then formed into a hook so the lanterns can be easily hung from above.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "q2IFfdkQCKV9DJ5j","flags": {},"type": 0,"text": "Several logs have been placed along the trail as well as throughout the forest. The logs are cracked and the cracks have been refilled with clear resin. At night the resin glows brightly, lighting the way.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "QX8Ww46DNTHHS0qn","flags": {},"type": 0,"text": "In the dense forest someone has made a simple wooden frame of a house, with no walls or roof. At the center of the house they have hung a lit chandelier, and placed a lovely mahogany table with seating for eight, and a full place setting. The table, plates and chandler have become worn over time, cracked and dirty.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "iMIW9agwixDCOtUD","flags": {},"type": 0,"text": "Along this trail someone has gathered up sticks and twigs from the ground. Then, they wove the sticks together to make eight egg-shaped arches placed right over the path. The arches are about 7 feet tall, and can easily be passed through.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "peQ4toIAWFERU3OD","flags": {},"type": 0,"text": "The path rounds a hill and overlook a huge field, in the field a stepped tower ruin made of stone juts up. The tower is weathered and crumbling, and nothing can be found inside, but the sight is impressive.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "KTTQ8CLwu2SLoGrF","flags": {},"type": 0,"text": "The path leads up through a grassy steppe and up through a steep hillside. The path gives way to stone stairs. Someone has come through and taken surplus stone slabs of the same material as the staircase and placed them vertically or at odd angles to decorate the trail.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "sn1H1WPwYNlgbyYE","flags": {},"type": 0,"text": "A small marble rotunda has been built at the edge of a river. It seats three comfortably but offers no shelter as the roof is made of latticed iron. At the center of the rotunda is a small statue of a cat holding a fish in its mouth proudly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "HHUFiB8GgQYAppgG","flags": {},"type": 0,"text": "The path crosses another, but does not directly connect as it goes under a large bridge. On the underside of the bridge someone has taken differently colored river stones and attached them to the ceiling to look like a clear night sky. Several well known constellations can be seen in their work.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "OJFfxH0cQaNECHDL","flags": {},"type": 0,"text": "The path is unpaved, and generally unkempt, but you happen upon a short wide staircase, regal enough for any king. The staircase is 10 steps tall and wide enough for 5. It boasts a wide stone banister carved of marble. Carvings of plants and forest creatures decorate the sides. Someone has come through and pried all the gems from their eyes and the gold plating from the staircase in general, but the impressive stonework remains. The staircase connects to a higher portion of the path, which continues on as normal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "YW9B5vidwBlgY06l","flags": {},"type": 0,"text": "The path begins to steepen, with roughly formed stairs leading the way. The trail takes a sharp hairpin bend to proceed. At the inner bend of their hairpin is a carefully carved statue of a woman, holding a fox in her arms. Several candles have been lit and placed all over the statue.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "2Mr4fu47Kkl3BtLn","flags": {},"type": 0,"text": "A roughly hewn ladder leads up into a whirl of sticks sitting atop a thicket. It looks almost like a massive birds nest. The inside can not be seen until you climb the ladder. Inside is a sheltered padded bed that will fit two comfortably.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "5e2XUNtwjYkRjOR6","flags": {},"type": 0,"text": "The path passes directly through a huge tree. A set of stairs have been formed from the tree roots leading up to an open archway of bark that bisects the tree. Inside the archway many passers by have left behind graffiti.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "UNfpYhckFTlJWEWX","flags": {},"type": 0,"text": "Three skinny trees have been carefully grown along the side of the path. They split from a common root and widen out to support a stone table top about 5′ across. Then they grow back inward, making a triple arch over the table, before recombining at the apex and finally leafing out in a natural tree formation. The table is clear.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "pxcirBJTD4zZWe17","flags": {},"type": 0,"text": "The fencing along the side of this trail is made up of live trees, grown in such a way that they weave their trunks together. At the top of these fences the trees sprout with bright green leaves. Beyond the fence, open prairie.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "voQXAcCJTV1C51Ze","flags": {},"type": 0,"text": "The path becomes grassy and well maintained, and the trees become neatly trimmed. After a mile or so of this pristine artful forest the trees give way to an open clearing with a single wooden gazebo at the center, covered in flowers in full bloom. Benches all around the gazebo have been placed to support a large audience.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "lMKcZNXFUBXPeh3C","flags": {},"type": 0,"text": "The path leads along a rocky creek, flowing with crisp water. After half a mile the source of the creek is found, flowing from the palm of a massive hand carved of stone. The Hand gently tips the water on top of a single juvenile tree. The stones all around the hand and water are thick with mosses.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "ZXpmXQAWrK9DKOPg","flags": {},"type": 0,"text": "A tree along the side of the path has been grown into an unnatural pattern. The trunk has split into several branches, the outermost forming a diamond shape, and the inner ones forming ‘holes’ around on another in a sort of weaving pattern. The branches all recombine to form the trunk after the diamond pattern and the rest of the tree appears to be normal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "NSvO8jxN9o5tRtvW","flags": {},"type": 0,"text": "The path curves around the base of a massive white wisteria tree, with dark black winding branches and brilliant streams of white flowers. Petals are gently raining all along the trail.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "rxQrPECVlw0wbsvT","flags": {},"type": 0,"text": "The path gives way to a long line of wooden discs carved from tree trunks, lined end to end for at least a mile of trail.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "7BdP6E7cQ94PSxHe","flags": {},"type": 0,"text": "Someone has hung a pentagram made of sticks from a tree overhanging the path, and tied each point in the star with a different bundle of drying herbs.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "0fSoL4LctURzvKoB","flags": {},"type": 0,"text": "The trail curves past a waterfall before cutting up through a stone cliff. Right before the staircase begins the stone landing has been carved into a beautiful viewing point for the falls, with dwarven cut banisters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "NlW3taDKXGJJXMzM","flags": {},"type": 0,"text": "The next section of path is clearly marked, and yet anyone approaching it has the strong urge to avoid the path, feeling a mix of wonder at the forest and annoyance at the path. There is no spell forcing anyone off the trail, merely a suggestion. A plaque laid out off the trail on either side reads “The road less traveled” Kevyn Picot. Multimedia; Forest, enchantment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "ya7D2n0zMFMsfZbX","flags": {},"type": 0,"text": "The path approaches a pond. The pond is perfectly square around the outside, and the path moves over the pond, on a series of rough laid stones covered in mosses, in a curved pattern. Branching off the path at regular intervals are tight spirals of stone. The pond is smooth and several Koi fish can be seen swimming in the clear water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "x3yLBdumx18QglQE","flags": {},"type": 0,"text": "As you approach this section of trail a shimmering humanoid can be seen standing by a tree, smiling politely. When you are close enough the human figure – a young man wearing a well tailored three piece suit – offers a tour. If you take the tour, he will tell about a historical battle fought in this very forest hundreds of years ago when the land was contested between elves and a clan of centaur. If you decline, the humanoid wishes you well and goes back to smiling politely.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "sBUDcW25MEWrU3LJ","flags": {},"type": 0,"text": "It has rained recently, the ground is wet and muddy. As you continue on you come upon a deck of cards that has been scattered through the forest, some cards in the trail, some in trees, some half buried, but all of them are clean and pristine. If the party manages to gather all the cards, they immediately re-scatter from the holder’s hand, all over the forest once again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "hNbHsMCTPNWnGKSd","flags": {},"type": 0,"text": "A single tree in the forest, a few yards off from the trail, shimmers with refracted light. On closer inspection the whole tree appears to have been carved from a massive deep blue tourmaline.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "2Y8pYSEnTb23JyDB","flags": {},"type": 0,"text": "Someone has put down mile markers along the trail, big slabs of local stone with carefully carved dwarven numbers. They are not evenly spaced though, and don’t seem to accurately reflect distance at all.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "sEaoisRbL2LdDVlO","flags": {},"type": 0,"text": "A fox is resting on top of a sunny rock. The trail splits in two to go around the rock and then recombines on the other side.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "d7xvTk4UG0IMo6tf","flags": {},"type": 0,"text": "The trail has begun to run alongside a low, calm creek with flat stones at the bottom. The water is only about calf-high. Walking in the water is soothing and invigorating. However every so often the creek bed is marred with deep (20+ yard) stone holes, perfectly circular.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "VO8o9GrTfEhEBMqt","flags": {},"type": 0,"text": "The forest which was wild at the start of your journey, has been cleared of all trees except for birch [willow, maple, whatever], and there are no leaves on the ground . You don’t see any stumps. Nature check (10 or better) and you see that many patches of the earth have been filled in with fresh soil. Careful observation reveals that this patch of the forest trail deviates slightly from your map, but recombines with the expected trail when the birch forest ends.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "Ty5HX9AganxAFV1o","flags": {},"type": 0,"text": "Someone has hung lanterns through this stretch of the forest trail. At night they light up with colourful elemental light. Every so often, you think you can see a lantern far off in the forest, away from the trail. Probably a trick of your eyes.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "QBGgEC6lAqyZZ7sU","flags": {},"type": 0,"text": "At the top of a massive sequoia tree you can clearly see a single window, lit from the inside. After looking for a while, the light goes out and the window disappears.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "0iFIoUZvWRSvacr5","flags": {},"type": 0,"text": "Someone has placed massive glowing spheres in the trees nearby, which have begun to grow over the spheres with time. The spheres glow a yellow orange and range from one foot to 4 feet in diameter. Some are high up in drooping branches, some tucked into the roots of trees.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "WuEotstX78FTsqBo","flags": {},"type": 0,"text": "In the forest something vaguely humanoid catches your eye, just for a moment. It is deep in the brush but, moving your head slightly, you can just barely make the outline of a person. If the party inspects further they will find a human sized sculpture made entirely of a mirrored surface, to reflect the forest around them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "yQoniMTINcXaF8EX","flags": {},"type": 0,"text": "Broken pottery scatters the ground. Pieces of broken flower pots lay all around the roots of the trees here, giving the sense that these trees burst out of their former containers rather quickly.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "tyR6ELhPA6JrFlUh","flags": {},"type": 0,"text": "Someone has knit a long winding strip of colorful yarn to cover the path for the next 10 yards. The yarn seems stain resistant and resilient, as the colors have held true for who knows how long. Walking on it is very soft and pleasant.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "1c9x6B8hnB7VYMaO","flags": {},"type": 0,"text": "Someone has come through this section of forest and dug the soil away from the trail to form a sort of top-down view of a home. The ‘pit’ is about 6 feet down, and contains furnishings and walls formed from the soil, avoiding tree roots where it can. The house meanders along the path and is not traditionally square or regular. The path is untouched, but bisects this ‘house’ of sorts.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "faViDdhl1qEppFlk","flags": {},"type": 0,"text": "Though the area here is wild, someone has planted a row of rosebushes along this section of trail, the roses are in full, brilliant bloom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "p6VS8i2hBK2RsY2m","flags": {},"type": 0,"text": "A statue of an angel with a large stone sword stands to the right of the trail. Several small pouches have been laid at its feet.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "QdDs70GSMMLDO3pB","flags": {},"type": 0,"text": "You can hear faint voices up ahead. As you approach, you seem to have stumbled into a painting class. Students at a wide range of ages are scattered throughout the field with easels, painting the landscape. A teacher, and old woman, walks between them offering critique and guiding her students.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "lf5i4i5UZKtIzvxR","flags": {},"type": 0,"text": "The trees overhead have had translucent fabric hung from their branches, just barely reaching the trail. It is easy to push the fabric aside to continue. As the trail progresses the fabric changes from white to pink and on through a rainbow of colors.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "m7zss79iUToVqBRv","flags": {},"type": 0,"text": "The trees along this stretch of pathway have had a myriad of wedding dresses fitted to their trunks. Some of the dresses are older, rotting away with mosses and torn by the growing trunk. Some are recent and pristine.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "QsTiTgUNbLLpfGgm","flags": {},"type": 0,"text": "A hundred or so Wands have been stuck point first into the soil at the edge of the trail, making a small field of sticks. Each wand appears to be different in style, and some appear to be affecting the surrounding plantlife with their presence.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "j4DxGNtNBubHWB9K","flags": {},"type": 0,"text": "The trail slopes downward into a field of mostly boulders. All throughout someone has lit incense atop the rocks, creating a strongly perfumed smoky fog along the trail.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "OKocCpSnOw4EOwPw","flags": {},"type": 0,"text": "A large red clay pot has been placed on its side at the top of a nearby creek falls. The back of the pot has been removed to let water flow in, changing the waterfall’s course to flow out of the mouth of the pot, giving the effect of constant pouring.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "7P3KYzxfY9x4CT4Y","flags": {},"type": 0,"text": "Woven spheres of sticks have been placed over sprouting plants along the trail. It appears the intent was to encourage planted vines and bushes to grow into the sphere pattern, but the plants have only just recently begun to grow.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "iehSPfGtzwjXKJgC","flags": {},"type": 0,"text": "A huge tree grows at the bend in the trail, apparently healthy. However a full 2 feet of trunk has been removed, leaving the top of the tree hovering, fully unsupported. In place of the missing trunk, a crystal pendulum is attached to the top part of the tree, hanging down in the center of the would-be trunk. A detailed glyph has been burned into the bottom stump depicting an 8 pointed star with axis for ‘Yes’, ‘No’, ‘Trusted’ and ‘Deceiver’. As people walk by the pendulum moves to point to different areas of the glyph.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "3lRV14mgVNZSFPNw","flags": {},"type": 0,"text": "A tree ahead is blooming out of season. Upon closer inspection at the base of each blossom a silver ring fits snugly. Removing the ring causes the blossom to wither and die.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "jYk3BQAXAylgXEMZ","flags": {},"type": 0,"text": "Ahead the mountain trail gives way down a steep cliff with a descending staircase. Along the way, several man-made turquoise pools of water cascade down into one another from a local spring. The pools each feed into one another and have a submerged bench to seat between 5 and 10. No other people can be seen.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "4vawVgsZLfTqhBAI","flags": {},"type": 0,"text": "You began noticing a few spider webs catching morning dew as you continue. The webbing becomes more and more common and as it does, the strands shimmer with iridescent color. After a while thick and heavy opal strands drape over the trail like blankets. Eventually the webbing fades like it appeared, and the trail is clear again. For the rest of the day, your party is unperturbed by insects.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "QBxfkKgsYsOp4qUv","flags": {},"type": 0,"text": "The trail passes by a clearing with a circle of wagons at the center. The wagons appear to be overgrown and rotting. On closer inspection there are a group of statues of merchants in poses of laughter, trade, or rest. All of them appear happy. Many of the wagons contain small offerings, perhaps left by passing merchants?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "SkdOjGgKkfrLyJbh","flags": {},"type": 0,"text": "Ahead you can clearly see snow falling, regardless of season. The trail passes through the center of a miniature town sculpted from toothpicks. The town is massively detailed, with the tallest 4 story buildings only raising to chest height. Tiny lights have been enchanted in the lamp posts and houses. Snow gently falls here, landing in the soil, but never accumulates more than an inch.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "uNHXxgZgTK5EsEye","flags": {},"type": 0,"text": "The forest ahead is filled with birdhouses of various shapes and styles. Birdseed has been scattered, and birdfeeders hang off from the trail. The whole forest is alive with bird calls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "gvBKpxpE9e8amV7y","flags": {},"type": 0,"text": "You happen across a long bridge spanning a chasm. Glancing to the northeast you see another bridge, made of a fallen tree and much more wild than this one. A procession of elk, deer, wolves and smaller creatures are crossing the bridge calmly together. When they reach the other side you can no longer see them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "vd4fKIVljZTc4YSo","flags": {},"type": 0,"text": "You hear the sound of distant creaking. Perception check to spot, deep in the forest, a structure. Far off the trail is an overgrown sailing ship, sails unfurled and billowing. There is a large hole in the hull. Trees and mosses have overtaken the ship.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "bLcyFp3kNjlcJnNi","flags": {},"type": 0,"text": "The trail opens to a cliff’s edge, overlooking the village ahead, rolling patches of farmland quilt the land below. A tall curchtower rises up from between the wooden homes. A gust of wind pulls across the land, making a ridge of bowed plants and curling the smoke from the chimneys.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "pxsrMFekM3R7tv8l","flags": {},"type": 0,"text": "A pair of gigantic antlers are arched over the trail, over the party’s heads with room to spare. Glistening strings with blown glass stars have been hung from various points on the antlers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "h4ZFvvqwFLUDV6Vp","flags": {},"type": 0,"text": "The trail peters out over an open field, several groups of locals are scattered in the grasses on blankets, eating and laughing. The groups appear to be friends and families, with many children running and playing. Tonight the Northern Lights are expected to make a great showing, according to the local wizard, and people are already arriving to get good seats.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "602Apep7fhA40bSD","flags": {},"type": 0,"text": "The trail passes by half a stone face carved from a boulder, Just this half of the face is taller than any party member. A mile down the trail, the other half of the face. Farther still, a hand holding a sword hilt and the broken fragments of sword. Then another hand holding onto a lantern the size of a small house, lit by some magical force. The plant life around this lantern has withered to dust. At the center of the next village is a massive stone platform.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "M2nBenXd59iF6Z4g","flags": {},"type": 0,"text": "Paint marks on the trees of this forest come together from one specific viewing angle to form the portrait of an elf, from all other angles the paint simply looks like a chaotic mess.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "Kw4f2cTv6UVZCDXG","flags": {},"type": 0,"text": "The trail passes by a circular mirror which is being held from behind by a statue. The Statue depicts a man in a cloak with an impossibly long neck and the face of a barn owl, peering over the top of the mirror and gazing at itself.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "Xn4VKPKCvEpEN0Jz","flags": {},"type": 0,"text": "Along the trail are spheres of iron, hollow on the inside about 2 feet in diameter. The iron shell has been cut out to show a forest scene made in metal, each sphere has a different scene. Someone has set a campfire inside each. The fire on the inside of the sculpture backlights the iron cutouts, and lights the trail.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "wvOHOw0JXbRXmkwC","flags": {},"type": 0,"text": "Someone has placed dress forms along the trail. Over time the forest has re-claimed the dress forms. Mosses drape over some, vines crawl up others, flowers have bloomed around the base of one, making a very impressive neckline. Each mannequin seems to have grown a beautiful dress or suit.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "LLTdWa3uOPj3sJ3m","flags": {},"type": 0,"text": "Several tree trunks have been stripped of all branches and bark. Faces and animal forms have been carved into the remaining wood, still rooted to the ground.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "d8QhMPgSz0YMveNl","flags": {},"type": 0,"text": "In the lush green forest a massive circle of obsidian, about 20 feet across, has been placed just off the trail. It is elevated off the ground about 2 feet, held up by wrought iron legs. A recent rainfall has filled the slightly concave surface with perfectly smooth reflective water. After looking for a moment, a drop of water falls from a tree, disturbing the smooth surface.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "N06L78Z7rXSkE6IO","flags": {},"type": 0,"text": "Rather than building a bridge over the top of this stream, someone has tunneled underneath. Inside the tunnel is lit by a cluster of luminescent moths.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "CZRCiQNalJCNKu3P","flags": {},"type": 0,"text": "The forest seems to be recovering from a fire, perhaps one or two years prior. In the wake of the fire someone has come through with colorful translucent resin, pouring it in the cracks of half burned trees and logs and reshaping the portions that has been burned. With the returning overgrowth the forest appears bright and surreal.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "SYtcQ54YkuJXHa7A","flags": {},"type": 0,"text": "Several animal skulls are piled to the right of the trail. Each one has been delicately carved with an intricate pattern, without losing the structural integrity of the skulls.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "07jbWNvcu6ZNuCp0","flags": {},"type": 0,"text": "At a bend in the trail, just off to the right, someone has placed a perfectly smooth cylinder of white marble, 7 feet tall. Walking around to the back of the cylinder reveals a highly detailed face has been carved into a deep crack in the marble.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "9ZNIOQV9E7FyiP7d","flags": {},"type": 0,"text": "On either side of the trail Two massive stone wings have been placed, reaching toward the sky.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "OzF3f2DMgbOiIpCp","flags": {},"type": 0,"text": "A massive illusionary koi fish swims through the forest trees along the trail. Every so often dipping down to pass right through the party. Each time it does, the air smells of fresh mint.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "NqjF5IWdrE8pZi7t","flags": {},"type": 0,"text": "Someone has taken the heads of old broken shovels and attached them at the base to make a huge metal pine cone. Then they placed it on this trail, for some reason.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "4tI7UmxR9eRxzj2a","flags": {},"type": 0,"text": "At first you think perhaps someone has spilled a bag of coins, but you realize that the scattered coins get more and more dense, almost like a mosaic. For about 10 yards the trail is perfectly paved with coins before the trail peters out again. The coins here appear to be from all different regions, in small denominations. Should you leave some coins to further the trail too?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "MyRtvL5Efu67fbUd","flags": {},"type": 0,"text": "The trail here ha been draped with mosquito netting. In addition to freeing you from the pestering of insects, you also have a chance to see several beautiful moths and butterflies up close from the other side of the net, they don’t seem to notice you while you are in the netting.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "IMNVZfmJPN6LYSUg","flags": {},"type": 0,"text": "A stray dog wanders up to you on the trail and decides to walk with you. He has a red bandanna tied around his neck. After about a mile or so he wanders off again.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "NUz7kxyGQVIzOc98","flags": {},"type": 0,"text": "Passing by a wide stream you spy a stray cat walking into the water. To your shock the water arcs around the cat, keeping it perfectly dry. With a deft swipe the cat snatches a fish from the water wall in front of it, and leaves the stream, still dry, now fed.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "CylnxHsF4fHMkJvH","flags": {},"type": 0,"text": "The trail has become a stone hopscotch board.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "iXgNuTRIHAr7bfMe","flags": {},"type": 0,"text": "You come upon a small decorated sign that reads “the masquerade trail – Speak aloud your costume” The sign can not be passed without speaking a request. For the next 6 miles of trail an illusion of the requested costume surrounds you. Along the trail several other costumed travelers pass.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "CBEJL8mQ2QE6b9Tz","flags": {},"type": 0,"text": "A sculpture of a giant metal key leans against an old tree. It is labeled “Important”","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "NUuS61YrPlPlt579","flags": {},"type": 0,"text": "The trail bisects a white wall, 6 feet high. The wall moves from north to south in a straight line, with no end in sight. Passing through the wall the interior side shows two different scenes, in motion. On the wall running north; a snowy village with several children having a snowball fight. On the wall running south; A bustling city in the midst of a festival. The wall is made of calcite, a Rock that refracts light and images.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "PZPb5c35iVKWLFaw","flags": {},"type": 0,"text": "The path opens up into a field where several gigantic metal rings support celestial sculptures. The Sun and Moon are represented by colorful and bright spheres carved into the faces of two women. Other planets and important stars have their own rings. It appears that the rings move in time with the celestial bodies, accurately depicting their position from the perspective of someone at the center of the sculpture.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "09SSAaYgGftfeVBX","flags": {},"type": 0,"text": "The forest has changed to become meticulously kept, more like a garden than the wilderness. At the base of each forest tree for the next mile is a small table with a bonsai tree, a perfect miniature of the tree it has been placed under. After a mile you come across an elderly man who is tending to a bonsai, not yet quite perfectly matching it respective tree. The Man invites you for a meal and a blessing from the forest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false}],"formula": "1d101","replacement": true,"displayRoll": true,"_id": "zCJzpUnRmAG5Yxb9"}
