{"name": "Cave Skill Challenges","description": "Over 100 skill challenges that the party must face in the deep depths of a cave.Credit: http://dndspeak.com", "permission": {"default": 0},"flags": {},"results": [{"_id": "QeYb6zQ7X5XdueCk","flags": {},"type": 0,"text": "The party comes across a large lake of mud. There are large rocks jetting out of the mud, and the party must make an acrobatics check to get across. If they fall in, they will wake the creatures that live in the deep mud.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [1, 1],"drawn": false},{"_id": "fpB0gjWJUQb3MKkv","flags": {},"type": 0,"text": "The path the characters are taking runs into an underground river. The characters must cross the river to continue. They must make an acrobatics check to keep from slipping on the algae under the water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [2, 2],"drawn": false},{"_id": "sRHVlRJjcAnSkCpb","flags": {},"type": 0,"text": "The party is bottle necked into a wide chamber. In the middle of the chamber is a gash of a ravine traversed by a wooden suspension bridge. Over the two posts on the bridge is the skull. If the players approach the bridge the skull will talk to the them trying to convince them of a contrived price to cross the bridge, trying to convince the biggest threat to it, or the whole group to cross at once. The bridge and the ravine is a mimic, when it reveals itself the gap in the floor peels up to form a wicked smile. This can be run as an encounter or as a skills challenge to notice it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [3, 3],"drawn": false},{"_id": "9cEENQKiOPQycX5Z","flags": {},"type": 0,"text": "There’s a fork in the caverns. A dwarf sits right next to the split. He says that he knows which way isn’t infested with cave dwelling monsters. The party must pull an investigation/intimidation roll to get him to tell them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [4, 4],"drawn": false},{"_id": "LLMXOTGjhOUYTEBV","flags": {},"type": 0,"text": "A large brilliant sapphire sits on top of a stalagmite. No amount of strength will pro it off but the stalagmite can be broken with a strength DC of 18. However if an arcana check is used (or history if a dwarf or familiar with dwarf culture) a DC of 10 will remind the player that gems like this are semi living and to loosen it all you need to do is ask politely.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [5, 5],"drawn": false},{"_id": "rMgyMopxk5kCoJ8A","flags": {},"type": 0,"text": "A rope bridge spans over a bubbling lake. It can only hold approx. 300 lbs. at a time and requires a DC dexterity check of 12 to make over without incident.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [6, 6],"drawn": false},{"_id": "HEVekiuanLBcXB1T","flags": {},"type": 0,"text": "A huge mass of bats with razor sharp wings and fangs fly at the players. Plays can either dodge out the way dexterity DC of 10 if they fail any player with under 16 AC takes 2d4 damage from cuts and bruises and any player over 16 AC takes 1 d4.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [7, 7],"drawn": false},{"_id": "EXim4G293bznUF0U","flags": {},"type": 0,"text": "The party walk into the next room which has an all-consuming darkness light travels less than a foot and character with dark vision cannot even see. All plays with dark vision made a wisdom check or become frightened. (Fights against low-level enemies can become epic battles in rooms like this)","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [8, 8],"drawn": false},{"_id": "uLtRrkVKqAL2IYxF","flags": {},"type": 0,"text": "The lady walks into a room that has a large network of glowing crystals in the ceiling. Any loud noise makes the crystals start falling from the ceiling. Player must make an athletics or acrobatics check to avoid them and not take any damage. DC of 11. Damage taken equals 11 minus roll d4. Players who roll a 1 or would take more than 6d4 damage take 6d4 damage and are trapped under the stone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [9, 9],"drawn": false},{"_id": "g7XTK6f5hENvPt89","flags": {},"type": 0,"text": "Run into a lonely stone golem who is exuberant at having new friends. Party must make a deception check with DC 8 to convince her they will return soon otherwise she will try to fight them if they leave.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [10, 10],"drawn": false},{"_id": "xAlQcf26rplL3ikg","flags": {},"type": 0,"text": "Deep into the cave the party finds a room with polished rooms and an alter with a curved dagger on it. The alter is made of an impossibly black stone that is completely different from the rest of the cave. Along the alter channels are cut that lead to a hole in the ground. After the party enters a stone door slams behind them. Any player who picks up the dagger must make a DC wisdom throw of 13 or be compelled to try and sacrifice one of the other party members until they drop the dagger. Behind the alter is a switch that will open the door again but because of limited oxygen the party only has 2 minutes until they start suffocating.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [11, 11],"drawn": false},{"_id": "3ZOrqKZ6W44FLHtW","flags": {},"type": 0,"text": "The cave is lined with sharp, jagged crystals that protrude from the walls. The PC’s must make a Dex check to see if they can maneuver through, otherwise they take slashing/piercing damage (small characters have advantage, large characters have disadvantage). The crystals can be smashed, but that makes noise, potentially alerting enemies in the area.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [12, 12],"drawn": false},{"_id": "jKGuM6QqmDG6enzI","flags": {},"type": 0,"text": "Spaces too tight to walk through, so players must use acrobatics to squeeze through (heavy armor gives disadvantage, small characters have advantage). The gap could be widened by pulling aside stones, but that gives the chance of triggering a rockslide or cave-in. Narrow ledges that must be balanced along above a steep drop.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [13, 13],"drawn": false},{"_id": "MOw6vWaYnQSGpMj9","flags": {},"type": 0,"text": "The party enters a cave that is dimly lit but they can still see enough to know their surroundings. The problem with this cave is there is some sort of essence that makes all noises 4X louder, the noises from the party talking are enough to echo throughout the cave at a booming sound. This booming sound shakes the ceiling causing the large sharp rocks to fall from the ceiling down toward the party. If the character is hit, they take 1D6+3 damage plus a bleeding effect.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [14, 14],"drawn": false},{"_id": "bTrkKbfk3eaXW2Yr","flags": {},"type": 0,"text": "DC 15 knowledge (nature) identifies bioluminescent worms in the wall, and the trigger for their glow, which is a gas that can occur naturally from vents or from somewhat decayed flesh.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [15, 15],"drawn": false},{"_id": "RYRgQRG2BFxWuAxQ","flags": {},"type": 0,"text": "DC 10 Constitution check to resist cough from dust inhalation; failure grants a temporary -1 to strength.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [16, 16],"drawn": false},{"_id": "ygeLlP7beb1nmQyn","flags": {},"type": 0,"text": "An entrance is made out of what appears to be a giant dragon head. To enter you’ll need to pry open its jaws with a strength check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [17, 17],"drawn": false},{"_id": "4cJjJ0uDWksL9GUW","flags": {},"type": 0,"text": "A locked doorway with the figure of a good aligned deity carved into it is built into the wall. The players must present a holy symbol of the deity or must provide the proper prayer to open the door. A DC 15 religion check is required to know the prayer, with any characters who are followers of the deity having advantage. Clerics of the deity automatically succeed. Behind the door is a small, unoccupied sanctuary that allows your character to rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [18, 18],"drawn": false},{"_id": "d23mVnLJATJ1Qqdq","flags": {},"type": 0,"text": "A still, 30ft wide pit of non-Newtonian fluid blocks the way. Any character that has to dash across to make the distance (i.e. anyone with a speed less than 30) does not have to make a check. However, any character that attempts to walk across normally has to make a DC15 Dex check or be sucked down into the pit, triggering a series of Strength checks with increasingly difficult DCs (similar to quicksand).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [19, 19],"drawn": false},{"_id": "iEflRyQeWj0qOhTu","flags": {},"type": 0,"text": "A cloister of flumphs block the way. They want to test how good and pure your heart is. Good-aligned players roll 1D20 with advantage to pass a charisma check. Neutral players have advantage as well. Evil players have disadvantage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [20, 20],"drawn": false},{"_id": "Tsxiz7qlKacuIuUQ","flags": {},"type": 0,"text": "An aggressive Owlbear blocks your way. Use animal handling to make it let you pass. Or fight it if you want…","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [21, 21],"drawn": false},{"_id": "qFyuh8PvgTPAgf9V","flags": {},"type": 0,"text": "A toxic/flammable gas is seeping from the walls. If the players use any fire spells or even when fighting the sparks could ignite the flammable gas.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [22, 22],"drawn": false},{"_id": "hO2re2WzKshfDTJ4","flags": {},"type": 0,"text": "Unstable stalactites fall from the ceiling of the cave and players have to make a Dex save to dodge the falling debris. The save and damage depends on size of stalactite and height it is falling from.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [23, 23],"drawn": false},{"_id": "PWaoFtxqbA3GN3T8","flags": {},"type": 0,"text": "The floor is literally lava. There are points to hop across (acrobatics) and an invisible rope lattice (investigation) one can hold on to. Anyone falling in gets burned!","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [24, 24],"drawn": false},{"_id": "ObcsqUSUwQElp1eN","flags": {},"type": 0,"text": "There is a fork with two statues. ‘One lies, one tells the truth’ is written above them. In fact, both statues always lie.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [25, 25],"drawn": false},{"_id": "MjKiEnKm9JHRvGhD","flags": {},"type": 0,"text": "A large dance hall has been carved out of the cave, with stone statues standing still in the middle. As soon as one of the adventurers steps onto the floor, music starts up throughout the hall, and the statues begin to whirl about the floor. The room is dangerously trapped, and the traps can only be avoided by dancing along to the music (Acrobatics or Performance check). A successful intelligence check to recognize the pattern allows the check to be made at advantage, and a bard may grant the rest of the party advantage by recognizing and calling out the beat with a performance check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [26, 26],"drawn": false},{"_id": "SY3ENKWQWnDtdeEi","flags": {},"type": 0,"text": "A great chomping mouth holds a small magical chest. The chest can be removed without damage by a successful sleight of hand check, or the mouth can be made to laugh (persuasion) or shriek (intimidation) in order to keep it open. A failed check means a crushed hand.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [27, 27],"drawn": false},{"_id": "5RWR4M8XGCEWBmI6","flags": {},"type": 0,"text": "A great stone owl blocks the way. No party member can pass without imparting a piece of knowledge the owl has never heard- this can be any intelligence check besides investigation. Party members are not allowed to share, although anyone knowing thieves’ cant or a pair making a successful deception/perception roll can roll for each other.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [28, 28],"drawn": false},{"_id": "eoJdapMo6PgIhTbN","flags": {},"type": 0,"text": "You find yourself in a great warren of tunnels. A successful Survival check (hard DC) allows you to find your way through. An insight or investigation check shows that the tunnels are patterned after blood vessels; a medicine check can then be made to have advantage on the survival check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [29, 29],"drawn": false},{"_id": "7kuVkBUSLUcw9hN5","flags": {},"type": 0,"text": "A mass of fungi grows on all sides of the tunnel. Anyone brushing up against the fungi releases a cloud of spores; everyone within 5 feet must make a constitution save or take 2 levels of exhaustion. A party can step carefully through without disturbing the spores (acrobatics); alternatively, a Nature check reveals that the spores’ effect is neutralized by sufficient alcohol consumption.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [30, 30],"drawn": false},{"_id": "Tx2m9IqwFHe03wgb","flags": {},"type": 0,"text": "A group of otyughs are happily feeding in a pit of garbage. The party can sneak by (stealth), try to parlay with them (persuasion), attack them (combat) or pass along the thin side of the pit without descending in (acrobatics).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [31, 31],"drawn": false},{"_id": "U7HNd2biKSW8BVoo","flags": {},"type": 0,"text": "The tunnel vertically splits suddenly, with the top portion a good eight feet above the sloping floor. A successful athletics check is required to jump and haul oneself up (assuming one can jump the requisite height). There are the remnants of a ladder on the side of the top tunnel.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [32, 32],"drawn": false},{"_id": "X8bga2JLFKv3PwU4","flags": {},"type": 0,"text": "A strange blue gas comes out of a crack in the earth. If it catches a character, it leaves them extremely depressed- they are unable to use any charisma-based skills or spells and have disadvantage on other checks. A successful performance or persuasion check can cheer them up, as can any player who can think up a clever and witty enough pun.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [33, 33],"drawn": false},{"_id": "exiD0DXeyXS3sXAR","flags": {},"type": 0,"text": "Someone has abandoned a half-orc baby in this cave. You must make an animal handling check (using charisma instead of wisdom) to keep the baby calm and happy. Afterwards, a successful persuasion check will get someone to take the baby in.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [34, 34],"drawn": false},{"_id": "Kvi2CMBDCa6iLO8O","flags": {},"type": 0,"text": "Flames and smoke belch from cracks in the earth. A Nature check allows you to time the eruptions and avoid them; alternatively, acrobatics lets you leap out of the way just in time. Dwarves have advantage at either.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [35, 35],"drawn": false},{"_id": "l0Cs323fk1cihHnb","flags": {},"type": 0,"text": "A recent cave-in has lowered the ceiling of the tunnel, requiring an acrobatics check (small creatures have advantage).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [36, 36],"drawn": false},{"_id": "NeGW2IUtZCYhJpwe","flags": {},"type": 0,"text": "A very hungry, yet affectionate dog wearing an ornate collar approaches the party during their foray into the cave, either during a short or long rest, or at a point where there might be the smell of cooking meat (burned kobold works too) or other food. Animal handling check of DC 10, along with a morsel of food of any type will have the dog follow the party (a DC check of 15, if no food is available or given). The dog will follow the party and help them in the event of a crossroads/puzzle/maze, in which case the dog will help the party pick the path that leads away from danger (or toward the lesser of two evils). The dog will depart at the start of combat unless a party member succeeds at a DC 18 animal handling check. If a nat 1 is rolled during any of these checks, the dog will steal an item (maybe food related?) or attack a party member before running away. If a nat 20 is rolled, the dog will assist in all subsequent combats.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [37, 37],"drawn": false},{"_id": "GzfhviY2RglcMDgA","flags": {},"type": 0,"text": "An apparent dead end has a full- length mirror on one side. In the mirror, the party members see themselves laughing and mocking them. The mirror, if broken, reveals a stone wall behind it, but reforms in moments, with the mirror party still mocking derisively and making amusingly insulting gestures. A successful intimidation check causes the mocking reflections to flee, whereupon the mirror is revealed as a doorway to another room.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [38, 38],"drawn": false},{"_id": "UHeGnn1L6SMkg0UP","flags": {},"type": 0,"text": "A hall of statues sits before you, all of different historical figures from a bygone era. A history (or bardic knowledge w/ advantage) check reveals one of them was a thief famous for finding hidden passages in the palace and robbing the treasury. Moving his statue causes a rope to a secret treasure room to fall.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [39, 39],"drawn": false},{"_id": "7HFeUDR7sc6xDZIQ","flags": {},"type": 0,"text": "A doorway in the side of the tunnel is strangely opaque. The doorway is ornately carved. An investigation check reveals that there is writing in (choose appropriate language for your cave): ‘Never Send a Clever Mind on a Fool’s Errand.’ Anyone who walks into the opaque doorway finds a large library atrium. It is richly furnished, with shelves of books extending high into the air. In the middle of the room is a large cage, surrounded by a moat. Inside the cage is some yummy stuff (choose gold, magic items, a McGuffin, something your party wants). The only way across the moat is a bridge, which has Very Obvious magical traps on it (think glowing, fiery runes and obvious wards). Any party member who either makes an Arcana check or speaks aloud about the traps (i.e. ‘what do those runes do?’) Is surprised by a book flying off of a shelf and settling on a table, which scoots over in front of them. The book is a compendium of information about runes and runecraft. Any question or desire for information of any kind is met with a similar reaction- an appropriate and highly useful book flies off the shelf and lands for perusal. Here is the kicker: the only way to get the stuff inside the cage is to walk straight through the runes and traps and open the (unlocked) cage door. Any other attempt is frustrated in a way that seems like you need a liiiiittle more information. To get OUT of the room, however, takes an insight save. The whole room is enchanted, and one cannot leave without making an appropriate insight check. Anyone with any skill proficiency in an intelligence-based skill makes the check at Disadvantage. If the party is able to somehow break the enchantment, they find the room is dark and ruined. All of the books are tattered and filled only with meaningless scribbles. There are a few dead adventurers (mainly wizards) in the room, still seated at tables, with stacks of books at their fingertips. There might even be a still-enchanted emaciated elf at one table, cobwebs growing around him as he searches for that last bit of knowledge. Everything learned from the books is illusory and is forgotten when you leave the room.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [40, 40],"drawn": false},{"_id": "5EZPIKyv7nacQ5lz","flags": {},"type": 0,"text": "DC 10 Nature Check reveals Ormu, a common yet bioluminescent moss. 15 or above reveals that following the patches of Ormu can lead to more rare and useful Fire Lichen. Follow the moss to a crack that small creature could fit through (or a DC 15 Athletics Check). The cave beyond is filled with Lichen but also has a lava swell passing through it. Every minute spent in the cavern requires a DC 15 CON save or take 1d8 fire damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [41, 41],"drawn": false},{"_id": "2900NcKY8TJRNQQi","flags": {},"type": 0,"text": "You come across a deep underground lake. In order to cross, you must steer a friendly but blind and hard-of-hearing giant tortoise that can ferry you across. To avoid yelling and attracting unwanted attention, a system based on touch is established. Failing an Animal Handling check will steer the tortoise in the wrong direction (toward rocks, other creatures, or even down into the water) or make him change his mind about helping you.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [42, 42],"drawn": false},{"_id": "VRvTFFkQRzAuoeTW","flags": {},"type": 0,"text": "A cave bear cub approaches you. You notice its mother sleeping not too far away. Any interaction you make with the cub requires an Animal Handling check to make sure you don’t upset it and wake its mother.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [43, 43],"drawn": false},{"_id": "hIVonjTRpn1NDAbA","flags": {},"type": 0,"text": "The mushrooms growing in this tall wet cavern reach up to the ceiling on tiny, spindly stalks. The caps are wide, some spanning to 5 feet, and each one is populated by an ecosystem of bioluminescent bugs. The stalks reach up overhead 10 to 20 feet high, but the diameter of the stalk is merely a few inches. Damaging any of these mushroom stalks causes them to collapse under their own fragility. Dex save DC 15 when moving through to avoid toppling the ecosystem. One mushroom cap deals 1D2 damage, but toppling one likely topples the rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [44, 44],"drawn": false},{"_id": "O71DKHKKtUA6YJhi","flags": {},"type": 0,"text": "The walls begin to bulge inwards and you start to notice large round stones littering the way forward. Continuing on is difficult terrain just due to the sheer number of round stones. After several minutes of struggling you come upon a clearing where several hammers and cracked stones are laid out on a blanket. Each round stone is a geode, able to be cracked with the hammer (Strength DC 12). They are beautiful, but cumbersome.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [45, 45],"drawn": false},{"_id": "1rz77av1pkzZcITu","flags": {},"type": 0,"text": "Someone has carved out a lattice roof to cover this section of path. From it the moss ‘Old Man’s Beard’ grows, hanging down long white tendrils. Small round lanterns have been hung in between the mosses, but they are unlit. Nature check DC12 to determine the medicinal properties of this moss – allowing the party a free hit die of healing on a success","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [46, 46],"drawn": false},{"_id": "sLDCax3dmRDMEMv7","flags": {},"type": 0,"text": "A geyser erupts every few minutes along the path side in this cave. It strikes the low ceiling, just as it has been for hundreds of years. A sizeable hole has formed in the stone above where the water strikes, and now, when the water strikes the top, the hole forces the water to flow down in a scalding rain over the path. The party will need to dodge the scalding water with Athletics (run right through) Acrobatics (time it well) or some other appropriate skill or suffer 1D10 points of burning damage","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [47, 47],"drawn": false},{"_id": "C00AT3jm0ExFXHb0","flags": {},"type": 0,"text": "The natural tunnel is bisected by a subterranean ice flow. Some time ago, perhaps years, the ice was carved through by some adventurer to continue on to the rest of the tunnel, but the slow moving ice has pushed that tunnel down-flow. The entrance of the tunnel is no more than a foot and a half wide, and will need to be cut to accommodate anyone larger. The ice tunnel beyond is spacious, but the exit, once again, is tight. Small creatures pass right through. Medium Creature must succeed a Dex save DC 12 to squeeze past both the entrance and exit. Large creatures or creatures that failed their Dex save must pass a DC 15 Strength check to break the ice. Failure to do so makes the party spend 1 hour clearing out the ice.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [48, 48],"drawn": false},{"_id": "GrOY26EKauJsNcws","flags": {},"type": 0,"text": "The tunnel is cut by a fissure in the stone, one-foot across, and spanning into the stone an unknown distance. The fissure is well lit by a magma flow running down one side of the fissure and along the bottom, but the magma is at least 10 yards away from the tunnel and poses no risk. The heat causes strong winds to blow through this fissure and through the tunnel. The jump across is easy. DC 5 Athletics or Acrobatics.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [49, 49],"drawn": false},{"_id": "luxyVVXyi89WiAyn","flags": {},"type": 0,"text": "A huge fungal colony pours poisonous gas into this chamber, and myconid spore servants rise to attack you if you dare enter. With enough wind and speed, you may clear the passage, but burning the fungus only fills the corridor with a too-thick cloud of poisonous smoke, blinding you. Careful not to trip on the skeletal arms grabbing your ankles, or you may join them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [50, 50],"drawn": false},{"_id": "L6mSAjNJGFFpaH28","flags": {},"type": 0,"text": "The party enters a room filled with statues. The statues move around when not being watched (stealth with advantage). If it is pointed out loudly to them, the statues shamefacedly return to their positions.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [51, 51],"drawn": false},{"_id": "v0MBsQXhRw20Hsrr","flags": {},"type": 0,"text": "A completely submerged passage of unknown length. Players can attempt to swim through it to the other side with a swim skill check, and a fortitude saving check if they do poorly on the swim check to see if they are at risk of drowning or panicking. Two or more adventurers who score above a 15 can retrieve a failing adventurer and assist them across and a health check allows them to revive them on the other side. The only danger is drowning but the length of the passage is far longer that most adventurers would feel comfortable traversing. An augury spell would not indicate that crossing the passage would spell disaster, excepting for some terrible rolls. Party members have to take a penalty for heavy armor. No hostile creatures inhabit the passage, but large fish could brush against the players in the dark and bioluminescent life can illume motes in the water also giving the adventures some indication of their surroundings and some exotic weird underwater life that appears largely uninterested in the party. If you are feeling kind, perception checks can allow the players to spot breaks above them where they might find pockets of air. Or maybe catch a glint of a trinket on the floor.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [52, 52],"drawn": false},{"_id": "BaJUEmwJvWOVFbnL","flags": {},"type": 0,"text": "The Sphere Pit – A large, open area filled with brightly colored spheres about the size of an elf’s fist. The spheres fill a pit approximately 30 feet in diameter. The spheres are tightly packed, such that anyone with the requisite speed (40) can run straight across the top without sinking in; anyone else can traverse the area with a successful swim check. Anyone in heavy armor sinks to the bottom of the pit and can walk along the bottom.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [53, 53],"drawn": false},{"_id": "A7RmSYgUwgJhfLRu","flags": {},"type": 0,"text": "The Immortal Court- Whoever is most wounded of the party (or whoever you as the DM feel would be most fun) suddenly dies (no save). As the rest of the party reacts, a portal opens and pulls them into a strange, richly furnished courtroom, filled with strange and shadowy beings. The dead party member is seated at one table near the front of the room, and as the rest of the party enters, they are allowed to pass through to seats near them. Seated next to the party member is an angelic version of them; at the opposite table, a fiendish version sits. Seated at the end of the room are three-cloaked figures- one in White, one in Black, and one in Gray. The gray one bangs a gavel and commands the prosecution to begin. The fiendish version stands and begins to recount the party’s crimes, with emphasis on the party member’s involvement in anything questionable or wrong. After this, the angelic version stands and gives a defense of the party. The fiendish version then begins calling witnesses- think a bandit the party killed, dead former party members, the members of a town they burned, or as appropriate. The angelic version then calls members of the party as witnesses in defense (have them make performance checks, with bonuses or penalties for the quality of their explanations). Before judgment is announced, however, an angelic messenger appears with a note, which is handed to the judges. They read it in silence, and then announce that the case is to be continued. There is a flash of light, and the party (including the ‘dead’ one) finds themselves back in their previous location. If the case was going well, i.e. the evidence seemed to point toward the more angelic side, the whole party (and especially the one on trial) get some buffs (they are, for example, under the effects of the bless spell). If, however, it was not going well, the one on trial feels a subconscious dread, affecting them like bane. These effects stay until the next long rest.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [54, 54],"drawn": false},{"_id": "S2uS76CKNjPY9jzL","flags": {},"type": 0,"text": "A long hallway adorned with paintings of faces going down the hall, the further you go the more unnatural and disturbing the paintings become. Role to not enter a state of paranoia for the duration of walking trough the hallway.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [55, 55],"drawn": false},{"_id": "V6eg01zUZ2HyDlYz","flags": {},"type": 0,"text": "The party finds an old necromancer’s cave. It is set up like an underground tavern. There is a large stage and rows of seats filled by skeletons. The party must step on the stage and make a performance check if they want to get the necromancer’s treasure. If they fail the check the skeletons attack them, if they succeed a skeleton comes from the bar and gives them the necromancer’s treasure.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [56, 56],"drawn": false},{"_id": "576cROnCApCqyOPG","flags": {},"type": 0,"text": "A subterranean lake has filled a low point of the tunnel waist-deep. The water is slightly acidic, but otherwise harmless. Don’t tell your partners so, though. See what they do.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [57, 57],"drawn": false},{"_id": "Vhl5grG9xWRCbXuR","flags": {},"type": 0,"text": "The bottom of the tunnel has been illusively made to look like a bottomless pit. A narrow strip goes across the middle, covered in spikes. Walking on the narrow strip means 1 piercing damage every 10 feet and requires an acrobatics check. Anyone falling off is, of course, totally fine on the floor of the actual tunnel.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [58, 58],"drawn": false},{"_id": "JIw7FP5BWNgEB0nA","flags": {},"type": 0,"text": "Swarms of clot flies come buzzing up through the cavern. The clot flies fly directly at anyone who has taken damage that could result in wounding (not psychic or poison or radiant, probably, but slashing or piercing or fire, etc.). The clot flies seek out the wound to feast. Anyone so targeted must make a constitution save or be sickened for 10 minutes. Regardless of whether they save, a targeted character gains 2 hit points as a result of cleaning and disinfecting agents in the flies’ saliva.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [59, 59],"drawn": false},{"_id": "u7e82Wx56HIccadP","flags": {},"type": 0,"text": "A roost of twenty blind cave basilisks are hibernating. Can you sneak by?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [60, 60],"drawn": false},{"_id": "ST8xHcaazZUnLh7o","flags": {},"type": 0,"text": "A series of mirrors from an opening in the cave system shine a light down into the depths. The light gets amplified by the dozens of mirrors until it hits a focusing crystal array and launched downwards through a vertical mine shaft that has a steady stream of steam pouring up. Can you avoid getting burned by the beams?","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [61, 61],"drawn": false},{"_id": "vFXz2Q3ABXvkJOiS","flags": {},"type": 0,"text": "A ten foot closed fist of stone near a waterfall holds a key at the bottom to a great stone door. You either divert the waterfall or send a small party member down into the fist to retrieve the key.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [62, 62],"drawn": false},{"_id": "u1zoz75ZizNMaggz","flags": {},"type": 0,"text": "A Dire Toad hops out at the party. If there are any females (or male elves) in the party, it announces in common that one of them (roll randomly) is the one they have been waiting for to kiss them into their true form.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [63, 63],"drawn": false},{"_id": "thrBneYoCPvngbVn","flags": {},"type": 0,"text": "A gigantic skeleton (possibly a fossilized whale) is embedded in the floor. Causing interesting time negotiating the passageway. Also can present skill challenge to identify the type of creature.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [64, 64],"drawn": false},{"_id": "eLF3U8FpMrPhoKQK","flags": {},"type": 0,"text": "In one of the tunnels in this cave your party will encounter a barrier of gelatinous matter, the color and consistency of bile. It stretches wall-to-wall, floor to ceiling, but doesn’t appear to be dripping, sloshing or behaving in a way befitting of ooze. If the party wishes, they can try to pass through it. It will part with relative ease and only takes up about 10 feet of this tunnel, but if they fail a DC 15 constitution/fortitude save, they gain a random disease. Alternatively, they can use a DC 15 nature check to determine the properties of the substance (i.e. the disease it carries), a DC 15 arcana check to see what might be effective against it (cold damage, or whatever fits your campaign), a DC 15 medicine check to take a sample and examine it (find the disease), or a DC 15 athletics check to see if they can run through it without getting infected (minimum 20 ft. speed).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [65, 65],"drawn": false},{"_id": "JBKQiHy7Jk9mU8jO","flags": {},"type": 0,"text": "An army of goblins has chased the players towards the edge of a pit, where a giant stalactite hangs, which looks loose. The players could try and somehow trick the goblins to fall in, but another option is make an athletics or acrobatics check to jump onto the stalactite, which will begin to fall when all the players grab on. They must make an athletics check to hang on while it is falling. The DM can determine how deep the pit is and scale it to the players HP.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [66, 66],"drawn": false},{"_id": "cKr3KRezHcWSdJ9y","flags": {},"type": 0,"text": "Golems made of diamond are slowly beginning to form. The players have to find ways to prevent them from growing and starting a high CR encounter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [67, 67],"drawn": false},{"_id": "nk71BhD6jgVw0zno","flags": {},"type": 0,"text": "One section of the cave has acidic slimes dripping from the ceiling. Successful travel through the section requires either a succeeded perception skill check of 15 or higher, or a dex save skill check of 10 or higher. Failure of both instances results in the player taking 3d6 acid damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [68, 68],"drawn": false},{"_id": "qtVL3yKSbGfBjQ5y","flags": {},"type": 0,"text": "If the party is traveling though the cavern at nighttime, they encounter a section where far above, the ceiling opens to the sky. There are stars aligned in such a way that it creates a glowing ray of light into the room. A successful Arcana roll of 15 or higher informs the party that any spells of 1st level or higher cast inside the ray of light will heal the player for 1d4 healing. This effect ends permanently after the first sunrise.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [69, 69],"drawn": false},{"_id": "H9rdyMNtgEPPNRBQ","flags": {},"type": 0,"text": "The party encounters a natural magical rock and gem formation that damages the players with lightning if they walk past it. A successful Arcana check of 10 or higher informs the player that any spellcaster walking past the rocks will complete a magical circuit and cause the electricity. The gems can be mined from the rocks for 50 gp worth of uncut gemstones.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [70, 70],"drawn": false},{"_id": "tMCuGsiGfJ3Y2Cx7","flags": {},"type": 0,"text": "A cave-in occurs, blocking the entrance/a point behind them. If under, it takes a DC 12 Athletics or acrobatics to avoid the falling rocks or take 3d6 damage. The party can either press on or make a DC 20 athletics to remove rocks over a 3-hour period.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [71, 71],"drawn": false},{"_id": "FniKN0sBBa5U9H0l","flags": {},"type": 0,"text": "The party finds a burbling spring flowing into a pool that appears to be just shallow enough to wade across. There is a skeleton in the pool with something glinting on its still clenched hand. The pool its self is actually a clever semi transparent magnifying illusion over a deep pit approximately 150ft deep with the skeleton at the bottom. Attempts to reach in and grab the skeleton give the impression that they are not reaching deep enough tricking people into falling in. An intelligence check (DC 17) is made to realist that the spring cannot exist there geologically. If they pass the illusion fails for them and they can see the pit and its contents. The glinting object is a Ring of Water Walking.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [72, 72],"drawn": false},{"_id": "TEQYkr50mUmWrQSo","flags": {},"type": 0,"text": "Players come across a very large birdcage hanging from the ceiling, in it is a skeleton of a Roc. DM needs to roll a secret Perception check. Success they smell gas, failure they start taking 4hp of damage from poison gas but don’t feel it until 50% of health is gone.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [73, 73],"drawn": false},{"_id": "a02KwYNTBWdwnpuw","flags": {},"type": 0,"text": "A particularly fast-growing strain of razor-sharp ‘golden’ needles and ‘thread’ react to the presence of living, organic matter within 30 feet. Able to ‘lunge’ or ‘fly’ 2d6 feet per round, the needles seek out soft, fleshy bits and pierce them, dealing a fair amount of damage on contact. The metal needles are poisonous to life, but actually drain magical energy from creatures in this way, converting positive energy to matter, as a way to reproduce and spread. With proper study, magical and alchemical prowess, and a fair bit of danger, the needles can be collected and refined into actual gold. Consider treating the needles as Striges.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [74, 74],"drawn": false},{"_id": "D6IHX2KRpWCa7NXP","flags": {},"type": 0,"text": "A sweet, soft smell fills a corner of the cavern, centered on a large underground swampy area. Anyone coming within 40 feet of the area must make a DC 14 Wisdom saving throw or be compelled to walk closer to the area and into the range of a giant pitcher plant, which attempts to swallow anyone of medium size or smaller. Anyone swallowed by the plant takes 2d6 acid damage each round. A character can escape with a DC 12 Athletics check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [75, 75],"drawn": false},{"_id": "xBDt8ZieLNx0duS8","flags": {},"type": 0,"text": "A pack of rust monsters have taken this part of the cave as their home, and will attempt to devour any metal or coins that get near them. When defeated and examined, the rust monsters have developed bands of precious metals in the carapaces, allowing adventurers to try to scavenge some. A successful nature check allows for more precise extraction of metals, otherwise adventurers have to drag 100+ pounds of scrap metal if they want to spend time refining it.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [76, 76],"drawn": false},{"_id": "w2WI6EyxZbEaULnj","flags": {},"type": 0,"text": "A pit of lava with stepping-stones. Players succeed a DC 10 Dex check to cross, or take 3d4 burning damage. A DC 7 Perception check reveals a much easier path that is infested with spiders, requiring a DC 5 Fortitude/Con save (whichever is preferred) to pass through unharmed. If failed, the victim takes exactly 1 poison damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [77, 77],"drawn": false},{"_id": "K2MxJpScwZaRDjhG","flags": {},"type": 0,"text": "An old door covers the entrance to the next room. It has no visible hinges; it has a handle, but has ‘Push’ hewn on it in Terran (‘KROKTH’ or your own word). It is unlocked, but stuck, taking a DC 14 strength check to unstick if pushing. If pulling, one must pull the entire door out of its hinges, requiring a DC 30 strength check.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [78, 78],"drawn": false},{"_id": "i68J3Hk1urBqpZNY","flags": {},"type": 0,"text": "A heavily stylized image of a god with an altar in front of it, recognizable with a DC 16 Religion check. Leaving an offering appropriate to the god depicted results in a blessing/reward of the god’s choosing.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [79, 79],"drawn": false},{"_id": "VLz3IplofjXA1FC7","flags": {},"type": 0,"text": "A long passageway with bioluminescent mushrooms growing on the walls. These mushrooms visibly release spores and smell terrible. A DC 15 nature check must be passed in order to determine what kind of mushroom they are. If the check is passed it will be revealed that the mushrooms are a rare kind and very sought after because the stems can be used as a ingredient for many types of potions and can fetch for a decent sum of gold in large amounts (the amount people will pay for them is up to DM’s discretion). Unfortunately the mushrooms release large amounts of flammable and poisonous spores. If the party has any lit torches or anything similar the spores will catch fire and the party will take 1d10 or 2d8(DM’s discretion) fire damage. If they don’t then they must make a DC 15 constitution saving throw or they will fall asleep and might get attacked by the monsters that make these caves their homes, holding their breath and/or sprinting through the passage will either nullify this throw or give the party advantage on it (once again up to DM’s discretion).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [80, 80],"drawn": false},{"_id": "JuQBmLFC8B4lNjmR","flags": {},"type": 0,"text": "This cavern has a hole in the floor and the roof, both about 5 feet across. As the party enters the room they see a chest fall from the roof through the floor. Looking into the pit just reveals inky blackness that no light or darkvision can penetrate. After about 30 seconds, the chest falls from the roof again. Anyone in the way will be struck and must succeed a dexterity check or be knocked into the hole, where they will continue to endlessly fall along with the chest until either are retrieved or they make much harder dexterity check to catch the floor as they fall past.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [81, 81],"drawn": false},{"_id": "WCDVQtAfCHSpH26S","flags": {},"type": 0,"text": "The party enters a huge room. The walls are decorated with elaborate paintings of animals, and three 5 feet squares on the floor have animal paintings too – an owl (int), a bear (str), and a hawk (dex). Above the door in the other side of the room (about 100 feet from the squares) a sentence is written in celestial (or any language you’d like): ‘Your strengths will be tested. Your restrain will be tested.’ if an entity with over 16 in the corresponding stat step into the square, they are incapacitated, blinded and silenced. If all 3 squares are activated, the door to the next room will open. If they break any of the square’s magic (DC 17 dispel magic roll, -1 for each extra level of dispel magic) the door opens, but the room is flooded from that door, and they need to swim their way against the current to get to the next room.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [82, 82],"drawn": false},{"_id": "ijBi6HaHNf7FNeBC","flags": {},"type": 0,"text": "The party realizes that they have been setting up camp every night in the same spot they camped the night before. No matter how far, how fast, or in which direction they travel, they always find themselves setting up in the same spot. A successful Investigation check reveals that cunning stonework walls are being shifted throughout the cave system, leading them away from their goal and back to their campsite (dwarves/gnomes/other industrious races have Advantage on this check). A successful Wisdom check reveals that they have entered the outskirts of an Illithid community. Psychic suggestions have been put in place to keep potential thralls in a loop until they can be captured.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [83, 83],"drawn": false},{"_id": "e4KKfhD5KL7eCcyF","flags": {},"type": 0,"text": "The party encounters a [insert appropriate Challenge Rating monster] that is acting oddly until it notices them. It turns to face them and swings between attacking the party and asking for help. A successful skill check (Intimidation/Persuasion to make the monster back down, Investigation to notice an odd detail, Arcana to feel the residual magic energies, etc.) reveals that this monster is a mostly-Polymorphed being originally of a ‘good’ race. A wizard’s experiment turned it into an unwilling monster. Unwillingness to investigate further leads to a challenging combat encounter.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [84, 84],"drawn": false},{"_id": "M2tzWj8CEsTjJsKU","flags": {},"type": 0,"text": "The characters come to a dead end with a ghost. The ghost has the ability to open the dead end up to the rest over the cave, but says he isn’t in a good mood. The characters must make a DC 13 CHA (persuasion) check to get him to open it up. They are given advantage if they offer to leave behind something interesting, though he is only interested in material/beautiful things that he can look at like paintings, gold, or flowers.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [85, 85],"drawn": false},{"_id": "J3zaSGGMKEFbdDd6","flags": {},"type": 0,"text": "The party encounters a pool of lava preventing them from progressing further. Across the pool is a metal drawbridge in the upraised position. A successful perception/investigation check reveals a small button across the pond next to the drawbridge. Successful lowering of the drawbridge requires the button to be pressed, either by rock throw/arrow shot or a really long stick (or some other creative solution).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [86, 86],"drawn": false},{"_id": "m4sxAbWxIexH2RQW","flags": {},"type": 0,"text": "Some strange phenomenon of water and crystalline mystery has turned a section of the cave into a house of mirrors. A successful perception or investigation check is required to navigate the way past the reflections and to the other side of the cave (or you could obscure the mirrors with some sort of paint). If you go through a wrong ‘passageway’, well, the walls have sharp parts and you’re walking straight into them.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [87, 87],"drawn": false},{"_id": "Z4voIKODpcnXJomE","flags": {},"type": 0,"text": "A member of the party puts a hand on the warm walls of the cave and feels rumbling, as burning hot water shoots out from all sides up ahead. The party must get through these jets of water and steam. The party must each make a dex check, or be scalded by the burning water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [88, 88],"drawn": false},{"_id": "ulQgtDkIpnzImIKI","flags": {},"type": 0,"text": "A hallway with buttons or levers on each wall in 10 feet increments. Between each set of buttons/levers there are arrow traps that will trigger if not properly deactivated. Players can deactivate each trap by pushing the buttons/pulling the levers at the same time (choose a roll and the players have to get within 5 of each other on their rolls).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [89, 89],"drawn": false},{"_id": "sdMYibBnUWHleBra","flags": {},"type": 0,"text": "Root Room: The Party comes across a cavern filled with thick roots. Somewhere far above a massive tree must be growing. These roots twist and turn as if alive as they grow deep into the mountain, making short work of the rock as they power through in their search for water. These roots require a DC15 strength check to get through, DC12 with a bladed weapon. A DC 15 dexterity check can also be done to climb through the moving roots as they writhe.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [90, 90],"drawn": false},{"_id": "JfTxOtNjTLzSLnxB","flags": {},"type": 0,"text": "A red gas seeps out of a vent or from the spores of a strange mushroom, somewhere nearby and fills the tunnel with fog. Disadvantage on Perception and all characters must pass a DC13 Will save or immediately go into a berserk rage and make a melee attack, with the intent to kill, at the nearest creature, expending a use of Barbarian Rage if they have it. The rage continues until someone can make a DC15 Diplomacy or Intimidate check to control the berserker. Once saved, the creature is immune from the rage effects of the gas until their next long rest. Optional: The gas is also flammable and sufficient concentrations (50% chance of a 10 foot square area going off when exposed to flame, shock, or high heat) of the stuff deals 1d10 fire damage and 1d10 force damage to creatures in the square.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [91, 91],"drawn": false},{"_id": "9JMAetm6oHmpvsdh","flags": {},"type": 0,"text": "A luminous green gas seeps from faintly glowing pools, and seems attracted to wealth or objects or creatures of beauty as if someone had cast Faerie Fire on them. It appears to move on its own and travel up to 100 feet unless a breeze disperses it. Optional: The gas forces all who share its space to pass a DC 13 Will save or begin coveting that which the gas is most attracted to, seeking to acquire it. Once infected by the gas, the victim may make a DC13 Will save each day, with the difficulty increasing by 1 per day they have not gained the item, their madness driving them to greater lengths to get the item and prevent others from having it. Another character attempting a Diplomacy or Intimidate check must pass a DC that is +2 higher than the current dc of the save in order to snap the creature out of it. Once saved, the creature is immune from the effect for 24 hours.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [92, 92],"drawn": false},{"_id": "V26iETf9LoCCJzxS","flags": {},"type": 0,"text": "The Dendritic Constriction – The roots of what appears to be an enormous tree have filled the cavern with their tangled and fibrous obstructions. It’s passable, but only barely and unobstructed area is visible on the other side. To pass through, the characters must succeed in a series of Dex/Acrobatics or Climb checks or become entangled. Once entangled, they must succeed on a Dex save or remain stuck. If any harm is done to the roots by either a Strength check attempt or direct attack, the roots reflexively begin to constrict all characters within its area of influence, doing damage each round that the characters don’t make another Dex save or otherwise appease or defeat the tree.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [93, 93],"drawn": false},{"_id": "QRE2CAPVbjimmuqI","flags": {},"type": 0,"text": "Sea Cave – The PCs have to make it through the cave before high tide when the cave fills up with water.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [94, 94],"drawn": false},{"_id": "akfOht2X5ciTJqmt","flags": {},"type": 0,"text": "Underwater Passageway – One of the passageways is completely filled with water. PCs have to make a (athletics, swimming) check to make it from one end of the passageway to other while holding their breath. May also require a (navigation, Int) check to not become disoriented in the dark murky waters.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [95, 95],"drawn": false},{"_id": "vG5luNCNaVTmLi11","flags": {},"type": 0,"text": "The Moths – The room appears to be covered in scales. Upon closer inspection the scales are some kind of subterranean moth. If disturbed the moths take flight in swarms. If there is an open flame when the moths take flight, they will ignite filling the entire chamber with fire for 3 rounds. If there is no source of flame the moths will block all vision for 10 rounds. PCs must make a (acrobatics, dex) check to avoid triggering the swarm.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [96, 96],"drawn": false},{"_id": "5gjJqO8uOPQTQNIN","flags": {},"type": 0,"text": "The chamber ahead slops down to an underground river with a strong current. There are several other exits in the room. If anyone tries to cross the room, the discover the floor is very slick. Anyone attempting to cross the room needs to make an (acrobatics, dex) check or the start to slide towards the river. Anyone who falls in the river is sucked away by the current.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [97, 97],"drawn": false},{"_id": "ClviYOQqzPO6KwKI","flags": {},"type": 0,"text": "The Bowl – The chamber slops down to the center of the room like a bowl. The floor & walls are also slick. Anyone entering the room will slide to the center of the room. PCs must find some way to scale the sides of the bowl to escape the room. -20% to thief climb walls skill due to slippery surface.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [98, 98],"drawn": false},{"_id": "lAxgJMCSIUhA6Vwa","flags": {},"type": 0,"text": "Old Mining Tunnel – The tunnel has partially collapsed. The mines support beams are the only thing holding up the ceiling. Unfortunately the beams are also blocking the path. (Dex check) to squeeze past, bonus for small size, increase difficulty if wearing armor. (Int check) to strategically remove beams & debris to make a path, on a failed roll the tunnel collapses","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [99, 99],"drawn": false},{"_id": "NCmvxfMCYF14kng4","flags": {},"type": 0,"text": "The Vertical Shaft – A 6ft wide tunnel goes straight up for about 60ft. A thief might be able to climb it. 3 (athletics, dex) checks for 2 PCs to climb it back to back. (Con check) at 30ft or rolls are made at -1.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [100, 100],"drawn": false},{"_id": "asObEidmQ9kKW9Wy","flags": {},"type": 0,"text": "The party is confronted by strange motes of light filling the cavern. Getting to the opposite side without touching one seems improbable. Touching one reveals that each mote deals 3d6 radiant damage (raised or lowered based on level), searing the skin before disappearing. How will the party cross? (Casting Darkness causes the lights to fade in that area while the spell is active, but don’t outright tell them that unless they cast it).","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [101, 101],"drawn": false},{"_id": "llulVA5SGglOuiHm","flags": {},"type": 0,"text": "The party is sneaking along when the front guard’s boot crunches down on something. Looking, they see that they have just stepped on a buried humanoid skull. Looking forward, the party now sees that what they previously took for oddly shaped rocks or stalagmites are in fact bones and piles of bones. If they proceed, have some portion of the bones animate into skeletons. The point being that they don’t know which ones are undead and which ones aren’t. The best thing to do is stealth, but they might not realize that.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [102, 102],"drawn": false},{"_id": "FtvGM0OrNInlZIXc","flags": {},"type": 0,"text": "A narrow and foggy passage leads onwards for some time, seemingly repeating. Only a successful investigation check can reveal a false wall along the path to escape. A party member might also coincidentally break through the wall. A sufficient spell might also be able to break the cave’s enchantment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [103, 103],"drawn": false},{"_id": "4T137W24aoWTIdO2","flags": {},"type": 0,"text": "You find an old abandoned experimental mining complex that appears to be a collaboration between a dwarven mining guild and a gnomish tinkerer guild. Automated mine carts still blast along the tracks at random intervals. Make perception checks to see if you can see if the carts are coming, then make dexterity checks to avoid getting hit. Some appear to still contain some riches, but good luck stopping the carts without risking life and limb.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [104, 104],"drawn": false},{"_id": "r1DJdwyVq5nvL522","flags": {},"type": 0,"text": "The Dark: A cavern filled with beautiful glowing crystals. The crystals absorb, amplify, and then emit light. Any light source rapidly becomes unbearably bright. Each turn, for each creature crossing the area, roll a 1d6. On a 4 or better, the creature traversing the area must resist an attack similar to the spell Sunbeam, and may save for half damage. Using the spell Shatter will expose all creatures within 50 feet of the area to the Sunbeam spell but only deal half damage. If magical darkness or a spell that blocks line of sight is used, for each creature instead roll 1d6 and on a 6 the Sunbeam attack pierces thru but deals half damage.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [105, 105],"drawn": false},{"_id": "DBKrOUx16fQkdzMj","flags": {},"type": 0,"text": "The Razor Maw: A cavern of milky white crystals with a narrow and winding path that will take several rounds to traverse. The crystals resemble the teeth of a giant creature and seem to malevolently (if slowly) grind open and closed with a terrifying silence, slicing anything, with a hardness less than steel, with an atomic precision; dealing crushing damage and slashing damage. They grow back quickly if smashed (1d6 turns), and using a spell like Shatter only gives a respite for a moment.","img": "icons/svg/d20-black.svg","resultId": "","weight": 1, "range": [106, 106],"drawn": false}],"formula": "1d107","replacement": true,"displayRoll": true,"_id": "gFmNBAjWKcxnIZ0t"}
